{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "neighbor",
            "id": 10226
         },
         {
            "name": "chef",
            "id": 18293
         },
         {
            "name": "anorexic",
            "id": 208678
         }
      ],
      "imdb_id": "tt0112257",
      "video": false,
      "title": "301, 302",
      "recommendations": [
         118613,
         44673,
         104310,
         31185,
         92990,
         126529,
         122611,
         133336,
         12130,
         133573,
         121795,
         30992,
         238811,
         57270,
         37909,
         79392
      ],
      "backdrop_path": "/yrjPnOUd0OWeK7OGYGhR33LExOh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1004,
               "character": "Song",
               "gender": 1,
               "credit_id": "531010b2c3a36829b8000a09",
               "name": "Bang Eun-jin",
               "profile_path": "/lOZRwcO5HezyxLjYqCS3DwFLH0Z.jpg",
               "id": 150127,
               "order": 0
            },
            {
               "cast_id": 1006,
               "character": "Yun",
               "gender": 1,
               "credit_id": "56519c35c3a36833e7006986",
               "name": "Hwang Shin-hye",
               "profile_path": null,
               "id": 1145025,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "The Investigator",
               "gender": 2,
               "credit_id": "546b79acc3a3680d75001f73",
               "name": "Kim Choo-ryeon",
               "profile_path": "/llgxJw4LRGgByjdwIdoYUxkemIn.jpg",
               "id": 1386703,
               "order": 2
            },
            {
               "cast_id": 1007,
               "character": "Kang Joon-shik",
               "gender": 2,
               "credit_id": "597482ab925141584301416a",
               "name": "Park Cheol-Ho",
               "profile_path": null,
               "id": 554825,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4895c3a36847f816f24b",
               "name": "Park Chul-soo",
               "profile_path": null,
               "id": 105617,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4895c3a36847f816f251",
               "name": "Suh-Goon Lee",
               "profile_path": null,
               "id": 150329,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.662573,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 54285,
      "vote_count": 10,
      "budget": 0,
      "overview": "Two obsessive-compulsives, a chef and an anorexic writer, are neighbors in an apartment building. The chef (301) tries to entice her neighbor to eat with fabulous meals. The writer (302) refuses to eat, and this refusal begins a turbulent relationship that forces both women to delve into their pasts of torment.",
      "similar": [
         2062,
         212778,
         567,
         101,
         2652,
         164,
         2898,
         82693,
         22794,
         223702,
         239563,
         417678,
         334533,
         295964,
         325133,
         843,
         309809,
         1265,
         9354,
         57431
      ],
      "original_title": "삼공일 삼공이",
      "runtime": 100,
      "poster_path": "/jQ2ZukcQMpVytK2uZHQs6az07ed.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Park Chul-Soo Films Ltd.",
         "id": 6636,
         "origin_country": ""
      }],
      "release_date": "1995-04-22",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Two apartments. Two women. One shocking mystery.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cheol-su Park"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Suh-Goon Lee"],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt0112257/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMDkwMzgyNV5BMl5BanBnXkFtZTcwNzMxNDcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Eun-jin Pang, Sin-Hye Hwang, Chu-Ryun Kim | See full cast and crew »"],
      "reviews": [
         "The woman living alone in apartment 302 is a writer who finds food repulsive and indigestible. Her new neighbor across the hall, living alone in 301, is a cook who is obsessed with food to the point where it dictates her life. Upon discovering her new neighbor's dislike for food, 301 makes it her mission to make 302 eat and enjoy her delectable meals. This leads to a very twisted relationship between the two women, as well as an exploration into the nasty experiences that influenced their current relationships with food. This Korean film is a cinematic oddity that is definitely a unique viewing experience. It is filled with rather disgusting visuals of food preparation (vegetarians, this is a warning!). The close-ups of people gorging on various food items are bound to make anyone squeamish. The DVD I saw was full screen and the transfer appeared poor, but the cinematography is great with an excellent use of vivid colors. Also, the inventive set design deserves praise, as most of the film takes place either in 302 (very sterile, library-like apartment) or 301 (very sleek and vibrant restaurant-like apartment with a futuristic looking kitchen). The two lead actresses give terrific performances and it is perverse fun watching them torment each other. The story moves at a slow pace but it works. There are various interesting flashbacks that are crucial to the plot, but unlike other movies with stories that are not told chronologically, this timeline is not difficult to follow. However, what actually happens during one of the flashbacks was a bit confusing due to the way that particular scene was filmed. This scene seemed vital to the story, so I think part of this movie was lost on me. One common theme in the movie is a link between sex and food that is not completely explored but still fascinating and provoking. 301,302 is an interesting and original but often confusing film that I would recommend to folks interested in Asian horror cinema beyond the current popular films. As is the case is with swimming, do not view this after or while eating!",
         "Very dark and mysterious film that interweaves a relationship between two neighbors, and a present day investigation. The screenplay is pondersome, and yet deliberate, in feeding (pardon the pun) the viewer certain amounts of information at a time. We get to know the characters, and exceptionally so, their quirks. The atmosphere is very dark, and claustrophobic, which adds so much to the film. The memories are haunting. It would be very hard not to talk about this movie after viewing it. Creepy, and at times, rather darkly funny, 301/302 is an offbeat choice very worthy of your consideration. Recommended.",
         "A policeman rings at the 301 to inquire about the 302, who disappeared. A young woman opens the door and feeds him with fried chicken, wine, salad... She appears to be only interested in sex, cooking and eating. Where that is just everything the young woman from the 302 hates. The movie is the story of these two women. How they met and how they made these choices for their lives. They were apparently not meant to meet, but they have in common their extreme loneliness. The movie is also about love and loneliness. The very beginning is brilliant: two little girls present their mother's fridge and that is really enjoyable, really. The colors are beautiful (as often in Asian movies). But all in all, I cannot say I completely liked it. It is a bit long some times and comes with no surprise (at least I guessed the end rather early), although a mystery-thriller. The psychology of 302 is not that clear (or maybe not that interesting, or maybe I am only interested in sex, cooking and eating). And another thing very Asian is the close-ups on people's mouth when they are eating. But there are interesting things, still. At least, you will leave the theater starving or start a diet right away (I am of the first kind...). For completeness, I shall add that both actresses are beautiful and eventually get naked.",
         "This film is such a delight. This was the first Korean film I watched. The second one to follow was \"Gojitmal\" (Lies). If you've seen these two films then you would understand what I mean when I say \"Korean cinema is Weird!\". But ofcourse that changed after I continued watching other Korean films. But back to 301, 302: A very well written and directed film. Pay attention to the lighting and set decor as it really adds to the story. I enjoyed this film very much and it really helped me because I was trying to lose some weight around that time and after seeing this film I did not have to worry about my appetite anymore. I highly recommend seeing it. The director did another great film called \"Push Push\" which I also highly recommend.",
         "Psychological Foreign (Korean) Thriller Stimulating cinematography, foreign artistic humor, unconventional yet identifiable characters, cohesive character development and interaction, slow start.. interesting movie. Humorously misleading packaging (US Version) DVD case reads something along the lines of, \"food, sex, and humor\" with an image of lovemaking and Korean food. Yes, these are the core themes of 301, 302 but to label this movie as just that for an unprepared audience.. well that's like serving up a plate of stinky tofu and describing it as \"healthy Asian food.\" I absolutely love it, it's genius.",
         "Director: Park Cheol-su Duration: 100 Minutes 301/302 opens with an investigator visiting the residence of 301, a recently divorced woman who is a master chef, after the disappearance of 302 because she is the one who last saw the missing woman. Unperturbed, 301 invites the investigator to have some fried chicken which he states is the best he ever tasted. The film then goes into a series of flashbacks, showing when 301 moved into her apartment neighboring that of 302. A boisterous, talkative woman is a bit put off by the coldness of her neighbor who prefers to not utter a single word than to accept 301's greetings. However, 302's coldness, and her slender figure, entices 301 to get to know her better, so she cooks 302 a mouthwatering meal. Yet, after 301 departs, 302 tosses the food into the fridge and hurries to the restroom to vomit as if the mere sight of food makes her sick. 301 continues to bring 302 food and each dish ends up in the garbage. After discovering this, 301 tries to force 302 to eat the food, but 302 explains that she cannot eat that her body rejects the food. She also cannot engage in sex because of similar reasons. She states that she has a great filth inside of her that does not allow her to enjoy food or sex and she wishes her body would disintegrate. After learning this, 301 continues to make more food, foods that she terms to be tender, but no matter how well prepared 302 cannot eat the food and always vomits it all up. After awhile the viewer finally learns 302's dark past. However, she is not the only one with a dark past. Why is 301 so insistent that 302 eats her food? It seems that 302 is not the only one with issues. The two main themes of 301/302 are food and sexuality. 302 is unable to enjoy or indulge in food or sex while 301 is fond of both. However, because of her rocky marriage and later her divorce she is unable to engage in a fulfilling sexual life so she indulges in food instead. Yet she is not just overeating, she is literally engorging herself with food gaining more than half her bodyweight. 302, on the other hand, is wasting away because of her fears associated with food and sex. A complex, dark film, 301/302 is quite a thought provoking film, but one that should definitely not be watched after enjoying a big meal.",
         "**** SPOILERS POSSIBLY**** I thought the director did an excellent job of trying to catch the essence of so called humankind ...food and sex..... He tries to focus on the wastefulness of human life and I was quite impressed with the way he does it. I actually felt quite repulsed by the end of the movie. A Fascinating twist, though slightly predictable (but then I grew up reading Alfred Hitchcock mystery magazines and Dahl's short stories). It was fascinating to see the way it is done. I loved the lighting and I loved the gross camera closeups of peoples faces and butts..added to the repulsiveness.. Also, the fact that the movie just focused on 301/302 and never really went outside much. Everything was shot indoors(except a few scenes )..but all you see through out are just man made creations (not counting the food), you never see any nature around..it is all concrete and steel... For the food also, she always goes to a grocery store with the aisles and aisles of food. I thought it was dark reflection on the 'life' modern man leads. Also I think the director tries to make a statement on the paradigm in which the woman is a homemaker and has nothing to do after a while. There were times in the movie like when 302 is abused by her father or when 301 has sex with her husband that I was reminded of the way sex was portrayed in Die Blechtrommel (The Tin Drum)....as a disgusting and a compulsive act. In summary, I would highly recommend this movie....This is not a flick to pass ur time...it is a very thoughtful movie.",
         "Not quite the \"comedy\" that the VHS box bills it as, but very, very good. Might not want to watch it alone, though, or with anyone who likes to cook.",
         "Eun-jin Pang is a gourmet chef who lives in apartment 301 and Sin-Hye Hwang is an bulimic writer who lives in apartment 302. Hwang disappears and Pang is interviewed by a detective. Pang was the last person who saw Hwang alive, but she says she has no idea where her neighbor is. Flashbacks reveal a different story. This is an entertaining, lurid thriller with a couple of very good performances and some awesome looking food (and some not so awesome looking food). Cheol-su Park's direction is quite good, especially the excellent composition. He recently was struck by a car while crossing the street and passed away. 301/302 was one of the first South Korean films to be distributed in the United States.",
         "This South Korean offbeat thriller won the 1995 Grand Bell award in its native country.Song-Hee lives in room 301 and Yun-hee in room 302 of the New Hope Apartments.After meeting,they realize they have opposing but eerily complementary neuroses:Song-Hee likes to cook,and Yun-hee hates food.And so begins a strange friendship that attracts scrutiny when one of them disappears.\"301,302\" is not as disturbing as it's reputed to be.Even slightly horrifying climax is predictable and not surprising at all.The pace is extremely slow and the film becomes quickly boring.Some viewers may be disgusted by a huge numbers of close-ups of food,but I wasn't offended in the least.Still the director Cheol-su Park draws some interesting parallels between sex and food.Overall,if you are a fan of Asian horror give this one a look.6 out of 10."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Park Chul-Soo Films Ltd."],
      "summaries": ["Two obsessive-compulsives, a chef and an anorexic writer, are neighbors in an apartment building. The chef (301) tries to entice her neighbor to eat with fabulous meals. The writer (302) refuses to eat, and this refusal begins a turbulent relationship that forces both women to delve into their pasts of torment."],
      "budget": 0
   },
   "movielensId": 652,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "1995-04-22",
      "dvdReleaseDate": "2005-01-11",
      "directors": ["Park Chul-soo"],
      "runtime": 100,
      "movieId": 652,
      "title": "301, 302",
      "mpaa": null,
      "actors": [
         "Bang Eun-jin",
         "Hwang Shin-hye",
         "Kim Choo-ryeon",
         "Park Cheol-Ho"
      ],
      "imdbMovieId": "0112257",
      "originalTitle": "삼공일 삼공이",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5eIiJksgwy0"],
      "plotSummary": "Two obsessive-compulsives, a chef and an anorexic writer, are neighbors in an apartment building. The chef (301) tries to entice her neighbor to eat with fabulous meals. The writer (302) refuses to eat, and this refusal begins a turbulent relationship that forces both women to delve into their pasts of torment.",
      "tmdbMovieId": 54285,
      "avgRating": 3.0122,
      "releaseYear": "1995",
      "numRatings": 82,
      "posterPath": "/jQ2ZukcQMpVytK2uZHQs6az07ed.jpg"
   }
}