{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0762133",
      "video": false,
      "title": "Shadow Company",
      "recommendations": [],
      "backdrop_path": "/vIhStERIRER4ox0mDjHw61iMqRX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47639251416c75097979",
               "name": "Nick Bicanic",
               "profile_path": null,
               "id": 1188445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "587ed8a192514138fb001b81",
               "name": "Jason Bourque",
               "profile_path": null,
               "id": 88040,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.651729,
      "production_countries": [],
      "id": 18151,
      "vote_count": 5,
      "budget": 0,
      "overview": "Documentary about the mercenaries and contractors working in modern wars.",
      "similar": [],
      "original_title": "Shadow Company",
      "runtime": 86,
      "poster_path": "/t3axHHb3ouG0hrRMa6NfUqgLvdX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-03-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Nick Bicanic",
         "Jason Bourque"
      ],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Nick Bicanic",
         "Jason Bourque"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0762133/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyNjAyMDY4NF5BMl5BanBnXkFtZTcwMTQwNDMzMQ@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Alan Bell, Phil Lancaster, Madelaine Drohan | See full cast and crew »"],
      "reviews": [
         "Almost everything you ever wanted to know about mercenaries, Shadow Company objectively provides historical background as well as poses questions on the importance of being informed about contract military today. The filmmakers neither condemn or glorify those who chose this line of work, although in the backlash against military in general after Abu Ghraib stories broke, it may appear to be more sympathetic to at least some of the subjects in the film. In fairness, it is balanced, and focuses not on the right or wrong of contract military/security firms, but on history, structure, and how they fit into global military action, from Sierre Leone to Iraq. It's a thoughtful, articulate documentary.",
         "From the description, I expected Shadow Company to be a condemnation of privately run military companies, however the actual film turned out to be very well balanced and well put together. The film grabs varying viewpoints, from the soldiers in the field, to the executives that hire them, to ethics experts and more. The film looked at the issue from historical, financial, ethical, and effective standpoints. The film added liveliness and interest through clever use of overlays and cut-away scenes. It managed to add elements of humor from time to time that helped the film feel much less dry than other documentaries. The best part about the documentary is that it did not attempt to sell me a particular viewpoint. It left me still pondering everything that I had seen on the screen, and attempting to decide what I really felt about the issue. In total, one of the finer documentaries I have ever seen.",
         "Being a non-military globally conscientious girl (who oft would even name herself a pacifist), I would have to say that this documentary was one of the biggest eye openers for me in the last few years. All the stereotypes, even the limited ones I had, were explored, dissected and supported, contested and investigated in the way you expect an objective documentary to be. The voices, both supportive and opposing, both disturbing and considerate, historical and modern... all were incontestably honest and articulated in an engaging way. The format of the documentary is one the defies convention - I hesitated to use Terrentino's name because only the unexpected dynamics of the format can be compared to him: things are presented in a way that you don't expect and you are left with questions to ponder yourself rather than a bunch of answers that settle the issue for you. This is a documentary that empowers the audience and for some people this is an unexpected and thrilling OR scary concept. I was asked to travel to Sierra Leone to do still photography for this project but other than that, I had no involvement of the story building process. I am amazed to see how each of the people they interviewed, and the facts they accumulated, have been presented in the final product in a way that is engaging and informative. No wonder Edward Zwyck was a fan of this doc - it's a rare example of what the documentary format can be used for.",
         "An impressive documentary for several reasons: for offering an invaluable glimpse into a hidden component of modern warfare that may have grave consequences for the future; for infusing a sense of style (and even humor where appropriate) into the story, breathing new and much needed vitality into the realm of political documentary; and for posing the right questions to the right people and not ramming the answers down viewers' throats. It's seems that these filmmakers have no agenda other than making a good film and shedding light on a dark subject--refreshing to say the least. Well worth seeking this one out.",
         "After Fahrenheit 9/11 and \"When the Levees Broke: A Requiem in Four Acts\" I feared the political documentary genre was forever lost in liberal bias. Shadow Company restores this genre to its rightful place of respectability. Far too often documentary film makers shape their films to fit their predetermined conclusions and present only the footage that backs up their premise. Shadow Company takes a fair and balanced approach that few filmmakers, or news outlets for that matter, have the courage and integrity to take. Shadow Company is an extremely insightful, educational, and entertaining look at a remarkable and very controversial event in contemporary politics and modern warfare. Anyone hoping to have a well informed conversation about the war in Iraq needs to see this film. Conservatives and liberals alike will call it one of their favorite films of the year.",
         "I saw the trailer for this film and having worked in Iraq was intrigued by it and never heard another peep about the film. I did a trawl recently looking for it after a conversation in which I remembered it (thank goodness for youtube as had forgotten name) and then went to the website and bought it. There is much said about the security world and this really is an incredibly well balanced documentary. It shows the good and the bad, the professionals and the idiots. Mostly it is an incredibly well made film, everything is explained well, the editing is slick, the interviewees are varied and incredibly knowledgeable. If you want to begin to understand the private security world this is a must see, it is also a must see if you want to try and understand Iraq and its reconstruction. Well done on such a good production.",
         "I just received my copy in the mail, and to be honest, I was completely surprised by the sheer entertainment value of the film. it's edited remarkably well, written well, and the interview subjects are interesting, and entertaining. Graphics and text inserted during conversation explain technical phrases or give statistics that you'd ask for naturally, so there's no drop off in wishing things were explained more. It's quite neat. The documentary is very objective, taking no side in the issue. It goes back quite a ways in the contemporary history of the Mercenary/Contractor world, while still being relevant to today's world. Highly recommended to anyone interested in Foreign Policy, or Military oriented subjects. -Chris",
         "I saw this documentary thinking that it would be biased one way or the other. I was pleasantly surprised to see it be neither a Michael Moore hack job or a Fox News fluff piece. For the most part it lets present and former mercenaries talk for themselves. The \"experts\" that are interviewed are not trying to comment on the subject but rather to explain it. Very refreshing indeed. In todays world of highly polarized politics it was great to see a film on this subject, which is for the most part about Iraq, be so even handed. The extras on the DVD are also well worth a look through. It's well worth the purchase.",
         "There's a reason this doc is called \"Shadow Company\". These people literally operate in the shadows. Little is known by the general populace about the \"private security companies\" that augment our American military presence in places like Iraq. Before I saw this doc I knew virtually nothing and I consider myself to be a reasonably well informed person. I make a point of keeping up with current events. But it came as complete surprise to me that there are dozens of these private companies, their employees hired to provide security for foreign dignitaries and business executives who operate in war zones. They live the lives of soldiers and put their lives on the line as soldiers do and yet, when one of them dies, who mourns? Who even knows except their own circle of loved ones. This film will open your eyes.",
         "This is a review of the DVD. Shadow Company is a compelling film about men for hire who go into very dangerous places in the world to act as security agents for companies; to fight for governments; or whoever hires them. They are apolitical and are seemingly very good at what they do. The film takes no sides, doesn't pull any punches, shows us just how dangerous and bloody fighting in todays troubled hot spots is. Some graphic footage of burning bodies may be disturbing but it did happen. There are about 20,000 mercenaries in Iraq at present. Others are in African countries where there is civil war. Some are in Afghanistan; or any place that is dangerous and there is need for men-with-guns; i.e. security agents. Film-makers Nick Bicanic and Jason Bourque were successful in getting the complete cooperation and trust of the mercenaries, called private security contractors, and through interviews and following along, we have a look at their day. Two of them, (Slavko Itic & Corbus Claassens) are articulate and matter-of-fact about the way things are in their jobs. The most horrific details are recounted with no histrionics. It is just the way it is. The extras are a great watch too. One long interview with Claassens recounts a hilarious story about a blow up doll. It's odd and a little scary. If the the guy in their company was just kidding, it would be one thing. But it sounded like he actually had conversations and 'fights' with his 'wife.' Yes, folks, he married his 'doll.' I won't spoil the rest of the story by further comment, but it is seriously strange - and very funny. The commentary by Nick and his partner, Jason, gives some more insight into what they did and why they picked certain parts and places to film . And how a lot of the film is shot in natural light and why. All in all I am so glad I had a 'headsup' on this film. Interesting subject which needs to be explored. Interesting people I for one would never have known about. Thought provoking. I rated it 10/10."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Purpose Films"],
      "summaries": ["Thousands of private soldiers operate in Iraq alone... and many more around the world. These individuals, known as private security contractors, are changing the face of modern warfare everyday while their world has remained mystery to those at home. Shadow Company is the groundbreaking investigative feature-length documentary that seeks out and reveals the origins and destinations of these modern-day mercenaries. Who are these security contractors ? What do they do ? Why do they do it ? THE RULES OF WAR HAVE CHANGED. Purpose Films proudly brings you an immersive and visionary look at the private individuals who have changed them in a way that defies typical documentary style."],
      "budget": 0
   },
   "movielensId": 65290,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-03-01",
      "dvdReleaseDate": "2008-12-02",
      "directors": [
         "Nick Bicanic",
         "Jason Bourque"
      ],
      "runtime": 86,
      "movieId": 65290,
      "title": "Shadow Company",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0762133",
      "originalTitle": "Shadow Company",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about the mercenaries and contractors working in modern wars.",
      "tmdbMovieId": 18151,
      "avgRating": 3.30769,
      "releaseYear": "2006",
      "numRatings": 13,
      "posterPath": "/t3axHHb3ouG0hrRMa6NfUqgLvdX.jpg"
   }
}