{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "usa",
            "id": 279
         },
         {
            "name": "oregon",
            "id": 1897
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "scar",
            "id": 14767
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "broken down car",
            "id": 162913
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "journey",
            "id": 189092
         },
         {
            "name": "mysterious past",
            "id": 209525
         }
      ],
      "imdb_id": "tt1152850",
      "video": false,
      "title": "Wendy and Lucy",
      "recommendations": [
         26518,
         10183,
         26508,
         13241,
         14298,
         14295,
         11490,
         21371,
         129971,
         162551,
         10503,
         5817,
         29698,
         44305,
         1956,
         18602,
         1479,
         255554,
         42164,
         44072
      ],
      "backdrop_path": "/rhkTf26knUCe7y96k8eDVKjnvUj.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "Kenneth Axel Carlsson",
            "id": "549f33839251411d530033bc",
            "content": "A woman, Wendy (Michelle Williams), is trekking through America, well, she does have a car, although not of much use to her (it breaks down early on in the movie). She also has a dog, Lucy, whom she loses early in the movie. We have no idea where this woman came from exactly, but we know where she is going, and why. Alaska... to get work. Of course, this might not be the entire truth, just what she tells people. She is not poor, but she has clearly not been wasting her money so far and she is not about to do that now, although, circumstances might take that decision right out of her hands.\r\n\r\nThis woman has experienced something, and carry the scars. She does not trust people well, but learns to trust some people throughout the movie. But luckily, the movie does not provide all the answers... we have to figure them out for ourselves. These are the movies that I like the best.\r\n\r\nMichelle Williams is amazing in this role, heartbreaking really. She makes good decisions, but also some terribly wrong ones that might change her journey significantly. I found myself being angry at her early on for making a really stupid and unnecessary decision, but how wonderful to finally see a character who isn't perfect. Flaws is what define a human.\r\n\r\nThe movie itself is slow paced, taking its time to follow Wendy around. It never rushes the story for a second, and when it is over, you can't help but think that it could have easily been 2-3 hours longer, as you want to see what happens to Wendy and Lucy. The images are very realistic, following Wendy close. They are not perfect, but neither is life, and this movie wants to show us just that... life. This is clearly an indie movie, and one of the best I've seen in a good while. I've seen another movie by the director, Kelly Reichardt, and it was filmed in the same way.\r\n\r\n_Last words... Wendy and Lucy is a story about being human, about surviving in the world, about searching for something, a purpose maybe. It is also about friendship and trust, about the choices that we make, the choices that come to define us and our lives. Yes, it might seem like a small movie, but in reality, it is the biggest story of all, the story of our lives._",
            "url": "https://www.themoviedb.org/review/549f33839251411d530033bc"
         },
         {
            "author": "Reno",
            "id": "5564a217c3a36851cf004d77",
            "content": "Michelle Williams is one of the photogenic face in Hollywood and also like her performance. But won the negative impression of mine over portrayal of her character in 'Take This Waltz'. Doing a villainous role may get appreciation, for example, the Joker from Batman, but doing things that affect morality is really hurt if you really like that person. After that movie, I was not into her films and she also did not do any major roles. Accidentally I came to know about this movie, which is in fact a bit older movie than what I was talking about and after knowing more about it, I got interested and I could not resist from watching. Frankly, this movie filled the gap created by the earlier crack.\r\n\r\nThis movie falls in the line of 'Open Road' and 'Into the Wild' when it comes to rendering the main character. If you have already seen those two, or any other similar flicks, then you would find this movie was very much intense. Wendy, a woman in her late 20s with her dog Lucy are on an expedition to the other end of the country seeking a solution to the difficulty for having a normal life and job. One must have to keep walking on either of way to see a light at the end of the tunnel and that's what Wendy does here.\r\n\r\n> \"You can't get an address without an address.\r\n> You can't get a job without a job.\"\r\n\r\nThis movie commence middle of her destination, where she's stranded after her car broke-down. It won't say anything about the earlier account of Wendy or what might happen after the timeline of this film. All the 80 minute of narration takes place in the Oregon city which is just a glimpse of her life for us as a movie, but a major impact thenceforth in her life. The struggle during fixing her car is what depicted simply, but beautifully on the screen.\r\n\r\nThe story is about the man and his pet's relationship, that's what the meaning of the title, like 'Marley & Me'. Also being a young woman, society is no safe for roaming freely all the places alone at all the time. Plain drama, it was, but something meaningful story, a lesson to learn, a character to study and a life to experience. A kind of journey of self- discovery during understanding how the civil system works. Thematically there's nothing wrong, but 'setting an example' wise, this movie is not safer for other than the adults. Among the best movies of the year it was released. Impossible not to recommend others, especially by me to you perhaps.\r\n\r\n8/10",
            "url": "https://www.themoviedb.org/review/5564a217c3a36851cf004d77"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "52fe44c9c3a36847f80aa157",
               "name": "Michelle Williams",
               "profile_path": "/xaRSSWD3jD1KpyjWgzzDP5lO5DS.jpg",
               "id": 1812,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mechanic",
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa15b",
               "name": "Will Patton",
               "profile_path": "/qpycaaWP1oUx1Wd2lMBfQtR7qDO.jpg",
               "id": 883,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Icky",
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa15f",
               "name": "Will Oldham",
               "profile_path": "/failAZJ5Nowvg8TPmmTJ49qIOH6.jpg",
               "id": 77080,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Andy",
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa163",
               "name": "John Robinson",
               "profile_path": "/fhQt1p1OjjsWzSf11mfZEa4QLwX.jpg",
               "id": 19197,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44c9c3a36847f80aa153",
               "name": "Kelly Reichardt",
               "profile_path": "/7pZjIomEh70Dkhr52aKpAqhx3mQ.jpg",
               "id": 56383,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa169",
               "name": "Sam Levy",
               "profile_path": null,
               "id": 1075441,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa16f",
               "name": "Jonathan Raymond",
               "profile_path": null,
               "id": 225557,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44c9c3a36847f80aa175",
               "name": "Kelly Reichardt",
               "profile_path": "/7pZjIomEh70Dkhr52aKpAqhx3mQ.jpg",
               "id": 56383,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c9c3a36847f80aa17b",
               "name": "Jonathan Raymond",
               "profile_path": null,
               "id": 225557,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa181",
               "name": "Will Oldham",
               "profile_path": "/failAZJ5Nowvg8TPmmTJ49qIOH6.jpg",
               "id": 77080,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa187",
               "name": "Ryan Warren Smith \t",
               "profile_path": null,
               "id": 90280,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cac3a36847f80aa18d",
               "name": "Kelly Reichardt",
               "profile_path": "/7pZjIomEh70Dkhr52aKpAqhx3mQ.jpg",
               "id": 56383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa193",
               "name": "Larry Fessenden",
               "profile_path": "/ry1FD2hv1mop8QzPCVHzpDeCX1z.jpg",
               "id": 31268,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa199",
               "name": "Neil Kopp",
               "profile_path": null,
               "id": 20487,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cac3a36847f80aa19f",
               "name": "Anish Savjani",
               "profile_path": null,
               "id": 47099,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cac3a36847f80aa1a5",
               "name": "Joshua Blum",
               "profile_path": null,
               "id": 1020052,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa1ab",
               "name": "Todd Haynes",
               "profile_path": "/wBDazO2j49uoquoHTEDxcniyGGC.jpg",
               "id": 16863,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cac3a36847f80aa1b1",
               "name": "Phil Morrison",
               "profile_path": "/oCbmH8XFVid581NDjRTvCuYzlLD.jpg",
               "id": 17246,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44cac3a36847f80aa1b7",
               "name": "Rajen Savjani",
               "profile_path": null,
               "id": 991786,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cac3a36847f80aa1bd",
               "name": "Ali Farrell",
               "profile_path": null,
               "id": 17635,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cac3a36847f80aa1c3",
               "name": "Laura Rosenthal",
               "profile_path": null,
               "id": 15426,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.449717,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8942,
      "vote_count": 89,
      "budget": 200000,
      "overview": "Wendy, a near-penniless drifter, is traveling to Alaska in search of work, and her only companion is her dog, Lucy. Already perilously close to losing everything, Wendy hits a bigger bump in the road when her old car breaks down and she is arrested for shoplifting dog food. When she posts bail and returns to retrieve Lucy, she finds that the dog is gone, prompting a frantic search for her pet.",
      "similar": [
         17130,
         40807,
         858,
         427900,
         8272,
         8346,
         1374,
         8065,
         510,
         141,
         634,
         13,
         73,
         5915,
         28178,
         112160,
         244267,
         216015,
         394117,
         424488
      ],
      "original_title": "Wendy and Lucy",
      "runtime": 80,
      "poster_path": "/gVsJK34vymqXs5aVweg9RpWGvuA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Oscilloscope Laboratories",
            "id": 4748,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Glass Eye Pix",
            "id": 1360,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Science",
            "id": 1976,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Washington Square Films",
            "id": 14862,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Field Guide Films",
            "id": 31301,
            "origin_country": ""
         }
      ],
      "release_date": "2008-05-22",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "On the long road, friendship is everything.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kelly Reichardt"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Jonathan Raymond",
         "Jonathan Raymond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1152850/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MTE1NjAwNV5BMl5BanBnXkFtZTcwMDM3MzMwMg@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michelle Williams, Lucy, David Koppell | See full cast and crew »"],
      "reviews": [
         "This review is coming from the perspective of a viewer in the exact same situation as Michelle Williams' character. This review will not summarize any key plot points nor try to pretentiously deconstruct the film in the air of a film school thesis, this review will put it to you as truthfully as the film has. I honestly feel that Wendy and Lucy shines a light on a part of America that is widely ignored; a part of America that's left behind by the faults and actions of The Bush Administration and those who feed off of greed and capitalism. For those who fit within these margins will go see this movie and fail to grasp the understanding of how it is to be desperately broke and have nothing else to hold on to but a few scraps of memories, soiled clothes and your trusted dog to help prevail what's left of you dignity, happiness and sanity. This is not an escapist film, for escapism is for people who can't cope with their own realities. That's why there is so much success in drugs and the media. Wendy should be praised for holding onto her convictions and not falling deeper through escapism. But when your reality is so harsh and greater problems seem to arise everyday, she can't even afford the luxury of escapism as others do, so why should the audience have any exception? Life is very complicated and it can't be wrapped up in a limited amount of time. The open ending reveals to us that nothing is certain, but it certainly must be better than right now. There should be no ending, no \"to be continued\", only \"What now?\" \"Where to go next?\" \"What am I gonna do\" \"Where will I sleep tonight and will it be a safe spot?\" If those aren't the questions going through your head as you watch Wendy in the end then you have lived a privileged life and will never have to worry about being thrust into such a situation where you have to give up everything you have left in hopes of things getting better soon. In a recession, this film should be seen as a lesson of how to live and what to do when comes the moment where you lose everything that's ever meant anything and how to live and restart from there. Of course every decision you make isn't the smartest one, but when you're desperate and have no other choice then you have to do whatever it takes to survive, even if that risks you a day in jail. We observe Wendy and Lucy from a voyeuristic standpoint. We meet up with them in the park, observe their actions, then watch them leave. For those with a sympathy toward the downtrodden we tend to feel a little sadness, maybe even a little guilt for not being able to help that person out more than we could. But there are also some who have been raised with everything handed to them and with easy opportunities. They look at people like Wendy and Lucy as a stupid bum who can't get it together, without ever realizing that not everyone has it as easy as they did. I have no idea how to end this review, but I just thought I'd write it as a bit of a rebuttal to all those who have completely missed the point of the main character and her actions which have led the movie to it's conclusion. If you've never truly suffered like the way Michelle Williams' character has then this movie will be lost on you. You may relate more with the clerk in the supermarket. But for those of you who've ever had to live in their car for a stretch clawing onto every dollar for dear life hoping to one day catch a break, then I must warn you that this movie will make you cry. And there's is absolutely no problem with that. I know how it feels, and sometime you just have to let it out in order to go on. Sometime you even have to let go of the things you love the most if you even want things to get better. For some it's impossible to do, but it's just as hard to watch.",
         "To say that this film is spare is to be generous; and, to whatever extent actors become their characters, Michelle Williams becomes Wendy, a young woman that is hanging by a thread. Wendy is doing her best, with little support and money, to survive day to day and to maintain her dignity. Along the way she loses her dog Lucy, the only stable and loving relationship in her life. Ultimately, she is faced with making a heartbreaking decision that their mutual welfare will depend upon. As her car (and bed) breaks down and resources dwindle, she collects cans and bottles and shoplifts dog food. She encounters a group of homeless people making a fire, a self-righteous store clerk, a smug auto mechanic, a sympathetic security guard, and a psychotic drifter, among others. We see each of them from the perspective of a young woman on the verge of economic collapse and who is gradually being transformed into someone facing the possibility of homeless destitution. Wendy offers a lens through which we can see such a transformation evolve. All homeless people, unless born into this condition, were something and somewhere else first. Wendy is such a person. As the economy declines and more and more people retreat into survival mode, it will be harder for them, for us, to empathize with the Wendys of the world, young people with once bright futures now facing desperate and maybe devastating times. I have heard it said that empathy is the first hostage of survival. Wendy and Lucy is an important little film, a slice of life, that not enough people will see and that offers us a window on what more and more young people will be facing for some time to come. This film pleads with us not to close our eyes or turn our backs on them.",
         "The true triumph of this film is its ability to say so much about the cold, cruel reality of just how close some people are to breaking their banks and their hearts. What fascinates me is: there are a few big budget films out there right now - all scrambling desperately to capture the same themes as W&L - that have no concept of how real people really act and survive. Those filmmakers must be pulling their hair out screaming \"how can she say it all with one woman and a dog, and I can't say a damned thing with all these great special effects???\" That is the joy in this film. The simple, honest, brutal truth of now. Enjoy.",
         "Far more refreshing to see the first and perhaps only truly flawless film of 2008 is the fact that Wendy and Lucy may be one of the first pieces of American contemporary art to both attempt to and succeed at encapsulating the entire human experience, particularly during our current universal financial and cultural malaise. I was particularly impressed to see a female writer/director--an American female, at that--who so deftly crafted a film with no rough edges, an efficient and earnest work that suffered none from any kind of artificial maudlin sentimentality. From moment one, it is clear that Ms. Reichardt has paid well-deserved attention to the works of Gus Van Sant (and in fact she gives thanks to Van Sant's genius cinematographer, Harris Savides, responsible for the ambrosial Death Trilogy). But too has this vibrant and adept filmmaker paid great notice to the neo-realists of yesteryear, particularly De Sica (the entire film can almost be seen as a contemporized Umberto D.). It is thus both for the content and form alike that Wendy and Lucy is indeed an imperative film in today's society, one that I hope will have a lasting shelf life and will allow Ms. Reichardt to continue doing what she clearly does best. Bravo. (Also, I've decided to add this short digression in here, as I'm saddened--though not surprised--by a great deal of the antipathy being dumped upon this fine American minimalist film. I've seen many reviews castigate Wendy and Lucy for being a film \"without enough depth or background,\" with characters whose plights are far too \"simplistic,\" or for simply being too nihilistic and bleak in its outlook of our current times. It is because Ms. Reichardt has decided to cast away the prototypical shackles of American films and to give us an earnest story with characters plucked directly from today's quotidian struggles that she, and her entire crew, should be applauded. Reichardt's unique choice of creating a film of empathy is unique, as, more and more, our American filmmakers choose to make films of sympathy: films that tell you too much, that give you all of the answers, and that break away from any semblance of truth or universality. Fortunately for those who had difficulty sitting still through a quiet, unassuming film such as Wendy and Lucy, there is more than enough television on the airwaves these days to satisfy. And fortunately, for the rest of us, those who are actually going through the very struggles that Wendy endures or who at least have any kind of awareness of these struggles, there is this brilliant and vital film.)",
         "Hoping to find a job in a fishing cannery in Alaska, Wendy (Michelle Williams), a drifter in her twenties, travels to the Pacific Northwest from her home in Muncie, Indiana with her most endearing companion, a golden Labrador Retriever named Lucy, whom she calls Loo. Looking masculine with a short haircut, a flannel shirt and a sweatshirt with a hood, Wendy seems aimless yet she is believable when expressing a desire for stability to a group of itinerant drifters at a campsite. Co-written by Jonathan Raymond, Kelly Reichardt's deeply affecting Wendy and Lucy, like her 2006 film Old Joy, combines an intimate personal story with a reflection of the malaise felt in the country today, her economic hardship typical of people adrift in a society in which they no longer feel a part. The film is set near the Oregon/Washington border in a small town that, with its roadside strip malls, gas stations, car repair garages, and convenience stores, is reflective of rural American cities and towns that have lost the character that once made them unique. As the film opens, Wendy plays with Lucy in the Oregon woods - the only sounds heard are Wendy humming a melancholy song. While sleeping in her 1988 Honda on Walgreen's property, she is awakened by a security guard (Wally Dalton) who tells her to move on but discovers that her car will not start. On a limited budget, she is shaken when the repair amount confirmed by the town mechanic (Will Patton) is greater than expectations. Trying to save some money, Wendy makes a serious mistake by stealing dog food at a grocery store. Unable to convince a smug teenage clerk to give her a break, Wendy leaves Lucy tied to a post outside the market while she is taken to jail on a shoplifting charge. When released after paying a fine that costs considerably more than the dog food, she discovers that Lucy has disappeared and the film's focus turns to Wendy's frantic and lonely search for her beloved dog. As she pays a visit to the local pound and looks for Loo around the town, a mood of profound emptiness pervades the deserted streets revealing the number of young people that have moved away. Assisted by the Walgreens security guard who lets her use his cell phone to call the pound and leave his number as a call back, Wendy is hopeful after posting signs all over town but the waiting drains her energy and her run-in with a deranged homeless man while sleeping in the woods frightens her to the core. Seeking some solace, she calls her brother in Indiana but meets only indifference, his girlfriend in the background asking what it is that she wants now. Not deterred, Wendy's spirit and determination allows us to recognize that the fight for self worth is not limited by material possessions or the opinion of others. Reminiscent of the Dardenne Brothers' ability to capture the emotional anguish of young people, Wendy and Lucy establishes Reichardt as one of the premier indie filmmakers in the U.S. today.",
         "WOW, that is easily the most depressing film I saw this year, hands down. Michelle Williams and Lucy the Dog star as Wendy and Lucy, respectively, in this remarkably affecting drama about a poor, independent woman escaping from her undisclosed troubles and making her way to Alaska with her dog. All the two have in life is each other, money is tight, food is hard to come by, and sleeping in the car is the only option for Wendy. A devastating turn of events happens to Wendy, and Lucy subsequently goes missing, leading Wendy on a mission to recover the only companion she has in her life. Along the way, Wendy encounters indifferent individuals whose actions are driven by self-righteous attitudes, but Wendy also finds help in an unlikely place, a compassionate security guard. In many ways, Wendy and Lucy succeeds in areas where Bolt (2008) came up short, but they both approach their themes in very different ways. Wendy and Lucy is absolutely heartbreaking, forcing me to cry out \"NO!\" twice in its duration. The ending was an absolute shocker to me, and actually squeezed a few tears out of my eyes. In this film, Lucy becomes a character in her own right, a brilliantly effective choice. Lucy becomes not just a symbol of everything Wendy loves in this world, but her only hope for survival. It is never specified, but the audience member is allowed to create an entire backstory behind these main characters. I like to believe that Lucy is a childhood pet of Wendy's, who helped Wendy through a difficult childhood, perhaps with abusive parents, in a foster home, whatever you would like to believe. It makes Wendy's situation that much more affecting. If you've ever felt like you have but one object in this world to turn to in times of trouble, and you've felt like escaping from chains that are holding you down, and beginning a new life for yourself someplace new. If you've ever felt so cut off from other individuals in this world, like screaming at the top of your lungs. If you've ever been placed in such a desperate situation, where your livelihood is threatened, and all that you love seems as though it is vanishing before you, you will undoubtedly shed a tear at this incredibly powerful drama about the connections humans make, the friendships we forge, and the sacrifices we must sometimes make. 9/10",
         "Sometimes the simplest stories are the most effecting and the simplest characters are the most endearing. Wendy and Lucy is a perfect example of this. When discussing this film however one must praise Michelle Williams. Before she even utters a word with her body movement and her facial features we get a sense of who Wendy is. We have seen this character before and we know her. Wendy is a simple girl with a simple purpose but Michelle Williams gives her the grace and kindness that makes her seem real and is all the more gut wrenching when things start crashing down around her. Most actresses her age with her resume would scoff at the idea of playing such a simple and expressionless character who hasn't showered for days and wears cut off brown pants and an unflattering blue sweatshirt but she breathes life into Wendy and adds an extra dimension to her. Of course a great performance would be wasted without a narrative for Wendy. As the film unfolds the narrative is quite simplistic. Wendy is stuck in a small town in Oregon on her way to Alaska and wants to get on her way as fast as possible before her money runs out. There however are events that will unfold that prevent this from happening. There is little surprise and in fact the narrative is quite predictable with most events foreshadowed. As these events unfold however they are still impactful and meaningful because Wendy does not see them coming. As simplistic as this narrative may be there is complexity to it in the form of political commentary on small town America and how the people that live there are struggling. Wendy herself is fleeing Indiana living in her car and managing a small sum of money to go to the promise land of Alaska since they are hiring. The town is suffering from the closing of a mill with few jobs and is inhabited by many disenfranchised individuals. While this film could be fixated on these points Kelly Reichardt has crafted them very subtlety into the character and the setting. Characters don't stand around saying small own America is dying, but we can easily pick this up from the plot and the visuals of a broken down town with many closed business and downtrodden individuals. Usually films of this type heap on background but instead there are only a few scenes to decipher Wendy's story and motivation. The soundtrack for this film is Wendy humming quietly to herself which when employed help foster a sense of intimacy. Kelly Reichardt shoots the film with a naturalistic feel with a steady and fluid motion of the camera. There are many long takes with tracking shots as the camera follows Wendy as she walks around this town but this is contrasted with close ups where the camera gets in tight to see the expressions on Wendy's face. There is only natural light used and most of the scenes take place out doors with wind blowing through Wendy's hair and building being nothing more than a backdrop. All of these aspects together create a sense of intimacy with Wendy. Wendy and Lucy shows us that a great film really only needs a honest and meaningful connection to a character through narrative, acting and mise-en-scène.",
         "Wendy (Michelle Williams) is a young woman down on her luck. Unspecified troubles have led her to make her way from Indiana to Oregon in a late-Eighties Honda Accord she's been told has a serpentine belt that isn't going to last much longer. Her sole companion is her golden brown mixed breed dog, Lucy (played by the director's dog, Lucy, who also was in her acclaimed first feature, Old Joy). She's headed for Alaska to make fast money in a Ketchikan fish cannery. In a park the first evening she hangs with some young people. One guy tells her she's got the right idea. There's good money up there in the canneries. He also admits he got drunk one night and had to flee his Alaskan job after wrecking a piece of conveyor equipment worth $100,000. She sleeps in the car, but is awakened by a guard (Wally Dalton) who tells her she can't sleep there and has to move the vehicle. It won't go. As the Cannes synopsis goes, from then on \"the thin fabric of her financial situation comes apart, and she faces a series of increasingly dire challenges.\" Indeed, this is the case. Wendy already may not have enough cash to make it up to Alaska if all goes well (she repeatedly looks at a page where she calculates her dwindling supply of dollars). When the major car issue arises, she may not even have enough to feed Lucy with. The news she gets from the garage man (veteran actor Will Patton) is decisive, anyway. Then she has a bad encounter with a young store employee (John Robinson of Van Sant's Elephant and Lords of Dogtown), and from then on things slowly but surely go downhill. The end of the film is not the end, however. There's no knowing how life will go for Wendy. The power of the film, which is painful and devastating to watch, lies in its nearly real-time effect as it delineates the transition from one level of marginality to several notches down. Williams is quietly convincing, but not spectacular, in her performance as Wendy. By joint agreement, she plays Wendy, as Reichardt put it in a press conference, \"very buttoned-down.\" The only person who seems to keep her from despair is the kindly security guard. Only once does she show violent emotion, after a terrifying encounter in the woods, which the director said may represent a vision of her future. Will she become like that crazy hobo (Larry Fessenden) herself, or just be thrown in with his kind? The film, which was shown in the Un Certain Regard series at Cannes this year, is the result of long planning by Reichardt, who lives in New York, including many miles logged in her car with Lucy by her side looking for locations. During the 21-day shoot, she knew the Portland settings so well she directed the DP on shots. The result is many classic images of generic regional Americana, vacant lots, drugstores, a supermarket, which in their colors and angles recall the poetically banal Seventies and Eighties color photographs of Stephen Shore, which is to say that there's a keen eye here. Reichardt seems to have a rare sense of how even white Americans very often come to live on the margins. In a time of economic crisis, this is a relevant story. The director, who confirms here that she has a distinctive vision, excels at careful observation and specific regional settings. The presence of the by now high profile Michelle Williams should help this second feature to gain Reichardt a larger audience. As with Old Joy, Reichardt's writing collaborator was Jonathan Raymond, who was an assistant to Todd Haynes on Far From Heaven. The film, based on a short story by Raymond, has been bought by Oscilloscope Pictures and will open at Film Forum in New York December 10th. It's part of the New York Film Festival at Lincoln Center, September 2008.",
         "Is there no more great frontier? Has time run out on those who look west to a better tomorrow? 'Wendy and Lucy' is a small movie with its scope set on a larger, subtle target. Soft-spoken but very admirable, Kelly Reichardt has crafted a touching story of one girl's endless search for her dog. On the road to Alaska in search for better economic opportunity, Wendy finds herself in a small Oregon town where its citizens seem to live on the fringe of poverty long after job-providing factories have closed up shop. Keeping track of every penny she spends, Wendy's car suddenly won't start. And after an attempt to shoplift a bit of food sidelines her, she loses track of Lucy. A dog, a companion, and her best friend. A determined Wendy searches for Lucy in every nook and cranny. Played by a quiet Michelle Williams, this is a subdued performance but a strong one. A portrait of loneliness, of heartbreak. She lives a life far from fortunate, but she holds her head high and looks to Alaska for hope. And in a small neighborhood where her situation seems to only go from bad to worse, Wendy has nobody to rely on but a friendly elderly security guard. Giving her a sense of moral support she probably is in desperate need for, we expect emotion. But staring panic in the face, Wendy remains strong. Her first moment of visible emotional anguish and vulnerability comes after a terrifying encounter in a forest in the middle of the night. A glimpse into her future as a vagabond? 'Wendy and Lucy' comes at a time when our own economy is in a state of perpetual free fall, which helps Reichardt drive her timely message home. It is these often seemingly mundane and unimportant everyday activities that may cause the film to drag, though it comes in at a slim 80 minutes. But it is these events that help the film and Williams find personality. 'Wendy and Lucy' asks us to be strong, to stick with our character. And it offers an ending that will pull at the heartstring of even the most hardened cynic. A tough, very challenging situation you and I would never want to find ourselves in. It speaks of conviction, of doing the right thing even when it's impossibly difficult. Raw but surprisingly gripping, Reichardt does much with little. It's a touching picture, a bittersweet one. 'Wendy and Lucy' may feel minor, but it's a fine piece of beautifully told cinema. A snapshot that gains more appreciation upon reflection. More reviews: rottentomatoes.com/vine/journal_view.php?journalid=219276&view=public",
         "Man, I'm a sucker for this kind of picture. Realism. A movie about real people, in real situations, just like you and me. No frills, no fantasy, no flash. It's not that I don't like movies with these elements in them; It's that a prefer movies without them. I like Michelle Williams without the make-up - just a waif caught in a tough situation in a generic Americana setting. It looks like a small town, but I see the credits say it's Portland Oregon. I'm also a sucker for trains, so I loved all the train shots. Is there a symbolism to the trains? Funny how many times a forlorn train horn is heard nearby, punctuating the quiet desperation of Wendy's plight. I loved the security guy (Wally Dalton) - he shows us there's hope no matter what the situation.....there really is always someone who cares. I sure hope Wendy makes it to Alaska; she deserves to. For those who like this one, you'll like a similar movie I viewed just a few days previous; it has a similar pace, and feel as this one, and a storyline with a little more tension: \"Frozen River\". Catch it if you can."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Field Guide Films",
         "Film Science",
         "Glass Eye Pix"
      ],
      "summaries": ["A woman's life is derailed en route to a potentially lucrative summer job. When her car breaks down, and her dog is taken to the pound, the thin fabric of her financial situation comes apart, and she is led through a series of increasingly dire economic decisions."],
      "budget": 200000
   },
   "movielensId": 65418,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-05-22",
      "dvdReleaseDate": "2009-05-05",
      "directors": ["Kelly Reichardt"],
      "runtime": 80,
      "movieId": 65418,
      "title": "Wendy and Lucy",
      "mpaa": "R",
      "actors": [
         "Michelle Williams",
         "Will Patton",
         "Will Oldham",
         "John Robinson"
      ],
      "imdbMovieId": "1152850",
      "originalTitle": "Wendy and Lucy",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["pASs3rerRCY"],
      "plotSummary": "Wendy, a near-penniless drifter, is traveling to Alaska in search of work, and her only companion is her dog, Lucy. Already perilously close to losing everything, Wendy hits a bigger bump in the road when her old car breaks down and she is arrested for shoplifting dog food. When she posts bail and returns to retrieve Lucy, she finds that the dog is gone, prompting a frantic search for her pet.",
      "tmdbMovieId": 8942,
      "avgRating": 3.52229,
      "releaseYear": "2008",
      "numRatings": 314,
      "posterPath": "/gVsJK34vymqXs5aVweg9RpWGvuA.jpg"
   }
}