{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0291538",
      "video": false,
      "title": "The Housekeeper",
      "recommendations": [
         41273,
         95448,
         43612,
         48150
      ],
      "backdrop_path": "/cnek32rcPip1WeHSEokFQ8rkwMt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jacques",
               "gender": 2,
               "credit_id": "52fe457f9251416c91034877",
               "name": "Jean-Pierre Bacri",
               "profile_path": "/sjXoA3DXsBi4MsymfNELa6idUk4.jpg",
               "id": 28281,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe457f9251416c9103487b",
               "name": "Brigitte Catillon",
               "profile_path": "/5Lk7epqxqcd8TdxfexOc06kiTNn.jpg",
               "id": 20081,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ralph",
               "gender": 2,
               "credit_id": "52fe457f9251416c9103487f",
               "name": "Jacques Frantz",
               "profile_path": "/tGa8DHACbaDKnNRBGWSJjgEf2KS.jpg",
               "id": 39884,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe457f9251416c91034889",
               "name": "Émilie Dequenne",
               "profile_path": "/dsOHqgq8NkCi36hpgx0jwsKeKYg.jpg",
               "id": 23671,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hélène",
               "gender": 0,
               "credit_id": "52fe457f9251416c9103488d",
               "name": "Axelle Abbadie",
               "profile_path": "/p23B3u43tSe2bePtsZZkJr5yX8b.jpg",
               "id": 269903,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Constance",
               "gender": 1,
               "credit_id": "52fe45809251416c91034891",
               "name": "Catherine Breillat",
               "profile_path": "/2oV2Jx2VbtC975ZZQshxuAarlTu.jpg",
               "id": 6295,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "le barman",
               "gender": 0,
               "credit_id": "52fe45809251416c91034895",
               "name": "Apollinaire Louis-Philippe Dogue",
               "profile_path": null,
               "id": 580245,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Julien",
               "gender": 0,
               "credit_id": "52fe45809251416c91034899",
               "name": "Amalric Gérard",
               "profile_path": null,
               "id": 580246,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "jeune fille au concert",
               "gender": 1,
               "credit_id": "52fe45809251416c9103489d",
               "name": "Nathalie Boutefeu",
               "profile_path": "/pm5gdhlhKqrYgIzya6NX4UPK4NV.jpg",
               "id": 130890,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "femme à la terrasse",
               "gender": 0,
               "credit_id": "52fe45809251416c910348a1",
               "name": "Laurence Colussi",
               "profile_path": "/tf78NxUVkg6NiXW1bmdgCvb1uGD.jpg",
               "id": 401125,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "assistant de Jacques",
               "gender": 0,
               "credit_id": "52fe45809251416c910348a5",
               "name": "Xavier Maly",
               "profile_path": "/AhqMSPil8kMHHxiiAntGKBYRmle.jpg",
               "id": 96416,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457f9251416c91034885",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56f96457c3a3686a6700b831",
               "name": "Christian Oster",
               "profile_path": null,
               "id": 1597758,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 2,
               "credit_id": "56f9646e92514168d50012bb",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.845241,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 34840,
      "vote_count": 11,
      "budget": 0,
      "overview": "After his wife leaves him for another man, Jacques hires a housekeeper, Laura, to keep his Paris apartment in order. As he starts increasing her hours and spending more time with her on her days off, Jacques is torn between the pleasure of Laura's company, and the headache that such an intrusion brings to his new domain of singlehood.",
      "similar": [],
      "original_title": "Une femme de ménage",
      "runtime": 91,
      "poster_path": "/tdqDhaO7qgjfWMJyLDImlYOXkeJ.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2002-11-13",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Berri"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Claude Berri",
         "Christian Oster"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0291538/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMjMwMDk5Nl5BMl5BanBnXkFtZTcwNjY4MjAwMQ@@._V1_.jpg",
      "actors": ["Stars: Jean-Pierre Bacri, Émilie Dequenne, Brigitte Catillon | See full cast and crew »"],
      "reviews": [
         "A tender, surprising little film with superb performances, fine writing, good filmic qualities, and a superb music script, Une Femme... touches the veiwer, provides laughs, allows self-recognition, and shows the relative maturity of the experienced against the unintended heartlessnes of the young in a sophisitcated society. Very French. The man is intellectually prepared but still has to deal with the emotions of loss, despite the utterly ill-suitedness of his new love. The girl's neediness for approval and \"love\" demands his response, to which his kind and needy heart does what we expect. A perfect slice of life as has defined French film for so long. Happily. And well. Chapeaux",
         "While some Americans on lower rungs of the cultural ladder are clamoring for \"freedom fries,\" those who appreciate the special verve and wit often the backbone of a good French film won't want to miss \"Housekeeper\" (the U.S. title). What could have been little more than a ninety-minute sitcom sparkles both because of the fine performances of the two leads and the story which deviates from an anticipated trite line. Jacques (Jean-Pierre Bacri) saw his marriage crumble when his wife departed. A recording engineer for both jazz and classical discs, he lives a messy life and needs a housekeeper. Responding to an ad he posted in a nearby cafe, Laura (Emily Duquenne) is about twenty years younger than Jacques and eager for the job. Actually desperate. Despite a Luddite reaction against single male's best friend - the vacuum cleaner - Laura straightens out Jacques's flat. But then she asks to move in for a few days as her boyfriend is kicking her out solely because their relationship has ended (we never see this most unreasonable man). One thing leads to another and, no surprise and not a spoiler, Jacques and Laura find themselves making passionate love. She clearly is deeply in lust with him and they take a holiday, motoring to the coast. What happens next? - hey, see the film. A man Jacques's age finding himself with a besotted, beautiful and very horny young woman would, in most stories, be either exploitive or lost in the fantasy of a perceived stroke of incredible fortune. Director Claude Berri gives Jacques a more interesting persona. He has no qualms or guilt about bedding the lovely Laura but he is neither the kind of man who takes selfish advantage of women nor the sort who takes leave of his senses. He's wholly appealing as a decent guy, not a cad or a fool. Laura? Ms. Duquenne plays her character to perfection. She's the kind of ingenue most men want and fear and the daughter who can drive any parent to drink. BUT...she does windows!!!!! Frederic Botton composed a brisk, very nice score. \"Housekeeper\" won't show in many cities but put in on your \"To Rent\" list. 8/10.",
         "Please, it's \"aspirateur\" not \"respirateur\". Having lived in France for many years I've seen similar situations develop countless times. I've also seen many Claude Berri films and he has got it down pat. It was pleasant to recognize the familiar Paris neighborhood scenes and to wax nostalgic over such familiar goings on. The two leads are most realistic and the supporting actors lend a tone of verité. All in all, a most realistic slice of life à la française. For anyone who has lived in Europe this film will be a pleasant reminder of the sophisticated approach and attitudes that the Europeans (especially the French)bring to situations such as the one depicted in this movie.",
         "Claude Berri's Une Femme de Ménage (Housekeeper) takes us to a familiar world of contemporary French cinema: a casual, chic quartier of Paris where a successful fifty-something jazz record producer named Jacques (Jean-Pierre Bacri) lives in a very comfortable flat that's a very big mess because his wife has left him. He answers a notice tacked up on a neighborhood café and before long Laura (Émilie Dequenne), a twenty-something with a perfect, ripe body and cooperative good nature equally in evidence, is not only coming twice a week to clean and iron, but, because her boyfriend kicks her out, has moved in. Next thing you know she's offering that body to Jacques and when his estranged wife Constance (played in a tortured cameo by director Catherine Breillat) appears at the door and begs for a reconciliation, he decides to escape on a two-week vacation in Brittany at his artist-chicken farmer friend Ralph's place, and Laura begs to be taken along. There is something charming about this moment when Jacques and Laura head for the seacoast, Laura packing the vacuum cleaner (`respirateur' in French) to practice (she's been using a broom, so she can enjoy hip-hop on the boom box; he's told her she must master the `respirateur' if she's going to get more work) - and insisting on getting herself a haircut and dye job enroute. She's very much a work in progress, and the uncertainty of her relationship with Jacques is interesting. It's so absurd you half believe it might work. Laura is eager to please and so docile and loving, poor Jacques would have a new mate for sure if he didn't mind one twenty-five or thirty years younger whose taste runs to loud pop, junky TV, and trashy magazines. The dialogue in the car defines the uncertainty. He doesn't love her -- he'd be a fool to - but he likes having her around. Ralph (Jacques Frantz) provides a whimsically eccentric note - he paints portraits of his pet chickens and then serves them for dinner; the house smells like a barnyard. But it also turns out, when Laura snoops in Ralph's bedroom and finds a ring with Jacques' name on it, that Constance has been there recently in her wanderings and has slept with Ralph. The beach is what separates Jacques and Laura. She loves the water; he hates it. He covers up and reads while she plunges, and then she becomes a regular in volleyball games with two teams of well built young men. Late at night she insists that Jacques take her dancing. He meets an old woman friend there - also just abandoned by her mate. . . but this sounds more complicated than it is. What happens is that when Jacques says he's about to go back to Paris, where Laura, who can be anything she wants here, is only his housekeeper, Laura finds a young man, and is as ready to pair off with him as she was with Jacques. Jacques meets the young man's mom on the beach. She's getting divorced. He's sympathetic. He goes for a swim to keep mom company. He gets a cramp in the water. She helps him out. Maybe they'll become a couple. THE END. It's too bad this novel adaptation by the talented M. Berri trails off this way. There is real fun in the sense of possibility Laura's voluptuous appearance provides. In French movies, old, ugly men are deemed attractive: note that Laura's cute new boyfriend doesn't even have a speaking part. He's just a walk-on - or rather a run-off: he lopes down to the ocean with Laura and that's the last we see of him. This alone makes Housekeeper a fresh vision for American viewers. However, there's hardly anything profound here, despite the French point of view, nor can Laura, whose nice body and youth are her chief coping skills, be seen as a liberated woman in the mold of Jeanne Moreau in Jules et Jim. Femme de Ménage is fun, but there's something hasty and condescending about it. An Eric Rohmer story probably wouldn't have the uneasy class aspects of Laura's inappropriateness for Jacques: age would the only factor (compare Claire's Knee). To see how hasty the story is, think of the sensitive and profound character study of a lonely man in Claude Sautet's 1992 Un Coeur en Hiver.",
         "The best thing coming from this Berri film is that plausibility and prediction conspire to improve a weak plot. The spectator, however, gets the surprise of his life when, in a sudden twist, the film reveals he has been watching the wrong movie. Give the kudos to the actors: sexily believable and deceitfully ordinary. Jacques and Laura, the main characters in this autumn-spring old line plot, early show their true self. She, young and beautiful, knows he is in a middle of a sentimental crisis. He, mature and confused, is never deceived by her egotist intentions. A sexual relationship is sure to occur, and so it does. But, it comes as a strange mix of feelings and desires, that the film never gets it clear. That's the relevance of this story: life cannot be deconstructed and explained in terms of art. Just the mirror, as the good Stendhal knew almost two centuries ago. Une femme de menage (more explicative than the English title) is a quiet thought on the passing of chances and the options we make; and a lecture on the futility of adapting our expectations to a self-deceitful sense of self-importance.",
         "I almost gave up on this one forty minutes in. Don't you do that. The ending is superb. Premise: working class girl gets dumped by her boyfriend and seeks work by housekeeping. Well, that can lead to something better if you keep house for the right person. Jacques (Jean-Pierre Bacri) who recently got walked out on by his wife, and who, not so incidentally looks sixty--well, fifty-five--(actually he was barely fifty when this was made, but you get the point) gets his ad for a housekeeper answered by Laura (Emilie Dequenne) who is twentysomething--a young twentysomething. I guess there is not much else to say, and to be honest I decided I would force myself to watch the inevitable. But the director is Claude Berri who directed two of the best movies I ever saw: Manon of the Spring (1986) and Jean De Florette (1986). And so I stayed with it. At about the fifty minute mark the movie started to get interesting. I could feel that old guy/young girl love affair was going to take an unexpected fork in the road. (As Yogi said, if you come to a fork in the road, take it. The players have no choice.) Obviously, old guy/young girl can end only one way: young girl leaves old guy for young guy. This is biology. It will be painful. Claude Berri knows all this, and probably a lot better than I do. And so guess what? Well, I won't tell. But you will find that the last thirty-some minutes of this sexy romantic comedy delightful, and especially the very, very clever and most satisfying ending. Just prior to that Laura asks Jacques for his blessing. He won't give it, but she is right: he should. And then when we get the final \"life is so...lifelike\" grimace on Jacques's face, we can only smile. Emilie Dequenne is delightful as the strangely wise and very natural Laura, and Jean-Pierre Bacri is winning as the old guy who knows better, but on reflection should thank his lucky stars. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "This movie has a light plot and lightly written characters: a middle-class neurotic-grumpy-artist falling in love with his young-trashy-placid housemaid. There is a very fine line between lightness and shallowness and that movie can't avoid falling into clichés, especially regarding the world outside the two main characters (like: the ex wife sleeping with the best friend). But the actors Emilie Dequenne and Jean-Pierre Bacri are just so generous towards their characters that they make them real, and utterly lovable. They are captivating and make that little unpretentious movie an enchanting delight.",
         "\"Housekeeper (Une femme de ménage)\" is a wry commentary on mid-life relationships that teeters on being male fantasy wish fulfillment. Writer/director Claude Berri uses visual and musical metaphors to show differences between characters, building on the central character's work as a sound engineer recording classical music and jazz. Jean-Pierre Bacri recalls the mid-life crisis role he wrote for himself in \"The Taste of Others.\" We are very slowly introduced to his stuck in the mud life and the cause for it, and then slowly see him come back to life to deal with his feelings. Amusing touch that the titular nubile nymphet eschews modern conveniences in cleaning while listening to pounding hip-hop dance music. Her taste in music and manipulative need for a rent-free apartment is about all that's realistic about her. Would a Hollywood version let everybody finally act their ages?",
         "Yet another small gem from that great year of French pics 2002. The talent is out of the right bottle too if anybody asks you, writer director Claude Berri and male lead Jean-Pierre Bacri, no slouch as a writer himself. To a certain extent is IS a male fantasy with Emillie Duquenne all but throwing herself at Bacri who has to be twice her age at least. But, as others have pointed out in these boards Bacri is basically decent and certainly wasn't looking for a May-December affair only for someone to police his apartment. For reasons of her own Duquenne developed what seemed to be genuine hots for him and naturally he's not going to turn down an attractive young girl. There's no special insight nor is any attempted, it's just a record of a brief fling in which nobody really gets hurt and we get to see some pleasant Parisian locations and listen to some pleasing music. Lemon soufflé anyone.",
         "This film is both comedy and a melodrama about a Parisian classical music producer who lives alone in his Paris flat. He hires a housekeeper without references or much experience. Jacques was brilliantly played by French actor, Jean-Pierre Bacri. The housekeeper, Laura, is perfectly played by Emilie Dequenne. Laura ends up moving into his flat where their musical tastes reflect their ages. They also have an intimate relationship which leads to a trip to Normandy Beach where they see his old friend. Most of the film is about Jacques and Laura's relationship. Jacques is overcoming from a painful breakup with his ex-wife. Laura needs a place to crash and he offers assistance. In the end, they become friends and lovers but I think they both needed each other's companionship for the loneliness felt at the time."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Renn Productions"
      ],
      "summaries": ["After his wife leaves him for another man, Jacques hires a housekeeper, Laura, to keep his Paris apartment in order. As he starts increasing her hours and spending more time with her on her days off, Jacques is torn between the pleasure of Laura's company, and the headache that such an intrusion brings to his new domain of singlehood."],
      "budget": 0
   },
   "movielensId": 6544,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2002-11-13",
      "dvdReleaseDate": "2003-11-11",
      "directors": ["Claude Berri"],
      "runtime": 91,
      "movieId": 6544,
      "title": "The Housekeeper",
      "mpaa": "",
      "actors": [
         "Jean-Pierre Bacri",
         "Brigitte Catillon",
         "Jacques Frantz",
         "Émilie Dequenne",
         "Axelle Abbadie",
         "Catherine Breillat",
         "Apollinaire Louis-Philippe Dogue",
         "Amalric Gérard",
         "Nathalie Boutefeu",
         "Laurence Colussi",
         "Xavier Maly"
      ],
      "imdbMovieId": "0291538",
      "originalTitle": "Une femme de ménage",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After his wife leaves him for another man, Jacques hires a housekeeper, Laura, to keep his Paris apartment in order. As he starts increasing her hours and spending more time with her on her days off, Jacques is torn between the pleasure of Laura's company, and the headache that such an intrusion brings to his new domain of singlehood.",
      "tmdbMovieId": 34840,
      "avgRating": 3.27586,
      "releaseYear": "2002",
      "numRatings": 87,
      "posterPath": "/tdqDhaO7qgjfWMJyLDImlYOXkeJ.jpg"
   }
}