{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0280696",
      "video": false,
      "title": "Garage Days",
      "recommendations": [18153],
      "backdrop_path": "/1a0zHbCZTXpGUl23w27OqJqImTl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Freddy",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce53",
               "name": "Kick Gurry",
               "profile_path": "/8XzZ6hw2ctF55O4Ia6WaH2Fnx0Y.jpg",
               "id": 93111,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe44e4c3a368484e03ce57",
               "name": "Maya Stange",
               "profile_path": "/4LnkpvHqTMAidrzQALnj9NkQZJ1.jpg",
               "id": 75671,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tanya",
               "gender": 1,
               "credit_id": "52fe44e4c3a368484e03ce5b",
               "name": "Pia Miranda",
               "profile_path": "/gEL1gEnnch7xKIql6Gvomw0dhsH.jpg",
               "id": 93110,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bruno",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce5f",
               "name": "Russell Dykstra",
               "profile_path": null,
               "id": 94349,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce63",
               "name": "Brett Stiller",
               "profile_path": null,
               "id": 75739,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lucy",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce67",
               "name": "Chris Sadrinna",
               "profile_path": "/kuvtsRhL0MspUiTYn8OGKISLlG4.jpg",
               "id": 94350,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce6b",
               "name": "Andy Anderson",
               "profile_path": "/oqMIHWHvKIFBTSYWPrQSvaeNJi9.jpg",
               "id": 62753,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Shad Kern",
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce6f",
               "name": "Marton Csokas",
               "profile_path": "/g36Ydyv0YbwXLOQ2KzGjFfkCDo1.jpg",
               "id": 20982,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e4c3a368484e03ce4f",
               "name": "Alex Proyas",
               "profile_path": "/yJEEjalWtxqg8Oe2aH0fVJIk4ii.jpg",
               "id": 21085,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5457fd660e0a2611580002b9",
               "name": "Alex Proyas",
               "profile_path": "/yJEEjalWtxqg8Oe2aH0fVJIk4ii.jpg",
               "id": 21085,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5457fd760e0a26115e0002a7",
               "name": "Dave Warner",
               "profile_path": "/fGZvmLlM3eizXlxDtUdqSA8hu3N.jpg",
               "id": 77699,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5457fd850e0a2611550002c8",
               "name": "Michael Udesky",
               "profile_path": null,
               "id": 1381471,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 2.154656,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 25921,
      "vote_count": 9,
      "budget": 0,
      "overview": "A young garage band in Sydney, is trying to make it big in Australia.",
      "similar": [],
      "original_title": "Garage Days",
      "runtime": 105,
      "poster_path": "/AhbXufZTchzrBjCMVKMrsI12s8G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mystery Clock Cinema",
            "id": 908,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Australian Film Finance Corporation",
            "id": 1380,
            "origin_country": "AU"
         }
      ],
      "release_date": "2002-10-03",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Proyas"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Alex Proyas",
         "Dave Warner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0280696/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjgyMDc3ODk4OV5BMl5BanBnXkFtZTcwMzkxMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kick Gurry, Maya Stange, Pia Miranda | See full cast and crew »"],
      "reviews": [
         "Unfortunately, the rest of the movie sucks on ice. The \"characters\" are either overblown clichés (death-obsessed goth girl? Check. Drugged-out drummer with mod haircut? Check check. Ubiquitous use of eyeliner? Check check check!) or ridiculously annoying people who you'd never spend six seconds with in real life. Script-wise, this is a soggy mess. There are three people credited with the story, which makes sense as there are at least three movies stitched together. My guess is that Dave Warner wrote a comedy, Alex Proyas penned a tragedy, and Michael Udesky scribbled in a notebook while tripping on liquid acid. Then each of them tore out every fourth page of his script, threw the remaining pages up in the air, and stapled the resulting mess together. The, um, cinematography is aggravating. Tarantino is not hip, MTV is not edgy and that disjointed text-on-screen technique went out of vogue around the 1890's. As for the trip/rave/ingestion scenes, they're as effective as PSAs: Don't do drugs! Why? They're boring as all get-out. Overall this is a sickeningly inauthentic movie. The acting is laughable, the comedy is unfunny, the pathos makes you hate these people even more than you previously did. All the tattoos look like they were drawn on with Magic Marker. And the band's total playing time is less than two minutes. 90 seconds of that is a fantasy scene. The ONLY reason to acknowledge the existence of this celluloid horror is its soundtrack. Featuring the Jam, the Femmes, the Cure, Roxy Music and Tom Jones - that's entertainment. Just buy the record and skip this movie entirely.",
         "Do yourself a favour and see \"The Wannabees\" (about a gang of foul-mouthed thugs who become the country's most successful children's show), \"Razzle Dazzle\" (about a failing dance instructor and a bunch of fellow losers trying to coach a bunch of pre-teen girls to victory) and \"Garage Days\" about... as best as I can summarize... a rock'n'roll soap opera that plays out like a Hunter S. Thompson nightmare (Fear & Loathing in Las Vegas). \"Garage Days\" is exactly what a quirky, offbeat, rock'n'roll Aussie comedy should be: quirky, offbeat & full of rock'n'roll. Before I even get to my review, I'll mention some of the tunes on the soundtrack: AC/DC \"It's a Long Way to the Top\" & \"High Voltage\", The Cure \"Boys Don't Cry\", Violent Femmes \"Blister in the Sun\", Roxy Music \"Love Is the Drug\", and a particularly hilarious choreographed psychedelic scene set to Rick James \"Superfreak\". As in Proyas's masterpiece \"The Crow\", the music really sets the stage for the whole experience. \"Garage Days\" follows a month in the life of a struggling punk-metal-grunge-pop band trying to get their one big shot. Along the way we get roped into the common themes of sex, drugs, love & friendship... and the not-so-common themes of creepy goth girlfriends, soul-sucking slot machines and talking cantaloupes. The whole movie comes at you hard & fast, like \"Amelie\" on crack. Quite surprising for director Alex Proyas, master of the cinematic shadows (\"The Crow\", \"Dark City\")--it's very bright and lively. If you're a fan of Proyas, you must see this side of him. Much like Tim Buton who did \"Batman\" as well as \"Peewee's Big Adventure\", Proyas proves that there's a fine line between darkness & light, and he's able to cross it seamlessly. A note for us Yanks, it helps to watch it with the subtitles because the Aussie accent can run over you like a rabid kangaroo. And some of the quips are priceless, you don't want to miss a beat. I found the script to be hilarious, the acting charming, the story suspenseful and the presentation memorable. Tastes may vary, but I found each character to be instantly likable, from \"Freddie\" (an odd mix of Peewee Herman and a young Christopher Walken) to \"Tanya\" (a punk rich girl who sports the perfect blend of hot, cute & badass), \"Lucy\" (Henry Rollins meets Billy Idol meets Mongo from Blazing Saddles), \"Joe\" (a puzzler who is best left for you to decipher), \"Joe's dad\" (an aging rocker who himself is more childish & clueless than his son), all the peripheral characters who did a stellar job, and then there's the guy who steals the show \"Bruno\" their loser manager (played by Russell Dykstra from the aforementioned \"Wannabees\"). There aren't many well-known movies I can compare this to because it's so unusual, but if you've seen the hilarious Japanese flicks \"Kamikaze Girls\", \"Swing Girls\" or \"Otakus in Love\" I'd say this fits right alongside them. It also reminded me a bit of the funny Rainn Wilson flick \"The Rocker\", only pumped up with twice the adrenaline and totally Aussified. If you like rock'n'roll comedies, do not miss this!",
         "Being engaged to an Aussie may jade my opinion of this movie, since I have been exposed to some of the little inside jokes and such over the past few years. However, any movie that keeps you talking about it and wanting your friends to see it so that you can chat about your favorite scenes is a movie worth watching. Yes, it is an old plot, but aren't they ALL?!?! Boy meets girl...boy can't have girl (Groundhog Day fell into this one in one aspect). The underdog(s) fighting all hope to live the dream (a la 8 Mile). We've learned to accept that there are a few plots that work, yet it is the nuances that happen to make them unique. This little movie has some great nuances, so forget the similarities and enjoy the uniquities. Grab a bag of chips and enjoy the ride. By the way, without spoiling anything, anyone out there who loved seeing the Stanford Tree mascot and the Cal Bear mascot throwing punches during a basketball game will howl out loud at one small scene. I know that I did.",
         "I liked this movie. The plot is as old as the hills, only it didn't end the way I guessed (and I like that). Also there is a twist that I didn't see coming. The movie tells the story of a band that starts before their first gig. There are the usual inner-band romances going on and the kooky over weight manager/roadie tossed in for fun (see \"Rock Star\" or \"Still Crazy\"). The have to raise $1200 at one point (insert usual odd ways they do that here). There is the usual big concert at the end. Blah Blah Blah. BUT I liked this movie. Why? The ending was real, the sound track is great (I'm 41 what can I say), there were some twists to the plot I didn't see coming and the even though it's a tired old plot, it's a tired old plot for a reason: It's a good one. 7/10",
         "I saw this movie as part of the AFI screenings. The movie is very upbeat and you walk out feeling very satisfied with the experience. The direction is excellent with some nice special effects esp. slow motion which is used for character thought pieces. There is great use of music, including the Cure but we don't really see them play much at all. Why there are probably many reasons probably because we know they are actors and that would be a little indulgent to have long mimed pieces. I don't think the band has a name. The plot starts off by being obvious. I was thinking, another \"band wants to hit the big time\" movie. Yes it is but it works due to this being only the starting point. Although the usual cliches are found here they aren't as laboured. Drugs and sex will means it will not suit the munchkins. Loved it!!!",
         "This film is a disappointment. It tries too hard to be cool and too little to be interesting. The love triangle is never compelling and the \"will they/won't they make it\" story would work only if we cared. As it is we have a bunch of annoying musicians doing not much in not much of a movie. Filmed in location in Newtown - where I live - it was interesting to see my haunting ground on the big screen. Also many of my friends were extras in the film, but all ended up on the cutting room floor. A shame cause for me having them in it would have been the highlight, nothing else was. On a positive note, Australian Actor Russell Dykestra does a great job as the manger/roadie of this unsuccessful garage band. The rest of them however seem terribly miscast. Maya Stange looks reasonably vacant throughout, like she really would prefer to be somewhere else - and who could blame her. Pia Miaranda and Kick Curry - both so good in \"Looking for Alibrandi\" a few years back, fail to light any sparks here. The style of the film is so erratic as to be positively frustrating, never more so than when we get the slow motion \"let's get inside their heads\" scenes where the characters voice over tells us unnecessary and frankly not very enlightening exposition. And as for the drug scenes - well terrible drug cliche doesn't even begin to cover it. The final song and dance scene played during the credits is the best bit of the film, trouble is you have to sit through the rest of it to get there. Alex Proyas (The Crow, Dark City) works best when he deals with dark, broody, mystery subject matters. Light quirky Australian comedy clearly isn't his forte.",
         "This film taught me an important lesson. Don't choose a movie based on the past works of the people who made it (which works both ways, actually). I was expecting a film directed by Alex Proyas to be at least half-decent, but was unpleasantly surprised. This film has a storyline so lame it's funny, mediocre dialogue, truly appalling acting (with one or two exceptions) and superfluous special effects. Don't waste your time with it. I watched it with my girlfriend and we were ready to switch it off after 10 minutes. We gave it another 10 minutes to see if it improved - nope. Back to the Loch with you, Nessie!",
         "This movie is just plain fun that takes a pretty average, well-known look at the music industry and the hike that bands take to get to where they want to be. But Alex Proyas adds some CGI effects (pretty funny ones, I might add...like Mellie the \"baby\") to make up where this average movie was headed. ALl of the actors are pretty unknown in the States (where I am), but it all doesn't matter because they were all vivacious enough (and good-looking enough) to make you believe that they encountered this past themselves. This movie tries to take you on an emotional roller-coaster of relationships between band members and their girl/boyfriends, but where that comes up short, the movie just throws more fun at you. My favorite parts are the melon-baby and the hallucination scene where the band's bassist tries to get money from her parents and finds herself tripping out. I hated the where-are-they-now ending and cutesy-poo looks back on life and love and careers and whatever else, but the movie as a whole was OK. I gave it a 6/10.",
         "GARAGE DAYS (dir. Alex Proyas) A strange film because it's a rock'n'roll movie that does not embrace the clichéd rock'n'roll fairy tale, but aims for just the opposite. GARAGE DAYS is about learning to accept your limitations and struggling with something that is really important regardless of your degree of success. Set in Australia the film has a 'local' feel, although Alex Proyas, the director, makes the film as big in scope as a classic of the rock genre. The perennial romance of rock'n'roll is the belief that a small but influential voice can overcome overwhelming odds and attain massive popularity and success. But the message of GARAGE DAYS is that after all of their struggle, the band members don't come close to fulfilling their rock'n'roll fantasy, but are still satisfied with their lives.",
         "Guys, take the movie at face value - it is funny with a touch of pathos that maybe those close to the music industry might be able to chuckle at a little more than others. I noticed a comment elsewhere that suggested it might have been written my a wannabe - I suggest you do your homework. Dave Warner was one of Australia's original punks and an icon of the Western Australian music industry in the 70's (and 80's). And they did it the hard way \"back then\". Maybe this is how he dreamed it was. You can see touches of this \"reality\" everywhere. For everyone else. It is funny and it is fun. If you think young musos come from another planet... welcome aboard the spaceship Garage Days... enjoy the ride as a bunch of mates try to live the rock'n'roll dream (or is that nightmare). But it ain't a documentary (rockumentary) - that would be boring. Almost famous? Maybe. It will leave you feeling a little warm and fuzzy and maybe feeling like you are now IN on some of the IN jokes. Don't take it so seriously. Great music and some great new (and not so new) Aussie acting talent."
      ],
      "genres": [
         "Comedy",
         "Music",
         "Drama"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Mystery Clock Cinema"
      ],
      "summaries": [
         "A coming-of-age comedy about a young Sydney band trying to get a foothold in the competitive world of rock n' roll. After the band's first gig is a colossal failure, the lead singer takes it upon himself to go out and pursue the most successful rock manager in the country. Meanwhile the other members of the band continue to deal with the kind of every day life issues that can ultimately tear a band apart. It may be the dawn of a new millennium but it's still a long way to the top if you want to rock n' roll.",
         "The story of a young garage band in Sydney, Australia trying to make it big."
      ],
      "budget": 6000000
   },
   "movielensId": 6554,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-10-03",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Alex Proyas"],
      "runtime": 105,
      "movieId": 6554,
      "title": "Garage Days",
      "mpaa": "",
      "actors": [
         "Kick Gurry",
         "Maya Stange",
         "Pia Miranda",
         "Russell Dykstra",
         "Brett Stiller",
         "Chris Sadrinna",
         "Andy Anderson",
         "Marton Csokas"
      ],
      "imdbMovieId": "0280696",
      "originalTitle": "Garage Days",
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young garage band in Sydney, is trying to make it big in Australia.",
      "tmdbMovieId": 25921,
      "avgRating": 2.88235,
      "releaseYear": "2002",
      "numRatings": 102,
      "posterPath": "/AhbXufZTchzrBjCMVKMrsI12s8G.jpg"
   }
}