{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0447166",
      "video": false,
      "title": "The Gamers: Dorkness Rising",
      "recommendations": [
         25745,
         214264,
         9047,
         241432,
         38986,
         16405,
         19319,
         27636,
         22882,
         31281,
         39908,
         84589,
         19965,
         31605,
         40798,
         19753,
         46175,
         22301,
         305276,
         54613
      ],
      "backdrop_path": "/gdZRNI5Tzh5UAezs0LEwEUKiVTo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Sir Osric / Lodge",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04095b",
               "name": "Nathan Rice",
               "profile_path": null,
               "id": 114105,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Daphne / Joanna",
               "gender": 1,
               "credit_id": "52fe44f5c3a368484e04095f",
               "name": "Carol Roscoe",
               "profile_path": null,
               "id": 132753,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Brother Silence / Cass / Rennard",
               "gender": 2,
               "credit_id": "52fe44f5c3a368484e040963",
               "name": "Brian Lewis",
               "profile_path": null,
               "id": 132754,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Flynn / Leo / Turk",
               "gender": 2,
               "credit_id": "52fe44f5c3a368484e040967",
               "name": "Scott C. Brown",
               "profile_path": "/zSwvc7kQTQtcujfwvJnPkKHvhyR.jpg",
               "id": 132755,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Luster / Gary / Fastidian / Undead Fastinian",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04096b",
               "name": "Christian Doyle",
               "profile_path": null,
               "id": 132756,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Luster (female) / Professor",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04096f",
               "name": "Jennifer Page",
               "profile_path": "/1KnDEWJgE0ATzdSUWwg6KAyv6ke.jpg",
               "id": 132757,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mort Kemnon",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040973",
               "name": "Geoff Gibbs",
               "profile_path": null,
               "id": 94931,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Hierophant",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040977",
               "name": "Ed Gibbs",
               "profile_path": null,
               "id": 132758,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mort Agrippa / Mummy #1 / Goblin",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04097b",
               "name": "Don Early",
               "profile_path": null,
               "id": 132749,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Inquisitor",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04097f",
               "name": "Sean K. Reynolds",
               "profile_path": null,
               "id": 132759,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mark",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040983",
               "name": "Chris Duppenthaler",
               "profile_path": null,
               "id": 114100,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Goblin Queen",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040987",
               "name": "Julia Vancil",
               "profile_path": null,
               "id": 132760,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Nodwick / Voice of Drazuul",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04098b",
               "name": "Steve Wolbrecht",
               "profile_path": null,
               "id": 132761,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Therin, Goddess of Light",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04098f",
               "name": "Emily Olson",
               "profile_path": null,
               "id": 132746,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "King Erasamus the Randomly Biased",
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040993",
               "name": "John Frank Rosenblum",
               "profile_path": null,
               "id": 132762,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e04094b",
               "name": "Geoff Gibbs",
               "profile_path": null,
               "id": 94931,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040951",
               "name": "Matt Vancil",
               "profile_path": null,
               "id": 114109,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a368484e040957",
               "name": "Matt Vancil",
               "profile_path": null,
               "id": 114109,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.199602,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26235,
      "vote_count": 18,
      "budget": 0,
      "overview": "All Lodge wants is for his gaming group to finish their adventure. Unfortunately, they're more interested in seducing barmaids, mooning their enemies, and setting random villagers on fire. Desperate to rein in his players, Lodge injects two newbies into the party: a non-player character controlled by Lodge, who the power gamers immediately distrust, and the rarest gamer of all -- a girl.",
      "similar": [
         8810,
         3134,
         294963,
         948,
         281,
         298312,
         141,
         681,
         4638,
         281957,
         10212,
         11564,
         43923,
         133805,
         2142,
         1359,
         185,
         10285,
         431,
         101
      ],
      "original_title": "The Gamers: Dorkness Rising",
      "runtime": 105,
      "poster_path": "/mndi25H3RJt9s7ay5UBrEfU5gUs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dead Gentlemen Productions",
         "id": 3047,
         "origin_country": ""
      }],
      "release_date": "2008-01-01",
      "vote_average": 7.1,
      "belongs_to_collection": {
         "backdrop_path": "/ub73vqZ3O4NmkViOcLapTWef882.jpg",
         "name": "The Gamers Collection",
         "id": 251383,
         "poster_path": "/6fddPG42kCQ7GVFuKZbT0RCGB7V.jpg"
      },
      "tagline": "They'll be taking a few liberties with the rules.",
      "adult": false,
      "homepage": "http://deadgentlemen.com/projects/the-gamers/the-gamers-dorkness-rising/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matt Vancil"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Matt Vancil"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0447166/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MDg3ODM3Ml5BMl5BanBnXkFtZTcwNDk1NTY4MQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Nathan Rice, Carol Roscoe, Brian Lewis | See full cast and crew »"],
      "reviews": [
         "I had heard about \"gaming\" and \"Dungeons and Dragons\" before, but I had know idea it could be like what I saw in the \"Gamers: Dorkness Rising.\" These guys are so funny and fun to watch. Especially the guy who plays the \"bard\" or \"minstrel\" or whatever, he has a gift for physical comedy and timing. There is so much background humor and energy in some of the scenes that make you really think that at least some of it was improvised there on set. The special effects needed to be worked on a bit, but I saw it at a convention last year and thats one of the things they said they were going to redo and make better, so it's probably wicked now!",
         "I saw this at the screening at GenCon in Indy. I had some time to kill and decided to check it out. It played to about 1000 people in a packed standing-room-only ballroom. Wow, what a ride! The script was tight. The action tense. The pacing perfect. The character exposition excellent. One thing I really appreciated was that you knew going in that this wasn't a big budget film. Yet it soon became obvious that the creators pushed their sets and effects as far as they could despite their limitations. And it was more than enough. It's true that this film was targeted at a certain audience - gamers/tabletop players - the creators make no effort to hide that. But other filmmakers could learn a lot from them. For in going for the jugular in scene after scene and not worrying about if Mom who happens to be watching will \"get it\", they got the biggest laughs time and time again. But there's enough universality there that Mom will be laughing too, even if she's not in on every joke. I think too many times I see films that try so hard to lower the bar to the lowest common denominator so that they will appeal to the most people, but the movie just ends up suffering for it. But not this flick. Indeed, this film was so solid that it had the audience wrapped around it's finger from the opening credits. And, while the viewers around me *really* wanted to like the film, they weren't pushovers - gamers can be among the most critical niche out there. I'm so glad I got to see this in a big crowd. At least 10 times the audience was having such a good time that they erupted into applause at a joke or scene during the film. How often does that happen at screenings? It should be no surprise that there was a huge standing ovation when the closing credits rolled. For my own part, I can't wait for this to be released. After it ended, one of the producers said they were shooting for a simultaneous TV/DVD release. That date cannot come soon enough.",
         "I am definitely not a gamer, but a couple people in my family and my boyfriend are. So, a little reluctantly I decided to find out what the big deal was with \"fantasy stuff\". I saw Dorkness Rising and thought it was HILARIOUS! It's slapstick, but not disrespectful to those that enjoy role playing games. Also, and most importantly, people who've never gamed before can enjoy it and not feel left out or lost trying to understand the plot. The acting was great and the field shots/set were believable. This makes me want to see other movies by this production company. I can't wait to see what the future holds for this group! Three cheers - well done!!",
         "Just got back from the European Premiere of The Gamers: Dorkness Rising. All I can say is that if you are a gamer (CRPG, RPG or LARP), then this movie is for you. And if you're not a gamer? Well, it's still a great deal of fun. The acting is certainly not Oscar-worthy, but in the whole element of the movie it adds to the charm. The humour is everywhere, along with some very nice touches (the tribute to Gary Gygax is especially well done, if you can spot it). The cast are very down to earth in their appearance, befitting the fact that they are ordinary people enjoying an ordinary hobby. The quality of the movie's sound and vision are adequate, but again, it all just adds to the atmosphere that helps to define this movie as being the Dungeons and Dragons movie, written and performed by gamers for gamers. Not afraid to use terminology specific to one system, they still manage to allow product placement to be a part of the movie, but in a very understandable and utterly fair manner. It also touches on some of the perceived prejudices that some gamers can have about other gamers and deals with that quite well. All in all the movie is very much driven by an well-thought-out equal balance of character, plot and entertainment (the Bard is amazingly good value-for-money). In the end it does make scoring this movie quite hard, so I have given it 2 scores. Score (for non-RP'ers): 7/10 (A few moments could go way over your head, but the main sections of the movie just work so hard and achieve so much more.) Score (for RP'ers): 10/10 (Everything fits together, in the perfect quantities, and with the perfect charm and sentiment)",
         "I'm new to gaming, but I would have started MUCH sooner if this film had been around! I caught it at Gen Con last year (a trip made only as a favor to my husband) and LOVED it! Even to a non-gamer like I was at the time, it's funny and accessible--so much so that I finally relented and started sitting in on my husband's gaming group. I don't want to give away any plot details, but if you're a gamer, you NEED to see this film--and if you're not, you're going to have a great time despite yourself. There are certainly \"in\" jokes, but the vast majority of the film is accessible to anyone. My only complaints: wish it were longer and wish it were available on DVD. Soon, perhaps?...",
         "Better than the original, \"the Gamers: Dorkness Rising\" manages to pull off a funny comedy with good acting, fine special effects, and comedy that transcends the \"gamer\" knowledge-base and do so on a low budget. I've seen many low-budget films that have been terrible and almost none that have been as good as their high-budget counterparts. This film blows most mainstream movies away! Parts are a bit weak (the bit with the pirates and ninjas -while funny- goes on a bit long without explanation and takes you out of the movie for a bit) but, overall, this is a very strong film. I'm very happy to say that I bought this film as soon as I saw it and brought it home. Any chance we can look forward to another feature Gamers movie from these guys? :)",
         "Dead Gentlemen Productions has put together a film with amazing production values considering their budget. Anyone that has ever played any role-playing game, particularly any fantasy RPG (they play Dungeons and Dragons in the movie) will LOVE this movie. Brilliant performances all around--especially with regards to the dual nature of the principles, playing their players and their characters. Anyone who has ever filmed or acted in a student film will appreciate the amount of work and love they put into this project. This movie (and its prequel) is to fantasy movies and role-playing games what Blazing Saddles is to westerns--parody of the highest order. I only have a couple minor complaints about the movie itself, none of which will prevent me from buying the DVD as soon as it's available (only 6 more weeks--I'm counting the days): 1. When Lodge is talking to Joanna about joining the gaming group, he hands her a copy of the Dungeons and Dragons Players Handbook and says \"this will tell you everything you need to know.\" The camera hovers too long on a shot of the book, and the moment really seemed like a commercial. 2. The jokes are hilarious, but they seem unevenly spread throughout the movie. The last third of the movie, after the almost continuous barrage of visual and verbal humor preceding it, slows down a bit, as if the narrative was catching up with the jokes. Odd, but Blazing Saddles always struck me that way as well. . . and I love that movie, too. One of the narrative strengths of the story is the unresolved nature of the romantic subplot. Will Joanna become the GM's girlfriend? Will she go back to Cass? Or will the three maintain a platonic friendship, deepened by the camaraderie of role-playing? (Yes that sounds sappy, but there are a couple of saccharine moments, particularly when Cass and Lodge \"make up\" at the end.) But the movie spans one week: in terms of human relationships, those questions could not be answered in a week. The fact that the characters' relationships are left undefined strikes me as better than the more classical choices you see in most movies, like the girl gets her prince and they move into the castle, or the prince sinks into the North Atlantic after three trite, tedious, and predictable hours. The writers really seem to have a grasp of the psychology of the characters, and you can see the characters (both the gamers and the player's characters) change over the course of the movie, but not suddenly, and not unbelievably. I would love to hear more wisdom from Brother Silence. \"The man who stands out in darkness is. . . fluorescent.\"",
         "This film is so wonderful it captures the gaming life. I laughed so hard while watching this. The movie is about a gaming group that have a hard time with a campaign that their dungeon master came up with. The movie switches from the real world and the gaming world as they play the campaign it shows them in the gaming world as their character, and then switches back to the real world when they are not playing. The campaign is the basis for a module that the dungeon master, Lodge, is writing. The problem is Lodge can't finish his module because the characters can't finish the campaign. They are more for killing and looting instead of role playing. Lodge wants them to role play through the campaign something they have never done before. They decide to bring in some extra help so they bring a,wait for it, girl in to play. Lodge also makes a npc, a non player character, a paladin,who can not witness or do wrong, to play. The film is how they do all this and more I don't want to spoil any of the film so I won't say any more. This movie may not be a big budget film the acting may not be Oscar worthy but if you are into gaming or into dungeons and dragons then definitely watch it. They had a lot of fun making this film and it shows I am not going to bash on it for any movie problems such as continuity or any thing it was a low budget film that is just fun. There is some slap stick comedy which I enjoy and some damn good writing in my opinion. So if you want a fun film try it .",
         "There are few films that have had me waiting and waiting for release more than this one. This is the latest film from The Dead Gentlemen group responsible for the original Gamers film and the Demon Hunters films. This group has not been terribly active over the last few years but this film is a definite reason to try and keep things up in following their progress. This film follows a group of gamers who are trying to finish a campaign run by a GM frustrated by his group's disregard for his story. With the help of some new blood they attempt the campaign again with hopes of finishing this time. This movie is a breath of fresh air in the movie community and a great improvement over the original. The movie shows respect for the game much like the original movie did but on top of that this movie shows a dramatic improvement on special effects launching it above the simplicity of college films. The acting is fairly decent and the jokes are quite funny. Unfortunately many of the jokes are in jokes so if you are not a gamer you may not find the film as funny as others. So this is why I give the movie an 8 instead of the 9 that I initially thought of. Any case if you are a gamer or know about gaming check this one out you will enjoy it.",
         "This groundbreaking film is truly a work of art. I went into the screening at the convention in Indiana with very low expectations, having already viewed 2 other film with \"gamer\" in the title (both of which were so bad that by the end of the second one I had plucked out one of my own eyes with my drinking straw and a twisted paper clip I found between the seat cushions). But from the opening credits \"Dorkness\" had me. The temperate Northwest setting made a beautiful backdrop for the drama surrounding the frustrated game master, Lodge(powerfully portrayed by Nathan Rice) and his misfit band of friends who set aside the real-life dramas they face everyday to face fantastical dramas in the setting Lodge provides for them. After the first scene(set in the fantasy world they inhabit) They are violently thrust back into the world they so desperately try to escape. This drew so many comparisons to my own life that I was moved to tears. Rice's acting is of such amazing caliber that I truly believed within the first 20 minutes of the film that he really was a twenty-something male suffering from frustration, male pattern baldness and an annoying group of \"friends\" that can't seem to grasp concepts like right and wrong. Lodge's friends are of some note here: Leo, the oldest and heaviest of the trio seems to be the only other character with a job, aside from lodge. Yet he seems to gravitate socially towards Gary, the youngest of the group. This seems only slightly odd at first until you realize that Gary is, in fact, a sexually confused sociopath with very few prospects outside his \"fantasy\" world. This dichotomy serves, not to confuse, but to inform and uplift the audience about the importance of diversity in our society. My only complaint about this is that the actors who portray Leo (Scott C. Brown) and Gary (christian Doyle) seem to play the characters for laughs at times, as though they were informed they were acting in a comedy instead of a hard-hitting action/drama. Speaking of action, Brian Lewis makes his film debut as Cass, the third and most influential member of Lodge's motley crew. the tension is always high when he is on screen, both when he is arguing passionately about his beliefs to Lodge or when displaying his fantastic Martial Arts skills as \"Silence\" his fantasy character. Or even when he turns around suddenly to face the audience and you reflexively duck in the audience so as not to get smacked by his fantastic chin. Lewis Lights up the screen no matter what he's doing and I hope to see more of him in the future. Once the action begins in this movie, it just doesn't quit. the drama and the action blend so seamlessly at times that you can's tell whether your in the middle of a frenetic action sequence or a touching dramatic moment. Truly a thrill ride of Epic proportions, I would recommend \"The Gamers: Dorkness Rising\" as required viewing for anyone who loves film. It was almost worth losing an eye over. ~Chip Deedlenick"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Dead Gentlemen Productions",
         "Epic Level Entertainment"
      ],
      "summaries": ["All Lodge wants is for his gaming group to finish their adventure. Unfortunately, they're more interested in seducing barmaids, mooning their enemies, and setting random villagers on fire. Desperate to rein in his players, Lodge injects two newbies into the distrust: a non-player character controlled by Lodge, who the power gamers immediately distrust, and the rarest gamer of all -- a girl. Can the group overcome their bickering to save the kingdom, or will the evil necromancer Mort Kemnon triumph unopposed? A parody of fantasy films and the adventure gaming community, The Gamers: Dorkness Rising is a hilarious romp through the world of sword and sorcery -- in this case, a world of exploding peasants, giant house cats, and undead roast turkeys. Game on!"],
      "budget": 0
   },
   "movielensId": 65588,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-01-01",
      "dvdReleaseDate": "2008-08-14",
      "directors": ["Matt Vancil"],
      "runtime": 105,
      "movieId": 65588,
      "title": "The Gamers: Dorkness Rising",
      "mpaa": "",
      "actors": [
         "Nathan Rice",
         "Carol Roscoe",
         "Brian Lewis",
         "Scott C. Brown",
         "Christian Doyle",
         "Jennifer Page",
         "Geoff Gibbs",
         "Ed Gibbs",
         "Don Early",
         "Sean K. Reynolds",
         "Chris Duppenthaler",
         "Julia Vancil",
         "Steve Wolbrecht",
         "Emily Olson",
         "John Frank Rosenblum"
      ],
      "imdbMovieId": "0447166",
      "originalTitle": "The Gamers: Dorkness Rising",
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["DvH4PskPZ4M"],
      "plotSummary": "All Lodge wants is for his gaming group to finish their adventure. Unfortunately, they're more interested in seducing barmaids, mooning their enemies, and setting random villagers on fire. Desperate to rein in his players, Lodge injects two newbies into the party: a non-player character controlled by Lodge, who the power gamers immediately distrust, and the rarest gamer of all -- a girl.",
      "tmdbMovieId": 26235,
      "avgRating": 3.58878,
      "releaseYear": "2008",
      "numRatings": 107,
      "posterPath": "/mndi25H3RJt9s7ay5UBrEfU5gUs.jpg"
   }
}