{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "arizona",
            "id": 1859
         }
      ],
      "imdb_id": "tt0051393",
      "video": false,
      "title": "The Badlanders",
      "recommendations": [
         38808,
         37317,
         42997,
         60643,
         34269,
         39435,
         38800,
         43356,
         15266,
         58902,
         32653,
         46570,
         43008,
         76568
      ],
      "backdrop_path": "/hE95nNCfxGPAomrLS1h67GHyXGA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Peter Van Hoek / The Dutchman",
               "gender": 2,
               "credit_id": "52fe495d9251416c750c5b83",
               "name": "Alan Ladd",
               "profile_path": "/tAMVLKk0A73RBIvib7QBntutKI8.jpg",
               "id": 30510,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John McBain",
               "gender": 2,
               "credit_id": "52fe495d9251416c750c5b87",
               "name": "Ernest Borgnine",
               "profile_path": "/kQhcGAc2TgohrvLZSYapT2SHRby.jpg",
               "id": 7502,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Anita",
               "gender": 1,
               "credit_id": "52fe495d9251416c750c5b8b",
               "name": "Katy Jurado",
               "profile_path": "/mlxcf8ni0QCYmLtccMjeFlVRx2s.jpg",
               "id": 4069,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ada Winton",
               "gender": 1,
               "credit_id": "52fe495d9251416c750c5b8f",
               "name": "Claire Kelly",
               "profile_path": "/jxUJ6xee0srOOmsEzNu7imvHRWp.jpg",
               "id": 94029,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Cyril Lounsberry",
               "gender": 2,
               "credit_id": "53f770b2c3a36833f70058dc",
               "name": "Kent Smith",
               "profile_path": "/xwAXHrjizAsN6j0xDlMadMMa4g4.jpg",
               "id": 51764,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Vincente (The Powder Monkey)",
               "gender": 2,
               "credit_id": "53f770c2c3a3683400005941",
               "name": "Nehemiah Persoff",
               "profile_path": "/jyH8brDoTdpNuGzSIGsJRS51iys.jpg",
               "id": 3160,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Sample",
               "gender": 2,
               "credit_id": "53f770d0c3a368340b00589b",
               "name": "Robert Emhardt",
               "profile_path": "/fYMw0dolhykl8z34sGKqS2OGAjC.jpg",
               "id": 83826,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Comanche",
               "gender": 2,
               "credit_id": "53f770dec3a36834070054a7",
               "name": "Anthony Caruso",
               "profile_path": "/lKlrMS3HFeDgYCTojZa6tfGBZGR.jpg",
               "id": 16004,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Leslie",
               "gender": 2,
               "credit_id": "53f770eec3a36833f70058df",
               "name": "Adam Williams",
               "profile_path": "/eGdsCvVnd66A57JOEQ2SghzSBJi.jpg",
               "id": 2645,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe495d9251416c750c5b7f",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe495d9251416c750c5b95",
               "name": "Richard Collins",
               "profile_path": null,
               "id": 69812,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe495d9251416c750c5b9b",
               "name": "W.R. Burnett",
               "profile_path": "/wkdR0bD13Jr0LGGsoWgSDyoEWDU.jpg",
               "id": 80728,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 1.231618,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 94533,
      "vote_count": 7,
      "budget": 0,
      "overview": "Two men are released from the Arizona Territorial Prison at Yuma in 1898. One, the Dutchman, is out to get both gold and revenge from the people of a small mining town who had him imprisoned unjustly. The other, McBain, is just trying to go straight, but that is easier said than done once the Dutchman involves him in his gold theft scheme.",
      "similar": [
         3090,
         6637,
         962,
         49849,
         429,
         12227,
         818,
         9654,
         49524,
         1572,
         10530,
         22,
         85,
         87,
         89,
         1995,
         1996,
         217,
         120,
         682
      ],
      "original_title": "The Badlanders",
      "runtime": 83,
      "poster_path": "/cIXV43gscAvk2ytiCG3nmFnv4B7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Arcola Pictures",
            "id": 14091,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1958-09-03",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Delmer Daves"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Richard Collins",
         "W.R. Burnett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1ODI1ODAwMF5BMl5BanBnXkFtZTcwNDI0NTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alan Ladd, Ernest Borgnine, Katy Jurado | See full cast and crew »"],
      "reviews": [
         "Satisfying tale of 2 paroled prisoners who set up to rob a mine belonging to the men who railroaded them into prison. Nice photography, somewhat slack pace. Good characterizations, especially by Borgnine and Jurado. Borgy plays a good man for a change, affecting the Chaneyesque character transformation from violent, angry inmate to a strong-willing individualist on the way to Mexico with the stolen loot. The heroes are surprisingly trusting, given that they had already been cheated by their new \"employers\". Nice tone, little substance or action.",
         "Vividly filmed in Cinemascope in the best late-50's MGM style, this loose remake of The Asphalt Jungle in a Western setting has some good acting and takes a different road. The relationship of Alan Ladd and Ernest Borgnine is consistently interesting and unpredictable throughout, and Katy Jurado offers a standout performance. Ultimately less grim than its source material, this one has a satisfying resolution, and the action that leads to it holds the interest the entire way. A solid Western that deserves a significant place in both of its stars' filmographies.",
         "I stumbled onto this one accidentally, and I'm glad I did. Davies always worked with Borgnine to fine advantage, but the electricity of his pairing with late-in-career Ladd is an unanticipated delight. And, Borgnine's chemistry with then-wife Jurado is hotter still. Couple that with a deliciously foppish performance by feckless Kent Smith and excellent supporting work from Anthony Caruso and Ford Rainey and sharp-edged dialogue. The result is a fast-paced keeper.",
         "Allen Ladd and Ernest Bourgine did outstanding work in this horse opera. The plot, the acting, the sets, all work well. This is one of Ladds better films, Bourgnine always adds to a film, Katy Jerado of \"High Noon\" fame is just great, and the rest of the cast work well. It is just a little gem of a film. The one distraction is a no longer so often heard stock soundtrack of less than \"A\" feature quality. Maybe they were newer when the film was released, and maybe they have been given a rest so newer viewers will not recognize them, but I have heard these sound cuts far too often in many a 1960's western, TV show, horror film, documentary, and what not. I wonder how much better it would have been with a Dimitri Tiomkin, a Lionel Neuman, a Bernard Herrmann, or John Williams soundtrack. If they ever restore this, and it is worth restoring, I would have a new soundtrack done for it. Still, this is a good film, a great western, and worth a watch. It is out of print right now but you can catch it on cable or get a used VHS print on E bay. Superior horse opera!",
         "I saw The Badlanders when it first came out in 1958 in theaters. It was my first acquaintance with both Alan Ladd and Ernest Borgnine. Then as now it's a good action packed western. But that's all it is. I didn't know at the time that this same plot had been done so much better by John Huston in The Asphalt Jungle. All the subtlety and character development that Huston had was sacrificed for action. Delmar Daves is a pretty good director of westerns and action is what they got here. Mind you The Badlanders is a good film for the Saturday afternoon trade, but it was done so much better before. Alan Ladd is Peter Van Hoek, mining engineer who has a heist in mind of his former employers. He's the Sam Jaffe of this version. He's looking for confederates and he enlists a former cell-mate from Yuma prison who is played by Ernest Borgnine. Sterling Hayden in the first version. Ladd was on the downward side of his career. The Badlanders is a perfect example of the kind of films he was doing after Shane, routine action flicks which could easily have been done as the plot of any number of television westerns that were sprouting all over the place at that time. Ernest Borgnine was still on the crest of his career from his Oscar winning performance in Marty three years before. He even got his then wife Katy Jurado in this film as his love interest. Nice cast that's familiar to western lovers round out the film. But everyone here has done better.",
         "This is the kind of film that you want to find when you sit down on a Sunday afternoon to have some \"TV time\". Alad Ladd is as solid and dependable as ever with his usual \"cool and unruffled\" persona and is probably the least effective of all of the leads! Ernest Borgnine and Katy Jurado initially look like an unlikely pairing but as the film progresses they \"gel\" more and more. It would also appear to have been an inspired piece of casting as the actors themselves \"paired up\" during this film and married the following year of its release! For me the two are the real stand-out performers in this film. I don't want to say too much more on the other characters for fear of giving plot away but suffice to say there is not a stinker amongst them although I have to say that I felt Claire Smith as Ada Winton was a bit invisible to the point where I actually thought a the end of the film \"Oh, is she back then; where did she come from?\" One thing that has puzzled me however is who was the actress that played Vincente's wife? It looked as if it could have been a young Natalie Wood but despite a speaking role (of sorts), there is no credit for her. Whoever it was she has some of the most expressive eyes seen since the silent days! Overall however and enjoyable yarn with a good solid cast providing a good solid performance.",
         "The Badlanders is directed by Delmer Daves (Broken Arrow/3:10 to Yuma) and it stars Alan Ladd, Ernest Borgnine, Claire Kelly & Katy Jurado. It's based on W.R. Burnett's novel The Asphalt Jungle, only with a Western variation as opposed to John Huston's film noir movie of the same name from 1950. The plot follows Peter Van Hoek, known as the Dutchman (Ladd), and John McBain (Borgnine), as they get released from Arizona Territorial Prison in Yuma in 1898. Tho not together, they both head for the mining town of Prescott where they have issues and scores to settle. An intricate plan involving stealing gold from the Lisbon Mine is hatched, it's a chance to get rich, get revenge or maybe get killed? It's really just a solid piece of film, Ladd & Borgnine play it right, and with Daves adding his customary flecks of humour, it's never less than entertaining. Even the two handed romantic sub-plots {two girls/two guys you see} is competently handled, with the Jurado/Borgnine coupling given weight since they both would become married to each other the following year. Shot in Metrocolor and Cinemascope it isn't found wanting visually, particularly the work in and around Tuscon, Arizona. The problem for many will be its talky centre, this is a film that has very little action. Except for a good old punch up as Borgnine tackles three rebel rouser's types, and the inevitable double cross based finale, the film is more concerned with forming bonds and educating in the way of getting gold out the mine. The latter of which was really interesting to me personally, but it could go either way for anyone else. You will also yearn for some flesh on the bones of the villains {Kent Smith is especially weak}, because they are barely formed, thus rendering the revenge core almost redundant. It's an above average time filler, but a film where all the principals were operating safely to earn their pay. 6/10",
         "Toward the end, there is a scene that I recognized almost word for word from a similar scene in The Asphalt Jungle, then I realized that the whole thing is a close approximation. The family man safe cracker is the family man \"powder monkey\", the heavy Borgine is the thug Sterling Hayden (with their girlfriends of questionable repute), the financiers with their bought lawmen and molls are the same, the caper is similar. This one is a bit more lightweight than the former. Maybe it would have worked better as a noir in B&W but not a bad film.",
         "Whilst watching The Badlanders, it struck me just how similar most of what was playing out was to one of your more typically hard boiled crime novellas; indeed, further reading reveals the film's roots are wholly embedded within the realms of crime fiction transfused with heist genre tendencies, the film effectively a remake of 1950's The Asphalt Jungle which itself was adapted from a book of the same name. The film's structure of somewhat hardened folks let loose from jail, but with differing sets of ideas in how to live out the remainder of one's life, before going on to get involved with rather maddeningly attractive women; the grief which comes with that and the promise of the robbing of some riches which is mingling around in the area, you might say is wholly generic in the typical sense. The transporting of the tale form whatever decrepit urbanised locale you like, indeed a proverbial jungle formed out of concrete, and back to the Wild West does nothing to cease the pleasures garnered out of such generic conventions; The Badlanders eventually formulating into an absorbing piece balancing these crooks clashing in their post-incarceration existences, with their plannings of heists born out of devilish back-stories, with the betrayals that might naturally unfold post-heist. The Hellish truths which loomed over most of James Mangold's 2007 3:10 to Yuma remake, and most probably the majority of both Delmer Daves' original and the initial novel, is here, in this film, thrust upon us without much in the way of pleasantries. The stark realities of Yuma jail that the outlawed Ben Wade in said text faced, had his death sentence been revoked, hovered over the proceedings like the scorching sun did over the protagonist of that text's crops, and is here put right across from the off - wholly establishing where we stand in necessarily knowing anything about such a jail. Delmer Daves is back, his 1958 film The Badlanders plunging us into those realities of Yuma jail by plunging its two principal characters into the deep end of grief and strife as a result of being on the inside. We're at the back end of the nineteenth century; the searing sun in this, the dusty; grotty locale of Arizona searing down onto that of both its chief players: Ernest Borgnine's John McBain and Alan Ladd's Peter Van Hoek, nicknamed \"Dutch\". Both men are released on account of their sentences running out at once, Dutch after a stretch that saw a corrupt marshal plant evidence onto his person that saw him put away and McBain because of his amoral lifestyle which saw him put away, but during which his Yuma stretch has reformed him. The pair of them initially go their separate ways, McBain the once criminally minded man looking to start afresh with a different stance; Dutch the straight man incorrectly put inside and as a result, has exited the other end a spiteful and disenchanted man looking for some vengeance. Whilst inside, the film observes how well they work when thrust together in tense and relentless scenarios and must adapt to one another accordingly; the attempted suicide by way of drowning one inmate tries during a daily wash in a nearby river seeing the pair of them combine to garner a better outcome. On another occasion, a heated situation threatens to boil over when McBain is jumped upon by Dutch thus preventing him from killing a guard in anger. Their demonstrating, here, their ability to combine to some degree and compliment one another's characteristics or skills, precedes their working together later on in additionally problematic circumstances. Dutch's revenge-ridden plan is linked to an old mineshaft long since abandoned of which he is aware still harbours gold, an item which will cost that of the nearby town dearly out of their own ignorance. In the case of McBain, he dutifully fights a group of men effectively doubling up as those with misogynist tendencies, instilling that while he maintains his aggression and combative skills, he's broader minded now. Both men meet respective women, the Mexican girl McBain saved eventually filling in as his love interest whereas Dutch winds up meeting the already married Ada (Kelly). Plans formulate, McBain appears to come back on board when he cannot find work and the tension is cranked up when the crew Dutch eventually enlists through a corrupt local official named Lounsberry (Smith) are given a mere few days to execute the heist following an interaction with a lawman giving them a strict ultimatum to get out of town. At stake is the overbearing threat of returning to Yuma, those jibes riddled with hostilities and unpleasantness that the guards uttered upon the men's release still ringing in the ear as the reality of life on the inside in those opening sequence resonates. The love stories and promise of happier times born out of the obtaining of the gold act well as items utilised in creating a greater sense of urgency, McBain's Mexican partner effectively forced into going back to the life fraught with what came with it if everything does not succeed, whereas the film playfully toys as to whether Lounsberry is to be trusted as the job itself undergoes numerous hold ups and problematic situations which threaten to scupper the plans of a group of people we have come to be rather fond of. Director Daves keeps everything moving, balancing these plights and combining the slimmer; more softly spoken demeanour of Ladd � calculating and cold look of calculation almost always in his eye - with the brasher, larger and more buoyant Borgnine. The women are suitable alluring, indeed Dutch's first altercation with Ada sees her tower above him as he peers upwards whilst on his hands and knees in a corridor, whereas the characters of law and order appear in a less than glamorous light: coming across as corrupt, provocative and as bullies rather than upstanding; the bulk of it formulating into something quite impressive.",
         "This is one of Delmer Daves' less ambitious westerns, but also one of his best. You would not see Alan Ladd playing more complex characters, like Richard Widmark, Gary Cooper, Glenn Ford or James Stewart, which were in other Daves' westerns. But Daves was able to make the most out of it and Badlanders is an entertaining, fast paced western, about two men who have been cheated out of what belonged to them, and decide to rob a mine. They would get rich and also revenge themselves. Ernest Borgnine and Katy Jurado give the best performances of the film, both play people who have had a terrible life but find hope in each other's arms. Claire Kelly has a small, but significant role, as the mistress of the mine's owner. Badlanders deserves to be released in DVD with widescreen in order to take full advantage of the fact that it was filmed in Cinemascope."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Arcola Pictures"
      ],
      "summaries": ["Two men are released from the Arizona Territorial Prison at Yuma in 1898. One, the Dutchman, is out to get both gold and revenge from the people of a small mining town who had him imprisoned unjustly. The other, McBain, is just trying to go straight, but that is easier said than done once the Dutchman involves him in his gold theft scheme."],
      "budget": 0
   },
   "movielensId": 66051,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-09-03",
      "dvdReleaseDate": null,
      "directors": ["Delmer Daves"],
      "runtime": 83,
      "movieId": 66051,
      "title": "The Badlanders",
      "mpaa": "",
      "actors": [
         "Alan Ladd",
         "Ernest Borgnine",
         "Katy Jurado",
         "Claire Kelly",
         "Kent Smith",
         "Nehemiah Persoff",
         "Robert Emhardt",
         "Anthony Caruso",
         "Adam Williams"
      ],
      "imdbMovieId": "0051393",
      "originalTitle": "The Badlanders",
      "genres": ["Western"],
      "youtubeTrailerIds": ["yULWLiFnBzU"],
      "plotSummary": "Two men are released from the Arizona Territorial Prison at Yuma in 1898. One, the Dutchman, is out to get both gold and revenge from the people of a small mining town who had him imprisoned unjustly. The other, McBain, is just trying to go straight, but that is easier said than done once the Dutchman involves him in his gold theft scheme.",
      "tmdbMovieId": 94533,
      "avgRating": 3.125,
      "releaseYear": "1958",
      "numRatings": 4,
      "posterPath": "/cIXV43gscAvk2ytiCG3nmFnv4B7.jpg"
   }
}