{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0067630",
      "video": false,
      "title": "Psychomania",
      "recommendations": [
         38446,
         26680,
         29954,
         64524,
         29570,
         29067,
         39222,
         39925,
         3581,
         31952,
         36754,
         3701,
         83519,
         4788,
         94069,
         29960,
         28050,
         6976,
         40158,
         39982
      ],
      "backdrop_path": "/dQkkjFZpCip4OghJGawN9NzuxwU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Tom Latham",
               "gender": 2,
               "credit_id": "52fe4760c3a36847f81326a7",
               "name": "Nicky Henson",
               "profile_path": "/yM2V0vt7ksVRw8BPPPIpSkqoXoe.jpg",
               "id": 2964,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Shadwell",
               "gender": 2,
               "credit_id": "52fe4760c3a36847f81326ab",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Abby Holman",
               "gender": 0,
               "credit_id": "52fe4760c3a36847f81326af",
               "name": "Mary Larkin",
               "profile_path": "/AnMxGC6mZB9fhlg8S3eja08hWHh.jpg",
               "id": 133124,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jane Pettibone",
               "gender": 1,
               "credit_id": "52fe4760c3a36847f81326b3",
               "name": "Ann Michelle",
               "profile_path": null,
               "id": 140415,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bertram",
               "gender": 2,
               "credit_id": "52fe4760c3a36847f81326b7",
               "name": "Roy Holder",
               "profile_path": null,
               "id": 24709,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Hatchet",
               "gender": 0,
               "credit_id": "52fe4760c3a36847f81326bb",
               "name": "Denis Gilmore",
               "profile_path": null,
               "id": 140416,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Chopped Meat",
               "gender": 0,
               "credit_id": "52fe4760c3a36847f81326bf",
               "name": "Miles Greenwood",
               "profile_path": null,
               "id": 140417,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mrs. Latham",
               "gender": 1,
               "credit_id": "52fe4760c3a36847f81326c3",
               "name": "Beryl Reid",
               "profile_path": "/aqptE9h34ULAO4t6Ew6rdGP4Dp0.jpg",
               "id": 42572,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Coroner",
               "gender": 2,
               "credit_id": "54959d7fc3a368115300273a",
               "name": "Martin Boddey",
               "profile_path": null,
               "id": 1221533,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Publican",
               "gender": 0,
               "credit_id": "54959da7c3a3686ae30043b7",
               "name": "Bill Pertwee",
               "profile_path": null,
               "id": 85536,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mrs. Pettibone",
               "gender": 0,
               "credit_id": "587196ebc3a3684f23010b39",
               "name": "June Brown",
               "profile_path": "/txRFsEdDaVvWqaCevs0rcS2U6dv.jpg",
               "id": 16481,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Chief Inspector Hesseltine",
               "gender": 2,
               "credit_id": "5871970ec3a3684f0e010f37",
               "name": "Robert Hardy",
               "profile_path": "/y6NTr4kw3mNQnPmvhs4XMiFT8v5.jpg",
               "id": 23076,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4760c3a36847f8132697",
               "name": "Don Sharp",
               "profile_path": null,
               "id": 101528,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4760c3a36847f813269d",
               "name": "Julian Zimet",
               "profile_path": null,
               "id": 95859,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4760c3a36847f81326a3",
               "name": "Arnaud d'Usseau",
               "profile_path": null,
               "id": 102129,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "596c2924c3a3684c0200a13a",
               "name": "Andrew Donally",
               "profile_path": null,
               "id": 1800376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "596c29499251413b6e009cae",
               "name": "John Cameron",
               "profile_path": null,
               "id": 19043,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "596c29569251413e9a003f6e",
               "name": "Ted Moore",
               "profile_path": null,
               "id": 9867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "596c2960c3a3683550001ccb",
               "name": "Richard Best",
               "profile_path": null,
               "id": 132588,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "596c29669251413b6e009cc8",
               "name": "Maurice Carter",
               "profile_path": null,
               "id": 95332,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "596c296ec3a3684bcb0092cb",
               "name": "Andrew Campbell",
               "profile_path": null,
               "id": 169723,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "596c29749251413b60009a72",
               "name": "Jean Fairlie",
               "profile_path": null,
               "id": 1811942,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.668282,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 48350,
      "vote_count": 20,
      "budget": 0,
      "overview": "A gang of young people call themselves the Living Dead. They terrorize the population from their small town. After an agreement with the devil, if they kill themselves firmly believing in it, they will survive and gain eternal life. Following their leader, they commit suicide one after the other, but things don't necessarily turn out as expected...",
      "similar": [
         24920,
         170,
         400136,
         19908,
         168098,
         485415,
         19204,
         923,
         434873,
         11429,
         273477,
         36647,
         1562,
         588,
         948,
         747,
         72190,
         381288,
         82654,
         766
      ],
      "original_title": "Psychomania",
      "runtime": 85,
      "poster_path": "/cQVHf01GeQoWGSiIMhOicZzkWhG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Benmar Productions",
         "id": 13947,
         "origin_country": ""
      }],
      "release_date": "1973-01-05",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Ride with the Living Dead!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Sharp"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Julian Zimet",
         "Arnaud d'Usseau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzY3MTY0N15BMl5BanBnXkFtZTcwNTY2MzczMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Nicky Henson, Mary Larkin, Ann Michelle | See full cast and crew »"],
      "reviews": [
         "This is a movie you cannot watch without smiling due to its many kitschy, laughable elements. The only son of a wealthy old English family of frog-worshippers heads a bike gang called the Living Dead that discovers how to come back from the Great Beyond by wishing really, really hard. Hijinks ensue as the bikers kill themselves one by one and come back, ready to commit better mayhem than they ever could when alive because now they are indestructible. The story features unbelievably short skirts on all the girls; a hippy folk song about the glory of living and dying as a biker; young moms being terrorized by the Living Dead as they push prams in their go-go boots and hot pants; interior decor that inspired the makers of 'Austin Powers;' and arcane frog-worship ceremonies that ultimately lead to the undoing of the gang. Never a dull moment.",
         "This is one of my favourite films ever. As a marker, my top 3 are 2001, Apocalypse Now & American Beauty. I can't believe some of the silly, silly comments about it. It's not a horror, it's not a drama, it's kitsch, it was supposed to be and it is. Some people need to chill out and not take life so seriously. I love it. Nicky Henson is just great. Beryl Reid & George Sanders & Roy Holder - all great. I saw this film the first time in 1987 on ITV late one night when I was in Sixth Form. It stuck in my mind for 5 years until it was finally repeated in 1992 and that time I made sure I taped it, the copy I still have. There's no need for me to go into plot as that has been covered, but I do want to underline that this film should be taken light-heartedly! The plot is so funny, and the way it is filmed and acted just underlines it all the way through. Reading some of the reviews puzzles the Hell out of me - along the lines of \"I was expecting a scary Hammer-style flick and I got this nonsense\". Errr ... how can you bad-mouth a film because it wasn't what you expected? That's irrelevant. Surely you should review it for what it is? If any of you guys see it in the TV schedules, make sure you watch & laugh! Real good fun, the methods the gang use to top themselves are hilarious and oh, the soundtrack! Enjoy - it's an order.",
         "I really don't want to say this is my favorite movie, but it sure is tempting. I know full well how cheesy and ridiculous it is... but it's also the most rockin', stylish, all-out groovy flick I have ever seen! I have no idea why this is classified as a horror movie. As far as I can tell, it's meant to be a comedy. A very, very black comedy. The movie's brilliance is that it takes extremely touchy subjects and turns them into lighthearted jokes. The basic message, as far as I can tell, is that there is nothing wrong with mass suicide, anarchism, or devil worship... in fact, it can even be fun! Now, can they really be SERIOUS about this? I think not. The entire movie is a joke, and a very funny one. With scenes such as a a biker jumping to his death after telling a cop \"I'll be right down!\", a biker blasting out of his grave on his motorcycle, a biker coming back from the dead in the morgue and calmly walking out like he just woke up from a nap, etc., all accompanied by some seriously sweet rock music, this is about as cool as it gets. I defy anyone to come up with a more entertaining movie than this.",
         "I've just watched this great film, and I just can't believe I haven't watched it sooner. What a movie! It's got everything a great seventies horror should have - groovy music (very reminiscent of Air's soundtrack for The Virgin Suicides), a well-spoken biker gang, hilarious suicide attempts, the living dead, as well as a bizarre occult fascination with frogs. Or were they toads? Who cares. It's a great film anyway, and I was pleasantly suprised at it's total lack of sex and gore. It just goes to show that you can have an entertaining horror film without resorting to exploitation. And as for suprise endings, well, you'll never see this one coming, I promise you!",
         "For years after its release, this movie was considered as juvenile, sensationalist trash. It was also 'allegedly' one of the reasons the veteran actor George Sanders made the ultimate career move - after his involvement with the film. However with today's young directors pre-occupied with concrete, drugs and misery, this old film now looks quite stylish and appears to be maturing like a cheerful old wine.",
         "Psychomania is probably the only British biker movie ever. The Living Dead are probably the poshest motorbike gang ever! Although they are mean, nasty, well spoken (mostly) & angry. They are also sensitive hippie types, who sing, with flowers in their hair! (don't ask me, I didn't make the film :-p ) The music, by John Cameron is awesome, and after 30 years, is finally available on 'trunk records'. The script is, well, cheesey and the plot is fun, for an 'X' rated film. If your wondering about the plot of the film, it's explained fully in three sentences within the first five minutes. In fact, the scrip is the only thing that lets the film down, although it's one of the reasons I love the film so much. \"...and another thing, you can only die once. After that, nothing and no one can harm you.\" \"WELL WHAT ARE WE WAITING FOR?\" The camera work is excellent in places, especially the morgue scene towards the end. The screenplay has a certain 'whit' about it, check out the suicide scenes. There no big flashy stunts, no flashy expensive SFX, but the film is full of good ideas, a splash of psychedelia and was maybe the inspiration behind the cover of Meat Loafs 'Bat out of hell' album cover. Psychomania is well worth a watch. Just sit back, relax, put your tongue in your cheek and enjoy the ride, there's a stone circle in it!",
         "Ok, kiddies. My whole life I have been a horror film junky. My parents, being the lovely and supportive folks that they are, always bought or rented me these bloody movies when I was a kid. As a gift on my 11th Christmas, I got Psychomania. I will always thank my parents for giving me this movie. It's great and cheesey in all the right ways and scary in all the ways a movie can be. It's creepy good fun! RENT IT NOW. Please. :)",
         "Like a few other people, I first saw this as a kid and it stuck. Anybody who remembers seeing 'Tommy' as a nipper and being hooked by it will know what I mean. It's really quite a terrible movie, but something saves it from being just another unwatchable 'cult' film. In fact, I would rate it as one of the better cult films I've seen. The film is actually well paced, and it never seems to drag. The story, although ridiculous, is easy to follow and always makes sense. The whole thing hangs together nicely. If your a fan of retro 1970s British culture (or atleast silly interpretations of it), this is one film to add to your collection.",
         "This film is hindered by a weak script and quite apathetic acting, but somehow it's ridiculousness makes the film work. Unintentionally Psychomania is an amusing farce, the story of a group of bikers who discover the secret of eternal life, and intend to use this gift for nefarious purposes. The gang themselves are meant to be hardened troublemakers, but the scene where they descend on a town to cause mayhem, is hilarious. I would have thought the Girl Guides could cause more trouble. Saying that, the film has some wonderful one liners, and there is fun to be had in watching this oddball of a movie. Best of all is the sequence where the bikers all commit suicide in order to return as invincible, not for them a simple death the varied ways are way overelaborate and funny. Biker Horror is an odd genre, but the film is great fun and worth a look. Finally, the film does has a cracking soundtrack, a strange blend of gothic high pitched keyboards and hip wah wah guitar, that is always lurking and ably partnering the high jinks on the screen.",
         "~Spoiler~ Psychomania is one of the more bizarre horror comedies I've seen. Alas, that doesn't mean it's a good movie. It involves a biker gang called The Living Dead who become just that. The gang's leader, Tom, comes from an occult family and learns the secret to immortality. That heavily guarded secret is this: When you commit suicide, you must really and truly believe you will come back. Great secret, huh? So he does this, it works, and he convinces the rest of the gang to so as well. What follows is a pretty funny montage of the gang dying in various, ridiculous ways. So the entire gang are now zombies, but they're turned into stone by a satanic figure before they even get to do anything. Bummer. So we have all this build-up for absolutely nothing. The best aspect of the movie for me was the soundtrack. I really dug the music. Also, a man buried on his bike and returning to life by ramping out of the grave ala Cemetery Man doesn't hurt either. The creepiest aspect of this film was finding out that in real life George Sanders (who played the satanic butler) committed suicide. His note read: \"Dear World, I am leaving because I am bored. I feel I have lived long enough. I am leaving you with your worries in this sweet cesspool. Good luck.\" Not to make light of his death, but perhaps he knew some heavily guarded secret..."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Benmar Productions"],
      "summaries": ["A gang of young people call themselves the Living Dead. They terrorize the population from their small town. After an agreement with the devil, if they kill themselves firmly believing in it, they will survive and gain eternal life. Following their leader, they commit suicide one after the other, but things don't necessarily turn out as expected..."],
      "budget": 0
   },
   "movielensId": 66105,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-01-05",
      "dvdReleaseDate": null,
      "directors": ["Don Sharp"],
      "runtime": 85,
      "movieId": 66105,
      "title": "Psychomania",
      "mpaa": "",
      "actors": [
         "Nicky Henson",
         "George Sanders",
         "Mary Larkin",
         "Ann Michelle",
         "Roy Holder",
         "Denis Gilmore",
         "Miles Greenwood",
         "Beryl Reid",
         "Martin Boddey",
         "Bill Pertwee",
         "June Brown",
         "Robert Hardy"
      ],
      "imdbMovieId": "0067630",
      "originalTitle": "Psychomania",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["Qa8zcFMRwxo"],
      "plotSummary": "A gang of young people call themselves the Living Dead. They terrorize the population from their small town. After an agreement with the devil, if they kill themselves firmly believing in it, they will survive and gain eternal life. Following their leader, they commit suicide one after the other, but things don't necessarily turn out as expected...",
      "tmdbMovieId": 48350,
      "avgRating": 3.07895,
      "releaseYear": "1973",
      "numRatings": 19,
      "posterPath": "/cQVHf01GeQoWGSiIMhOicZzkWhG.jpg"
   }
}