{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0103888",
      "video": false,
      "title": "Brother's Keeper",
      "recommendations": [
         381043,
         28216,
         98280,
         30142,
         51391,
         29044,
         19215,
         8847,
         37088,
         24998,
         411014,
         381038,
         221094,
         23388,
         94180,
         41355,
         51725,
         411011,
         205077,
         317916
      ],
      "backdrop_path": "/qu7J8VE3J1oPoPdteiIRYqGDwEx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4517c3a368484e047f2b",
               "name": "Connie Chung",
               "profile_path": null,
               "id": 96149,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "(None)",
               "gender": 0,
               "credit_id": "52fe4517c3a368484e047f2f",
               "name": "John Teeple",
               "profile_path": null,
               "id": 96151,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4517c3a368484e047f33",
               "name": "Delbert Ward",
               "profile_path": null,
               "id": 96152,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4517c3a368484e047f37",
               "name": "Roscoe Ward",
               "profile_path": null,
               "id": 96153,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4517c3a368484e047f3b",
               "name": "Lyman Ward",
               "profile_path": "/lL1dAVbBcSU4O2wD4XZcsmOCcRZ.jpg",
               "id": 90198,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4517c3a368484e047f27",
               "name": "Bruce Sinofsky",
               "profile_path": null,
               "id": 69238,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4517c3a368484e047f41",
               "name": "Joe Berlinger",
               "profile_path": "/nm1QiopjjZLypVQUjJkJ3SkEGnB.jpg",
               "id": 69237,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.810844,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26755,
      "vote_count": 20,
      "budget": 0,
      "overview": "This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert was a member of a family of four elderly brothers, working as semi-literate farmers and living together in isolation from the rest of society until William's death.",
      "similar": [],
      "original_title": "Brother's Keeper",
      "runtime": 104,
      "poster_path": "/AnF8vnVAgkE9nCTtrwGBvAZj4p3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1992-09-09",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "A heartwarming tale of murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Joe Berlinger",
         "Bruce Sinofsky"
      ],
      "runtime": 104,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103888/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4ODU1NDQyNl5BMl5BanBnXkFtZTcwOTg3NzUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Delbert Ward, Roscoe Ward, Lyman Ward | See full cast and crew »"],
      "reviews": [
         "In a simple way this is just an \"us and them\" story, with the hardworking small town folk being treated like buffoons by the big, mean, well-groomed city justice people. But Berlinger and Sinofsky are far more talented than that, and their film ends up being one of the most human films I've ever seen in terms of their generosity to their subjects. It's generous because they don't put their views into the film, they don't decide how we should view the allegations, but at the same time don't restrict themselves from becoming somewhat involved in these brothers' lives. At first we're inclined to look down on these brothers -- they rarely bathe, they're not educated, they can hardly hear what the documentarians say to them. They're completely unselfconscious. Our natural reaction is to place ourselves above them. But the filmmakers' greatness is in how within about half an hour we find ourselves connected to them as equals. In fact, we notice how philosophical they can be, maybe without realizing it -- without being treated like simpleminded saints. The directors give us a view of the townspeople, too, the Ward brother supporters, many of which are quite articulate themselves. (One elderly gentleman, a hard man from the outside, is surprisingly forward-thinking, when it's speculated that the brothers may have had an incestuous relationship, and he uses the word \"gay\" rather than the expected offensive term, and refers to the justice people as \"narrow minded,\" and how whatever kind of relationship the bothers had, sexual or not, it should not have any bearing on the case.) There's one startling description of the brothers' love for one another, that if indeed one of the brothers did kill the other, it was in the same way he would have killed a sick and dying cow, paralyzed after giving birth. (There's one horrifying scene where a pig is killed that isn't quite as lovely.) The communal, familial way in which the filmmakers interact with the brothers is exactly the same way these townspeople interact with one another. The construction of the film is just perfect for the entire film. It's uncomfortable without being cruel, it's friendly without being cloying, it's dark and disturbing without seeming phony. When joyful fiddle music plays after a scene, it's never mocking the way it would be in another film. (And one of the greatest scenes in the film is an image of a ragged man with his cows, and some very, very haunting violin music by Jay Ungar and Molly Mason, whose entire score is outstanding, and anticipates \"Fargo.\") When the trial takes place, we're implicated because we don't know the truth. By this point we're so invested in these brothers that when one of them is on the bench, shaking and terrified from nervousness -- these brothers just don't have this kind of human contact -- the filmmakers have completely earned our tears. It's not a sentimental moment, it's as horrifying as the scene of the pig being killed. You feel as if the judicial system is raping this man of his dignity. This is a masterpiece. 10/10",
         "We are a class of 8 that live in the town where the movie is filmed. We watched the movie and have gone over articles about the Ward brothers. The movie was riveting and very interesting. We weren't even born when this took place. Some of us had heard stories from our parents and grandparents and for the rest of the class this was the first time we heard about it. We feel the town has changed but the people are still the same. Even though the Ward brothers have passed on, their legacy still remains. They are still topics of conversations. We did not like it when Lyman was on the stand and having a nervous breakdown. Half the class feels he is not guilty and the other half are unsure. We are glad we got to see this film and read the stories.",
         "This incursion into the private lives of rural people that turn public by exposition in the media had an eerie effect on me. It was a subjective reaction to a real story that has nothing sinister about it, but I was deeply distressed and somehow frightened by the realization of how some people still live isolated from the world, and in unhealthy conditions, while at the same time being in touch with a community that finds them eccentric but is ignorant of their dysfunctionality. The disturbing story of the four Ward brothers, farmers who lived like hermits in a shack until old age, is material for a Gothic novel or a psychological thriller. When one brother dies in 1990, and his younger brother Delbert is arrested for murder, the \"Munnsville horror\" begins, manipulated by the media while the community defends the accused. For their opera prima, directors Berlinger and Sinofsky spent more than a year with the case. The result was highly rewarding.",
         "This well made documentary involving the murder trial of an illiterate farmer in upstate New York is about as well made as they come. Delbert Ward, a simple farmer who could hardly read, is accused of killing his brother, Bill, in his sleep. Motives for the crime ranged from 'mercy killing' (his brother was sick at the time) to even the suggestion of a sex crime (the brothers shared the same bed all their lives and never had girlfriends). Delbert signed a confession but claims the police made him sign and agree to certain things that weren't true just so he can go home. When the charges were made the whole town of Munnsville, NY, came to Delberts side to defend him and even got money together to release him on bail. This film is an interesting look into the lives of simple people being confronted with 'big city' police and attorney tactics. Even after winning some awards from big film festivals no one bought the film so the filmmakers self-distributed the movie themselves, taking it from theater to theater. It is now one of the most successful self-distributed films of all time. It now has distribution and is well praised. Good Stuff!",
         "Brother's Keeper is quite simply one of the greatest documentaries ever made. The subject of the film Delbert Ward reminds you of a hillbilly Chauncey Gardener from the movie \"Being There\". Instead of being played by Peter Sellers, Delbert is a real person. Delbert has no indoor plumbing, but he does have a television, so when his life is turned upside down and Connie Chung comes to interview him that is one thing he understands. This amazing story takes place not in rural West Virginia, but in New York state. If you get the chance to see this compelling story be sure not to miss.",
         "This film was not made to be entertaining, as far as I can tell. That is not an indictment of the film; it is an indictment of the biggest reason people go to see films. As I watched this film, I was transported into another place. I presume that place is where the filmmakers wanted me to go. It was not a \"fun\" or \"exciting\" place. It was simply a place where I could be and feel otherwise than I am and do right now. I live within bicycle riding distance of the location of the events in this film, yet I got closer than I ever will to them through the craftsmanship of the filmmakers. The music, the imagery, and the way the story was presented combined to provide me with a notable experience. This story is now part of me. Thanks to the filmmakers.",
         "My wife and I are from the metropolitan area of NY, but we have been seasonal residents of Central NY around where this documentary took place. Having the knowledge of the area and the feel for what rural America is like in Central NY, I understood completely what the film makers tried to tell in this documentary. We know people just like the Ward brothers who speak, look and act the same. One old dairy farmer that I know proudly says that he has never been out of the county his whole life. It was for this reason I enjoyed seeing the special movie extra on the DVD in which the Ward Brothers were taken to visit NYC. You as a viewer of this documentary will enter a world which may be strange, disturbing and raw, but it has its own worth and benefit to those who live in it. While watching the trial, I wondered how jury selection was done and how the attorneys were able to select or eliminate jurors in an area that is very close and opinionated. It seemed as it would be hard to find impartial individuals. With everything else that was covered so well, I felt that this was a necessary part of the film that was left out of either the film or as an extra. One of the best films I had ever seen.",
         "i saw this on PBS a few years ago and it haunted me for days. this is a totally unique film experience unlike any you have had or can imagine. it is a documentary, but just as hoop dreams smashed all preconceptions of what a documentary can be, so does this. it is riveting, gut wrenching, and incredibly suspenseful. it shows you characters and a world that are totally new and captivating. it is heartbreaking and uplifting. it moved me in every way i have every been moved by a movie, but without being manipulative or maudlin. it is yet another brilliant documentary snubbed by those ingorami at the academy. i guarantee that you will not come out of this unchanged. it is one of the greatest films i have ever seen (and i have seen a great many...)",
         "I didn't think I was going to like this and I was very afraid that the Ward brothers and their rural lifestyle would be made fun of or otherwise trashed, but this was so thoughtful and careful in its examination. The political motivations of some of the real-life people: the cops, the medical examiner, the prosecutor, were a great foil for the (some would think surprisingly) open- minded townspeople and the hardworking defense attorney. Loved the story and really felt for the brothers and the townspeople. Though I work in Boston now, I've lived and worked in rural areas just like this, and maybe that's part of the deal for me.",
         "It's very sad to look at the Ward Boys, a trio of brothers whose simple world is brought out into the national spotlight in 1991 when one of their brothers is found dead in the morning, and one of the brothers, Delbert (who shared the bed with Bill, the dead brother), is accused of murdering/ euthanizing him. To watch them is to see a segment of the country that gets little attention, but is made king of quaintly riveting in this context. We basically see all the different characters of the town go about their daily lives (including the brothers) while the backdrop of the murder trial casts a pall over their lives. It's funny to see people who would have never normally talked to these outcast bumpkins now embrace them as if they were relatives. And the old Ward Boys, all in their 50s and 60s, don't seem too affected by it all until the trial. This is a really enthralling watch and it gives an insider's view into a community and a world that many of us never get to see. Some of the townspeople are really fun to just listen to, and the police make themselves look pompous and suspect, which is one of the great achievements of this film... it makes us relate to people who are unlike most of us and rally around them against those most like ourselves."
      ],
      "genres": [
         "Documentary",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "American Playhouse",
         "Hand to Mouth Productions"
      ],
      "summaries": ["This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert was a member of a family of four elderly brothers, working as semi-literate farmers and living together in isolation from the rest of society until William's death. A police investigation and Medical Examiner's autopsy suggested that Bill may not have died from natural causes and Delbert was arrested on charges of Second-Degree Murder. Under questioning by police, Delbert appears to have waived his rights and signed a confession, but this film suggests that he may not have been competent to do so. The film explores possible motives for the crime, from 'mercy-killing' (Bill was ill at the time) to progressively more bizarre hypotheses. It also shows how residents of the rural community of Munnsville, NY rallied to the support of one of their own residents (previously considered a social outcast), against what they felt were intrusive 'big-city' police and District Attorney tactics."],
      "budget": 0
   },
   "movielensId": 6612,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-09-09",
      "dvdReleaseDate": "2003-07-29",
      "directors": [
         "Bruce Sinofsky",
         "Joe Berlinger"
      ],
      "runtime": 104,
      "movieId": 6612,
      "title": "Brother's Keeper",
      "mpaa": "",
      "actors": [
         "Connie Chung",
         "John Teeple",
         "Delbert Ward",
         "Roscoe Ward",
         "Lyman Ward"
      ],
      "imdbMovieId": "0103888",
      "originalTitle": "Brother's Keeper",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["OlDSGMAyUrE"],
      "plotSummary": "This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert was a member of a family of four elderly brothers, working as semi-literate farmers and living together in isolation from the rest of society until William's death.",
      "tmdbMovieId": 26755,
      "avgRating": 3.8948,
      "releaseYear": "1992",
      "numRatings": 404,
      "posterPath": "/AnF8vnVAgkE9nCTtrwGBvAZj4p3.jpg"
   }
}