{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt0116231",
      "video": false,
      "title": "The Bandit",
      "recommendations": [
         31401,
         27953,
         31415,
         50737,
         32279,
         57892,
         46629,
         31408,
         31402,
         31534,
         34529,
         30634,
         31412,
         89111,
         13393,
         31413,
         56655,
         49769,
         83651,
         19703
      ],
      "backdrop_path": "/z8V5o6Wm7bzpXUIggd91IkaSkb7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Baran",
               "gender": 0,
               "credit_id": "52fe4520c3a368484e049f05",
               "name": "Şener Şen",
               "profile_path": "/m8idLZ2icbHsSoic0L3PPQuGv6T.jpg",
               "id": 77349,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "cumali",
               "gender": 0,
               "credit_id": "52fe4520c3a368484e049f09",
               "name": "Ugur Yücel",
               "profile_path": "/pQa8iXqeWIElHUXRuZPnzhFvbm5.jpg",
               "id": 109085,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sedat",
               "gender": 2,
               "credit_id": "52fe4520c3a368484e049f1f",
               "name": "Özkan Uğur",
               "profile_path": "/eqNHeDu75LV6r7Ea9uMVpOKV4zf.jpg",
               "id": 106787,
               "order": 2
            },
            {
               "cast_id": 30,
               "character": "Emel",
               "gender": 0,
               "credit_id": "5709040f92514147fc000cda",
               "name": "Yeşim Salkım",
               "profile_path": "/xjBMXQTjjp5NhhNrOKnElUcxX3X.jpg",
               "id": 1258891,
               "order": 3
            },
            {
               "cast_id": 31,
               "character": "Berfo",
               "gender": 2,
               "credit_id": "570905499251415bc000317c",
               "name": "Kamran Usluer",
               "profile_path": "/q17ivqlcp7IQhQjI9CrMtHrOIGL.jpg",
               "id": 1136675,
               "order": 4
            },
            {
               "cast_id": 32,
               "character": "Andref Miskin",
               "gender": 0,
               "credit_id": "57090569c3a3681d2400342d",
               "name": "Necdet Mahfi Ayral",
               "profile_path": null,
               "id": 1383768,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4520c3a368484e049f0f",
               "name": "Yavuz Turgul",
               "profile_path": null,
               "id": 109445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4520c3a368484e049f15",
               "name": "Yavuz Turgul",
               "profile_path": null,
               "id": 109445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4520c3a368484e049f1b",
               "name": "Mine Vargi",
               "profile_path": null,
               "id": 135600,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57090155c3a3681d2c003690",
               "name": "Ömer Vargı",
               "profile_path": null,
               "id": 236655,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57090167c3a3681d29003348",
               "name": "Askin Arsunan",
               "profile_path": null,
               "id": 1603205,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57090177c3a3681d24003332",
               "name": "Erkan Oğur",
               "profile_path": null,
               "id": 147777,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "570901869251415bc00030a1",
               "name": "Ugur Icbak",
               "profile_path": null,
               "id": 1603206,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570901949251415bcf002f0a",
               "name": "Hakan Akol",
               "profile_path": null,
               "id": 90294,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570901aa9251415bcf002f0e",
               "name": "Burak Arliel",
               "profile_path": null,
               "id": 1120698,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570901b8c3a3681d24003340",
               "name": "Onur Tan",
               "profile_path": "/vifr7mnJu3AxcsYqJKyIlA0tiO8.jpg",
               "id": 145477,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570901c8c3a3681d300038ba",
               "name": "Rengin Altun",
               "profile_path": null,
               "id": 1603207,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "570901dac3a3681d2c0036aa",
               "name": "Idil Akcil",
               "profile_path": null,
               "id": 1603208,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570901e8c3a3681d2c0036b0",
               "name": "Selda Çicek",
               "profile_path": null,
               "id": 145496,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570901f7c3a3681d29003366",
               "name": "Ziya Ulkenciler",
               "profile_path": null,
               "id": 1603209,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570902d99251410a4b002c6e",
               "name": "Gulay Dogan",
               "profile_path": null,
               "id": 1603210,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "570902e89251415bcf002f5f",
               "name": "Ozlem Sekercioglu",
               "profile_path": null,
               "id": 1603211,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57090306c3a3681d300038ff",
               "name": "Keith Sewell",
               "profile_path": null,
               "id": 1603212,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "57090335c3a3681d30003911",
               "name": "Sait Dinek",
               "profile_path": null,
               "id": 1603214,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "57090348c3a3681d2400339b",
               "name": "Hilmi Guver",
               "profile_path": null,
               "id": 1603215,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "5709035cc3a3681d2c003711",
               "name": "Nail Yilmaz",
               "profile_path": null,
               "id": 1603217,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "570903749251415bc0003105",
               "name": "Yunus Acar",
               "profile_path": null,
               "id": 1351534,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 0,
               "credit_id": "57090395925141385e002458",
               "name": "Sahin Gul",
               "profile_path": null,
               "id": 1603220,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "570903a69251415bc0003114",
               "name": "Aziz Kiskanc",
               "profile_path": null,
               "id": 1603221,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "570903b6c3a3681d290033ca",
               "name": "Sermin Mikar",
               "profile_path": null,
               "id": 1603223,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "570903cbc3a3681d2c003729",
               "name": "Behcet Karakiz",
               "profile_path": null,
               "id": 1603225,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "570903dac3a3681d2600379f",
               "name": "Derya Erguven",
               "profile_path": null,
               "id": 1603226,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.436948,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 26900,
      "vote_count": 69,
      "budget": 0,
      "overview": "The epic adventures of the legendary Baran the Bandit following his release from prison. After serving 35 years, it is no surprise that the world has changed dramatically. Still, Baran can't help but be shocked to discover that his home village is now underwater thanks to the construction of a new dam. He then heads for Istanbul to get revenge upon his former best friend, the man who snitched on him and stole his lover Keje. Along the way, Baran teams up with Cumali, a tough young punk who finds the thief's old-fashioned ways rather quaint. When Cumali gets into deep trouble with a crime boss, Baran adds another vengeful task to his roster.",
      "similar": [],
      "original_title": "Eşkıya",
      "runtime": 121,
      "poster_path": "/z8LKvkaPJ62qPDEGtIMYfk9RVge.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Geopoly",
            "id": 75291,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filma-Cass",
            "id": 47853,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ArtCam",
            "id": 75290,
            "origin_country": ""
         }
      ],
      "release_date": "1996-11-29",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Yavuz Turgul"],
      "runtime": 128,
      "synopsis": null,
      "writers": ["Yavuz Turgul"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0116231/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQ2NTE5NDUwN15BMl5BanBnXkFtZTcwMTI5NjkzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sener Sen, Ugur Yücel, Sermin Hürmeric | See full cast and crew »"],
      "reviews": [
         "From the cinematography to the plot, to the fine acting, this film is a great example of the diversity of film-making outside Hollywood. A triumph from beginning to end, this film is pretty difficult to pigeonhole as it has so many elements to it. Is it a thriller, is it a reflection on one man's life, is it a buddy movie, is it a revenge movie? It's all this and more. It's got a great pace about it and the depiction of city and country is nicely juxtaposed in many of it's scenes. It's a while since I've seen this film, but there are so many scenes which have stayed with me. I love this film, but damn it's difficult to find.",
         "I found this movie to be one of the best that have ever come out of Turkey. It addresses and reflects on many levels issues and transformations that are currently part of Turkish culture . Sener Sen is strong in his role as an aging \"eskiya\" (a Turkish word for a bandit that would roam the country, making his living off ambush and looting) who returns to his rural home after years of imprisonment only to find his only love taken away to the big city (Istanbul). The story unfolds as an at times romantic, at times funny, at times sad and serious tale which speaks to the multiplicities of modern Turkish life, be it the culture clash (and melding) between city and rural populace, institutional corruption, poverty, and most importantly the identity of a nation that has for almost a century been torn between East and West. The love story driving the whole plot is really only a lighter framework to depict the more important issues in Turkish society that this movie successfully tackles.",
         "The 'rebirth' of Turkish cinema is rejoiced with perhaps one of the finest movies to ever appear in Turkey. It appears the sudden pause of the Turkish cinema due to the lacking quality against the western movie market has resumed, transforming yesilcam and its unique and familiar style into something that is more recognizable by the 'new generation'. Movies like Kahbe Bizans, Abuzer Kadayif, Eskiya, and TV series like Ikinci Bahar and Yilan Hikayesi are some of the finest examples of this. Yet these are far more than simple replications of the western styles, these contain an element of the Turkish culture and people that we are so used to seeing. This is the essence of the brilliance beneath Eskiya. The way it accurately reflects our troubles and the way we deal with them. Beginning with the first scene, we become aware of the how incredibly well written the script is and the realism and truthfulness beneath the characters. This realism in fact is drawn to such a scale that at no poin t in the movie, do we feel anger at any character, or identify one as evil; merely the victims of the horrible system in which we live in, and the incidents we read in the papers everyday. While national problems such as migration, organized crime, and poverty are all central themes to the movie, so are human emotions like betrayal and revenge. Even the bizarre ending filled with numerous deaths appears very natural. The acting also is quite remarkable. Sener Sen, being a great actor, portrays Baran superbly, while Ugur Yucel with his unquestionable talent does his part and every other role is cast with incredible thought and consideration. The climax I thought shows this the best, Sener Sens monologue on the rooftop scene had tears coming out of my eyes. Overall, it would be very unjust to say that this is the greatest Turkish movie to be ever filmed because, being a kid of the new generation, I would simply be completely blocking out 50+ years of yesilcam. However with it's great script, the warmth we feel towards the characters, and the amazing performances by the actors, this is one of the best and it most certainly is a symbol of the rebirth of Turkish cinema. If you are Turkish and haven't seen or heard about this movie, you probably slept through the last 5 years go see it now! And if you're not Turkish, you should still see it. I recommend it to anyone.",
         "This is a great Turkish movie. It has a great story line. This movie opened a new age in turkish movie history. Before this movie turkish cinemas were almost dying. The actors are great. If you want to watch a great movie try this!",
         "this movie has a great storyline.. for the people that doesn't know Turkish movies highly recommended to watch this movie, its a great drama with Sener Sen (one of the best Turkish actor)who's the last bandit from his old gang. He was in prison because of his backstabbing friend, he gets out of jail and start for seeking revenge and starts finding the real reason of the backstabbing. This movie stays one of my favorites and thats why i wont spoil anything, so i highly recommend you guys this movie !! 10 out of 10 ReZ",
         "I've seen this movie in the cinema ten years ago when I was younger and now, after seeing it again, I'm surprised that I still get the same emotions from it. In my review, I'll try to stay away of spoilers but I'll also give you a good treatment of the plot as well (just the big-picture). Movie starts as Baran, an old eskiya (a honorable bandit) is getting out of prison after 35 years of jail to find his village and his home under the waters of Firat river. He then learns that his confinement was due to an old comrade's betrayal, and that his comrade took away and married his lover, Keje. Baran comes to the biggest city of Turkey, Istanbul to seek his old comrade and maybe to take revenge... Due to an unlikely coincidence, he meets Cumali, a young man that has no family and is living in Istanbul, earning his life with criminal acts. Baran the Eskiya is not familiar with the city-life but Cumali is willing to help him because of his debt. Baran the eskiya has a deep character, despite his criminal past, he looks like a naive person in the metropolitan city of Istanbul. Despite that he is an uneducated person, he may be the most honorable and wise person in this big city. Sener Sen (Baran) and Ugur Yucel (Cumali) each gives spectacular acting performance and their talents combined with an intelligent script breathe life into this \"Eskiya\" myth. Baran is the last of the Eskiyas ! The movie has a slow start but towards the ending, the mood gets stronger. The movie reaches it's climax at the dramatic scenes to the finish. This is a story about honor and the power of love. This is a story about two strangers that are becoming tied emotionally, like the father and the son. A classic Turkish Action/Drama movie for all to see ! PS. also check out another Turkish movie \"Kabadayi\" by the same director/writer (Yavuz Turgul) and the same actor (Sener Sen).",
         "Sener Sen was a well known actor before Eskiya but after this movie he is like Al Pacino for Turkish people.The movie is the best movie of all Turkish movies and I had seen it for nearly ten times and each time I discovered different things and I liked it more.The movie is about an eshkiya means a person lives in the mountains,takes money from rich people in order to survive someone lawless.After 35 years in prison he meets a man in the train and than their fates go in the same way.He will love him as if like his child so that he will even leave his darling for him.The movie is about love,revenge,mafia and drug deals.It is a real masterpiece and I recommend this to everyone",
         "i can write just one comment about this movie. You must see that movie before you die. Magnificent movie from Turkey. \"From the cinematography to the plot, to the fine acting, this film is a great example of the diversity of film-making outside Hollywood. A triumph from beginning to end, this film is pretty difficult to pigeonhole as it has so many elements to it. Is it a thriller, is it a reflection on one man's life, is it a buddy movie, is it a revenge movie? It's all this and more. It's got a great pace about it and the depiction of city and country is nicely juxtaposed in many of it's scenes. It's a while since I've seen this film, but there are so many scenes which have stayed with me. I love this film, but damn it's difficult to find.\" i am join in that.",
         "And, to tell the truth, HE still is. The filmmakers in Turkey are always claiming about reaching the thing, the unbelievable, the extreme thing that this movie made to the people. With no grand advertising, or big budget, that's just a miracle that movie has made. And to a miracle, points or comments do nothing but you wanted and I give:eternity out of 10 and just love, like the movie gives to you.",
         "Yavuz Turgut's \"Eskiya,\" which came out almost a decade ago, is he perfect illustration of how unique Turkish cinema can be when it combines elements of Western crime genre films and Anatolian folk dramas, which have been the basis for Turkish films since Muhsin Ertugrul directed films some 75 years ago. The film has some major flaws, but these are mostly in terms of production. The script and its' direction are fairly crisp, and the acting by veteran comic Sener Sen, in a serious role here, and Ugur Yucel, who was also great in Ali Ozgenturk's \"Balalayka,\" is quite exceptional. The film features a haunting score, deep symbolism (particularly in the final scenes) and timely social themes. I think the later is one of the reasons why it has not been popular with those who are more unfamiliar with Turkey, but it is this very element which makes the film more than just a routine gangster film. The film is also considerably more violent than most Turkish films, though many (particularly '70s films of the late Yilmaz Guney) made for brutal cinematic experiences. Another interesting aspect of this film is that it shows a crime family taking its' lifestyle from Anatolia into Istanbul, which reminded me of how Marlon Brando took up where he left off upon leaving Sicily for New York. \"Eskiya/The Bandit\" is not as exceptional as either \"Yol\" or \"Uzak/Distant\" but it is quite a moving film and I gather since it outgroosed \"Titanic\" in Turkey, it was quite the crowd-pleaser.The film was also made at a time when film production in Turkey was at an all-time low, but the industry has thankfully picked up considerably."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "ArtCam",
         "Filma-Cass",
         "Geopoly"
      ],
      "summaries": [
         "The epic adventures of the legendary Baran the Bandit following his release from prison. After serving 35 years, it is no surprise that the world has changed dramatically. Still, Baran can't help but be shocked to discover that his home village is now underwater thanks to the construction of a new dam. He then heads for Istanbul to get revenge upon his former best friend, the man who snitched on him and stole his lover Keje. Along the way, Baran teams up with Cumali, a tough young punk who finds the thief's old-fashioned ways rather quaint. When Cumali gets into deep trouble with a crime boss, Baran adds another vengeful task to his roster.",
         "After serving a 35-year jail sentence, Baran, a bandit, is released from prison in a city in Eastern Turkey. The first thing he does is to return to the village he left. But the village has been long submerged under an artificial reservoir. Baran's undoing was Berfo, a friend who had once been closer to him than a brother. In order to snare Keje, Baran's sweetheart, Berfo seized his best friend gold and have Baran arrested by the gendarme on Mountain Cudi. Then Berfo purchases Keje from her father against her will, and disappears. According to rumor, he is in Istanbul. While traveling to Istanbul by train, Baran meets Cumali, a young man. Cumali was raised in the alleys of Beyoglu, his life revolving around bars, gambling joints, alcohol, dope and woman. Cumali dreams of joining the mafia and making it big. He takes Baran to a dilapidated hotel in the backstreet's of Beyoglu. After a while, Cumali and friends discover that Baran used to be a bandit, but they can't take it seriously. For them, it is just a laugh. Cumali's dreams of a new life include Emel, his girlfriend. Emel has a convict brother, who is in trouble with the other prisoners in his jail. His life is in danger, and he needs high amount of money to get out. Cumali promises Emel to get the Money for her brother as soon as possible. Meanwhile, the bandit is going through Istanbul in a daze, lost in totally alien world, with no idea where to start looking for the woman he loves and the mortal enemy who was stolen her..."
      ],
      "budget": 0
   },
   "movielensId": 66302,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "1996-11-29",
      "dvdReleaseDate": null,
      "directors": ["Yavuz Turgul"],
      "runtime": 121,
      "movieId": 66302,
      "title": "The Bandit",
      "mpaa": null,
      "actors": [
         "Şener Şen",
         "Ugur Yücel",
         "Özkan Uğur",
         "Yeşim Salkım",
         "Kamran Usluer",
         "Necdet Mahfi Ayral"
      ],
      "imdbMovieId": "0116231",
      "originalTitle": "Eşkıya",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["OPJwwRUCQd4"],
      "plotSummary": "The epic adventures of the legendary Baran the Bandit following his release from prison. After serving 35 years, it is no surprise that the world has changed dramatically. Still, Baran can't help but be shocked to discover that his home village is now underwater thanks to the construction of a new dam. He then heads for Istanbul to get revenge upon his former best friend, the man who snitched on him and stole his lover Keje. Along the way, Baran teams up with Cumali, a tough young punk who finds the thief's old-fashioned ways rather quaint. When Cumali gets into deep trouble with a crime boss, Baran adds another vengeful task to his roster.",
      "tmdbMovieId": 26900,
      "avgRating": 3.65517,
      "releaseYear": "1996",
      "numRatings": 58,
      "posterPath": "/z8LKvkaPJ62qPDEGtIMYfk9RVge.jpg"
   }
}