{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1133995",
      "video": false,
      "title": "The Way of War",
      "recommendations": [
         235388,
         181175,
         80195,
         114003,
         85133,
         97636,
         46297,
         25574,
         70576,
         211914,
         97544,
         172002,
         96367,
         9727,
         71628,
         34231,
         37059,
         47853,
         55662,
         291545
      ],
      "backdrop_path": "/nXZLxoqh03rrZBt1B3EQK9K6TWQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "David Wolfe",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0ef",
               "name": "Cuba Gooding Jr.",
               "profile_path": "/yu8Q3ImFu3RJne585jjgeQO2Boo.jpg",
               "id": 9777,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sergeant Mitchell",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0f3",
               "name": "J.K. Simmons",
               "profile_path": "/jPoNW5fugs5h8AbcE7H5OBm04Tm.jpg",
               "id": 18999,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Secretary of Defence",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0fd",
               "name": "John Terry",
               "profile_path": "/wESDSPXZXmXLp9vEfdtNKguwV3o.jpg",
               "id": 8659,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sophia",
               "gender": 1,
               "credit_id": "5321a67f9251411f7a002e68",
               "name": "Jaclyn DeSantis",
               "profile_path": "/6pEU3x8XdOekoCVlFQ7aGS980Q6.jpg",
               "id": 171732,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "The Black Man",
               "gender": 2,
               "credit_id": "5321a6c39251411f7e002fa2",
               "name": "Lance Reddick",
               "profile_path": "/5t4j7zvsjG5UyVxBJzly5OUMR3x.jpg",
               "id": 129101,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mac",
               "gender": 2,
               "credit_id": "57f0a1ad92514159de008af9",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Seven",
               "gender": 0,
               "credit_id": "57f0a3c79251416d44000a0b",
               "name": "Jayson Warner Smith",
               "profile_path": "/3voluDVyMEE7lkFAFOXryU9zvN6.jpg",
               "id": 1514474,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Eleven",
               "gender": 1,
               "credit_id": "57f0a42cc3a3683ea9007da1",
               "name": "Sarah Ann Schultz",
               "profile_path": null,
               "id": 58793,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sanchez",
               "gender": 2,
               "credit_id": "57f0a4e79251416d44000a79",
               "name": "J. Omar Castro",
               "profile_path": "/gAcpNnOVwuzXM1IghKR2sTIacx4.jpg",
               "id": 206027,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Samir / Ace of Spades",
               "gender": 2,
               "credit_id": "57f0a54e92514159de008c45",
               "name": "Vernel Bagneris",
               "profile_path": null,
               "id": 237404,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Snow",
               "gender": 2,
               "credit_id": "57f0a64c9251416d9c000aad",
               "name": "Edrick Browne",
               "profile_path": "/rKc64U4YccyEPfEf7VCXbdBmQAx.jpg",
               "id": 112286,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0f9",
               "name": "Scott Schafer",
               "profile_path": null,
               "id": 559030,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58811e70925141302b0018f6",
               "name": "John Carter",
               "profile_path": null,
               "id": 1741919,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.085034,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15945,
      "vote_count": 18,
      "budget": 0,
      "overview": "Paramilitary operative David Wolfe stumbles upon an international conspiracy connecting presidential cabinet members to a Middle Eastern terrorist plot. Wanting to expose the truth, Wolfe defies orders and returns to the US as an army of one fighting for American security and integrity",
      "similar": [],
      "original_title": "The Way of War",
      "runtime": 90,
      "poster_path": "/nSLmUWom20GbU02dsBvR40zxwdv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2009-02-20",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "He has a single mission. To explore the truth.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Carter"],
      "runtime": 90,
      "synopsis": "An ex-soldier hides from the government he formerly protected. Unfortunately that sums up the entire \"plot\".",
      "writers": ["Scott Schafer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1133995/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTExNzg5Mzc0OV5BMl5BanBnXkFtZTcwNjg5NTAzMg@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Cuba Gooding Jr., Clarence Williams III, John Terry | See full cast and crew »"],
      "reviews": [
         "This is one of the worst movies I've seen in a long time. Besides the fact that it didn't make much sense, it seemed to move along terribly slow (makes standing in line at the DMV seem fun), barely made any connections between characters at all, and the directing and production were really, really bad, to the point that one scene actually jumped to another without any transition; just a quick cut while a character was in mid sentence. Having seen most of Cuba Gooding Jr's movies, I was surprised that after the last few movies he did, which were watchable, he stooped to a new low with another low budget movie. There are better things to do than waste an hour and a half of your life on this pointless waste of film. Don't believe me? Go ahead, watch it. I'm sure within the first thirty minutes you'll want your money and your time back..... I know I do.",
         "I wouldn't pick a copy of this off the street, I'd kick it into a gutter. Absolute rubbish. If possible I'd give it a negative out of ten. If you do watch this, steal it off the internet, it's not worth even renting. Cuba has never been so dull and boring. The plot line was slow, and never peaked. Flashbacks never fully described the situations. Many questions were left unanswered. Dialogue could have been better composed by a 10th grade theater class for downs children. The was absolutely no positive attribute that I can think of, except when the credits came up and I was able to confirm that the film really did just suck. If I weren't sick and stuck at home. I'd have walked out.",
         "Boring, slow, stupid plot.... WORST MOVIE I have seen in a long long time! Cuba must have been drunk while reading the script to have accepted that role, or perhaps he has a horrible agent. First Look Studios? That's the last time I will ever watch a movie that they distribute or promote! I was confused for most of the movie, and there is no way in hell I am going to watch that movie again to try to figure it out. I understood where the movie was going but I refused to believe it could be that lame, I was waiting and waiting for the movie to start.. then the credits began to roll and I got excited because that meant the movie was over!",
         "Saw an early version of this and must admit was pretty boring. I had high hopes from trailers and Cuba being in the lead role, but after 40 mins of almost walking out on it i managed to stick it to the end,then wish i had followed my instincts and actually had walked out on it when it finally had ended. The acting is OK,the plot had potential, but the end result was just a tedious waste of space that i cannot really recommend even to die hard fans of Cuba Gooding Jr. I would like to say that with a few tweaks in the plot it still maybe watchable, but it needs a major plot change to even be that good, so am not hopeful at all and have given it a generous rating of 3",
         "What the hell just happened? I sat through this movie waiting for something to happen and nothing. I am almost tempted to ask for my dollar back from Red Box for the hour and a half that I lost and will never get back. Who wrote this script and please tell me they no longer work in this field. I am normally a big fan of Cuba Gooding Jr. but his acting along with everyone else's was horrible and they should all be ashamed for having anything to do with this crap and taking people's money for watching this. And why was this movie rated R, have they changed the rating system to include boring and confusing into the R rating now. There was no violence in this movie, if there was can someone please show me where.",
         "I just watched this Screener and was very disappointed. The plot and direction this movie took was all over the place. The actors have all done great work in the past but I was not able to identify with them at all. The director must not have been available at editing because it was lagging and at times I looked at my watch waiting for a story to surface. The story had potential but in my eyes it fell short in so many ways. I will understand why this is not picked up by many theaters. I don't mean to be harsh. There are some good points. Shots of D.C are done very well. The soundtrack was decent. Although in a few scenes the music does not mix with what you see. I hope everyone involved in this movie enjoyed themselves because I will be very shocked if it has a long shelf life.",
         "An absolute waste of an hour and half, that I will never get back. A darn shame. Instead I could've watched paint dry or watch my dog chase squirrels in the backyard. I expected this confusing and poorly put together movie to be good due to the fact it starred Cuba Gooding Jr. It also had some impressive role players in the film, yet they couldn't get it done. Just absolutely lame. The movie kept flashing back and forth between the past and present. The indicators it was a flashback weren't very good at all. They wanted you to feel for David Wolfe, Gooding Jr.'s character, and connect with him the way you do with, say Jason Bourne. But you just don't, this kind of knock of Bourne-in-a-sense character was just pathetic. Save yourselves don't watch this atrocity.",
         "I'll start by saying I like much of what Cuba Gooding JR. has done but I think the storyline blows. I found myself watching the time tick by to see if it was almost over. The movie was painfully slow with little reward at the end for waiting for the story to better unravel. The plot is very confusing much of the way through this flick. Originality is another factor. Movies similar to this have been done before and with much better story lines. The Bourne trilogy is an example of that. The Way of War doesn't offer anything near that level of action though. The music was off. I don't feel that it did a good job keeping up with the storyline and I had some issues with the subtitles. Sometimes I'll turn them on and go back over dialog that is too difficult to make out. At least during the early part of the movie, the subtitles were grossly off their mark. Somewhere in the neighborhood of 30 seconds to a minute! I think Cuba does a great job acting the part, but it doesn't save the movie. My grandma could write better scripts then this! Comon Cuba!!!!!",
         "I rented this film from a Redbox mainly because I like Cuba Gooding Jr. I must admit that this is the first film since Howard the Duck many years ago that I didn't finish. I left after about 45 minutes as I found it way too slow, uninvolved, poorly edited, terribly written and boring. It is one of the worst movies I've ever seen and unless it got substantially better, I wholeheartedly recommend against this movie, even if you are a fan of the lead actor. IIt wasn't just bad...it was horrible. I even have made bets that my fellow movie-loving friends wont be able to sit through it. Maybe on another day when I want to punish myself Ill rent it again...just to have a feeling of my tolerance level. Avoid!",
         "I can't believe Cuba would be in this. I have enjoyed him in other roles, but this movie is pathetic. Has he sunk this low to accept such a role? After seeing him in movies like Tuskegee Airmen, Jerry Maguire, and Pearl Harbor (to name a few), I expected a lot more here. The only saving grace was getting to see Clarence Williams III (Linc in original Mod Squad TV series). J. K. Simmons is normally a good actor, but there was nothing to work with here. There was not enough of a cohesive plot to go around though. Don't bother watching this one. The dialog was random and nonsensical. Everyone wanted to talk in hushed tones and mysterious, incomplete thoughts. I'm glad I only wasted a $1 renting this one."
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "Capital City Entertainment",
         "Louisiana Media Productions",
         "Salvatore/Ornston Productions"
      ],
      "summaries": [
         "Paramilitary operative David Wolfe stumbles upon an international conspiracy connecting presidential cabinet members to a Middle Eastern terrorist plot. Wanting to expose the truth, Wolfe defies orders and returns to the US as an army of one fighting for American security and integrity.",
         "A paramilitary operative goes on a rampage after discovering a conspiracy to commit war."
      ],
      "budget": 5000000
   },
   "movielensId": 66472,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-02-20",
      "dvdReleaseDate": "2009-02-10",
      "directors": ["John Carter"],
      "runtime": 90,
      "movieId": 66472,
      "title": "The Way of War",
      "mpaa": "R",
      "actors": [
         "Cuba Gooding Jr.",
         "J.K. Simmons",
         "John Terry",
         "Jaclyn DeSantis",
         "Lance Reddick",
         "Clarence Williams III",
         "Jayson Warner Smith",
         "Sarah Ann Schultz",
         "J. Omar Castro",
         "Vernel Bagneris",
         "Edrick Browne"
      ],
      "imdbMovieId": "1133995",
      "originalTitle": "The Way of War",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["f0Sp6sFEFng"],
      "plotSummary": "Paramilitary operative David Wolfe stumbles upon an international conspiracy connecting presidential cabinet members to a Middle Eastern terrorist plot. Wanting to expose the truth, Wolfe defies orders and returns to the US as an army of one fighting for American security and integrity",
      "tmdbMovieId": 15945,
      "avgRating": 1.8125,
      "releaseYear": "2009",
      "numRatings": 8,
      "posterPath": "/nSLmUWom20GbU02dsBvR40zxwdv.jpg"
   }
}