{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0022877",
      "video": false,
      "title": "Fanny",
      "recommendations": [
         42818,
         43873,
         84875,
         43844,
         77672
      ],
      "backdrop_path": "/xPm2w2WFjSy1JAnjOmXuF24H7VX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "César Ollivier",
               "gender": 2,
               "credit_id": "52fe4630c3a36847f80f19cf",
               "name": "Raimu",
               "profile_path": "/hcWtTUtz7JoyZgvCkFlMsOWUNvg.jpg",
               "id": 239231,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Marius Ollivier",
               "gender": 2,
               "credit_id": "52fe4630c3a36847f80f19d3",
               "name": "Pierre Fresnay",
               "profile_path": "/wrNThmczgvtyyzxGtrHvFdlO6jV.jpg",
               "id": 11546,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Fanny Cabanis",
               "gender": 0,
               "credit_id": "52fe4630c3a36847f80f19db",
               "name": "Orane Demazis",
               "profile_path": "/cHwfS5coIpilo7mubfc1t16kxKi.jpg",
               "id": 564273,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Honoré Panisse",
               "gender": 0,
               "credit_id": "52fe4630c3a36847f80f19d7",
               "name": "Fernand Charpin",
               "profile_path": "/wMLJEaEiK5ZDUchAMkMxsygpXhw.jpg",
               "id": 94939,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Honorine Cabanis",
               "gender": 0,
               "credit_id": "581d7cafc3a36806ff00500f",
               "name": "Alida Rouffe",
               "profile_path": "/3NB3taI23IiKtpory6kaplOpjuw.jpg",
               "id": 584135,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Félix Escartefigue",
               "gender": 0,
               "credit_id": "581d7de49251410a16005104",
               "name": "Auguste Mouriès",
               "profile_path": null,
               "id": 1041481,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Monsieur Brun",
               "gender": 2,
               "credit_id": "581d7e3cc3a36806ef005152",
               "name": "Robert Vattier",
               "profile_path": "/pRjCtywCvoVY2gmlDarLvxrUYn5.jpg",
               "id": 117901,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Claudine Foulon, tante de Fanny",
               "gender": 0,
               "credit_id": "581d7e81c3a36806f3005544",
               "name": "Milly Mathis",
               "profile_path": "/3xYmO6LvkaAxCvjwQFFRVjrRlEV.jpg",
               "id": 588733,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Innocent Mangiapan, le chauffeur du ferry-boat",
               "gender": 2,
               "credit_id": "581d7ea19251410ee3004fb6",
               "name": "Marcel Maupi",
               "profile_path": "/1dcrgrR6fm3QklqLSww4uDmu08Z.jpg",
               "id": 592727,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dr Félicien Venelle",
               "gender": 2,
               "credit_id": "581d7ec9c3a36806ec004cc5",
               "name": "Édouard Delmont",
               "profile_path": "/8FIPdIuNpEiDaGe5frIqy4ODP2i.jpg",
               "id": 69971,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Fortunette",
               "gender": 0,
               "credit_id": "581d7ee3c3a3680cc0004183",
               "name": "Odette Roger",
               "profile_path": null,
               "id": 544205,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Amélie",
               "gender": 0,
               "credit_id": "581d7ef4c3a3680c6800551d",
               "name": "Annie Toinon",
               "profile_path": "/Aqac6UecX4J6szGPz1eYrjZjWe3.jpg",
               "id": 544204,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4630c3a36847f80f19c5",
               "name": "Marc Allégret",
               "profile_path": "/3kzHDulp7q0HMDqFIUwmTZvLUvR.jpg",
               "id": 238954,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4630c3a36847f80f19cb",
               "name": "Marcel Pagnol",
               "profile_path": "/bjIlDWOTYWpvAGJFBOyVfdL48nL.jpg",
               "id": 38393,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.805936,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 43146,
      "vote_count": 12,
      "budget": 0,
      "overview": "Picking up moments after the end of Marius, this film follows Fanny’s grief after Marius’s departure—and her realization that she’s pregnant. Panisse continues courting her and embraces the baby’s impending arrival as a gift, so long as its paternity remains a secret. Fanny and Panisse wed, but after her baby’s birth, Marius returns unexpectedly and demands what he believes is still his.",
      "similar": [],
      "original_title": "Fanny",
      "runtime": 140,
      "poster_path": "/rqBSHS1oibBk2ZG4fJxqQTwIpNl.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films Marcel Pagnol",
         "id": 19160,
         "origin_country": ""
      }],
      "release_date": "1932-11-02",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "La Trilogie Marseillaise",
         "id": 156152,
         "poster_path": "/odxlrxLTgGaqHvV8FpbZRHRZWsE.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marc Allégret"],
      "runtime": 140,
      "synopsis": null,
      "writers": [
         "Marcel Pagnol",
         "Marcel Pagnol"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0022877/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTM1NTUwNjQ1Ml5BMl5BanBnXkFtZTgwNDE2OTI3MjE@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Raimu, Pierre Fresnay, Fernand Charpin | See full cast and crew »"],
      "reviews": [
         "FANNY is the second film of a trilogy, based upon a play by Marcel Pagnol, from which all three works are taken, featuring most of the cast of excellent actors which made the stage original a great artistic and popular success, including Raimu, Charpin, Pierre Fresnay, and Orane Demazis as Fanny, an assemblage which remains faithful to the heart of the original. By repudiating the normal placement of concurrent French films made in Parisian studios, and producing the work in his native Marseilles, in Provence, Pagnol achieves a finely-hewn naturalism which is very congenial to the scenario, dealing as it does with a hard-working bourgeoisie whose lives are in concert with rhythms of a major seaport. Fanny's passionate attention to Marius (Fresnay) results in her pregnancy from their farewell coupling at the denouement of the first of the trilogy, MARIUS, with her lover falling prey to the lure of a seafaring life and she, abandoned, accepts a proposal of marriage from a much older M. Panisse (Charpin), in order to save the reputation of her family. The love of Panisse for the child of Fanny is the moving force in what must be the inevitable fulfillment of the storyline, i.e., the return of Marius to claim his erstwhile fiancée and his true child in a scene which brings the best from Demazis, Fresnay, and Raimu as Cesar, the father of Marius and lifelong friend of Panisse. Pagnol directed only the finale of the trio, and selects for FANNY Marc Allegret, who leads the cast with distinction, displaying particular skill when allowing Pagnol's magnificent dialogue to be developed in what is essentially a filmed work for the stage, with few sets, and who allows liberal emphasis upon the plastic Raimu, who is, after all, the most important presence in this romantic masterpiece.",
         "If you can get by the first fifteen minutes, get into the leisurely pacing and that fact that nothing is going to explode and no one shoots anybody or stabs anyone in the eye, and the film is about learning to live with other human beings, about being a parent, about falling and staying in love, perhaps you'll come to love this film, too. The trilogy is set in another time long gone--Marseilles, a provincial fishing village, where Cesar and his son operate a sort of bar where locals drift in and out and play cards; a pretty young woman sells seafood outside, and she's known son Marius since they were children. Enough said: except that the acting is amazingly naturalistic for a 1930's film, that the performance by famed French entertainer Raimu is beyond words, is simply astounding in his range of emotions, his understanding of the human condition. This understated drama is a quiet masterpiece.",
         "Part two of Marcel Pagnol's wonderfully simple, but, mind me, not simple-minded Marseilles trilogy is even funnier and more touching than its predecessor, thanks to expanded supporting roles and a broader variety of outdoor locations. The dialogue is as humorously and emotionally rich as ever and the cast, almost outshone by Raimu's terrific performance, works wonders with their lines. The pace may drag slightly from time to time and some story aspects feel redundant, but the basic concerns of Pagnol's deeply philanthropic approach to issues like paternal love, social constraints and diverging attitudes towards life offer more than enough pleasures. 8 out of 10 suspicious premature births",
         "This is the second of the three part \"Fanny Trilogy\" by the French writer, Marcel Pagnol. Originally, they were a stage play, then a movie and then many years later in 1961, the three movies were combined to make one movie named FANNY. I've always loved the 1961 movie, so I was thrilled to see the original three movies--all part of a 4 disk set by Kino Video. Throughout much of the 1932 movie, the lines were identical or very close to the 1961 film. Of the three movies, I think this one is closest to the 1961 film except that this one is in French with subtitles and is black and white. The 1961 version is simply a lot prettier--with great music, lighting, and acting. The earlier version, though wonderful, is a little more flat. Not bad--in fact, very good,...just kind of flat in comparison. If you only have the patience, see the 1961 combined film. If you are a cinephile, then see all of the films--the writing by Pagnol is amazing.",
         "I've watched this movie several times now, each time hoping I will like it more than the time before. But that doesn't happen. The first movie in the so-called Marseilles Trilogy, Marius (1931), is one of the masterpieces of world cinema, and not surprisingly one of the most beloved of French movies by the French. This movie, based on Pagnol's sequel play of the same name, has much more melodrama and much less humor than Marius, and frankly, the melodrama is not good melodrama (whatever that would be). The scene between Panisse and Fanny, when he explains why he will marry her even though she is pregnant by another man (Marius), is moving and funny. The final scene is interesting for the definition of fatherhood that it puts forward. There are interesting moments here and there throughout the movie. But the whole falls far short of Marius, and too often comes off as just another 1930s movie melodrama. If you liked Marius - and how could you not? - you would want to see this, but don't get your expectations up too high. More's the shame.",
         "Part the Second of this trilogy reminds us that at heart it is pure melodrama and if not quite 'dead! and never called me mother', it is certainly from the same stable. Arguably Orane Demazis - replicating here, as indeed are all the principals, her stage role as the eponymous seduced and abandoned and slightly enceinte ingenue - is the weakest link in an unusually strong chain yet even then with the handicap of being saddled with a role that today would be risible (I doubt if it is possible to 'SPOIL' a classic which is now some 72 years old so suffice it to say that as a result of 'giving herself' to Marius, shortly before he ships out on an extended cruise, Fanny finds herself in an 'interesting' position and must make some tough choices. Today, of course, it is practically an honor to fall pregnant with no father material in sight and a State standing by to cosset the resulting infant from cradle to grave but in 1932 the resulting 'shame' embraced not only the mother-to-be but also her family) she manages to elicit our compassion and keep our humor at bay. Pedants will have a field day with the dodgy arithmetic - Marius has supposedly signed up for a five-year voyage yet on his return Fanny's son is a mere 10 months old - but what matters is the acting-plus-believability factor and here, thanks as always to the great Raimu, aided and abetted by Fernand Charpin, Alida Rouffe and Milly Mathis they bring it off to a fare-thee-well. Pierre Fresnay as Marius does little more than play the fly-in-the-ointment in the closing quarter of the movie and may well have been looking ahead one full decade to 'Le Corbeau'. Building on the first part and moving seamlessly to the next stage this is a worthy successor to 'Marius'. 9/10",
         "This is the second film of Pagnol's famous trilogy set on the quay of the Old Port of Marseilles. It follows immediately upon Part One, MARIUS (1931, see my review) and is succeeded by CÉSAR (1936, see my review), in which the action takes place many years later. These films were made over a period of at least six years, with a total running time of 375 minutes, with the same actors playing the same characters. Whereas Part One largely dealt with the character Marius (played by Pierre Fresnay), this film concentrates on the girl Fanny who is deeply in love with him. Fanny is wonderfully played by Orane Demazis, with haunting emotional depth. In Part One, after a night of love with Fanny, Marius then abandons his plans to marry her and instead follows his dream and goes to sea on a long five-year voyage on a sailing ship bearing scientists who want to measure the bottom of the Indian Ocean. He does not tell his father, César (played by Raimu), that he is leaving, because he knows he will try to stop him. This film commences immediately after the departure of Marius on the sailing ship. César and Fanny are both left desolate. César knows that Fanny and Marius have spent a night together, which at that time was considered deeply shocking and 'a loss of honour'. He had wanted them to marry, but now Marius has gone to sea and will not be back for years. Then, Fanny discovers that she is pregnant. At that time, such a social disgrace could not be endured if a girl remained single. If Marius were still there, they would have married and the problem would have been solved. But he does not even know about the pregnancy and cannot return in any case. What is Fanny to do? She is desperate, and so are her mother and Marius's father, César. They all live on the same quay together with the wealthy sail-maker Honoré Panisse, eloquently played by Fernand Charpin (sometimes known simply as Charpin). Panisse is made aware of the problem and renews his offer to marry Fanny and does not mind that the child is not his. So the wedding takes place and Fanny's honour is saved, and the child does not have to be given away, but can be brought up as the son and heir of Panisse. After the marriage, Marius returns unexpectedly and is horrified at what has happened. He wants to reclaim 'my wife and child' but is persuaded to go away and leave things as they are. So he and Fanny, both heartbroken at their fate, part again. All of this may sound like a trite story, but it is far from that as presented on the screen. This second film is directed by Marc Allégret, who does an excellent job, just as Alexander Korda had done with the preceding film. (Marcel Pagnol himself would direct the third and final film, CÉSAR, 1936, see my review). The earnestness and passion of the remarkable actors in these three films is so intense and real that one feels that one is really there on the quay with these people. Daniel Auteil is doing remakes of these three films, and has completed MARIUS and FANNY (both 2013), but the production of the final one, CÉSAR, has apparently not yet commenced, although it has long been announced. Auteil is directing the films and plays the part of César. The first two Auteil versions have been released and are readily available on DVD, but have not yet been released with English subtitles. One even wonders whether CÉSAR will really be made by Auteil, as perhaps some funding problem has arisen. Auteil's public association with filmed Marcel Pagnol stories began in 1986 when he played the role of Ugolin in JEAN DE FLORETTE and MANON DES SOURCES, which were hugely successful around the world. In 2011 he appeared in and directed Pagnol's story THE WELL DIGGER'S DAUGHTER (see my review), which was a superb film. Certainly Auteil's obvious love of the Pagnol stories is a most endearing characteristic of his. He himself is not from Provence but was born in Algiers. After this film finishes, many years elapse in the story before the episodes of the final film, CÉSAR (1936, see my review), which brings the intensely emotional saga to its conclusion.",
         "I have just finished watching Proof, a film released in the year of our Lord, 2005, which is adapted from a stage play in which the director has gone to great pains to hide the fact that his work is based on the play. flash back 70 years and we have a movie made that looks like a filmed stage play with real locations replacing the stage sets. All early sound movies feel set-locked as people talk and deliver within the range of the camera. Therefore, to hold the interest to the modern viewer, the dialogue and acting must be believable and engaging. The film fails to achieve it for the most part because the performance of the actress playing Fanny is a total success even though she was reprising her role from the stage. First time director, Pagnol adapting his own stage works suffers from a non-visual eye. The delight, is French star Raimu who delivers a performance still worthy to the eye even today. There is a reason Orson Welles called him a genius. The melodramatic plot of a scorned, (maybe that is too strong a word: even abandoned is too strong because she never lets on to her man that she does not want him to leave) woman who is pregnant is passé though common in the literature of the period. I remember a tracking shot that impressed me as the camera follows Fanny through the streets as she suspects she is pregnant. In the way it is handled and executed, it is cinematic authorship at its finest. It is a film in the middle of the trilogy, therefore there are loose ends left to be resolved. All movies are time capsules, it is said, therefore approach this with the right attitude and you might be rewarded."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Les Films Marcel Pagnol",
         "Les Établissements Braunberger-Richebé"
      ],
      "summaries": ["Marius has left, signed up for a five year hitch on a ship bound for the Indian Ocean. In his few letters to his father César, he hardly mentions Fanny. When she finds she is pregnant, she considers her options: suicide, to raise the child on her own, to wait for Marius, or to marry Honoré Panisse, the older merchant who seeks her hand. These choices are emotional: to raise a bastard, to trust in Marius' eventual return, to believe he'll want to marry her, to save her mother from shame, to fool Panisse, to give her child a name. In scenes dramatizing Fanny's honesty, she talks to her mother, then Panisse, César, and later Marius, and she makes her choices."],
      "budget": 0
   },
   "movielensId": 66977,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1932-11-02",
      "dvdReleaseDate": "2002-01-01",
      "directors": ["Marc Allégret"],
      "runtime": 140,
      "movieId": 66977,
      "title": "Fanny",
      "mpaa": null,
      "actors": [
         "Raimu",
         "Pierre Fresnay",
         "Orane Demazis",
         "Fernand Charpin",
         "Alida Rouffe",
         "Auguste Mouriès",
         "Robert Vattier",
         "Milly Mathis",
         "Marcel Maupi",
         "Édouard Delmont",
         "Odette Roger",
         "Annie Toinon"
      ],
      "imdbMovieId": "0022877",
      "originalTitle": "Fanny",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Picking up moments after the end of Marius, this film follows Fanny’s grief after Marius’s departure—and her realization that she’s pregnant. Panisse continues courting her and embraces the baby’s impending arrival as a gift, so long as its paternity remains a secret. Fanny and Panisse wed, but after her baby’s birth, Marius returns unexpectedly and demands what he believes is still his.",
      "tmdbMovieId": 43146,
      "avgRating": 3.59091,
      "releaseYear": "1932",
      "numRatings": 11,
      "posterPath": "/rqBSHS1oibBk2ZG4fJxqQTwIpNl.jpg"
   }
}