{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cattle",
            "id": 15225
         },
         {
            "name": "rustler",
            "id": 18292
         },
         {
            "name": "cattleman",
            "id": 186391
         },
         {
            "name": "ranch foreman",
            "id": 222291
         }
      ],
      "imdb_id": "tt0028653",
      "video": false,
      "title": "Born to the West",
      "recommendations": [
         40717,
         169828,
         137458,
         68082,
         40743,
         102379,
         45607,
         23391
      ],
      "backdrop_path": "/sQIUCdKVG74FBsY4KzwjbhxKR8D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dare Rudd",
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c41",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Judy Worstall",
               "gender": 1,
               "credit_id": "52fe486fc3a36847f8166c51",
               "name": "Marsha Hunt",
               "profile_path": "/fKYyWL0MI0UrZp1UT6CaWOJqzEH.jpg",
               "id": 1215925,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tom Fillmore",
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c45",
               "name": "Johnny Mack Brown",
               "profile_path": "/og5E8yehVEUR0ym3kRUWETVmwJn.jpg",
               "id": 100253,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lynn Hardy",
               "gender": 0,
               "credit_id": "52fe486fc3a36847f8166c4d",
               "name": "John Patterson",
               "profile_path": null,
               "id": 1200195,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Bart Hammond",
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c67",
               "name": "Monte Blue",
               "profile_path": "/u5eHdofzXRQu08r0YFS5LwXoc3E.jpg",
               "id": 90074,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sheriff Pete Starr (uncredited)",
               "gender": 2,
               "credit_id": "56a478d79251410c08003abb",
               "name": "Jack Kennedy",
               "profile_path": null,
               "id": 121096,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Cattle Buyer",
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c6b",
               "name": "Lucien Littlefield",
               "profile_path": "/65jnSJmU2BC4Jrpg2Nfg6glU6wN.jpg",
               "id": 34574,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Trail Hand (uncredited)",
               "gender": 0,
               "credit_id": "56a478f8c3a36838a30054af",
               "name": "Art Mix",
               "profile_path": "/ApqC9z8rSwWJJvbwPc32lAuiXt2.jpg",
               "id": 557086,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Dinkey Hooley (uncredited)",
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c49",
               "name": "Syd Saylor",
               "profile_path": "/5VKk3UNGktDsZCEtIqN1Z0GIcmg.jpg",
               "id": 88728,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c3d",
               "name": "Charles Barton",
               "profile_path": "/guy21POXvRpGhvA4SwWycWMzXkm.jpg",
               "id": 30099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c57",
               "name": "Stuart Anthony",
               "profile_path": null,
               "id": 1040062,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe486fc3a36847f8166c5d",
               "name": "Robert Yost",
               "profile_path": null,
               "id": 146503,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe486fc3a36847f8166c63",
               "name": "William T. Lackey",
               "profile_path": null,
               "id": 89911,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56a47872925141524c00103d",
               "name": "Zane Grey",
               "profile_path": "/b481lJAh8NQSo70DohOnAU3J8Co.jpg",
               "id": 557979,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.469362,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53574,
      "vote_count": 5,
      "budget": 0,
      "overview": "Dare Rudd takes a shine to his cattleman cousin Tom's girlfriend who asks Tom to hire Dare to head the big cattle drive. Dare loses the money for the drive to cardsharps, but Tom wins it back, but Dare must save Tom's life.",
      "similar": [
         6972,
         452507,
         22660,
         12501,
         3110,
         1406,
         3089,
         9394,
         1712,
         11966,
         6644,
         43933,
         4929,
         15573,
         18843,
         11967,
         547,
         27277,
         21355,
         63310
      ],
      "original_title": "Born to the West",
      "runtime": 59,
      "poster_path": "/t9CKNYwk6uvPmRIW8C0Suav2sNp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1937-12-10",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "CRIMSON-STREAKED ROMANCE HITS THE TRAIL!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Barton"],
      "runtime": 59,
      "synopsis": null,
      "writers": [
         "Stuart Anthony",
         "Robert Yost"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028653/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTA2MjQ1MTY4N15BMl5BanBnXkFtZTgwODY0MjE3MjE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: John Wayne, Marsha Hunt, Johnny Mack Brown | See full cast and crew »"],
      "reviews": [
         "John Wayne fans should watch this film right after seeing a few of the ultra-low budget B-westerns Wayne made for Lone Star Pictures in 1934-5 (conveniently, you can get a 2-DVD set with this film, nine of Wayne's Lone Star cheapies, and ANGEL AND THE BADMAN for six bucks at Wal-Mart). In the earlier films, we're clearly watching young Marion \"Duke\" Morrison appearing under a stage name. By the time BORN TO THE WEST (aka HELL TOWN) came out in 1937, Morrison was really growing into the John Wayne persona. The swagger, the drawl, and the squint are all there. Perhaps the character wasn't quite perfected yet, but the seeds of Wayne's future superstardom are there on the screen. And the film itself is much better as well. No longer is Wayne a goodie-two-shoes, milk-drinking, kiddie-matinee hero. His character here is flawed--even a bit of a screwup. The script, the direction, and the acting are miles ahead of his early films. It's certainly not one of the greatest movies he ever made, but it's a solid, enjoyable little Western. 7/10",
         "John Wayne and sidekick Syd Saylor are heading from Montana to Wyoming to the ranch of Wayne's cousin Johnny Mack Brown. Wayne's a cocky sort, fancies himself a great lady's man and poker player. The Duke even in his later and more irascible years usually didn't have parts that called for that, but here he does show that side of his character and shows it well. Wayne moves in on Marsha Hunt who is Brown's girl friend. That does throw a monkey wrench into the relationship between the cousins. Later on at the hands of cardsharps Monte Blue and James Craig, Wayne gets himself in quite a hole. Johnny Mack Brown had an interesting career. He was an All American back for the Crimson Tide of Alabama before Paul Bryant took over the team. He opted for a Hollywood career and appeared opposite stars like Mary Pickford and Greta Garbo in silents. His Alabama drawl made him a natural for westerns and he was grinding out the B films just like the Duke was at this time. This is their only film together and they both complement each other's persona well. Although another great football player Jim Thorpe has a bit role in this film, some lists have Alan Ladd in the cast. I have to say that I examined it frame by frame and there's no trace of Mr. Ladd. Even without Ladd it's a passably good B western, could have used some better editing, but better than some of what Wayne was doing at Monogram at the time.",
         "*This review is based on the re-release of the film under the title, Hell Town* Drifter Dare and his friend Dink travel to Wyoming to see Dare's cousin, Tom Fillmore, banker and president of the cattleman's association. A large number of herd are being rustled in the area, headed by saloon and casino owner Bart Hammond. Tom gives Dare a chance to earn an honest living (Dare bills himself as the greatest poker player west of the Mississippi, while Dink sells lightning rods as part of a payment scam) by working on his next cattle drive. Dare accepts, mostly to impress Tom's sweetheart Judy. After failing to lure Dare into working for him, Hammond has a few of his men sent to sabotage the trail drive, including herd boss Lyn (who lost his job to Dare, and regulated to a hand working the drive). When that fails, Hammond, along with card shark Brady, lures Dare into a crooked poker game, getting the money that Dare earned for the drive. Will Dare leave the game before its too late, or will Tom have to bail his cousin out of this jam somehow? Very good movie, with an excellent cast. Wayne seems to carry most of the film, seeming odd that Brown was an established B western draw, and he could have gotten more scenes in the film. Same goes for Monte Blue who just seemed to pop in and out as the villain Hammond. A bit too much of stock footage for me, but there are plenty of good scenes, and the poker game at the end is on heck of a scene, with plenty of suspense. Rating, based on B-westerns, 9.",
         "While it has a story that is not bad in itself, \"Born to the West\" (or \"Hell Town\") is mostly carried by John Wayne's screen presence, with some help from Johnny Mack Brown and the rest of a pretty good cast. Wayne plays a gambling-addicted cowboy who runs into his respected and influential cousin (Brown) while passing through Montana. The two become rivals for the affections of Brown's girlfriend (Marsha Hunt) while at the same time they must join up to deal with cattle rustlers and crooked card players. A lot of the story is routine, but there are some interesting features, and it moves at a good pace. The scenery is also pretty good at times. The film is a decent Western in its own right, and is also worth watching to see Wayne's performance as a man who has to combine action with some careful thinking about his future. It's not hard to see why soon after this movie he started to get the big roles and the attention due to a star.",
         "I am giving this film ten stars, not because it is a great film (although it is one of the best of its type), but because it is a remarkably important transitional film for one of the real originals of American cinema, John Wayne. This is one of the last of the many 'Saturday matinée' potboilers Wayne acted in for a half-dozen marginal studios during the 1930s; two years later, Ford would give him the big break of his career in \"Stagecoach\". Unlike the other potboilers he appeared in, \"Hell Town\" (aka \"Born to the West\", although I have never seen a print with that title on it) is well-written, well-directed, nicely photographed, and well-acted by all involved (but especially Johnny 'Mack' Brown) - surprising quality for a cheapie, but I suppose the fact the story it derived from had been written by Zane Grey - already a legendary Western writer - probably impressed cast and crew to make a best-effort presentation here. At any rate, the film, under 55 minutes long, has the look and feel of a feature-length Western of the time, and it survives far better than any other of the Western shorts of the period. The story is solid, with relatively serious overtones concerning the possibility of redemption. Wayne's character, a gambling addict, is rightly transformed when he discovers that his cousin is a better gambler than he is, but just prefers not to gamble. Wayne himself is in top-form for the period. All the little gimmicks and gestures we associate with him are here in a way never seen in any film of his before this - his cautious smile, his frown, his ability to strike a pose leaning his weight on one leg, his soft but firm voice of warning, his ability to face a tough situation with grace and even, one must admit, an oddly noble humility. This is no longer the \"Singing Mesquiteer\" of the earlier potboilders, this is finally the Duke, who would star in \"Stagecoach\" and lead an army of fans (including myself) through film after film for four more decades. This is where the filmography of John 'Duke' Wayne rightfully begins - a film that has survived well, and may yet survive a few decades more. (Note: in another film made the previous year, Winds of the Wasteland, Wayne can also be seen coming into his own as an actor; but this is the better film.)",
         "Dare Rudd (John Wayne) and sidekick Dink Hooley (Syd Saylor) are itinerant cowpunchers who can't seem to stay in one place very long. In \"Helltown\", the boys are headed to Montana, where they meet up with Rudd's cousin Tom Fillmore (Johnny Mack Brown), who offers them a job. It's a hoot to see the boys wearing aprons as they start out as cooks with the herd, although Dare becomes self conscious when Miss Judith (Marsha Hunt) rides into camp. Judy is Tom's girl, but the attraction between her and Dare is evident early on. Fillmore has a cattle herd to move, and promotes Dare to running the drive, partly to prove to Judy that he may not be up to the task. Meanwhile, bad guy Bart Hammond (Monte Blue) has his eyes on Fillmore's cattle, but when his henchmen fail to rustle the herd, he figures it's easier to win the money that Dare was paid at the end of the trail. Conning Dare into a rigged card game with his man Brady (James Craig), Dare's money begins to evaporate hand after hand. It's only when Dare fails to show up back at Fillmore's ranch that Tom goes out to find his cousin. Exposing the cheats, Tom, Dare and Dink high tail it before the bad guys can get their revenge. \"Helltown\", also known as \"Born to the West\", was released in 1937 by Favorite Films Corporation, a couple of years after Wayne's series of Westerns for Lone Star Productions. It only slightly alters the Lone Star formula; Wayne does get the girl at the end of the film, but here he was trying. There's a great runaway horse scene where Wayne rescues Marsha Hunt, in which Johnny Mack Brown's horse does a complete somersault spill. Syd Saylor does a nice job as the comic relief pal, doing his best to sell lightning rods to unsuspecting victims. He replaces familiar faces George \"Gabby\" Hayes and Yakima Canutt here, staples of the Lone Star films. John Wayne's charisma is beginning to develop here, preparing him for the leap to super star status that he eventually achieved. \"Helltown\" was based on a novel by legendary Western author Zane Grey. If you're looking for more films based on Grey's stories, try \"Fighting Caravans\" with Gary Cooper, \"The Light of Western Stars\" with Victor Jory, \"Drift Fence\" with Buster Crabbe, and \"Heritage of the Desert\" with Randolph Scott.",
         "According to author Tony Thomas, this film shot adrenaline into the careers of both John Wayne and Johnny Mack Brown. It's pretty entertaining, with a good story, fine cast, terrific scenery and excellent camerawork.",
         "According to author Tony Thomas, this film shot adrenalin into the lagging careers of both John Wayne and Johnny Mack Brown. It's very entertaining, with a good story, fine cast, terrific scenery and excellent camerawork.",
         "This one’s slightly better than Texas TERROR, mainly because it features a better-than-average cast – apart from Wayne, of course, there’s Johnny “Mack” Brown as The Duke’s cousin/boss, Marsha Hunt (later co-star of the classic Anthony Mann noir RAW DEAL [1948]) as the girl who comes between them, Lucien Littlefield as Wayne’s sidekick/conscience, and Monte Blue as the villainous (but ostensibly respectable) leader of a gang of cattle rustlers. Based on a Zane Grey novel, the film was originally released as BORN TO THE WEST – but this got changed on its re-issue to the more vivid HELL TOWN; interestingly, Wayne’s leadership of a cattle drive here anticipates Howard Hawks’ Western masterpiece RED RIVER (1948), in which he gave one of his finest performances. Again, the film runs for less than one hour while involving standard excitements – a saloon brawl, various cattlemen-vs.-rustlers clashes, a marathon poker game erupting into violence, etc. – and familiar embellishments, such as comedy relief and romance (except that lovely young Hunt makes for a much more interesting partner for the Duke than the wooden Lucille Browne of Texas TERROR). All in all, though, the film remains strictly a potboiler.",
         "Though the copy of \"Hell Town\" I saw was pretty miserable, the quality of the script and of the acting more than made up for it. John Wayne by the time this was made was already a veteran actor, mostly in B Westerns. That \"B\" designation, by the way, was purely a reference to the size of the budget, something too many people don't seem to realize. This B Western, despite its budget, had a really intelligent script and a talented director and, most of all, some of the best actors available: John Wayne, Johnny Mack Brown, and the lovely Marsha Hunt, as well as the busy but today under-rated Syd Saylor, who, despite his being the hero's sidekick, doesn't even get screen credit! On a purely personal note, catching this film at westernsontheweb.com gave me my first opportunity ever to see \"Hell Town,\" and I am so very grateful. As many reviewers have written here, this film is a milestone in the Duke's career, giving him an opportunity to show his innate talent, and giving audiences an opportunity to appreciate that talent. It is well past November, but I am giving thanks for my own opportunity to view this remarkable motion picture, and I am grateful to IMDb and to westernsontheweb for the information and the film, which I urge everyone to take time to watch."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Dare Rudd and Dinkey Hooley, roaming cowhands, drift into Montana, where they meet Dare's cousin, Tom Fillmore, cattleman and banker. Tom offers them jobs but they pass, until Dare sees Tom's sweetheart, Judy Worstall and decides to take the job. He is put in charge of a cattle drive, replacing ranch-foreman Lynn Hardy, who is in cahoots with Bart Hammond, rustler. Dare delivers the cattle to the railhead and is about to return when he is persuaded into a poker game by Buck Brady, a crooked gambler. Dare is almost cleaned out when Tom appears and takes a hand and discovers the dealer is switching decks.",
         "Can Dare Rudd prove he is responsible enough to win the heart of Judy and also outwit the crooked saloon owner?"
      ],
      "budget": 0
   },
   "movielensId": 66981,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-12-10",
      "dvdReleaseDate": "2001-01-02",
      "directors": ["Charles Barton"],
      "runtime": 59,
      "movieId": 66981,
      "title": "Born to the West",
      "mpaa": "",
      "actors": [
         "John Wayne",
         "Marsha Hunt",
         "Johnny Mack Brown",
         "John Patterson",
         "Monte Blue",
         "Jack Kennedy",
         "Lucien Littlefield",
         "Art Mix",
         "Syd Saylor"
      ],
      "imdbMovieId": "0028653",
      "originalTitle": "Born to the West",
      "genres": [
         "Romance",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Dare Rudd takes a shine to his cattleman cousin Tom's girlfriend who asks Tom to hire Dare to head the big cattle drive. Dare loses the money for the drive to cardsharps, but Tom wins it back, but Dare must save Tom's life.",
      "tmdbMovieId": 53574,
      "avgRating": 2.16667,
      "releaseYear": "1937",
      "numRatings": 3,
      "posterPath": "/t9CKNYwk6uvPmRIW8C0Suav2sNp.jpg"
   }
}