{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "zen",
            "id": 6172
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "new age",
            "id": 10902
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0177749",
      "video": false,
      "title": "Enlightenment Guaranteed",
      "recommendations": [147198],
      "backdrop_path": "/qMnYIURsG0eWBZpGsWLbjLXzhJo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Uwe",
               "gender": 2,
               "credit_id": "52fe45e5c3a368484e0753b5",
               "name": "Uwe Ochsenknecht",
               "profile_path": "/nPaQx2K0UodicKPlrAXQjjkilF7.jpg",
               "id": 682,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gustav",
               "gender": 2,
               "credit_id": "52fe45e5c3a368484e0753b9",
               "name": "Gustav-Peter Wöhler",
               "profile_path": "/taGjNdze4T89L4mmlowmG9xqVbS.jpg",
               "id": 36688,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Petra",
               "gender": 1,
               "credit_id": "52fe45e5c3a368484e0753bd",
               "name": "Petra Zieser",
               "profile_path": "/pS2cEduXaUWqzUX7okBhyCmcEgM.jpg",
               "id": 3936,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ulrike",
               "gender": 1,
               "credit_id": "534b08f4c3a3682dd8001ecb",
               "name": "Ulrike Kriener",
               "profile_path": "/qCrFcIaxA3N2hICbAmsi2c52cE4.jpg",
               "id": 714,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Heiner",
               "gender": 2,
               "credit_id": "534b0909c3a3682ded001e7e",
               "name": "Heiner Lauterbach",
               "profile_path": "/ijrlHcCTjA5VrmY3vJsuOC3qUL3.jpg",
               "id": 7830,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "584f45669251416fad001442",
               "name": "Wilson Gonzalez Ochsenknecht",
               "profile_path": "/4PNS3CjPaEMHOv3IsqcGdiqhCqr.jpg",
               "id": 55183,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "584f4576c3a3683150001405",
               "name": "Jimi Blue Ochsenknecht",
               "profile_path": "/oQw8iHhUDipwxoX1K3kfrm2kfTT.jpg",
               "id": 16823,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe45e6c3a368484e0753c3",
            "name": "Doris Dörrie",
            "profile_path": "/2v1I1odswHZGMJYfSYmehJ3p4Ra.jpg",
            "id": 18969,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.856122,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 29507,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two middle aged German brothers - one New Age and recently divorced, the other uptight and sceptical - travel to a Zen monastery in Japan in search of enlightenment, or perhaps just in search of themselves.",
      "similar": [
         858,
         112160,
         634,
         437557,
         43923,
         141,
         153,
         297762,
         227306,
         242224,
         2771,
         59468,
         10735,
         9090,
         5781,
         157360,
         27586,
         11418,
         248774,
         9587
      ],
      "original_title": "Erleuchtung Garantiert",
      "runtime": 109,
      "poster_path": "/40NdSAZki8sLcpwTiapioOc9nQx.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [],
      "release_date": "2000-01-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Two Strangers in a Strange Land.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Doris Dörrie"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Doris Dörrie",
         "Ruth Stadler"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0177749/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMzY4NTg3N15BMl5BanBnXkFtZTcwMTQzMzY3Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Uwe Ochsenknecht, Gustav-Peter Wöhler, Petra Zieser | See full cast and crew »"],
      "reviews": [
         "Shown at the MIFF as 'The Bridge in the Rain' (why? I dunno). I almost didn't see this film as it sounded as if it could easily have been another of those 'mundane' foreign films but no, it was excellent. Gustav, who originally intended to go to the Tokyo monastery, is the type who gets lost in supermarkets. The other brother, Uwe, ends up going along after drowning his sorrows when his wife leaves him. Unfortunately, Uwe seems to fit right in with the strict monastery life, much to Gustav's torment! He even copes better than his brother when they get lost and separated in Tokyo. They both have personal torment and sibling rivalry which is equally engaging and funny. The monastery is in quiet, idyll surroundings out of Tokyo. A memorable line which hits home if you live in a big city comes in the form of a saying about 'hate' and anger - but I won't give it away. I thought that the story could have gone in any number of possible directions with equally enjoyable results. I also think that filming this on video and using footage from the video camera in the film enhanced the realism. A very memorable film.",
         "This movie is really quite a feast. It shows two German brothers on a trip to Japan to visit a Zen monastery. Both brothers face personal questions: one has just been left by his wife, and the other, well, that comes too late in the film for me to discuss here. Upon arriving in Tokyo, they settle in a comfortable hotel and go out for a night on the town. Problem: where is the hotel? At first this seems comical, but it quickly becomes a serious crisis. They sleep in cardboard boxes on the street. The brothers' ability to deal with these problems and their other problems are examined in the light of the daily mundane tasks they take upon themselves when they arrive at the monastery. The movie handles religion very well. It shows the value of their meditation without getting overly preachy. It shows the brothers, especially Uwe, the one whose wife left him, trying very hard to find a meaning in what they do. The movie is about people and the deep problems people have. Some viewers might find this boring, but I found it compelling. There is no one thing I can point to, but the whole feel of the movie and the characters seemed right.",
         "\"To live is to suffer,\" says brother Gustav, blissfully. \"Buddha's first noble truth.\" Enlightenment Guaranteed, a German Zen comedy is an amazing film that succeeds on several levels: as an insight into Buddhist philosophy and practice, as the maturing process of two brothers, and as a look at the hectic world of Tokyo, Japan. I won't guarantee you'll be enlightened but I'm sure you'll be entertained. Shot with digital video, the film revolves around two brothers, Gustav, (Gustav Peter Wöhler), a single Feng Shui consultant, and Uwe (Uwe Ochsenknecht), a salesman whose wife and children have just left him. After his brother's marital breakup, Gustav reluctantly takes Uwe with him to the Sojiji Soin Father Temple (a Zen monastery) in Monzen, outside of Tokyo. Their adventures in Tokyo are funny and touching. One time they get lost and cannot find their way back to their hotel. Another time they run out of money and are bilked by a singing ATM machine in a hilarious sequence. Finally, they end up sleeping in cardboard boxes, then in a tent next to a railroad train. The two are thoroughly spent when they finally arrive at Monzen. There is a stunning contrast between the frenetic pace of Tokyo and the serene setting of the monastery. The brothers have to get used to getting up at 4:30 A.M., taking cold baths, running cleaning rags across the floor and the elaborate unwrapping of eating utensils. Roles are reversed to a certain extent as Gustav buckles under pressure, while the uninitiated Uwe, merely along for the ride, proves surprisingly adaptable to the rigors of monastery life. The two brothers gradually lose \"control\" of their lives and learn to live in the present. As the Abbot of Monzen explains, enlightenment is not the achievement of something, but the absence of something. In Uwe's case, it might be the absence of attachment to the circumstances of his life. Enlightenment Guaranteed is a celebration of the act of looking within ourselves to unravel the mysteries of who we really are. The clanging of the various chimes and gongs, the beating of the drums, and the meditation rituals of the Buddhist monks create an atmosphere of calm and spirituality that left me with a feeling of joy.",
         "If you want to see a little of the real Japan then watch this movie rather than \"Lost in Translation\" (which would have been better if it was filmed in New York so the director knew what she was talking about). Yes, it is a bit slow in some parts but anyone who has been on a self-finding journey will relate, and laugh even more at the funny situations they get into. Germans and Japanese have a lot in common so that makes the misunderstandings real rather than the usual \"foreigners in Japan trying to make the Japanese seem like savage aliens\". In this time of reality TV and home-movies being used on various TV shows, the hand-held camera shots are very real. Also interesting is that the characters names are the actors real names so it adds to the effect.",
         "Enlightenment Guaranteed may seem funny at first but in fact it's very serious and explicitly Buddhist, since it involves two German brothers and their adventures in getting into and out of Japan's Monzen Buddhist monastery. Unfortunately the only format in which it has been released in North America is German VHS with English Subtitled which is somehow disappointing but the beauty of the movie almost makes you forget this little problem, The more interesting fact is that the actors actually had to live the monastery life during the shooting: for two weeks they and the crew never left the Monzen grounds!",
         "I took a change with my movie rental dollars when I grabbed ENLIGHTENMENT GAURANTEED at the video store and found it to be a delightful, low budget picture. It's a German PLANES, TRAINS and AUTOMOBILES with spiritual overtones. The two main characters, who are brothers, make their way to a Japanese (Buddhist) Monastery to escape their lives and their troubles. The trip to the Monastery is great. However, once at the Monastery the film slows down too much. Too many shots of people banging drums in ritualistic bliss. Thankfully, the film soon picks up again with main characters gaining new perspectives on life. Throughout the film cemeteries, homeless people and ravens are referenced leaving the viewer to figure some things out on their own. If you like funny, semi-deep movies with no effects or explosions you may really dig this. Curiously, the actors used their real names for their characters which explians why Petra's kids look just like her.",
         "\"Enlightenment Guaranteed\" is a wonderful film. Funny, visually interesting and intelligent. However, education about Buddhism is required, I think, for real appreciation of the film's layers of story telling. The independent film feeling was really charming. Ochsenknecht and Wohler work well as a comic team. The monastery scenes were fascinating and fun. There is a whole self consciousness of the play as a play that I really liked. It seemed more like small, alternative theater than film at times. I don't think this could be a commercial hit, simply because it takes a certain level of education and understanding of philosophy to get many of the jokes. The small audience, with whom I saw the film, were split down the middle. Half of them seemed as delighted as I was. Half seemed bored and restless. The German speakers near me were laughing as often and as loudly as I was. My own education in Buddhist practices was a major source of my appreciation for the film, I think. Well worth seeing, if you can find it.",
         "I adored this movie; it was sweet, funny, honest, beautiful, and poetic; I was smitten. As a friend of mine (a film critic) wrote to me, \"I've rarely seen anything that matches form to content in such an easy and really loving way.\"",
         "Though I haven't seen a lot of John Casavetes' work, apart from that, this is one of the best modern (read: 1985-present) uses of 8mm film that I've ever seen. This is one of those films you just have to throw yourself into. I'm not drawing a parallel between the two--at all!--but people who have seen 'Neon Genesis Evangelion' will recall how by the end of the first episode you had no idea what was going on, right alongside the principle character. This movie has a similar feel--It's unsettling at first, but ultimately presents itself as a curiously wonderful juxtaposition of warmth and coldness; interrelation and alienation. Very few films are capable of doing this well. Oh, and as a side note -- this is NOT one of those aimlessly meandering art films hell-bent on using 8mm to generate indie/underground credibility. In sum: a thoughtfully rewarding film about two very different German brothers lost in Japan and discovering a fine gray line dividing the point of no return from the point just before it and overcoming that dualism.",
         "Doris Dorrie has got the uncanny knack of rendering us speechless with her serious comic sagas which depict mundane human foibles.Erleuchtung Garantiert recounts a few mirthful episodes in the lives of its \"crazy about spirituality\" protagonists Uwe and Gustav.Uwe has never meditated in his life but still believes that it would help him in lessening his conjugal distress.The problems arise for them as they foolishly spend all their money in Tokyo.Things come to such a pass that they are forced to spend a few restless nights on the streets.Uwe and Gustav seem to have lost themselves completely in a metropolis like Tokyo where everyone is busy chatting on their mobile phones.The path to enlightenment is tricky for them but they happily tolerate all inconveniences in order to find spiritual bliss.They finally reach the Monzen monastery where they comprehend their innate strengths and weaknesses.Uwe overcomes the agony arising out of his failed marriage.Gustav realizes that he was never happy leading the life as a heterosexual male.He grasps that he has always been a homosexual person.Even though Erleuchtung Garantiert has been shot on Digital Video,it still manages to retain its ineffable charm. Erleuchtung Garantiert's biggest positive feature is that it reveals how one should move away from the hustle and bustle of a materialistic society in order to gain inner happiness."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": ["Megaherz TV Fernsehproduktion GmbH"],
      "summaries": ["Two very different brothers get together for a temporary stay in a Japanese zen monastry. The trip from Germany to Japan brings up some unexpected quests they have to manage. Soon both really have to leave their ordinary lifes behind and are on a voyage to themselves."],
      "budget": 0
   },
   "movielensId": 6717,
   "movielens": {
      "languages": [
         "Deutsch",
         "日本語"
      ],
      "releaseDate": "2000-01-20",
      "dvdReleaseDate": "2003-08-12",
      "directors": ["Doris Dörrie"],
      "runtime": 109,
      "movieId": 6717,
      "title": "Enlightenment Guaranteed",
      "mpaa": null,
      "actors": [
         "Uwe Ochsenknecht",
         "Gustav-Peter Wöhler",
         "Petra Zieser",
         "Ulrike Kriener",
         "Heiner Lauterbach",
         "Wilson Gonzalez Ochsenknecht",
         "Jimi Blue Ochsenknecht"
      ],
      "imdbMovieId": "0177749",
      "originalTitle": "Erleuchtung Garantiert",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["6fXi4lOJe1I"],
      "plotSummary": "Two middle aged German brothers - one New Age and recently divorced, the other uptight and sceptical - travel to a Zen monastery in Japan in search of enlightenment, or perhaps just in search of themselves.",
      "tmdbMovieId": 29507,
      "avgRating": 3.73684,
      "releaseYear": "2000",
      "numRatings": 57,
      "posterPath": "/40NdSAZki8sLcpwTiapioOc9nQx.jpg"
   }
}