{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "homesickness",
            "id": 1007
         },
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "host family",
            "id": 5372
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "minor leagues",
            "id": 156100
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0990413",
      "video": false,
      "title": "Sugar",
      "recommendations": [
         12125,
         42225,
         26232,
         79172,
         50769,
         236630,
         84900,
         45576,
         48826,
         31626,
         333,
         48210,
         25112,
         290969,
         27093,
         47227,
         50071,
         70829,
         28311,
         21555
      ],
      "backdrop_path": "/ohyydtAmlf7y46XwVZgJwyLw2WU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Miguel 'Sugar' Santos",
               "gender": 0,
               "credit_id": "52fe46fe9251416c7508a62b",
               "name": "Algenis Perez Soto",
               "profile_path": null,
               "id": 86381,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jorge Ramirez",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a62f",
               "name": "Rayniel Rufino",
               "profile_path": "/gcxROKGft5qclXOASQswLhhgM04.jpg",
               "id": 1005788,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Brad Johnson",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a633",
               "name": "André Holland",
               "profile_path": "/nq6qk6P5idimcSJ0bpFqLQrb0Li.jpg",
               "id": 459980,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Stu Sutton",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a637",
               "name": "Michael Gaston",
               "profile_path": "/tAmpD16aVzWbs8evbCFaed9perN.jpg",
               "id": 33241,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Osvaldo",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a63b",
               "name": "Jaime Tirelli",
               "profile_path": "/tmQlW0qO4Hr2o4f6pk7knDjmYlf.jpg",
               "id": 59743,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Helen Higgins",
               "gender": 1,
               "credit_id": "52fe46fe9251416c7508a63f",
               "name": "Ann Whitney",
               "profile_path": null,
               "id": 1005538,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Earl Higgins",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a643",
               "name": "Richard Bull",
               "profile_path": "/5TYupEMDpS4UL1lLaYO5ynNB1vF.jpg",
               "id": 31210,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Anne Higgins",
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a647",
               "name": "Richard Bull",
               "profile_path": "/5TYupEMDpS4UL1lLaYO5ynNB1vF.jpg",
               "id": 31210,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Reyna",
               "gender": 1,
               "credit_id": "52fe46fe9251416c7508a64b",
               "name": "Alina Vargas",
               "profile_path": null,
               "id": 1005804,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46fe9251416c7508a615",
               "name": "Anna Boden",
               "profile_path": "/h5YMXdI42zb0uqn5UJHF4fT9AER.jpg",
               "id": 53069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe46fe9251416c7508a61b",
               "name": "Anna Boden",
               "profile_path": "/h5YMXdI42zb0uqn5UJHF4fT9AER.jpg",
               "id": 53069,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a621",
               "name": "Ryan Fleck",
               "profile_path": "/z5EL2oWKEVUgFb6wjoX0BSxthsJ.jpg",
               "id": 53068,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fe9251416c7508a627",
               "name": "Ryan Fleck",
               "profile_path": "/z5EL2oWKEVUgFb6wjoX0BSxthsJ.jpg",
               "id": 53068,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5866be57c3a3684f5c000e7e",
               "name": "Jeremy Kipp Walker",
               "profile_path": "/nOvgl8GkdAM5dolHQem2urf8uSC.jpg",
               "id": 53079,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.16765,
      "production_countries": [
         {
            "iso_3166_1": "DO",
            "name": "Dominican Republic"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 17003,
      "vote_count": 14,
      "budget": 0,
      "overview": "Sugar is a 2008 sports drama film directed by Anna Boden and Ryan Fleck. It follows the story of Miguel Santos, a. k. a. Sugar (Algenis Perez Soto), a Dominican pitcher from San Pedro de Macorís, struggling to make it to the big leagues and pull himself and his family out of poverty. Playing professionally at a baseball academy in the Dominican Republic, Miguel finally gets his break at age 19 when he advances to the United States' minor league system; but when his play on the mound falters, he begins to question the single-mindedness of his life's ambition.",
      "similar": [
         8923,
         5693,
         9655,
         10637,
         22881,
         858,
         9291,
         2300,
         112160,
         39254,
         141,
         634,
         227306,
         242224,
         323677,
         9469,
         11287,
         43923,
         10474,
         455
      ],
      "original_title": "Sugar",
      "runtime": 120,
      "poster_path": "/ldiKnTAt8pBB3rY6HQI4QZt6r7n.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Serie 23 Productions",
            "id": 94624,
            "origin_country": ""
         },
         {
            "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
            "name": "Sony Pictures Classics",
            "id": 58,
            "origin_country": "US"
         }
      ],
      "release_date": "2009-04-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.sonyclassics.com/sugar",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Anna Boden",
         "Ryan Fleck"
      ],
      "runtime": 114,
      "synopsis": "Filmmakers Ryan Fleck and Anna Boden (Half Nelson) weave this introspective sports drama concerning a talented Dominican baseball player who longs to break into the American big league and earn the money needed to support his impoverished family. Miguel Santos is a talented pitcher who might just have what it takes to earn a prized spot on a Major League Baseball team, but before that happens he'll have to prove his worth in the minor leagues. Advancing into the United States' minor league system at the tender age of 19, Miguel is warmly welcomed into the small-town Iowa home of his host family, but can't help but struggle with language and cultural barriers despite the kindness of strangers. Subsequently forced to reevaluate his life's ambition after his once-trusty arm becomes unreliable, the previously single-minded pitcher gradually begins to question both the world he lives in and the role he has chosen to play in it. - Jason Buchanan, All Movie Guide Miguel \"Sugar\" Santos (Perez Soto) spends his weekends at home, passing from the landscaped gardens and manicured fields on one side of the guarded academy gate to the underdeveloped, more chaotic world beyond. In his small village outside San Pedro de Macoris, Miguel enjoys a kind of celebrity status. His neighbors gather to welcome him back for the weekend; the children ask him for extra baseballs or an old glove. To his family, who lost their father years before, Miguel is their hope and shining star. With the small bonus he earned when he signed with the academy some time ago, he has started to build his family a new house - one that has a bigger kitchen for his mom and a separate room for his grandmother. After learning a devastating knuckle curve, Sugar is invited to spring training by the fictional Kansas City Knights. He is assigned to their Single A affiliate in Iowa, the Swing. He is housed by the Higgins family, who take in Swing players every year. Jorge (Rufino), a veteran player and the only other Dominican on the team, also tries to help Miguel learn the ropes. However, despite the Higgins' welcoming efforts and Jorge's guidance, the challenge of Miguel's acceptance into the community is exposed in small ways every day, from his struggle to communicate in English to an accident of casual bigotry at a local bar. Miguel's domination on the mound masks his underlying sense of isolation, until he injures himself during a routine play at first. While Miguel is on the injured list, Jorge, his one familiar connection to home in this strange new place, is cut from the team, never fully regaining his ability following off-season knee surgery. The new vulnerability of Miguel's injury, coupled with the loneliness of losing his closest friend, force Miguel to begin examining the world around him and his place within it. Pressure mounts when Salvador, a young pitching phenom who used to play with Miguel, is brought up from the Dominican Republic to join the team. Miguel's play falters, and the increased isolation begins to take its toll on him. As his dream begins to fall apart, Miguel decides to leave baseball to follow another kind of American dream. His odyssey finally brings him to New York City, where he struggles to find community and make a new home for himself, like so many before him. [D-Man2010]",
      "writers": [
         "Anna Boden",
         "Ryan Fleck"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0990413/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMzI0OTIyOF5BMl5BanBnXkFtZTcwMzU1NzEzMg@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Algenis Perez Soto, Jose Rijo, Walki Cuevas | See full cast and crew »"],
      "reviews": [
         "What's with the low ratings for this movie? I saw this at the Toronto Film Festival, and people loved it. Is it that some audiences wanted a regular sports movie, with everything leading up to the big game? This follows Dominican ball players and their dreams of making it to the bigs. We go from the Dominican to small town Iowa, then to New York City in a movie that's pitch perfect the whole way. And it got everything right, from how small towns in America watch these young guys grow and progress, to how they're treated like animals when they face injuries or setbacks. The actors are mostly unknowns, and they give the movie a documentary feel. I especially loved the old couple that takes one ball player in every year, and the minor league baseball manager, who is portrayed very fairly as a guy who pushes his players, but wants to see them make it. This movie is a home run, pardon the pun, because it transcends the sports genre and becomes a movie about finding one's self worth, no matter where your career path takes you. I believe that if you want something more from a sports movie than being just a past-time, you'll find it in \"Sugar\", from the team who directed \"Half Nelson\", another movie that was more concerned with characters and self-worth over silly plot requirements. To the low scorers out there I would say don't judge a movie for what it's not, and really look at what it is. Because this is a special movie that never goes wrong.",
         "\"Sugar\" is simply one of the best sports movies ever and it does so avoiding every sports movies cliché ever made. The story of the main character is simply a composite of the story of the majority of people who go to play the game professionally. Not only that, but also reflects the story of the immigrant who comes to America pursuing a dream. Spoken mostly in Spanish, the movie almost qualifies as a foreign language film. The filmmakers do an excellent job capturing the contrast in atmosphere of the Dominican Republic -a poor country, rich in happiness- to the heartland of America, and back to the Bronx -a Dominican stronghold outside of the island, also stricken by poverty. As in \"Friday Night Lights\" you can feel the constant stress these young players endure to make it big. It's every bit as tense and if you like baseball, and are interested a little bit about these foreign superstars now playing the game, this movie is going to be a treat. One of the best films of 2009.",
         "Sugar is an important Hispanic film. And yes, two Americans made it, Fleck and Boden, but they do so without compromise, without an agenda, and without patronising - and what we get IS an Hispanic film - it is not a film about America, it really is a superb Hispanic (Spanish in America) perspective - and it just blew me away. 100% convincing, valid, justified - and simply a great film. The story of the baseball player Sugar, played with consummate skill by Soto, has all the elements of a good sports movie plus the added dimension of a very well thought through arc and development. This is without a doubt one of the better films of the year; it captures both baseball and the alienation of the Hispanic experience in the US with alacrity and a light touch. The characters have real depth and emphasis is placed on the internal rather than simply the external. Strongly recommended as a breakthrough film for Hispanic film in the US, both in the quality of the story and acting and for excellence in film making.",
         "Did you ever watch a movie and think, \"Eh, this is okay but nothing great\" and then, when it was over, you said, \" \"Wow, that was really good!?\" That's \"Sugar,\" a film you may not quite appreciate how good it is until it's over, and then you think about it for awhile. What made it so good, I thought, was the amazing realism with the dialog. If I hadn't read that this was movie with actors, I would have sworn I was watching a documentary. We follow a young guy from the Dominican Republic about 19 who is hoping to become a Major League baseball player. If you follow baseball, you already know there are a lot of good players from the Dominican. \"Miguel 'Sugar' Santos,\" played by first-time actor Algenis Perez Soto is a pitcher in the Kansas City organization, but most of the baseball in seen in a small town in Iowa, where Santos is assigned to play Class A ball as his first stepping stone to the Major Leagues. In one scene, I saw a sign on a business that said \"Davenport\" and the ending credits list Quad Cities as a place of filming. It's in Eastern Iowa right on the Mississippi River. In the last 40 minutes, the film takes place in New York City as our ballplayer gets discouraged and takes a bus to The Big Apple to see his friend and to see Yankee Stadium, where he has dreams of playing. This film does not have the normal successful-happy ending, and that makes it all the more realistic. It's not a sad ending, either, as our hero makes do with what he has and gets help from some nice people....and simply gets on with his life and plays baseball simply for the joy of it on weekends. The best part of this film, I thought, was the realistic dialog that went with that realistic story. Everybody from the ballplayers, to the Higgins family in Iowa who housed \"Santos,\" to the Iowa manager and the all the folks he met in New York City all sounded like the real deal. This movie does not have the feel of something made up; it looks and sounds very authentic. Although made for an Hispanic audience, with most of the language in Spanish, it also was for North Americans, to open our eyes what it's like for all these Latin American players who come to the states to play professional baseball and can't speak English. This is baseball's version of \"Lost In Translation.\" Yes, the story has a few flaws and it's slow at times, but its definitely worth watching and can lead to some interesting discussions.",
         "The success of Latin ball players like Roberto Clemente, Juan Marichal, and Orlando Cepeda are legend but we never hear about the hundreds that fail, those who get lost in the system or are simply unable to handle the pressure of exorbitant signing bonuses or less than welcoming small town environments. In Sugar, writer-directors Anna Boden and Ryan Fleck, whose film Half Nelson from 2006 won numerous awards, have created a film about the problems faced by young Latinos in attempting to make the jump from the comforts of their home town environment to the major leagues. It is not just a movie about baseball but about what is important in life. 20-year-old Miguel Santos (Algenis Perez Soto) is nicknamed Sugar - he says because he is sweet on the ladies but others have different opinions. Sugar is a pitcher at an American baseball training academy in the Dominican Republic whose recently developed knuckle curve ball puts him ahead of the pack. He is the idol of his family and the children in his home town but must compete with hundreds of others like himself for an invitation to a minor league Spring Training camp. Though the baseball academy attempts to teach the fundamentals of the English language, all the players seem to remember is \"home run\", \"foul ball\", \"I got it\", and the words to \"Take Me Out to the Ball Game\". Given his gifts, Sugar is invited to spring training with the fictional Kansas City Knights in Phoenix, Arizona. Eventually assigned to a Single-A farm team in Bridgetown, Iowa, he is light years away from his comfort zone. When he first sees his posted assignment to Bridgetown, Ia. he asks \"where the heck is Ia (ee-ay)\"? Sugar boards with a Midwestern farm family that has taken in Latino players in the past, but the adjustment is difficult. Sugar does what is expected - attends church, eats foods he is unfamiliar with, and says little but his only companion is Jorge (Rayniel Rufino), a fellow Dominican on the team who has remained stuck in Single-A ball because of an injury that refuses to heal. Soon his problem with language and customs begin to take their toll. He encounters racial slurs at a local nightclub and is confused when he receives mixed signals from the family's ultra religious teenage daughter Anne (Ellary Porterfield). When he is slow to recover from a leg injury sustained in covering first on a ground ball, his pitching skills begin to suffer as well. One scene highlights his sense of dislocation as he tries to make his way through a massive entertainment complex filled with flashing lights, video game machines, and bowling alleys. To try to regain his pitching form, he takes steroids but it only makes his sense of disorientation worse. His manager (Johnny Marx) is patient but he is paid to produce results and his sensitivity to Sugar's situation only goes so far. When Sugar asks teammate Brad (Andre Holland) what he would do if he could no longer play baseball and learns that Brad studied history in college, he begins to rethink exactly what he wants to do with his life. After Jorge heads for New York after being let go, the film moves in an unexpected direction, but never loses its intelligence and sensitivity. Soto is a captivating presence in his first acting role and the fact that he is also a skilled amateur baseball player gives the baseball scenes an electric authenticity. While Boden and Fleck show their love of the game, they do not hide their disdain for its exploitative aspects. No clichéd sports success story, Sugar is sweet and goes down easy but leaves a pungent aftertaste.",
         "Baseball movies are often deemed cliché in today's world of cinema. You have a team or a player the film focuses around, they're usually underdogs or feel good stories, they have an improbable season and the end result is usually a championship for the team, or a life altering moment for a player. The movie, Sugar goes completely against this modern day norm. As a baseball movie, Sugar won't stand-alone. What does set it aside is the cultural quantum leap the main character endures. The films main character, Miguel Santos, whose nickname is the movies namesake, is the hero of his small, Dominican Republican village, as a pitcher with lively arm, an ideal build, and terrific upside. He receives mounting pressure from his family and the community to become the next Dominican baseball star, and eventually gets his shot. It's a reminder for every Sammy Sosa and Pedro Martinez who makes it from the Dominican Republic; hundreds of others burn out and are never heard from again. It's the off the diamond aspects of the opportunity he gets that makes the movie an interesting character piece. Short, and seemingly innocuous scenes help build the movie, and show the struggle that Santos endures in his assimilation to Americanized life, which ultimately correlates to his performance on the field. As mentioned, as a baseball movie it goes away from the norm, Hollywood cookie cutter of a sports movie, but as an allegory of the struggle that millions of Latino baseball players go through, it couldn't be more spot on. For a person with virtually zero prior acting experience, Algenis Perez Soto gives a noble performance as the films protagonist. He's never really asked to go outside his main personality, which is stoic and monotonous, but he has a few moments where he breaks off, and his ability to act at emotional pinnacles are shown. Surely this won't be the end of his acting career, as he virtually won the acting lottery by randomly being selected for a lead in a semi-major motion picture. Most of the actors don't have enough of a part in the movie to shine, as no other character was given enough screen time to even be considered a strong supporting actor. The writing and story is thorough in its sports detail, which a baseballs junkie would enjoy, but the average moviegoer might not understand. The subplots in the movie like the love story and the conflicts surrounding the supporting characters lack substance. Those subplots, along with the characters involved in it seem to just disappear abruptly. The story is somewhat episodic, divided into a few large parts, with none of those parts supporting characters carrying on through the movie. As a whole, the movie takes on a slow pace, and sometimes struggles to keep the interest of the viewer. If you plan on seeing Sugar, don't go in expecting a team to pull in a superstar to save the day in the last second, or for the main character to pitch a World Series no-hitter, or you'll be disappointed. Mainly, don't go into the movie expecting a baseball movie, or you won't be satisfied. In the end, the movie lacks a punch that would make it stand out, but gets my praise for tackling a plot that usually will end with a cold dose of reality. Rating: 7/10",
         "If you are looking for another \"sports\" film, this isn't it. Sure, it's about Dominican baseball players trying to make it in the United States, and get some money for their families, just as African-Americans use the NBA to get out of the ghetto, but it is so much more. Baseball isn't the story here. It is just a backdrop. The story is immigration. It was funny watching Miguel 'Sugar' Santos (Algenis Perez Soto) put up with an Iowa farm family when he went to play \"A\" ball. They didn't speak Spanish, and he didn't speak English. The daughter (Ellary Porterfield) seemed interested, but couldn't take the big step. He left for New York when he felt his game go. He managed to find a new life. Not completely without baseball, but without making it to the majors. Life is like that. It's what happens when you make other plans.",
         "This is one of those movies that seem to fall between the cracks. Little known, but one you'd hate to miss...especially if you like baseball. The best part of this film is the authenticity and the inspiration that comes from it. Miguel Santos(Algenis Perez Soto) is a 19-year old in the Dominican Republic, where baseball still reigns supreme. Miguel, nicknamed Sugar, is a gifted pitcher that throws a knuckle curve with power. Dreams of making it to America and the big leagues sometimes do come true for some. And when it happens it means a family actually has a chance of getting out of poverty. Sugar and many other hopefuls attend the Dominican's Kansas City Baseball Academy and with any luck can be called up to Minor League ball in the States. Sugar gets to make the trip to Kansas City's team in Burlington, Iowa. There he will struggle with the language, culture and pressure of having any degree of success to rescue his family. This poignant and very believable baseball movie also stars: Rayniel Rufino, Michael Gaston, Andre Holland, Ellary Porterfield and Ann Whitney.",
         "Sugar was beautiful, heart-felt, and realistic. I loved the flow of the movie, showing Miguel \"Sugar\" Santos' journey, from his days in Dominican Republic to the U.S., struggling with the language barrier and his own identity while maintaining his passion for baseball. It felt I watched an actual documentary, witnessing Sugar's desire to succeed in the sport and becoming a \"product\" for the Minor Baseball League. Very compelling! Anna Boden and Ryan Fleck are fantastic once again with how the story was told and the care with research (back stories of real life ballplayers) to tell this story so perfectly. And the lead actor, Algenis Perez Soto was impressive, considering this was his 1st acting role. I highly recommended this movie!!",
         "........................................................from Pasto,Colombia...Via: L.A. CA...and ORLANDO, FL More often than not, baseball stories are focused on the guy who manages to get all the way to the Majors. Sometimes we can lose sight of the fact that for every spot filled on a major league roster, there are scores, if not hundreds, of players who get sidelined somewhere along the way in their quest to make it to the big leagues! You don't have to like Baseball to enjoy SUGAR, but if you do, you're likely to enjoy it all the more. You have to give HBO films credit....Gutsy move to make a baseball movie that... A) Is about 70% in Spanish B) Manages to make the viewer empathize with the isolation & culture clash experienced by someone who arrives here not speaking any English and.... C) Morphs completely into a different movie genre! Algenis Perez Soto plays SUGAR. I'd venture a guess that more likely, he IS SUGAR! IMDb PRO lists this as his only acting gig, ever. Apparently, he is undecided as to whether or not to continue his career in acting. Amazingly, Mr. Perez's contact E-mail address also appears. Here it is: algenisperez@gmail.com (Hope that you find the address Helpful!) SUGAR also boasts some great Dominican Merengue music; new, exotic third-world locations; and an on-screen collision between Dominican and Mid-Western Iowan cultures...Quite fascinating to watch! 9*...ENJOY/DISFRUTELA! Any comments, questions or observations, in English o en Español, are most welcome! KissEnglishPasto@Yahoo.com"
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "HBO Films",
         "Journeyman Pictures",
         "Hunting Lane Films"
      ],
      "summaries": [
         "By 2008, more than 25 percent of major league baseball players were born in Latin America. At 19, Miguel \"Sugar\" Santos, a serious kid from the Dominican Republic, signs with Kansas City. He flies to Phoenix for tryouts and is sent to the Class A team \"The Swing\" in the fictional town of Bridgetown, Iowa, where he lives with a farm family. Thus begins his odyssey: leaving his mom and girlfriend; living in an alien culture; learning English; overcoming jitters; working hard; achieving early success; navigating friendships, occasional racism, and a woman's mixed signals; dealing with an injury; trying performance-enhancing drugs; and, searching for his place in the world. Will he make it to the Majors; will he play in New York?",
         "Dominican baseball star Miguel \"Sugar\" Santos is recruited to play in the U.S. minor-leagues."
      ],
      "budget": 0
   },
   "movielensId": 67223,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2009-04-03",
      "dvdReleaseDate": "2009-09-01",
      "directors": [
         "Anna Boden",
         "Ryan Fleck"
      ],
      "runtime": 120,
      "movieId": 67223,
      "title": "Sugar",
      "mpaa": "",
      "actors": [
         "Algenis Perez Soto",
         "Rayniel Rufino",
         "André Holland",
         "Michael Gaston",
         "Jaime Tirelli",
         "Ann Whitney",
         "Richard Bull",
         "Richard Bull",
         "Alina Vargas"
      ],
      "imdbMovieId": "0990413",
      "originalTitle": "Sugar",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["NrovzeE8uTM"],
      "plotSummary": "Sugar is a 2008 sports drama film directed by Anna Boden and Ryan Fleck. It follows the story of Miguel Santos, a. k. a. Sugar (Algenis Perez Soto), a Dominican pitcher from San Pedro de Macorís, struggling to make it to the big leagues and pull himself and his family out of poverty. Playing professionally at a baseball academy in the Dominican Republic, Miguel finally gets his break at age 19 when he advances to the United States' minor league system; but when his play on the mound falters, he begins to question the single-mindedness of his life's ambition.",
      "tmdbMovieId": 17003,
      "avgRating": 3.53211,
      "releaseYear": "2009",
      "numRatings": 109,
      "posterPath": "/ldiKnTAt8pBB3rY6HQI4QZt6r7n.jpg"
   }
}