{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0293624",
      "video": false,
      "title": "Super Sucker",
      "recommendations": [],
      "backdrop_path": "/tecyynidGpWTdW4P5yFKwfa06yL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Fred Barlow",
            "gender": 2,
            "credit_id": "5932bbe19251417de200bfb5",
            "name": "Jeff Daniels",
            "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
            "id": 8447,
            "order": 1
         }],
         "crew": []
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.394696,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41846,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two door to door vaccuum cleaner salesmen hilariously compete against each other.",
      "similar": [],
      "original_title": "Super Sucker",
      "runtime": 93,
      "poster_path": "/hEHxmqpkmhbGKt9Dsy9ocwnRrCY.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2002-01-01",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "A new comedy that dosn't blow... It sucks!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Daniels"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Jeff Daniels",
         "Guy Sanville"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0293624/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNDk5MTY5OF5BMl5BanBnXkFtZTcwOTI1NjYzMQ@@._V1_SY317_CR18,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Daniels, Matt Letscher, Harve Presnell | See full cast and crew »"],
      "reviews": [
         "I just saw the Super Sucker world premiere in Ann Arbor, Michigan (where Jeff Daniels grew up and now runs Purple Rose Films) and it is absolutely hilarious. Sidestepping all the toilet-level humor and midwestern-centric culture which made Escanaba in da Moonlight a less-than-perfect success, Super Sucker is a sharp comedy for the American everyman. Daniels stars as Fred Barlow, a vacuum salesman with an life-long passion for his trade. When Johnsonville, Michigan proves not big enough for both Barlow and his arch rival salesman (Harve Presnell), their boss creates a contest in which the man with the most sales wins exclusive rights to the city. Barlow is out of luck until he discovers a drapery attachment that pleases housewives in more ways than one. But will the \"American Association for the Abuse of Household Appliances\" approve? And will Barlow's rival let such a gimmick steal his loyal customers? The plot twists, turns and tickles brilliantly. I must say, for an independent film, this is one marvelously professional production which easily outdoes most contemporary Hollywood comedies. Direction, cinematography, sound, editing and writing are all top notch. Not to mention the cast, a classic lineup of wacky salesmen, chock-full with comedic talent. You get to love them all. Matt Letscher especially shines as Daniels's eager and naive sales apprentice. Above everything, let's not forget Mr. Daniels. I'd go so far as to say that this film is his crowning achievement on many levels. Not only has he crafted one of his funniest roles and films ever, he's finally starred in a comedy that you're not ashamed to admit liking. I interviewed Daniels for Ann Arbor's CURRENT magazine a few weeks before the premiere and he said that if there's one thing he knows how to do, it's to make people laugh. The proof is in the pudding. You won't need a drapery attachment to get absolute pleasure from Super Sucker.",
         "Being a fellow Michigander (with Jeff Daniels), I can see part of where this movie came from. It's a satirical look at Midwestern family values and sexual mores (like Daniels' other, more well-known, and overall better \"Pleasantville\"). Unlike \"Pleasantville,\" where the attacks on sexual puritanism are subtle enough for some casual viewers to miss, \"Super Sucker\" is blatant. The premise: A down-and-out vacuum cleaner distributor (Daniels) in a moderate-sized Midwest town (based on and shot in Jackson, Michigan) has been given 30 days to outsell his overbearing and obnoxious competitor. Whoever sells the most systems gets sole rights to distributorship. Daniels seems destined to lose -- the competition has much more advertising money, and is willing to throw any rules of fairness out the window -- until he discovers a special use for a long-discontinued attachment. He puts the attachment into rapid production, and offers it as a \"special bonus\" that only his distributorship has available. His fate changes radically, buildi ng up to a raucous farce of a climax. The buildup is, in my opinion, slow, and bits are ham-fistedly predictable; the \"cat\" scene belonged in a Farrelly Brothers movie (and that's not a compliment), but it was thankfully brief. But once it gets going (around the midpoint), and writer/director Daniels decides that whatever real world logic he had been attempting to follow should be thrown out the window in favor of over-the-top absurdity, it has some truly comedic scenes. In a time when Michigan's sexual more pendulum appears to be swinging back to the left, the film is a nice push in the right direction. And, sociosexual politics aside, it's a darn fine piece of unpretentious independent comedy -- something we can never have enough of. TV buffs will likely enjoy a cameo from Gilligan Island's Dawn Wells, making fun of her own stereotyping as Mary Ann. Purple Rose fans will note that, except for bits of body-humor comedy and Daniels' affably hapless good guy (a persona he started with \"Something Wild\"), this is a much different film than Escanaba in Da Moonlight (also a good movie, although I enjoyed the play more). Like \"Pleasantville,\" it has more national appeal (\"Escanaba\" was rife with Michigan in-jokes), and despite some of its stageplay-like shots, it's obviously based on a screenplay, with many more scenes and a much larger cast. I hope Purple Rose works out its own kinks in distributorship (leaving me wondering if Daniels' frustration here didn't contribute to \"Super Sucker\"'s premise), because these films deserve a larger audience than they seem to be getting.",
         "Which is a compliment, if you've seen it. Its plot is puerile in nature and a base in concept, which will offend the gentle viewer. However, for those who are comfortable enough deal with the nature of the show will find themselves wanting to roll on the floor laughing. I am particularly delighted how they put the fifties vacuum salesman into today's world, but gave the movie a fifties look and feel. The lighting, styling and many of the mannerisms of the characters had you jumping back and forth between the eras. This movie, like Escanaba in Da Moonlight, had the strong sense of having been a play. Many of the stagings and acting parts jumped out and said this is a play stage scenario. Go see this movie and enjoy it. Don't let your insecurity chase you away.",
         "In the vein of Kingpin, Office Space and Airplane. Super Sucker isn't as funny as any of those movies but, considering it's budget, is still pretty impressive. Fans of \"dumb\" comedies will probably like, not love, this move.",
         "Reading some of the other post here and I think there are too many prudes on here lol You can NOT take this movie seriously, it's just a dumb comedy and it is Funny! This movie is a strange combination of the 1950's, 1970's and today. Its like \"Leave it to Beaver\" meets a soft porn movie ..lol The laughs really begin when \"Mothers little helper\" is introduced in the movie :) Jeff Daniels is hilarious! I loved it and got a kick out of it!",
         "This film was good, the acting was wonderful , Jeff Daniels did a Great job as the Super Sucker Salesman- anyone who has ever sold vacuums and love vacuums this is a wonderful movie, they will find this a treasure. For everyone else, it's an off beat funny movie that you'll enjoy. Although it probably won't go well in the theaters due to the advertising of this movie, it is worth seeing. The supporting Cast is Great, Matt Letscher (Howard) was Hilarious, he was a wonderful addition to the film, a stand out performance.. If you have a chance -go see this movie, on the whole you will enjoy it, some parts are a bit off center and have you thinking \"What??\" , but the comedy is great!",
         "Super Sucker is Jeff Daniel's second indie movie filmed in Michigan (his home state). I recommend it if you are looking for a funny, funny movie with a simple plot (in other words, a no-brainer). The premise might be a bit rough for some but I think most viewers will not be offended. My husband and I saw the premire in Ann Arbor, MI and are anxious to see it again because people were laughing so hard at times some lines were missed. If you saw Daniel's Escanaba in da Moonlight (and you may have noticed I live in Escanaba and was actually in that film if you looked really quick!) and were a bit disappointed, Super Sucker is far better...consistantly funny.",
         "I saw Super Sucker at Madstone Theaters in Ann Arbor. While I was generally pleased with the movie, I found it to be forced in places, as if the actors were trying too hard to make the joke work. I was expecting a movie a la \"Tin Men\" or even \"Glengarry Glen Ross\". Low key, but with Daniels' brand of humor. Instead, \"Super Sucker\" is an over-the-top, farcical movie about sexually unsatisfied residents of a medium-sized city using a new vacuum cleaner \"attachment\" in the pursuit of pleasure. I think the intent of the movie was to preach a sexual liberation, anti-prude message, if Fred Barlow's (played by Daniels) \"sermon\" at the end is any indication. If that was the intent, the movie fell short of doing it well. I feel sly humor and innuendo, like that found in the beginning of the movie, would have played much better, but instead we were treated to sexual vaudeville, with biker mamas, cross dressers, and dirty old men cheering and marching. I'm certainly no prude, but I think the movie would have been much better leaving something up to the imagination instead of blasting us in the face with it. Kudos to: Daniels and the lesser known actors he chose for the film who really helped sell the film, the fact that the movie was shot 100% on location close to home in Jackson, MI, good character development, and the few scenes with truly sly, sarcastic humor. I would have liked more conflict between Barlow and the other vacuum cleaner distributor (played by Harve Presnell, an actor I love to watch), and more Dawn Wells, because unlike Howard Butterworth in the movie (played beautifully by Matt Letscher), I am a Marianne man all the way. Michigan residents should see the movie for sure, little kids shouldn't see it at all, and everyone else should see it if they're looking for a fairly predictable plot with comedy and farce, too few instances of well-done wit and satire, but want some chuckles and laughs from a movie targeted to adults instead of the Kangaroo Jack crowd.",
         "Saw the film at its premier last spring. Missed a lot of the dialog because everyone was laughing so hard. Am anxious to see it again. I think this is a lot better than many of Daniels' other comedies. Academy award material it is not. It is just a hoot of a film.",
         "I was able to view this film at CineVegas 2002, and I will say it wasn't a waste of time, but I am not sure I would pay to see it again in the theaters. Jeff Daniels plays a middle class, vacuum sales person who is losing business to his cross-town competitor. Until this point, the movie is pretty, well...boring. At this point the movie turns to the extreme and becomes pretty funny in a \"stupid movie\" sort of way--you don't want to laugh but you just can't help it. I will not go any further as I do not want to ruin the film for anyone. Daniels plays a good role and is funny in it, and if you go into this film not expecting a whole lot, you shouldn't be disappointed."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Purple Rose Productions"],
      "summaries": ["Two door to door vacuum cleaner salesmen hilariously compete against each other."],
      "budget": 0
   },
   "movielensId": 6737,
   "movielens": {
      "languages": [""],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": "2003-08-19",
      "directors": [""],
      "runtime": 93,
      "movieId": 6737,
      "title": "Super Sucker",
      "mpaa": "R",
      "actors": ["Jeff Daniels"],
      "imdbMovieId": "0293624",
      "originalTitle": "Super Sucker",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two door to door vaccuum cleaner salesmen hilariously compete against each other.",
      "tmdbMovieId": 41846,
      "avgRating": 2.2931,
      "releaseYear": "2002",
      "numRatings": 29,
      "posterPath": "/hEHxmqpkmhbGKt9Dsy9ocwnRrCY.jpg"
   }
}