{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "country house",
            "id": 1655
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0331468",
      "video": false,
      "title": "Cold Creek Manor",
      "recommendations": [
         15992,
         12146,
         13572,
         9756,
         11058,
         9039,
         10929,
         10984,
         16077,
         11859,
         9009,
         13275,
         9034,
         16028,
         20009,
         10342,
         16379,
         29979,
         10685,
         12117
      ],
      "backdrop_path": "/9qxHm4VTbndb6grVsSXMZrfNfFV.jpg",
      "revenue": 21384035,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cooper Tilson",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c67d",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Leah Tilson",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c681",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dale Massie",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c685",
               "name": "Stephen Dorff",
               "profile_path": "/l9DEmM22RzJA331AOdg5cAXaOfm.jpg",
               "id": 10822,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c689",
               "name": "Juliette Lewis",
               "profile_path": "/eeEx3v5ElBHvlrJjULlj5I3EpPF.jpg",
               "id": 3196,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kristen Tilson",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c68d",
               "name": "Kristen Stewart",
               "profile_path": "/eiQqvaPMoTjdnlGHyrp2HOBxtMc.jpg",
               "id": 37917,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jesse Tilson",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c691",
               "name": "Ryan Wilson",
               "profile_path": null,
               "id": 73568,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sheriff Ferguson",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c695",
               "name": "Dana Eskelson",
               "profile_path": "/cpOT9ELQJkBGn3z1FoAL0OY3AFM.jpg",
               "id": 73569,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mr. Massie",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c699",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c69f",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6a5",
               "name": "Richard Jefferies",
               "profile_path": null,
               "id": 73570,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6ab",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6b1",
               "name": "Richard Jefferies",
               "profile_path": null,
               "id": 73570,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c6b7",
               "name": "Lata Ryan",
               "profile_path": null,
               "id": 12631,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c6bd",
               "name": "Annie Stewart",
               "profile_path": null,
               "id": 6116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6c3",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6c9",
               "name": "Declan Quinn",
               "profile_path": null,
               "id": 6117,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c6cf",
               "name": "Dylan Tichenor",
               "profile_path": null,
               "id": 1809,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5823d6b09251411a41001670",
               "name": "Michael Trent",
               "profile_path": null,
               "id": 1327842,
               "department": "Editing",
               "job": "First Assistant Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.086568,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12767,
      "vote_count": 152,
      "budget": 0,
      "overview": "Wanting to escape city life for the countryside, New Yorkers Cooper Tilson (Quaid), his wife Leah (Stone) and their two children move into a dilapidated old mansion still filled with the possessions of the previous family. Turning it into their dream house soon becomes a living nightmare when the previous owner (Dorff) shows up, and a series of terrifying incidents lead them on a spine-tingling search for clues to the estate's dark and lurid past",
      "similar": [
         3134,
         11564,
         8810,
         281,
         948,
         298312,
         22323,
         4771,
         12162,
         949,
         170,
         241,
         431,
         793,
         101,
         562,
         1359,
         141,
         681,
         281957
      ],
      "original_title": "Cold Creek Manor",
      "runtime": 118,
      "poster_path": "/yIfGja2k9UCOm1ed8yiz9VKaJsE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "2003-09-19",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "The perfect house hides the perfect crime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Figgis"],
      "runtime": 118,
      "synopsis": null,
      "writers": ["Richard Jefferies"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0331468/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4OTIwNDgzOF5BMl5BanBnXkFtZTcwNDYwNDAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dennis Quaid, Sharon Stone, Stephen Dorff | See full cast and crew »"],
      "reviews": [
         "Many audience members of this thriller were disappointed (mostly thanks to the misleading trailer for the film) because it lacked the supernatural element they thought would be present. They needn't have complained. The film is complete science fiction because not one character in the entire thing remotely behaves like a human being! Quaid and Stone play an NYC couple with high-end careers and two mouthy, spoiled kids who, after one of the children is nearly creamed by an SUV, decide to pack up and move to the country. They find a huge, dilapidated house that is exceedingly reasonable in price (this part of the movie has been done over and over in the cinema from \"Burnt Offerings\" to \"The Watcher in the Woods\" et al.) Before they have completely unloaded all the debris from the previous owner (who was foreclosed upon during a jail sentence for manslaughter), the owner (Dorff) shows up and begins to encroach on the desired peacefulness of the family. Quaid hires him to refurbish the swimming pool and before long, Dorff has decided to do almost anything to rid the house of the new owners. The rest of the film deals with the battle of wills between Quaid and his family and Dorff while Quaid seeks to find out why Dorff is so bent on driving them out. Even if Dorff got the family to leave, the property would still not be his legally and he is clearly in no position to buy it back, so even the basic premise of the story lacks solidity. That's the least of the problems, though. Throughout the film, everyone in it acts like a complete idiot. Quaid (in a surprisingly emasculated role, not that that's entirely a bad thing) makes so many stupid decisions at every turn. He does appear handsome and tan in the film, but his character is pretty dim. Stone overacts horrendously. Noted for her cool, chilly roles in films like \"Sliver\", \"Intersection\" and \"Basic Instinct\", here she is a hopelessly edgy bundle of nerves who squeals and screams every time anything unexpected happens like someone coming to the door or coming out of the water and having someone at the edge of the pool! This is apparently a lame attempt to have some \"frightening\" clips to stick in the trailer so that people wouldn't know that the film is actually a lengthy struggle between a family and a bum and not a haunted house chiller. Dorff does succeed with the impossible. He creates a character who is unbalanced and threatening and vulgar, yet also sexy and even sympathetic to a point. His is the most interesting work in the film, though his character is pitifully underdeveloped. Other cast members include a well-cast Lewis as a sleazy, boozy tramp, Eskelson as the planet's most useless Sheriff and Plummer, who steals scenes lying down and nearly comatose, as Dorff's craggy, cruel father. Without question, one of the fall-down funniest scenes in the film is meant to be one of the scariest. Ridiculously, each member of the household comes into contact simultaneously with a different terrifying snake (at the precise same time!) They then proceed to bounce through the house like pinballs, screaming at everything and nothing and over emoting to the point of true hilarity as they encounter snake after snake. This scene alone guarantees the film a spot in bad movie heaven. Many other senseless and unintentionally funny moments happen during the \"scary\" parts. Another horrible aspect of the film is the annoying and inappropriate musical score which, amazingly, was written by the director! He undermines his own film's suspense and tension with such dreadfully bad (and badly timed) music cues. The film is unbelievably illogical and bad in more ways than there is time to detail, but it is watchable, especially if one is in the mood to laugh rather than cower.",
         "OK we've all seen this type of film before, family leave problems and life in the city for a new start in the country only to find far greater and real problems than those they left behind. Unfortunately it's just not done particularly well in this movie. It starts well and gives the impression it will lead into some kind of haunted mansion movie once the family arrive at their new home. However, what happens is far less exciting. Quaid gives another solid but unremarkable performance, Dorff is passable but his character never seems as threatening as he should be, Lewis plays the kind of role she seems to fit like a glove. The one thing I realised from this film is Sharon Stone has no impact or presence on the screen at all, I mean she had an impact on me when I was 15 and first saw Basic Instinct, but hey. She is one of the few actresses I would actually advise to only accept films with nudity scenes involved. The direction is only apt, you feel there is meant to be some kind of attraction or sexual tension between Dorff's and Stone's character but whether due to the fault of the Director or actors it does not work at all. It is also at times very predictable, which is not a good factor for a thriller. The film does have it's redeeming features, it does at least keep you interested enough to follow through to the climax just to see what happens. It is one though you will not be revisiting soon again.",
         "It's 4:30 a.m. Top executive Mom groans, thumps off the alarm and staggers out of bed. She's got an early morning flight. Respected film-maker Dad mumbles, \"Remember to reset the clock.\" She doesn't, of course. It's 7:56 a.m. Dad squints at the clock, hollers, \"Oh, s**t! Kids, up, up, up, up!,\" followed by, \"We're late. Your mother forgot to reset the alarm. Again!,\" as he slams together that staple of popular cinema, the breakfast no-one has time to eat. It's never occurred to either of these Movers and Shakers to buy a second clock. Their alarm-challenged children clatter downstairs, the daughter whining, \"Ohmigod, it's late. I have to be at school early today!\" Buy an alarm clock, kid. Better yet, read the little book that comes with your beloved mobile phone and see if it has an alarm function. After hanging Mom for the clock fiasco, Dad decides \"the city\" is to blame for all their woes. The Green Acres Four treat themselves to an unauthorised viewing of a crumbling country estate that's been foreclosed by the bank. The house is furnished. There's an unmade bed. Yet they roam freely, snooping through family photos and papers. They buy The Old Massie Place at a knockdown price. Dad's inspired to create one of his \"labour of love\" documentaries. This consists of \"creating a time-line\" (i.e., skewering vintage photographs with thumbtacks) and having a goggle at some highly personal Polaroids of the previous owner's wife. Out of \"miles\" of home movie footage, a poolside scene featuring this attractive young woman and her daughter in bikinis seems to be especially pertinent. When \"Just Out of Jail\" Dale Massie shows up looking for work, Dad ignores the protests of his vulnerable teenage daughter and hires the guy for unsupervised work around the house. This is even stupider than the alarm clock situation. The only vaguely plausible reason Dad could have for inviting this guy into the family home is to help with the documentary. Dale's brimming with family anecdotes (\"my grandmother built that pool in 1926\"), but Dad acts bored and exasperated when he's around. In a classic scene, Dad's tinkering about on his laptop with archive footage of NYC. Since his budget to too low to hire voice-over talent, his own voice is droning on about cast-iron architecture. Wielding one of the farm implements Dad doesn't have a clue about, shirtless, sweaty Dale explains that it's a killing hammer, designed by Grandpa Massie and his blacksmith. Articulate, informative and sleazily attractive, he winds up his narrative with, \"Look at the spike. Straight into the brain. A small little clean hole right through the skull. Bam! No bone splinters. No pain.\" Grab your camera, Dad! This is Good Stuff! But no, Dad can't wait for Dale to hightail it out of the house so he can go back to making The Most Boring Documentary in the World. Throw in Dead Meat the Pony and Mobiles Don't Work in the Valley, and you've got all the ingredients for a nice long snooze. Don't forget to set the alarm.",
         "I've seen way flakier movies that were smash hits. Most Hollywood thrillers & action movies have to be viewed with a willing suspension of disbelief anyhow. People do things they'd never do in real life. They ask stupid questions & accept answers that no one with a high school education and an IQ in even low triple digits would accept in real life. They walk away from falls, car crashes and burning buildings that would kill real human beings. They *split up* to look for the ghost/axe murder/evil demon! So, what's wrong with this one? I got involved. I got tense. I was on the edge of my seat. I liked it. The tension was built up without any reference to gory scenes, just creepy camera angles, shadows, the wind blowing curtains, the increasing feeling that Something Really Bad was just around the corner. You get to see Sharon Stone looking almost like an ordinary human being. Dennis Quaid is his usual edgy self. Stephen Dorff does a great slide into madness. If I'd believed everything I read about it, I never would've picked up the DVD. It's not Hitchcock, but it's definitely worth watching. Check it out.",
         "Cold Creek Manor is just a collection of sad, tired \"thriller\" clichés. I know it's a bad sign when I'm rooting for the victims to die. Characters say and do things for no reason, apparently, other than the writer wanted to make the movie last just a little bit longer. Rest assured that if a course of action makes no sense or is just a bad idea in general the story will follow it. As if that weren't bad enough, the characters are all cardboard cut-outs without any depth. Seemingly all the women in this movie are, in the words of Mr. Massie \"cheatin' whores.\" Small town America is once again Hollywoodized into too-close-for-comfort chumminess on the one side and we don't take kindly to strangers xenophobia on the other. Once again the movies tries to impart to us the dangers of moving to the country. Although Quaid's mild-mannered, pushover character works for the most part. Finally, the sound editing leaves a lot to be desired, lines are muttered requiring the use of subtitles to understand some parts. And the music that is supposed to evoke a sense of suspense just comes across as annoying.",
         "Cold Creek Manor Here's yet another film that I believe suffered from some poor advertising. Or, at the very least, some misguided advertising. As I recall when it was released, there was a strong vibe to those ads that indicated some sort of haunted house or ghost story or something. So it came up on Encore, I remembered those ads and wanted to see what kind of haunted house story I was going to get. Dennis Quaid and Sharon Stone? Sounds alright. I'm not generally a big fan of haunted house pictures, but I figured I'd give it a look. At least it's rated R, right? Well, well, well... So. So where are the ghosts and sh*t? Turns out this is not the ghost story I thought it was... A big, rich family from \"the big city\" (I think it was Boston or New York--of course--everyone's from either those cities or LA these days) gets fed up with the hustle and bustle and insanity of living in the city and decide to move out to the middle of nowhere. They stumble upon a glorious old house in glorious old decay--Cold Creek Manor. The house is owned by a bank ready to off-load it for whatever they can get for it. Apparently, they could get around 200 grand for it. Sh*t, this house is huge! The property goes on forever! There are houses in the Twin Cities here that are 1/6th as big as the house in this film that cost more than that! Anyway, eventually, the last surviving, capable, member of the family that once lived there turns up, fresh from prison, and a little annoyed that his house is all gone. So he starts terrorizing the family all slowly and methodically and weirdly... Or does this family just have some really rotten luck...? Well, at any rate, Dennis Quaid thinks the guy is out to get them and goes mildly berserk trying to prove it. He's a documentary filmmaker, and it doesn't help matters that he's doing his current documentary on the family that lived in that big ol' mansion before he and his family moved in. Here's the breakdown: The Good: --The acting is generally pretty good (one scene I'll point out later is the exception) --Dennis Quaid and Sharon Stone after all. She's done well to prove she's more than just a remarkable specimen of femininity--she's also an actress, after all. --Impressive sets--that house is beautiful--from the decaying look of it's years of neglect to it's remarkable half-restoration--it's a great lookin' place to live. --Fairly interesting story. --Pretty good chemistry between Sharon Stone and Dennis Quaid, they're characters (the married couple) endure arguments and crumbling marriage with hints of adultery. Didn't Hurt It, Didn't Help: --The atmosphere was pretty mild. Nothing special, and nothing doing a really intriguing job of building tension. --The usual plot-point that one part of the mystery can only be solved by a chance discovery by the children is, of course, present here too. --Average Cinematography. --Some very mild blood/gore scenes. Mostly, with just some blood--and a skeleton or two. Nothing major. Looked good, but wasn't anything special. --Only mild violence. Fight scenes, mostly. --Very mild nudity, and one sex scene--through window blinds no less. The nudity is pretty much relegated to pictures--photographs--of the wife of the last member of Cold Creek's original family. The Bad: --Sharon Stone kept her clothes on. Okay, I'm kidding. She did, but that didn't hurt the film in any way. --The music varies from average, to simply obnoxious. We get scenes that contain mild drama, but have a piano pounded on with a feverish, near lunatic intensity. Here's an example: Car driving down stretch of road, someone's worried about an argument--overcast with DUNN-DUNN-DUNN-DUNN-DUNN-DUNN-DUNNNNN!!!! as loud as the howling of hell beasts in hell. --One exceptionally poor scene where the family is apparently threatened by generally harmless American mountain snakes. The snakes slowly slither to and fro through the house and everybody freaks out with enough overacting to match any Keanu Reeves scene. It just wasn't scary. Not at all. Maybe, if there were tons and tons of snakes--like in \"Raiders of the Lost Ark\" it would've been mildly scary. But whole family is running away from a terrifying torrent of roughly 6 snakes. The scene, very simply, wasn't believable. I almost laughed at it--it was that stupid. --Some clichés and cheesiness pop up occasionally. No real surprises. The Ugly: --Occasionally feels like a \"Deliverance\"-style \"big city folks out 'n their element\" movie--but not as good as \"Deliverance\" (which is a classic). Memorable Scene: --Dennis Quaid punches Sharon Stone in the face. Oopsy! Acting: 7/10 (except for that one scene) Story: 6/10 Atmosphere: 5/10 Cinematography: 5/10 Character Development: 7/10 Special Effects/Make-up: 7/10 (not much to note) Nudity/Sexuality: 2/10 (quantity) Violence/Gore: 6/10 Sets/Backgrounds: 8/10 Dialogue: 7/10 Music: 3/10 Writing: 6/10 Direction: 6/10 Cheesiness: 3/10 Crappiness: 0/10 Overall: 5/10 I'm giving it a 5 because the film suffers from a few too many problems. It's probably good for fans of horror/thrillers to take a look at, but is likely too mild for hardcore horror fanatics to care about. Better, maybe, for the average movie-goer looking for a light thriller to spend an evening with. www.ResidentHazard.com",
         "Cold Creek Manor 2003 Ugh. Slow paced, slow witted. Poorly written. The most interesting character was the bad guy (Stephen Dorff) and he was as cookie-cutter as the rest. What happened to Dennis Quaid? I'll tell you. He recognized early on that this movie was a dud. His performance throughout ranges from sleepwalking to hysterical over-acting. Sharon Stone has an excuse. She's not often accused of being a good actress or choosing good movies (though The Quick and the Dead is one of my all time favorites). It's not that the story has plot-holes. It probably does but the fact that it's so mind-numbingly boring makes that irrelevant. And that's really the Cardinal Sin of a movie, no? A movie can be bad, yet entertaining (Plan 9 From Outer Space). A movie can be offensive to the point you don't want to watch it, but still well done. A movie can be insulting in it's blatant propaganda, but still maintain interest and create discussion. This movie is just boring.",
         "Otherwise known as \"Cape Fear For Dummies\", this is a hideously lame \"suspense thriller\" that is not suspenseful or thrilling. At all. Dennis Quaid and Sharon Stone play a married couple who decide to move out of the big city after one of their kids is almost hit by a car. So they buy a big, dilapidated mansion in the sticks called \"Cold Creek Manor\" and start fixing it up. Then, showing tremendous smarts, they hire Dale Massie (Stephen Dorff), the creepy former owner of the house, to help fix it up. Even though they know he just got out of prison, AND the fact that they just found him roaming around in their house. Guess what? He's a psycho! Since there's really nothing of worth in this movie at all, I'm just going to offer 10 reasons why you SHOULDN'T see \"Cold Creek Manor\"... 1. It's so predictable and formulaic that to call it by-the-numbers is an insult to numbers. 2. The name of Quaid's character is \"Cooper Tilson\". What kind of name is \"Cooper Tilson\"? The kind you'd only find in a movie. 3. You'll get depressed when you realize the same guy who directed the great \"Leaving Las Vegas\" (Mike Figgis) also directed this piece of crap. 4. The huge amount of plot holes, stupid coincidences, lapses in logic, and crummy dialogue will lead you to believe that the script was written by a 4 year-old. 5. At one point, while playing hide-and-seek, one of the kids finds part of an old wooden sign on the ground that actually says \"EVIL\" in big letters. Oooooh, scary! 6. When Massie lets loose snakes in the house, they all attack each separate family member at the EXACT SAME TIME. That's convenient. 7. It's boring. 8. It's really, really boring. 9. It's so boring that you'll leave knowing the exact number of lights that go up and down the theater aisle. 10. It sucks.",
         "The director and producer of documentaries Cooper Tilson (Dennis Quaid) and his wife, the executive Leah Tilson (Sharon Stone) have a stressed life with their two children in New York. After a minor accident with their son Jesse (Ryan Wilson), they decide to move to the country. They find a huge old house with furniture and a large field for a bargain and decide to buy it. They make a garage sale to get rid of the possessions of the former owner, and a couple of days later, Dale Massie (Stephen Dorff) visits them, introducing himself as the previous owner, who lost the house for the bank after being sent to the prison for three years for accidentally killing a man. He asks for a job in the repair team, and Cooper accepts to hire him. The life of the Tilson family changes after the arrival of Dale, and deep secrets about the former family are disclosed. \"Cold Creek Manor\" is a Mike Figgis' thriller, having names such as Dennis Quaid, Sharon Stone, Julliete Lewis and Stephen Dorff in the credits; therefore I expected a great movie. Most of the time, I kept saying to myself: \"-Surprise me, surprise me\". Indeed this film surprised me, in a bad sense: it is nothing but a standard and bureaucratic thriller, full of clichés and incredible situations. For example, who would hire a weird man, former owner of a property and that has just left the jail? Or when Cooper is threatened, why he stays alone in the isolated house, with doors and windows completely open? Or when Leah and Tilson are threatened, why do they look for refugee in the house, climbing to the higher floors, after seeing their car on fire? This movie is a typical commercial product, broadcast on Saturday night by the largest Brazilian open network: shallow, predictable and full of stars. My vote is five. Title (Brazil): \"Garganta do Diabo\" (\"Devil's Throat\")",
         "Stupid horror film that was marketed as a supernatural mystery but is rather a dumb mortal tale of two city slickers (Dennis Quaid and Sharon Stone) who take their kids out of New York City after a near-fatal car crash and buy a huge manor in the middle of nowhere. Unfortunately for them, Dale, the old owner, gets out of prison and comes looking for them, eager to cover up a murderous secret that has been buried inside the house (or around it?) for years. Dennis Quaid is a documentarian and his wife does nothing but mope about. As he does everything in the house, including making breakfast, she whines that she does too much. Just one of many laughable moments in this straight-to-video-style thriller that boasts a good cast giving watered-down performances. They knew what they were getting into. The movie is dumb. This could have made a great supernatural thriller. That's what I thought it was, anyway. 2/5 stars. - John Ulmer"
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Red Mullet",
         "Cold Creek Manor Productions"
      ],
      "summaries": [
         "Wanting to escape city life for the countryside, New Yorkers Cooper Tilson (Quaid), his wife Leah (Stone) and their two children move into a dilapidated old mansion still filled with the possessions of the previous family. Turning it into their dream house soon becomes a living nightmare when the previous owner (Dorff) shows up, and a series of terrifying incidents lead them on a spine-tingling search for clues to the estate's dark and lurid past...",
         "A family relocates from the city to a dilapidated house in the country that was once a grand estate. As they begin to renovate the place they discover their new home harbors secrets, conceals a horrific past, and may not be free of the former inhabitants completely."
      ],
      "budget": 0
   },
   "movielensId": 6751,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-09-19",
      "dvdReleaseDate": "2004-03-02",
      "directors": ["Mike Figgis"],
      "runtime": 118,
      "movieId": 6751,
      "title": "Cold Creek Manor",
      "mpaa": "R",
      "actors": [
         "Dennis Quaid",
         "Sharon Stone",
         "Stephen Dorff",
         "Juliette Lewis",
         "Kristen Stewart",
         "Ryan Wilson",
         "Dana Eskelson",
         "Christopher Plummer"
      ],
      "imdbMovieId": "0331468",
      "originalTitle": "Cold Creek Manor",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["EUKuySo1mzs"],
      "plotSummary": "Wanting to escape city life for the countryside, New Yorkers Cooper Tilson (Quaid), his wife Leah (Stone) and their two children move into a dilapidated old mansion still filled with the possessions of the previous family. Turning it into their dream house soon becomes a living nightmare when the previous owner (Dorff) shows up, and a series of terrifying incidents lead them on a spine-tingling search for clues to the estate's dark and lurid past",
      "tmdbMovieId": 12767,
      "avgRating": 2.40865,
      "releaseYear": "2003",
      "numRatings": 416,
      "posterPath": "/yIfGja2k9UCOm1ed8yiz9VKaJsE.jpg"
   }
}