{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0109129",
      "video": false,
      "title": "Angie",
      "recommendations": [
         57685,
         40344,
         141127,
         41590,
         40634,
         106143,
         116014,
         22711,
         39473,
         40480,
         45712
      ],
      "backdrop_path": "/su8F3l9wJzzhQ4H4TQFJR14xAnz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 22,
               "character": "Angie Scacciapensieri",
               "gender": 1,
               "credit_id": "52fe48b69251416c91095d7d",
               "name": "Geena Davis",
               "profile_path": "/6b8cRJOItz7yNpYuLCPkl5kv4m2.jpg",
               "id": 16935,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Noel Riordan",
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d59",
               "name": "Stephen Rea",
               "profile_path": "/taD1NngDbW8cyCuacAT3YaecSEG.jpg",
               "id": 9029,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Vinnie",
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d5d",
               "name": "James Gandolfini",
               "profile_path": "/19r3knxqTAPUgfItOPXg3ouOcpI.jpg",
               "id": 4691,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Tina",
               "gender": 0,
               "credit_id": "52fe48b69251416c91095d61",
               "name": "Aida Turturro",
               "profile_path": "/hvQKy8ZdeWWVBgLbeczkm0kyAgU.jpg",
               "id": 106791,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Frank Scacciapensieri",
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d65",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Kathy",
               "gender": 1,
               "credit_id": "52fe48b69251416c91095d69",
               "name": "Jenny O'Hara",
               "profile_path": "/jfEnP388TYX8kGyrD4MOadyOJRb.jpg",
               "id": 4734,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d6d",
               "name": "Michael Rispoli",
               "profile_path": "/mRS7DAXhuLu8Z7PAlicm6kP0EZz.jpg",
               "id": 18313,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Joanne",
               "gender": 1,
               "credit_id": "52fe48b69251416c91095d71",
               "name": "Betty Miller",
               "profile_path": null,
               "id": 614230,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Ballerina",
               "gender": 0,
               "credit_id": "52fe48b69251416c91095d75",
               "name": "Susan Jaffe",
               "profile_path": null,
               "id": 929946,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Lover",
               "gender": 0,
               "credit_id": "52fe48b69251416c91095d79",
               "name": "Jeremy Collins",
               "profile_path": null,
               "id": 929947,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Young Joanne",
               "gender": 1,
               "credit_id": "52fe48b69251416c91095d87",
               "name": "Marin Hinkle",
               "profile_path": "/cdSW58BExmrfRCfcOfKPZblDSxI.jpg",
               "id": 65760,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48b69251416c91095d1f",
               "name": "Martha Coolidge",
               "profile_path": "/6XDmHbCLMtzvVU8h5ZauG8CkSIl.jpg",
               "id": 63713,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b69251416c91095d25",
               "name": "Avra Wing",
               "profile_path": null,
               "id": 929944,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d2b",
               "name": "Todd Graff",
               "profile_path": "/jk44OP76UtK5D8bmNkJFqagwziq.jpg",
               "id": 18342,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d31",
               "name": "Roger Birnbaum",
               "profile_path": null,
               "id": 4504,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d37",
               "name": "Larry Brezner",
               "profile_path": null,
               "id": 11957,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d3d",
               "name": "Todd Graff",
               "profile_path": "/jk44OP76UtK5D8bmNkJFqagwziq.jpg",
               "id": 18342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48b69251416c91095d49",
               "name": "Joe Roth",
               "profile_path": "/lUtmB3mtMPrA5hhoEwZBeX1U5uL.jpg",
               "id": 18311,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d55",
               "name": "Steven Cohen",
               "profile_path": null,
               "id": 19452,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b69251416c91095d83",
               "name": "Johnny E. Jensen",
               "profile_path": null,
               "id": 63728,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54ec413d92514179710012d3",
               "name": "Patrick McCormick",
               "profile_path": null,
               "id": 57465,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "571fb8e7925141531b0001cb",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.935649,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 83714,
      "vote_count": 14,
      "budget": 0,
      "overview": "Angie lives in the Bensonhurst section of Brooklyn, N.Y. and dreams of a better life than everyone she knows. When she finds that she is pregnant by her boyfriend Vinnie, she decides that she will have the baby, but not Vinnie as a husband. This turns the entire neighborhood upside down and starts her on a journey of self discovery. This journey includes her family, a new lover and her life. Even her best friend Tina has trouble understanding Angie. Written by Tony Fontana",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         10735,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Angie",
      "runtime": 107,
      "poster_path": "/9GIaom6F54XQDlgtl7vBPX5unH1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1994-03-04",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martha Coolidge"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Avra Wing",
         "Todd Graff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109129/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNjYwNzM1N15BMl5BanBnXkFtZTcwNDIzNTQyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Geena Davis, Stephen Rea, James Gandolfini | See full cast and crew »"],
      "reviews": [
         "Originally intended for Madonna (who can't act & would have definitely STUNK!), this was an excellent role for Geena Davis. \"Angie\" is a film about an Italian/American woman from the Bensonhurst section of Brooklyn, N.Y. Her mom left her when she was a child & because of this she has a romanticized notion of her mother & a deep fear of abandonment. She wants more out of life than her working class plumber boyfriend (and father of her child) can offer her so she falls in love with a lawyer from Ireland while pregnant(someone as far removed from her Brooklyn world as possible!) After the baby is born, the lawyer dumps her & she also feels rejected by her son (you'll have to see the movie to find out why) so she heads off to Texas to finally face her mom for some type of closure. Yes, this character's angst & situations can be overwhelming , but real life can be like that too sometimes. The musical score, by Jerry Goldsmith, is excellent (particularly \"Angie's Theme\") & compliments the movie wonderfully. The movie also has a knack for capturing the New York Italian/American experience authentically. At times, \"Angie\" feels like a hybrid of other films (\"Working Girl\", \"Beaches\", \"Saturday Night Fever\", \"Moonstruck\" & \"Pretty Woman\") but it works. (This film is based on the novel \"Angie, I Says\" by Avra Wing. In the book the main character's name is Tina Scacciapensiari & her best friend's name is Angie. The first names of these characters were switched for the film).",
         "I'm a guy, and as such, chick flicks aren't my forte. However, having watched this movie with my family, I can say it's not half bad. Geena Davis is an intriguing actress. She always has a decent, good-natured way about her characters, and that really shows through in this film. It's an effective story about coping with family issues in an Italian-American family. Davis' title character has to deal with raising a newborn without the support of the child's father, and that throws everything in her life into a tailspin. I wouldn't exactly say it's a memorable work on Davis' resume, but it's a quality movie none the less. I'd recommend it as a family movie, more for the parents than the children.",
         "The protagonist (Geena Davis) was told she was abandoned by her mother, grew up with secrecy surrounding the whereabouts of her mother, was lied to, and felt abandonment issues that she had to deal with -- much like an adoptee. Her stepmother tried to pretend she was the mother of Gina's charactor. Geena's character left her own baby for awhile, but regretted it later. One amazing and gratifying detail for me is when the step-mother character admitted that Geena's charactor was the mother of her child and \"we\" (her and her husband) had no rights coming between them (which they had been trying to do). So unlike mothers in real life, this woman was allowed to reclaim her child after she dealt with her problems. It's a good movies for exploring adoption issues.",
         "Comedy-drama from talented if erratic director Martha Coolidge concerns a modern Italian-American working woman in Brooklyn, pregnant and unmarried, finding herself curious about the mother who abandoned her and her father years before. Begins brightly, with Geena Davis seemingly well-cast in the lead, but it quickly becomes mired in colorless sub-plots (including the woman's resentful best friend and her abusive husband, a schizophrenic mother, a needy stepmother, a malformed infant, and a married boyfriend!). By the midway point, Davis begins to struggle in her role, pushing her pivotal moments too hard and losing her innate likability. Worse, this scenario is far too neat and tidy--and when the actors aren't being overly 'cute', they're screaming senselessly at each other. Sadly, \"Angie\" bombs out. *1/2 from ****",
         "Gina is a wonderful actress and she is marvelous in this realistic portrayal of life in New York City. In all her moods her personality rings true. The film leaves some unanswered questions but so does life.",
         "Though Geena Davis is a great actress, good at playing particularly strong-willed women, the screenplay for \"Angie\" just meanders all over the place, from light comedy to the staunchest of melodramas. I mean, what kind of a movie has a woman go into labor while gyrating in a Santa Claus suit then show her give birth to a one-armed baby, get abandoned by her married lover, watch as her stepmother breast-feeds the one-armed baby, abandons said baby, finds her long-lost mother (who it turns out is a schizophrenic), learns that one-armed baby is in a coma... all in about 15 minutes. This was one of the most uneven films I've ever seen. Turturro's particularly good in it as the best friend, yet her character is left out of the final half hour, though she's a central character, and never returned to. Rea and Gandolfini's potentials are completely wasted in a movie that just doesn't seem to know what to do with itself.",
         "It will bring you to tears and make you laugh. Angie lives in the Bensonhurst section of Brooklyn and dreams of a better life than everyone she knows. When she finds that she is pregnant by her boyfriend Vinnie, she decides that she will have the baby, but not Vinnie as a husband. This turns the entire neighborhood upside down and starts her on a journey of self discovery. This kind of sentimental character piece needs a tight focus so all of the nuances of the characters shine through. The characters in this film have a lot of depth, and that makes all the difference. I give this one a rating of 7 out of 10.",
         "So THIS is where they concocted the cast for the \"Sopranos\". Go figure. Three of the character actor cast members go on to the best show on television. And \"Geena Davis\", a damned Oscar winner, gets saddled with the \"Geena Davis Show\". If Geena Davis were Italian..I guess she'd have landed the Edie Falco role. I think there ought to be a Congressional inquiry into the matter. Something tells me that during the shoot for \"Angie\", David Chase was standing on a grassy knoll...hey...call me a conspiracy theorist...but I'll be willing to bet I'm right. Back and to the left..back and to the left.....",
         "The video box cover promised hopeful viewers that the film contained inside was \"a heartwarming story brimming with irrepressible fun. This was not so. We laughed at the movie, but certainly not with it. Telling the story of a hysterical, irresponsible and certainly resistable woman, this movie may be praised by critics but whatever quality they saw in it must have wound up on the cutting room floor. The characters are unlikable and obnoxious, the plot meanders without ever deciding where it wants to go, and sheer lethargy kept us from doing what we should have done five minutes into the film and shown our VCR some mercy. Do yourself a favour and avoid this mess, whatever the video box may say.",
         "Geena Davis and a few veterans from the popular TV series, \"The Sopranos\" are featured in this 1994 comedy/drama claptrap from Hollywood Pictures. Davis is in the title role as an unmarried and pregnant woman who decides to leave the pressures of the big city life and start over in a more relaxed setting. The film could've been a little better if more screen time were given to Tony Soprano himself, James Gandolfini (who was very effective in bit parts and minor supporting roles before \"The Sopranos\" made him a breakout star)."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Hollywood Pictures",
         "Morra, Brezner, Steinberg and Tenenbaum Entertainment (MBST)"
      ],
      "summaries": [
         "Angie lives in the Bensonhurst section of Brooklyn, N.Y. and dreams of a better life than everyone she knows. When she finds that she is pregnant by her boyfriend Vinnie, she decides that she will have the baby, but not Vinnie as a husband. This turns the entire neighborhood upside down and starts her on a journey of self discovery. This journey includes her family, a new lover and her life. Even her best friend Tina has trouble understanding Angie.",
         "Favorite quote \"We are all broken. Those of us who are less broken need to help those who are more broken.\""
      ],
      "budget": 0
   },
   "movielensId": 6788,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-03-04",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Martha Coolidge"],
      "runtime": 107,
      "movieId": 6788,
      "title": "Angie",
      "mpaa": "",
      "actors": [
         "Geena Davis",
         "Stephen Rea",
         "James Gandolfini",
         "Aida Turturro",
         "Philip Bosco",
         "Jenny O'Hara",
         "Michael Rispoli",
         "Betty Miller",
         "Susan Jaffe",
         "Jeremy Collins",
         "Marin Hinkle"
      ],
      "imdbMovieId": "0109129",
      "originalTitle": "Angie",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["RZnQUeyz4Tc"],
      "plotSummary": "Angie lives in the Bensonhurst section of Brooklyn, N.Y. and dreams of a better life than everyone she knows. When she finds that she is pregnant by her boyfriend Vinnie, she decides that she will have the baby, but not Vinnie as a husband. This turns the entire neighborhood upside down and starts her on a journey of self discovery. This journey includes her family, a new lover and her life. Even her best friend Tina has trouble understanding Angie. Written by Tony Fontana",
      "tmdbMovieId": 83714,
      "avgRating": 2.4901,
      "releaseYear": "1994",
      "numRatings": 101,
      "posterPath": "/9GIaom6F54XQDlgtl7vBPX5unH1.jpg"
   }
}