{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1051245",
      "video": false,
      "title": "Moving Midway",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Expert",
            "gender": 0,
            "credit_id": "52fe4a49c3a368484e14ad7f",
            "name": "Bruce Chadwick",
            "profile_path": null,
            "id": 1072286,
            "order": 0
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4a49c3a368484e14ad7b",
            "name": "Godfrey Cheshire",
            "profile_path": null,
            "id": 1072285,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.074198,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 120528,
      "vote_count": 2,
      "budget": 0,
      "overview": "When New York film critic Godfrey Cheshire returns home to North Carolina in early 2004 and hears that his cousin Charlie Silver plans to uproot and move the buildings of Midway Plantation, their family’s ancestral home, an extraordinary, emotional journey begins.",
      "similar": [],
      "original_title": "Moving Midway",
      "runtime": 95,
      "poster_path": "/k5fK62r3vKMOc8fRpu7z6iC0yz1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-04-14",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.movingmidway.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Godfrey Cheshire"],
      "runtime": 95,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1051245/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0OTE5OTcyOF5BMl5BanBnXkFtZTcwNjkzNjYwMg@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Chadwick | See full cast and crew »"],
      "reviews": [
         "MOVING MIDWAY is the saga of 'Midway Plantation', ancestral home to the family of Godfrey Cheshire, the director of the film. In the winter of 2003 Cheshire learned that his cousin, Charlie, caretaker and owner of the mansion and huge estate is going to move the antebellum home to a new location a few miles away due to intense commercial development in the area. During the preparation for the move, the director is contacted by a black man, Robert Hinton, Associate Director of African-American studies at New York University who turns out to be a blood relative, and this development allows Cheshire to show how the specter of slavery impacted the family legacy. The film examines how family members of both races exchange details of their heritage, and come to terms with the relocation. Cheshire makes the case that much of what is considered 'historical fact' is based on biased opinion and myths which have been deeply influenced by popular culture, and especially Hollywood. The issue of Race is handled with great tact and gentility, however the fundamental component of Class is largely ignored. Although by the close of the film, we are introduced to many of the Black relatives, it is the White family members who have retained ownership of the land, and this is the source of the the family's substantial wealth. I wonder how the tone and content of the film would have changed if somebody had whispered the word, \"REPARATION\".",
         "This is a charming documentary, ostensibly about moving an historic family plantation home to a new setting, but actually about much more. The family's quixotic history, mingling white and black branches of the family, emerges gradually as the film progresses. We meet many fascinating characters, and hear many fascinating stories dating back to the Civil War. As the story evolves, new characters are introduced serendipitously as people in search of their ancestry emerge from far-flung places, including Harlem. Ultimately, the actual moving of the house is as fascinating and nerve-wracking as anything else in this idiosyncratic and very uplifting film. I can't recommend it highly enough."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["At Christmas 2003, New York-based film critic Godfrey Cheshire is visiting his family in North Carolina when his cousin Charlie Silver tells him something startling. Charlie inherited Midway Plantation, the ancestral home of his and Cheshire's extended family, and has been its devoted caretaker. But now Charlie and his wife Dena have made a decision: They want to move Midway - the antebellum manor house and several outbuildings - to a new location to escape Raleigh's encroaching sprawl. Can you really transplant a plantation? Will the \"place\" be the same if it is uprooted from the soil in which it has stood since 1848? Charlie's plan provokes immediate controversy in Cheshire's tradition-minded family. For Cheshire, it brings back memories of the wild, strange and magical place Midway seemed when he was a child, and of the stories he heard there - stories of his mother's family, the Hintons, settling the area in the early 1700s, fighting in the Revolution, being invaded by Yankee troops in the Civil War, and surviving Reconstruction. Yet stories, Cheshire realizes, both convey and conceal. The reality of the Southern plantation was that it depended on the institution of slavery. In Cheshire's family, stories of slaves always depicted them as happy and devoted, which surely disguised a more painful, complex reality. In fact, Midway bred two sets of Hintons, one white, one black. For years, they have rarely encountered each other. But that begins to change as Cheshire sets out to chronicle Charlie's attempt to move Midway."],
      "budget": 0
   },
   "movielensId": 68337,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-04-14",
      "dvdReleaseDate": "2009-02-17",
      "directors": ["Godfrey Cheshire"],
      "runtime": 95,
      "movieId": 68337,
      "title": "Moving Midway",
      "mpaa": "",
      "actors": ["Bruce Chadwick"],
      "imdbMovieId": "1051245",
      "originalTitle": "Moving Midway",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "When New York film critic Godfrey Cheshire returns home to North Carolina in early 2004 and hears that his cousin Charlie Silver plans to uproot and move the buildings of Midway Plantation, their family’s ancestral home, an extraordinary, emotional journey begins.",
      "tmdbMovieId": 120528,
      "avgRating": 3.8,
      "releaseYear": "2007",
      "numRatings": 5,
      "posterPath": "/k5fK62r3vKMOc8fRpu7z6iC0yz1.jpg"
   }
}