{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "child murderer",
            "id": 1468
         },
         {
            "name": "shower",
            "id": 1879
         },
         {
            "name": "illegal immigration",
            "id": 2173
         },
         {
            "name": "freight train",
            "id": 2448
         },
         {
            "name": "kiss",
            "id": 5091
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "gang",
            "id": 10726
         }
      ],
      "imdb_id": "tt1127715",
      "video": false,
      "title": "Sin Nombre",
      "recommendations": [
         63310,
         15451,
         12473,
         10217,
         16876,
         11197,
         74666,
         21345,
         48868,
         12877,
         32084,
         10451,
         8342,
         81375,
         136902,
         106756,
         82941,
         48508,
         12149,
         12093
      ],
      "backdrop_path": "/f56HoLd7Fc1zgKBwGN6nvpTweDR.jpg",
      "revenue": 5101756,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Sayra",
               "gender": 1,
               "credit_id": "52fe440fc3a368484e00d1b9",
               "name": "Paulina Gaitán",
               "profile_path": "/6Ux2SsaCDj2KDV3vjKtixpB1jTc.jpg",
               "id": 36586,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "El Casper",
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1bd",
               "name": "Edgar Flores",
               "profile_path": null,
               "id": 87263,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "El Smiley",
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1c1",
               "name": "Kristyan Ferrer",
               "profile_path": null,
               "id": 87264,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Lil Mago",
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d1c5",
               "name": "Tenoch Huerta",
               "profile_path": "/3wGFejGaiDp65z4CrDZaItsPKgC.jpg",
               "id": 87265,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Martha Marlene",
               "gender": 1,
               "credit_id": "52fe440fc3a368484e00d1c9",
               "name": "Diana García",
               "profile_path": "/tiyuJAwS9jxyla9EVMlv0mSM0hj.jpg",
               "id": 87266,
               "order": 4
            },
            {
               "cast_id": 24,
               "character": "El Sol",
               "gender": 2,
               "credit_id": "53a9b16ac3a3687a31007268",
               "name": "Luis Fernando Peña",
               "profile_path": "/ddNLOirWUzYpuHQp9UfLsdcEoxh.jpg",
               "id": 91251,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Leche/ Wounded Man",
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d1cd",
               "name": "Héctor Jiménez",
               "profile_path": "/gdPEBAWjybV1eBp4qvFg2dj410j.jpg",
               "id": 57410,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d191",
               "name": "Cary Fukunaga",
               "profile_path": "/9BDeASL8E1Rr55fn0uQwEv1EAH6.jpg",
               "id": 87257,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d197",
               "name": "Gerardo Barrera",
               "profile_path": null,
               "id": 87259,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d19d",
               "name": "Pablo Cruz",
               "profile_path": null,
               "id": 87260,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1a3",
               "name": "Gael García Bernal",
               "profile_path": "/o4sdHKTBbF8GpooIwp5bvliubyY.jpg",
               "id": 258,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe440fc3a368484e00d1a9",
               "name": "Amy Kaufman",
               "profile_path": null,
               "id": 60476,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1af",
               "name": "Luis Carballar",
               "profile_path": null,
               "id": 276,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d1b5",
               "name": "Claudio Contreras",
               "profile_path": null,
               "id": 87262,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1d3",
               "name": "Craig McKay",
               "profile_path": null,
               "id": 4869,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d1dd",
               "name": "Marcelo Zarvos",
               "profile_path": "/yNS8st1i09XuB7dHEvkMhO3u5sD.jpg",
               "id": 55177,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440fc3a368484e00d1e3",
               "name": "Cary Fukunaga",
               "profile_path": "/9BDeASL8E1Rr55fn0uQwEv1EAH6.jpg",
               "id": 87257,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe440fc3a368484e00d1e9",
               "name": "Adriano Goldman",
               "profile_path": null,
               "id": 52530,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 7.482408,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 21191,
      "vote_count": 170,
      "budget": 0,
      "overview": "Set on the border, where Mexico becomes the crucible and the fearsome gangs of today’s Mexican countryside, the gauntlet, to freedom. The stories of a girl living in Honduras and hungering for a brighter future, and two teen gang members, for whom the Mara Salvatrucha is near their entire universe, become interlaced on the train to the border, a journey that will determine the future of their lives",
      "similar": [
         979,
         281957,
         445954,
         3134,
         994,
         2652,
         8456,
         829,
         4771,
         156022,
         281,
         37094,
         27576,
         339692,
         180863,
         395834,
         8999,
         185,
         13223,
         588
      ],
      "original_title": "Sin Nombre",
      "runtime": 96,
      "poster_path": "/ktzyg31ibW2MWTZh4KpKMCgtgt6.jpg",
      "spoken_languages": [
         {
            "name": "Polski",
            "iso_639_1": "pl"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/oappZpW9UoU3NXnjmooHlXmaPHE.png",
         "name": "Universal Studios",
         "id": 13,
         "origin_country": ""
      }],
      "release_date": "2009-03-20",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "The greatest sin of all is risking nothing.",
      "adult": false,
      "homepage": "http://www.filminfocus.com/focusfeatures/film/sin_nombre",
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cary Joji Fukunaga"],
      "runtime": 96,
      "synopsis": "El Casper (Edgar Flores) (aka 'Willy') is a gang member initiating a young boy into his gang. The boy is given the nickname \"El Smiley\" (Kristyan Ferrer) following a violent initiation. Casper is romantically involved with a girl, Martha Marlene, but keeps the relationship a secret from his gang, fearing for the girl's safety. When she follows him to a gathering of his gang, the leader, Lil' Mago (Tenoch Huerta Mejía), insists on escorting her away in private, despite the protests of Casper. Following his failed rape attempt, Lil' Mago accidentally kills her. He conveys this to Casper, telling him that he'll \"find another.\" Lil' Mago brings Smiley and Casper to La Bombilla, a location along the train tracks where illegal immigrants stow away on passing trains for travel to the United States. Among the illegal immigrants is the Honduran family the viewer has been introduced to consisting of a teenage girl Sayra (Paulina Gaitán), her father, and her uncle, who are on their way to New Jersey to live with relatives. Lil' Mago, Casper, and Smiley rob the passengers for any money they have until Lil' Mago spots Sayra and attempts to rape her. El Casper, still grief-stricken and possibly seeing parallels with Mago's treatment of his girlfriend, intervenes, killing Lil' Mago and urging Smiley off the train. Throughout the train ride, Sayra keeps approaching Casper with curiosity despite her father's advice. Smiley goes back to the gang, telling them what happened. Furious, the gang leader El Sol accuses Smiley of collusion. Smiley timidly protests, begging to be sent to kill Casper to prove his loyalty. Back on the train, Casper, who has smuggled gang members in the past, knows the nuances of the journey, instructing fellow passengers when to get off the train and run around to avoid immigration officers. At one point, Casper is with Sayra's family. While they are sleeping he leaves the train quietly, only to discover Sayra with him, having followed him. The two journey north on a car transport, Casper evading local franchises of his gang which are all helping Smiley. At an immigrant shelter, Sayra sees a familiar face and asks news of her father and uncle. At this point there occurs an error in the English sub-titles. She is told of her father, 'No esta con nosotros' ('He is not with us'), whereupon she smiles - the subtitles, however render the answer as 'Your father is dead' which makes Sayra's smile seem callous. At a river crossing where the attendant can only cross with one person at a time, Casper pays their fares with the digital camera containing the cherished pictures of his murdered girlfriend and insists Sayra goes first. Just as she is half way across, the gang find Casper, and, after a desperate chase, Smiley encounters him on the river bank and shoots him. The dénouement shows Sayra outside a mega mall in the United States, calling the phone number of her dead father's second family which she had memorized, and Smiley, now accepted by his gang, getting a tattoo commemorating his loyalty. [D-Man2010]",
      "writers": ["Cary Joji Fukunaga"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1127715/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMTQ0NjgwNV5BMl5BanBnXkFtZTcwNzM5MjIzMg@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paulina Gaitan, Marco Antonio Aguirre, Leonardo Alonso | See full cast and crew »"],
      "reviews": [
         "Let's be clear from the outset, this is a dark, bleak and violent movie. The episodes in-between the on-screen savagery, consist of a lot of regret, anxiety and a deep, deep sadness. Having said that, I also think that this is one of the most important movies I have seen in quite awhile, buried unfortunately amidst the clutter of beginning-of-the-year garbage releases and the upcoming summer blockbusters. I wish this movie had a much higher profile, in fact I think that this movie should be required viewing in high-schools all across the US and Canada. It should also be seen by all those people who think about immigrants as a pest and as parasites who come to take away their jobs and be a drain on their resources, abusing the social system or whatever. The same people who watch Lou Dobbs and his \"one man crusade\" to save America from the invading plague of illegals. The minute-men who gleefully think that the wall now separating the US from Mexico is the greatest thing since the pyramids. The same people that after having spewed their vitriol, hatred and bile against immigrants have no problem with Juan mowing their lawn and Consuela looking after their snot-nosed mortally obese children, and Miguel picking-up all the s*it they leave in the streets, malls and every other place one can throw garbage in. Maybe, just maybe, watching this movie will at least give them a glimpse into the lives, backgrounds and destinies of these people, who are abused, mistreated and forgotten by almost everybody, people who basically have come to symbolize a type of disposable human garbage, that truly are without a face, an identity and \"sin nombre\", without name. Perhaps we could all come to understand what it is that drives these waves of humanity to risk it all for even the promise of a better future. Then we could all come to realize that \"life, liberty and the pursuit of happiness\" are not exclusively American values, but rather universal values to which all people aspire to. Even amidst all the doom and gloom of the movie there are some sublime moments of beauty, humanity and yes even hope. It was quite hard at times for me to watch this movie, not because of what I saw, but because I can relate to what I saw and be reminded of a time in my life I wish I could forget, but know I can't. It will be part of me until the day I die. I want people to learn and understand instead of being so quick to judge and dismiss the plight of other fellow human beings. WHAT WOULD YOU DO IF THE SITUATION WAS REVERSED?",
         "Let's call this film a documentary. Sure, these were actors following a script. But more importantly, it documents a segment of life that few readers in the developed world have any insight into. For those who avoid graphic violence, I suggest reading the section on this site that describes specifically what it is, and shut your eyes selectively. I did; but still couldn't relax enough to have dinner afterward until I downed several shots of Scotch. I was shaken, my throat constricted, and imbued with a feeling that may be a mild dose of Post Traumatic Stress Disorder. But documentaries are like that. And when I read that the writer-director, Cary Joji Fukunaga, had actually lived with his subjects, and risked his life voluntarily, as they do out of routine necessity, I consider the least I can do is vicariously experience this reality. It is a reality that I see every day in the frightened eyes of those stunted young men congregating around \"Home Depot\" looking for a day's wages. It reflects a life so mean, so violent, that the lawless Tijuana is a Nirvana compared to their home slums of Honduras and Guatemala. So first they come to Mexico, then ride the trains to the ultimate goal, America. In doing so they run a gauntlet of dangers that could only be conveyed in a dramatization such as this. Empathy, compassion to all in our society, is a luxury for those born into a world where such emotion is the norm. Even in America's imperfect society, the rule of law predominates and the random violence is still newsworthy. The people in this film, especially the gang members had no such choice. These gangs provide a circle of affection and caring, but it is defined by the contrast between those who are their \"homies\" and the outsiders, the other gangs, for whom cruelty has no limits. On a day trip last week to Baja California, we were stopped at a check point configured exactly like the one in the film. A single soldier in bullet proof vest surrounded by sand bags with a 50 caliber machine gun pointed at our car. My friend struck up a conversation with the guard; they both smiled, and we went on our way, to stop at a bakery right before crossing the border and heading to our home in Encinitas. Similar check points; but for those refugees in \"Sin Nombres\" huddled in the empty car on the truck, their lives depended on not being seen. If they had been spotted, and then run out of fear, the machine gun would have killed them in a second, by soldiers hardened by the same violence they face. My day trip to Mexico, while covering same type of territory, could not have been more different. I had my American Express Card and an American Passport, along with a cloak of protection by the norms of an ordered society. Those depicted in the film had none of this. Their lives were determined at the moment of their birth, with choices so limited that their desperate Odyssey to reach what was my birthright was their best available option . This is an important film. Perhaps it should be edited with the more horrible graphic acts simply alluded to, to make it more accessible to a wider audience in America. While it provides no political prescription, it conveys an accurate picture of the reality of life just below our border. If there is to be a political plan to addressing our \"illegal immigrant\" problem, at the least it should be informed by the road taken by those depicted in this powerful film.",
         "Greetings again from the darkness. Nice to see the initial low rating has climbed after more people have discovered it. It is a riveting film that weaves together two heart-wrenching, gritty stories that would otherwise seem unrelated. It is beautifully and realistically photographed and provides no-frills story telling. Director Cary Fukonaga throws the viewer into the middle of the brutally violent gang world at the same time he depicts the frightening desperation of Hondurans making their way through an unforgiving Mexico towards an unwelcoming United States. Trust me ... you don't wish to be part of either of these worlds. The film is at its best when these two worlds collide and Willy/Casper makes a life-changing decision to help a would-be victim. Edgar Flores plays Willy/Casper as the reluctant gang member with a conscience who is just trying to have a life outside the gang. He plays hero to Paulina Gaitan's Sayra, who is on her way to see relatives in New Jersey. Ms. Gaitan reminds of the talented Catalina Sandino Moreno from the excellent \"Maria Full of Grace\". Willy and Sayra are an odd couple, but seem good for each other, though their destiny seems obvious from the first moment. Some great footage of the inner workings of an ultra violent, macho world of gangs left me wondering how anyone could escape alive. These are very scary people. I can understand some finding this difficult to watch, but I can't understand how it can be mistaken for anything other than fine film-making.",
         "I saw this beautifully crafted new film at Sundance and was completely entranced. The cinematography and design is astounding. The new faces and local actors give everything for the project. The writer/director did an extensive amount of research including riding on the tops of trains with immigrants crossing Mexico, and spending time with MS gang members. And indeed the film is full of all kinds of personal, empirical moments that reach up and contrast the violence and epic quality of the piece. Ultimately the film has a very classical quality that evokes an \"Odyssey\" kind of timelessness. Everyone should go see this in the theatres the moment it comes out. Great, great first film.",
         "A truly excellent film, and an important one for our time. It has a brutal, awakening reality to it, but only to show the innocence and courage the characters portray. It is a very pure, and new story of survival. Brilliantly shot, with a ver rich, and warm feel, at the same time is brings you to the frightening underworld of the vicious gang organizations in Central America. Academy Award nominated film producers Diego Luna and Gael Bernal obviously saw a diamond with this film and out came a modern day masterpiece. Cant believe i missed it in theaters. For a first film by Cary Fukunaga, it looks as if it's his 10th, showing no flaws, and with a cast of actors that do their characters amazing justice, Sin Nombre is a MUST SEE!",
         "In Sin Nombre, first-time writer-director 31-year-old Cary Joji Fukanaga has crafted a uniquely moving film experience that dramatizes with authenticity the drive among the poor in Latin America to pull up roots and seek a better life in the U.S. Transcending genres and styles, Sin Nombre, translated \"without a name\", is performed by mostly non-professional local actors whose weathered faces mirror the harsh realities of their life. The film is shot by cinematographer Adriano Goldman with 35mm film rather than digital-video which is today's norm and avoids stylistic clichés such as hand-held cameras and dizzier-than-thou fast cutting. Opening in Tapachula in the state of Chiapas in southern Mexico with a saturated color palette of deep red and orange, the trajectory of this low-budget, but beautifully shot thriller follows two parallel threads that meet in the middle. It begins with the initiation of a new member into the Mara Salvatrucha gang, in this case, a twelve year old boy called Smiley (Kristyan Ferrer) who has been recruited into the gang by young Willy aka Casper (Edgar Flores). Smiley must endure a gang ritual where he is thrown to the ground and kicked and beaten thirteen times to prove his toughness. As if that is not enough, the pre-teen is then forced to shoot a prisoner from the Chavalas, a rival gang. Breaking the rules, Willy takes Smiley with him to meet his secret girlfriend Martha Marlene (Diana Garcia) but the clandestine meeting ends when sadistic gang leader, Lil' Mago (Tenoch Huerta Mejia) finds out about it and tries to rape her with tragic consequences. In the second thread, Sayra (Paulina Gaitan), a Honduran teenager is reunited with her father and decides to join him and her uncle on a perilous journey to New Jersey to meet other family members. In a powerful scene, they join other immigrants at a train crossing and then climb to the top of the railroad car of a passing train to begin the journey. One of the many dangers they face is that of being robbed by gangs or other poor Latinos who think they must have huge sums of money. In this case, the robbers are Casper and Smiley who have been ordered to join Lil' Mago. When the leader tries to rape Sayra, however, Casper takes action which ensures that his future and that of Sayra will be inextricably linked. To reach the U.S., Sayra and Willy, now drawn together out of mutual need and attraction, have to overcome the network of covert operatives employed by the Mara gang, the danger of the border patrols, and the ordinary Mexicans who throw rocks at them and put their journey in peril. Powerful performances by Gaitan and Flores create an electric chemistry that wraps our hearts around their struggle to find release from their troubled past. Winner of awards for directing and cinematography at Sundance, Sin Nombre has been attacked by some critics because it is a story about the truth of poor people's lives wrapped in a conventional framework. In my view, that is precisely what gives the film its strength. It is not an easy task for any immigrant who wants to make it to America, and Sin Nombre alerts us to the dangers as well as the opportunities. It succeeds not only as education but as theater, allowing the viewer not only to understand the perils illegal immigrants face but to relate emotionally to them as human beings. Fukanaga was not a criminal or an immigrant but knows full well that the common thread existing among all people is that of being able to dream of a new day for themselves and the people they love. He spent two years doing research among the Mara Salvatrucha gang based in Mexico and Los Angeles, and in riding on the top of freight cars with Honduran and Salvadorean immigrants headed towards the U.S. border. The result is both deeply moving in its poetry and off-putting in its violence, a film of heartbreaking sadness but also one of joy and redemption, one of the best so far of 2009.",
         "There have been a number of movies on the immigration topic. Babel perhaps the most realistic. Yet. they all lacked a certain ring of truth and were too polished. This film is different. It so explores the seamy underside of poverty that you walk away having learned something you did not imagine before. Few movies do this. The director spent considerable time researching this project, riding the trains, hanging with the gangs, and it shows. Rather than get the typical cursory perspective, this filmmaker so penetrates the lives of his subjects you know what you're seeing reflects their horrible reality. A young gang member in Honduras lives his life with the gangs. Something happens, and along with other locals, he tries to escape to America riding the tops of trains that move along the continent. The voyage is gripping, showing in researched detail what immigrants go through to overcome this challenge. The scenery is depressingly accurate, no glossy backdrops here. My feeling when watching this was finally, a movie was made that shows how squalid poverty is for these people. How the gangs are, what life is like in them. It will be difficult for me to forget some of the things I saw in this film, which is a good sign. I will probably see this movie again I so enjoyed it. Two things stand out. Believable characters, and a believable story. I was transfixed from beginning to end. Definitely the best of the genre.",
         "Directed by the young talent Cary Fukunaga, a winner of the Sundance Film Festival Directing award, the film focuses on a combination of issues in South America, from involvement of kids and teenagers in Mexican gangs to what it takes for those who decide to leave South and Central America and seek greener pastures in the U.S. The story follows two main characters, Casper and Sayra, played by lesser-known actors Edgar Flores and Paulina Gaitan. While Casper is the member of the feared gang Mara Salvatrucha, his faith connects him with Sayra, a Honduran emigrant that travels with her father and uncle together with the other emigrants on a freight train to the U.S. On this journey together, as Casper tries to escape his faith and Sayra to meet hers, the main characters are slowly blending together, complete each other through their diversity, while they have to face the rough side of life in today's Mexico. As a result, the film has a gripping, disturbing, moving sour-sweet blend to it, and is exactly the type of the film where it's unpredictability, natural change of pace, and lots of eye candy in the scenery, makes you part of the story until the credits role, making you beg for more inside. Fukunaga's film feels so real not only thanks to his time spent in Mexico and his first hand experience with both, emigrants and immigrants he met before and while shooting the film, his cast of actual members of the Mara gang, perfect editing and combination of locations and the effort he took while filming to get the best out of his actors (\"apart from beating them\", he joked at Vary), makes the film one of the best feature debuts I've ever seen.",
         "This movie rocked. I would definitely recommend seeing it, especially on the big screen: the cinematography is incredible. The film manages to teach you something about the world, expose you to an underworld you (well, at least I) had no idea existed, bring up some important social issues, all while keeping you on the edge of your seat. Some highlights included stunts on trains, some crazy home-made guns, and amazing tattoos. The acting was also very good -- especially considering several of the cast had no real acting experience. The audience I saw it with loved it -- it got some great gasps and even some big laughs. And all by a first-time director. Well done.",
         "I previously said the two best movies of 2009 thus far are \"Sunshine Cleaning\" and \"State of Play\". But this newest entry, \"Sin Nombre\", makes me move this one into the top spot, easily. It is a meaningful contemporary statement made by a writer/director newcomer with guts. The story(ies) begin in Honduras, a bit later on in Mexico. We first meet Sayra (Paulina Gaitan), who is to accompany her father from Honduras to America � their sights are set on New Jersey. Sayra has not seen her father in a long time, so theirs is an uneasy alliance. He shows her a crudely drawn map, and he traces their route; theirs is a long journey. We next meet Casper (aka Willy � played by Edgar Flores), a member of a Mexican gang from whom he is hiding his girlfriend; he lies to the gang leader about his whereabouts, but this fearsome leader has his suspicions. We also meet Smiley (Kristian Ferrer) who has just been initiated into the gang. Both Casper and Smiley are put to an additional test to prove their loyalty. They are now thoroughly enmeshed in a world of violence and considerable darkness. This is an edgy world, one in which the overwhelming sensation is constant threat. Eventually the two separate threads become entwined � both Casper and Smiley have headed north on a train headed north through Mexico, and Sayra and her father have climbed aboard the same train. How all these characters meet and how their itineraries merge is the heart of the narrative. The shots of train yards and of the illegal train passengers enroute � sitting on top of cars mostly - are very engaging and have a authentic look. The cinematography in the movie is terrific. There are great shots of border crossings and always the trains. According to director Cary Fukunaga the train scenes were difficult to shoot (http://www.popmatters.com): \"We had to maximize those few days we could actually shoot on a train to make it all real,\" Fukunaga says. \"We ended up building a prop train on flatbed trailers, pulling them on country roads around Mexico. You use extras on the set to block the horizon line. If they're in the way, you can't see how far the train goes off into the distance. Definitely something they don't teach you in film school.\" All really good movies have a surprise, and there is one here that made me lean forward as if I could see a little better; it was a case of - Did I just see what I think I saw? And that reminds me that this was the first picture in a long time where people walked out fairly early on. That always makes me wonder what a movie about gangsters would have attracted them in the first place. I am reminded of \"City of God\" and \"Amores Perros\", two films that also portray the darker sides of Central America. For anyone needing a fix of smart storytelling with social commentary woven throughout should seek this one out. This is my favorite kind of movie, one where the director leads you through a shadowy other-world full of realistic characters and situations. Four stars."
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Scion Films",
         "Canana",
         "Creando Films"
      ],
      "summaries": [
         "Honduran teenager Sayra reunites with her father, an opportunity for her to potentially realize her dream of a life in the U.S. Moving to Mexico is the first step in a fateful journey of unexpected events.",
         "A Honduran young girl and a Mexican gangster are united in a journey across the American border."
      ],
      "budget": 0
   },
   "movielensId": 68347,
   "movielens": {
      "languages": [
         "Polski",
         "Español"
      ],
      "releaseDate": "2009-03-20",
      "dvdReleaseDate": "2009-09-01",
      "directors": ["Cary Fukunaga"],
      "runtime": 96,
      "movieId": 68347,
      "title": "Sin Nombre",
      "mpaa": "R",
      "actors": [
         "Paulina Gaitán",
         "Edgar Flores",
         "Kristyan Ferrer",
         "Tenoch Huerta",
         "Diana García",
         "Luis Fernando Peña",
         "Héctor Jiménez"
      ],
      "imdbMovieId": "1127715",
      "originalTitle": "Sin Nombre",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["HFlTivEUlTw"],
      "plotSummary": "Set on the border, where Mexico becomes the crucible and the fearsome gangs of today’s Mexican countryside, the gauntlet, to freedom. The stories of a girl living in Honduras and hungering for a brighter future, and two teen gang members, for whom the Mara Salvatrucha is near their entire universe, become interlaced on the train to the border, a journey that will determine the future of their lives",
      "tmdbMovieId": 21191,
      "avgRating": 3.83931,
      "releaseYear": "2009",
      "numRatings": 641,
      "posterPath": "/ktzyg31ibW2MWTZh4KpKMCgtgt6.jpg"
   }
}