{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "safecracker",
            "id": 159339
         },
         {
            "name": "invisibility",
            "id": 189115
         }
      ],
      "imdb_id": "tt0053593",
      "video": false,
      "title": "The Amazing Transparent Man",
      "recommendations": [
         3165,
         85682,
         27677,
         38750,
         84719,
         72091,
         44585,
         109757,
         3164,
         112481,
         84419,
         63088,
         23293,
         141600,
         31984,
         113523,
         31118,
         28586,
         23045,
         37464
      ],
      "backdrop_path": "/obcQJeXLgNk045ySuC664upV18q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Laura Matson",
               "gender": 0,
               "credit_id": "52fe44909251416c910152c7",
               "name": "Marguerite Chapman",
               "profile_path": "/nNo8HRmPreClbWsmZvB3AFzGgso.jpg",
               "id": 108232,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Joey Faust",
               "gender": 2,
               "credit_id": "52fe44909251416c910152cb",
               "name": "Douglas Kennedy",
               "profile_path": "/8fCM2tVhpziKRRZ2xY9WGdbBSOB.jpg",
               "id": 95734,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Major Paul Krenner",
               "gender": 2,
               "credit_id": "52fe44909251416c910152cf",
               "name": "James Griffith",
               "profile_path": "/AcltehHWFxLWgIZfuhxfAJnIJYX.jpg",
               "id": 3347,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Peter Ulof",
               "gender": 2,
               "credit_id": "52fe44909251416c910152d3",
               "name": "Ivan Triesault",
               "profile_path": "/gWpMvwsE3ydU0GeFtvLqQZBXbov.jpg",
               "id": 5041,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Julian",
               "gender": 0,
               "credit_id": "52fe44909251416c910152d7",
               "name": "Boyd 'Red' Morgan",
               "profile_path": null,
               "id": 108236,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Maria Ulof",
               "gender": 0,
               "credit_id": "52fe44909251416c910152db",
               "name": "Cormel Daniel",
               "profile_path": null,
               "id": 108238,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Drake",
               "gender": 2,
               "credit_id": "52fe44909251416c910152df",
               "name": "Edward Erwin",
               "profile_path": null,
               "id": 108240,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Smith",
               "gender": 2,
               "credit_id": "52fe44909251416c910152e3",
               "name": "Jonathan Ledford",
               "profile_path": null,
               "id": 108241,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Security Guard",
               "gender": 2,
               "credit_id": "52fe44909251416c910152eb",
               "name": "Patrick Cranshaw",
               "profile_path": "/onUKpczej5fMG84mLs3aLgQAnDJ.jpg",
               "id": 58513,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "State Policeman",
               "gender": 2,
               "credit_id": "52fe44909251416c910152ef",
               "name": "Dennis Adams",
               "profile_path": null,
               "id": 108243,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "State Policeman",
               "gender": 1,
               "credit_id": "52fe44909251416c910152f3",
               "name": "Stacy Morgan",
               "profile_path": null,
               "id": 108244,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Security Guard",
               "gender": 0,
               "credit_id": "5860fa05c3a3681a7702ba8f",
               "name": "Norman Smith",
               "profile_path": null,
               "id": 1235962,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44909251416c910152c3",
               "name": "Edgar G. Ulmer",
               "profile_path": "/PU5rCuIxOPcffvceRU4K2Y9smj.jpg",
               "id": 5030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44909251416c910152ff",
               "name": "Lester D. Guthrie",
               "profile_path": null,
               "id": 1206135,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44909251416c91015305",
               "name": "Robert L. Madden",
               "profile_path": null,
               "id": 1176690,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44909251416c9101530b",
               "name": "John Miller",
               "profile_path": null,
               "id": 27948,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44909251416c91015311",
               "name": "Darrell Calker",
               "profile_path": null,
               "id": 111193,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44909251416c91015317",
               "name": "Meredith M. Nicholson",
               "profile_path": null,
               "id": 1148558,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44919251416c9101531d",
               "name": "Jack Ruggiero",
               "profile_path": null,
               "id": 135104,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44919251416c91015323",
               "name": "Ernst Fegté",
               "profile_path": null,
               "id": 127200,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c91015329",
               "name": "Jack P. Pierce",
               "profile_path": null,
               "id": 29813,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "5447c5dbc3a3686d8f002823",
               "name": "Jack Lewis",
               "profile_path": null,
               "id": 131489,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.774308,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31634,
      "vote_count": 15,
      "budget": 0,
      "overview": "An ex-major forces a scientist to develop a invisibility formula, with which he plans to create an invisible army and sell it to the highest bidder. However there are side effects to the formula.",
      "similar": [
         31417,
         9738,
         1979,
         135397,
         336843,
         1927,
         585,
         303,
         223,
         1073,
         910,
         8850,
         40761,
         16227,
         3766,
         17136,
         10973,
         11071,
         20482,
         25508
      ],
      "original_title": "The Amazing Transparent Man",
      "runtime": 57,
      "poster_path": "/lELV3k8VBa91XQoOUMPWe85tCJy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Miller Consolidated Pictures (MCP)",
         "id": 16768,
         "origin_country": ""
      }],
      "release_date": "1960-02-01",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Invisible and Deadly!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edgar G. Ulmer"],
      "runtime": 58,
      "synopsis": null,
      "writers": ["Jack Lewis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053593/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNzk3MzQ5M15BMl5BanBnXkFtZTcwMTE3MTcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marguerite Chapman, Douglas Kennedy, James Griffith | See full cast and crew »"],
      "reviews": [
         "Before viewing this 1960 drive-in hit, keep in mind that it is not really a serious attempt at science fiction. Many critics and viewers have panned this movie because they expected some sort of INVISIBLE MAN-style plot with good acting and plenty of special effects. But if it was high-quality cinema they were looking for, then why in the hell did they choose to watch a movie with a title like \"THE AMAZING TRANSPARENT MAN\"? Viewers with no expectations, a good sense of humor, and an open mind will probably enjoy this bizarre little sci-fi romp. The whole mad scientist/escaped prisoner/invisible Nazi story is beyond befuddling, but it is so unbelievably far-fetched that you'll be entertained anyway. THE AMAZING TRANSPARENT MAN does a nice job at not dawdling on boring fake science jargon (a shortcoming that most sci-fi yarns of this era suffer from) and somehow manages to dole out one outrageous scene after another during its unusually short running time. Within the course of 58 minutes, you will witness invisible fist fights, invisible robberies, atomic blasts, jailbreaks, in-your-face anti-nuclear-weaponry overtones, and a whole barrage of people stealing from and/or deceiving one another. Every single character either betrays or holds one another hostage at some point during the picture. If you're in the mood for something that is so goofy and so off-the-wall that it defies description, then I suggest you run out the VHS cut-out bin nearest you and pick up this movie. Trust me, you'll be glad you did.",
         "Why are people so down on this modest but enjoyable movie? Beats me. Joey Faust (what a name!), safecracker, is busted out of the pokey and made an offer - turn invisible and steal radium for a mad scientist/soldier planning on setting up an invisible army to conquer the world. Joey goes along with it but quickly decides to use his powers for what comes naturally - stealing lots of do re mi. This causes conflict as you can imagine, and then his invisibility goes on the fritz. Faust is played by Douglas Kennedy who played one of the cops in 'Invaders From Mars', the baddie is James Griffith who had a bit part in Kubrick's 'The Killing', and the movie was directed by Edward G. Ulmer who made the strange Lugosi/Karloff classic 'The Black Cat' back in the 1930s. 'The Amazing Transparent Man' won't change your life, but it's entertaining enough. Worth a look for fans of 1960s/60s b-grade thrillers.",
         "Some aspects of Ulmer's Amazing Transparent Man are, in retrospect, pretty funny. James Griffith's poorly mimed fight with an invisible man, the occasional continuity disasters, and the infrequent technobabble are examples. This is not, however, quite funny enough or cheesy enough to have been good MST3K fodder. Underlying the mediocre special effects, the occasionally overblown dialog, and the uneven performances, the story line presents an interesting take on the invisible man theme. The heavy, played without much verve by James Griffith, is an ex-Nazi spy who looks and speaks like Mr. Rogers. His plan, involving all manners of extortion, involves forcing refugee German scientist (Ivan Triesault) to use radiation to turn an escaped convict safe-cracker (Douglas Kennedy) invisible. His goal is ostensibly to steal money and radioactive materials to further his experiments. In the role of his co-conspirator and femme fatale we find Marguerite Chapman. Chapman and Kennedy have some on-screen chemistry which is used to good advantage in the film, but Chapman's performance is below par. Kennedy does well in a role which used his experience well. Griffith's performance, given his credentials, is surprisingly poor. The ancient and experienced Triesault, the class of the acting talent in this film, steals the show to an extent, but is also the only really sympathetic character in the lot. The movie has a somewhat plodding pace at first, but the character development is good enough to draw the audience in. The Amazing Transparent Man is no action film, but once the action begins, it doesn't really let up until the nicely climactic end. Despite all of the bad press this film has received here on IMDb, this film really isn't a bomb, and I recommend it to sci-fi and low budget b movie buffs.",
         "A prisoner is freed by people who want him to do a job for them -- he doesn't know what it is, just that he'll be \"free\", but he finds himself the subject of a weird experiment. He eventually turns \"transparent\" because of radiation treatments, and the guys who are doing it to him are Nazis out to conquer the world with an invisible army (?!!!?). They want him to use his transparency to rob military bases of plutonium for building their army, but he eventually goes back to his stock and trade -- bank robbery. When his floating bag finally attracts notice, he starts to flash in and out of visibility -- cool scene. Decent photography, tight direction redeem this seeming 5 day quickie.",
         "The Amazing Transparent Man is very similar to The Invisible Man and one main difference with this movie is that involves the Atomic Age, radiation etc. A criminal who has escaped from prison is made invisible by a mad scientist and gets him to steal nuclear fuel to help with future experiments. Things go wrong when he robs a bank though as becomes visible and is also dying through radiation poisoning. This movie has some good special effects considering the low budget. Highlights include the \"one man\" fights. The cast includes Douglas Kennedy (The Land Unknown) and Marguerite Chapman (Flight To Mars). The Amazing Transparent Man is worth watching if you get the chance. A great way to spend just under an hour. Rating: 3 stars out of 5.",
         "A title like \"The Amazing Transparent Man\" does have you seriously wondering on how poor the movie you are about to watch will be - - for a start, he can't even achieve invisibility (only transparency), so what is 'amazing' about that? But the opening titles suggest you might get something a bit better than you were bracing yourself for. It's quite a good mood setting, with the music involving a cello grinding 4 repeating notes ominously. The other give away is that in the opening credits, the directors and producers names are shown in running-writing style - clearly both artists. And the opening prison escape bit is good, as well as the police checkpoint scene, and they involve some nicely framed external shots. In fact its all looking like this might be a surprisingly enjoyable film, until the escaped safe-cracking crim Faust (played by Douglas Kennedy) has his first real indoor talking scene. And then you realize that for some reason only known to him, Mr Kennedy plays Faust like some \"John Wayne\" cowboy. Why a safe cracker would also be a swaggering tough guy who looks like he is ready to say \"Ok Pilgrim\" is a constant annoyance which does tend to cripple the film. Anyway - - I don't think I'm giving much away to point out the early setup in the film when Krenner (the Bad Guy) says something like \"Dr, make sure the radioactive material is kept away from the beam, or else we will all blow up\", and then Dr Ulof repeating something similar back to Krenner five minutes later - - clearly, something is eventually going to go wrong along these lines much later in the film, and they really don't want you to miss it. The other annoying thing about this movie is how quickly the characters (Faust, Krenner, Dr Ulof, Laura (the bad guys girl), and Julian (the bad guys hired help)) seems to keep swapping alliances and personality, all as a result of some simple statement that would even make a daytime soap opera blush.(eg: a \"But your son is dead\" has Julian swapping sides without a thought that \"Hey, maybe she is lying because I have a gun pointed at her?\"). So, the film is not too strong on the logic of how and why the characters act and respond. When combined with its over-earnestness, the final sentence uttered in the film, instead of being the deep and meaningful thought provoker the director and producer obviously intended, resulted in me chuckling for quite a while after the closing credits finished. Ultimately - The Amazing Transparent Man is better than its title suggests, but not something to recommend.",
         "\"The Amazing Transparent Man\" is one of the latter films by Edgar G. Ulmer. Obviously, it's nowhere near as good as his masterpieces \"Detour\" or \"The Black Cat\". It isn't even as good as \"Strange Illusion\" or \"Bluebeard\". Still, for what it is (a slight second feature), it's actually not half bad. The purpose of these films was to entertain, and despite the low rent production values and seeming lack of interest from the entire cast and crew, \"The Amazing Transparent Man\" manages to avoid being dull. The film runs a scant hour length, and doesn't get bogged down in any character development which really wouldn't work within the context. The film is sloppily made, but that's part of the charm. They simply don't make these economic chillers anymore. Plus, the combination of science fiction and gangster story is a nice touch. If you like creature features, you could really do a whole lot worse than \"The Amazing Transparent Man\" for late night viewing. (5/10)",
         "Given the total low-budget look of the film, the indifferent performances of the entire cast, the lack of credibility from scene to scene, and the overall amateurishness of acting and direction, it's merciful that this film directed by Edward G. Ulmer is only 58 minutes. DOUGLAS KENNEDY (looking a bit flabby and tired) is the lead, a man who has just escaped from prison and has a girlfriend (MARGUERITE CHAPMAN) waiting just outside for a quick getaway. After that, all plausibility is over, as she takes him to the home of a mad Army Major who is housing a scientist able to make objects invisible. The wounded Major seeks some sort of revenge for his wounds and envisions an army of invisible men, but Kennedy advances another idea--a bank robbery with him stealing into the vault while invisible. Reluctantly, the doctor agrees to the plan--but the plot takes a few twists when things don't go as smoothly as planned. No one in the film gives a performance worth remembering, and the mad scientist played by IVAN TRIESAULT is worst of all in a key role. In one crucial scene he appears to be reading his dialog off cue cards as he recites the ingredients of his experiment. To say DOUGLAS KENNEDY is wooden is to be charitable. The same can be said for Miss Chapman who has absolutely no chemistry with the leading man. All of it looks like it was put together in five days with some very primitive special effects. Considering that Edward G. Ulmer did direct some very successful scary films at Universal, this is nothing less than a disaster.",
         "Amazingly\u0085short, maybe? With a running time of barely 55 minutes, this looks more like a random episode of \"The Twilight Zone\" rather than like a full Sci-Fi picture. Or amazingly wasted potential, perhaps? Naturally, the shortness of this movie also inflicts abrupt plot twists, insufficient character drawings and a forced climax. But probably, it just stands for amazingly good entertainment despite a truckload of shortcomings! With a man like Edgar G. Ulmer (\"The Black Cat\", \"Bluebeard\") sitting in the director's chair, it's at least certain that the movie you're about to see will be stylish and containing a handful of well-mounted suspense sequences. The basic premise has a mass of great ideas (that all begged for a more detailed elaboration, actually) and the fluently written dialogues allow all the players to give away stellar performances. Douglas Kennedy stars as a charismatic and eloquent safe-cracker with a very cool name (Joey Faust), running from prison with the help of a vicious ex-military officer who developed a bizarre plan to gain world power! Faust has to serve as a human guinea pig and, whist invisible through radiation, steal more uranium to investigate the possibilities of creating invisible armies. Don't you just LOVE these insane evil masterminds and their grotesque ideas? The wayward criminal he is, Faust doesn't simply follow these orders blindly. The special effects are weak and there's a lack of set pieces, yet it's a fun movie with a good pace. James Griffith portrays my favorite type of underdog-villain; distinguished and calm, but relentless and greedy when it comes to the crunch. Considering this is late 50's/early 60's Science Fiction, the movie ends with a mandatory philosophical debate. Warmly recommended, after all.",
         "Another early black and white sci-fi film with some promise........at least in the beginning. Mad dictator \"wanna be\" springs bank robber from prison to use him in his plan for taking over the world with an invisible army. Sound outrageous? You bet! The sets are cheesy, the story is pretty stupid, the actors either overact or can't act at all, the ending is over the top.......these are all part of the elements that make low budget films fun to watch. Besides, it was directed by Edgar Ulmer, who did some fascinating work. But for some reason, this one is disagreeable. There are holes in the plot as big as Rhode Island and there is something very sleazy about all the actors, even though a couple of them are mainstays of \"B\" films, and in the case of Ivan Treisault, \"A\" list big productions (\"Notorious\", for example.)And there is that constant bickering........it seems that 75% of the dialogue is shouted. The special effects......well, I've seen worse, much worse, even though you can see the wires. We've seen wires in films before. So what is it that makes this little programmer unpleasant? It just doesn't seem to gel but I don't know why. Maybe it was that Wurlitzer organ in the middle of the living room! So catch it on MST3K with Mike and the 'bots.....without them, it is pretty damn dismal."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "Miller Consolidated Pictures (MCP)",
         "Exclusive Roadshow Attraction"
      ],
      "summaries": [
         "Paul Krenner, an ex-major with delusions of grandeur, has forced scientist Peter Ulof to develop a radiation-based technique to turn men invisible, with which process he plans to create an invisible army to sell to the highest bidder. He busts safecracker Joey Faust out of prison and forces him to undergo the invisibility treatment so he can steal more radium to further the experimentation. Plans go awry when Faust discovers there is a side-effect to the invisibility treatments he didn't count on.",
         "A crazed scientist invents an invisibility formula. He plans to use the formula to create an army of invisible zombies."
      ],
      "budget": 100000
   },
   "movielensId": 6836,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-02-01",
      "dvdReleaseDate": "2003-09-09",
      "directors": ["Edgar G. Ulmer"],
      "runtime": 57,
      "movieId": 6836,
      "title": "The Amazing Transparent Man",
      "mpaa": "",
      "actors": [
         "Marguerite Chapman",
         "Douglas Kennedy",
         "James Griffith",
         "Ivan Triesault",
         "Boyd 'Red' Morgan",
         "Cormel Daniel",
         "Edward Erwin",
         "Jonathan Ledford",
         "Patrick Cranshaw",
         "Dennis Adams",
         "Stacy Morgan",
         "Norman Smith"
      ],
      "imdbMovieId": "0053593",
      "originalTitle": "The Amazing Transparent Man",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["8Jc0P9AgqC0"],
      "plotSummary": "An ex-major forces a scientist to develop a invisibility formula, with which he plans to create an invisible army and sell it to the highest bidder. However there are side effects to the formula.",
      "tmdbMovieId": 31634,
      "avgRating": 2.46429,
      "releaseYear": "1960",
      "numRatings": 28,
      "posterPath": "/lELV3k8VBa91XQoOUMPWe85tCJy.jpg"
   }
}