{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cheating",
            "id": 1332
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "supernatural powers",
            "id": 4769
         },
         {
            "name": "preacher",
            "id": 18072
         }
      ],
      "imdb_id": "tt0104695",
      "video": false,
      "title": "Leap of Faith",
      "recommendations": [
         12596,
         10631,
         45225,
         19382,
         2107,
         20759,
         31052,
         38554,
         17956,
         16384,
         14170,
         14684,
         26261,
         11310,
         10608,
         38147,
         10905,
         40820,
         10467,
         18966
      ],
      "backdrop_path": "/zSSqiExnHS4C9HpKlG7ITYxG1Go.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jonas Nightengale",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c867",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jane Larson",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c86b",
               "name": "Debra Winger",
               "profile_path": "/l1ISZ6yfV8ilaNmOHBVTheq6Mbq.jpg",
               "id": 26513,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marva",
               "gender": 1,
               "credit_id": "52fe451f9251416c7504c86f",
               "name": "Lolita Davidovich",
               "profile_path": "/vQlk518qlef94XXJqtrkIqS3izo.jpg",
               "id": 12139,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sheriff Will Braverman",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c873",
               "name": "Liam Neeson",
               "profile_path": "/9mdAohLsDu36WaXV2N3SQ388bvz.jpg",
               "id": 3896,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Boyd",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c877",
               "name": "Lukas Haas",
               "profile_path": "/1n1CTF6fi52BF407iQU6aMMKWFU.jpg",
               "id": 526,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Hoover",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c87b",
               "name": "Meat Loaf",
               "profile_path": "/43nyfW3TxD3PxDqYB8tyqaKpDBH.jpg",
               "id": 7470,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c87f",
               "name": "Philip Seymour Hoffman",
               "profile_path": "/8DjE4XIngdn0dK3RnIKTHB8U8jZ.jpg",
               "id": 1233,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Tiny",
               "gender": 2,
               "credit_id": "53305068c3a3685fac006a36",
               "name": "M.C. Gainey",
               "profile_path": "/icWXPTZlbOytDwMzRLM37TyBcox.jpg",
               "id": 22132,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Georgette",
               "gender": 0,
               "credit_id": "5330507fc3a3685fcb006a81",
               "name": "LaChanze",
               "profile_path": "/g3P0Q3ZJZaUabXZi7gdaBzMniHh.jpg",
               "id": 56689,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Ornella",
               "gender": 0,
               "credit_id": "533050a5c3a3685fd3006bfc",
               "name": "Delores Hall",
               "profile_path": null,
               "id": 1232201,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Lucille",
               "gender": 0,
               "credit_id": "533050c1c3a3685fac006a3c",
               "name": "Albertina Walker",
               "profile_path": null,
               "id": 1304288,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Dolores",
               "gender": 1,
               "credit_id": "5a388f06925141547e06c311",
               "name": "Phyllis Somerville",
               "profile_path": "/motrffoZUrUpMbESD9wEvbgzjHU.jpg",
               "id": 17184,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c885",
               "name": "Richard Pearce",
               "profile_path": null,
               "id": 73496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe451f9251416c7504c88b",
               "name": "Janus Cercone",
               "profile_path": null,
               "id": 73497,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c891",
               "name": "Michael Manheim",
               "profile_path": null,
               "id": 73498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451f9251416c7504c897",
               "name": "David V. Picker",
               "profile_path": null,
               "id": 10590,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c89d",
               "name": "Ralph S. Singleton",
               "profile_path": null,
               "id": 18855,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c8a3",
               "name": "Cliff Eidelman",
               "profile_path": null,
               "id": 2120,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c8a9",
               "name": "Matthew F. Leonetti",
               "profile_path": null,
               "id": 2507,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c8af",
               "name": "John F. Burnett",
               "profile_path": null,
               "id": 8881,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c8b5",
               "name": "Mark Warner",
               "profile_path": null,
               "id": 1732,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c7504c8bb",
               "name": "Don Zimmerman",
               "profile_path": null,
               "id": 15005,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.220836,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12772,
      "vote_count": 63,
      "budget": 0,
      "overview": "Jonas Nightengale is a fraudulent Christian faith healer who makes a living travelling around America holding revival meetings and conducting 'miracles' with the help of his friend and manager, Jane, and their entourage. One of their trucks breaks down in Rustwater, a town in desperate need of rain to save their crops. While waiting for spare parts, Jonas decides to hold a revival meeting in the town. The local sheriff, Will Braverman, is skeptical and tries to prevent his town and its people from being conned. However a local disabled boy, Boyd, believes Jonas could make him walk again. Events in Rustwater make Jonas examine his own faith and doubts.",
      "similar": [
         11069,
         10829,
         262841,
         9362,
         755,
         76640,
         10891,
         1427,
         2288,
         59,
         585,
         1585,
         3981,
         782,
         793,
         162,
         275,
         1547,
         3933,
         44896
      ],
      "original_title": "Leap of Faith",
      "runtime": 108,
      "poster_path": "/rTIdtL5e8qe1Uf8AsbKhLBEnY7J.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1992-12-18",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Real miracles, sensibly priced.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Pearce"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Janus Cercone"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104695/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMDQwNTM4MV5BMl5BanBnXkFtZTcwOTE0ODYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steve Martin, Debra Winger, Lolita Davidovich | See full cast and crew »"],
      "reviews": [
         "I can't believe how many people have missed the point of this movie. This is one of those movies that you can't just turn your brain off and watch. Every scene from beginning to end is intended to make you question your own faith in God. It is filled with symbolism and should be taken at a deeper level than just a movie about a con man who uses a ruse of holiness to con people out of their money. This is about God reaching down and healing a spiritually broken man. Steve Martin gives possibly his best performance ever as Jonas Nightengale; a man who's life has been less than virtuous. The supporting characters are all excellent, and the music is amazing. But what really makes this movie are the last fifteen minuets. No movie has ever had such a powerful and uplifting ending. This movie has cemented a spot on my top five list and I strongly recommend that you see it.",
         "I read some comments that thought this film might offend Christians. Nonsense. I think you just might have to be a Christian to appreciate the humor in this film. Steve did his homework in making this film which explores the seedy world of traveling charlatans masquerading as evangelists. It is a more serious film than some of Martin's other efforts, but I found it very funny as I have attended many Church services that were near identical to the ones portrayed in the film. If you have stayed away from this film because you are a Christian, I say give it a look. I don't think it will offend you that much and you will enjoy the outcome.",
         "Steve Martin is a great comedian. Always has been, always will be. (Even after the Out-of-Towners.) But very comedian at one point or another gets that itch. The one that can make or break a comedians career. The drama itch. On the surface, this looks like a silly satire of traveling evangelist. But if you look deeper, you will see Steve Martin giving what is perhaps the most powerful performance of his career. Fresh from movies like HouseSitter, Father of the Bride, and L.A. Story (one of my personal favourites), Steve Martin plays a con man who's current con is working as a traveling evangelist. Despite being a movie about a con man, however, Steve Martin does something that not many people thought he could do at the time: he showed he could actually act! And in a movie that had a message, nonetheless. Yes, the man who once played the banjo with an arrow through his head delivers a message. Yes, this movie has it's flaws - meandering on insignificant side stories while under developing others, leaving some stories unresolved - but most of these are story flaws. Faith movies (or at least good ones) have never been about stories, but about the emotions and the messages that they convey, and this movie conveys two very important messages. 1) Sometimes, all you need is faith. 2) Steve Martin can act his goofy ass off! If you wanna see a movie with a great story and great jokes, rent L.A. Story or Parenthood. If you wanna see a movie with a great message that even an agnostic would find uplifting (see previous reviews) then watch Leap of Faith.",
         "Steve Martin's actually acting in this movie! Off course he's still in his frame act, but the good thing is, the script demanded his style, and nobody could do it better than him. Watch when he preaches, when he dance and sing, when he talks, even when he's lost. And seemingly the other casts (Debra Winger, Meat Loaf, Liam Neeson, Lolita Davidovich, etc.) open their way to expand Martin's performance in this movie. The movie itself is light and enjoyable, one of the best movie on it's genre. A perfect holiday movie.",
         "I think the reviewer who said this movie was \"dark\" and \"sick\" was watching a different movie, or just simply missed the point of the ending. Steve Martin plays an Elmer Gantry-type traveling evangelist who is a jaded huckster and gleefully cons and takes advantage of others, whether they be well or handicapped. Perhaps this is what the reviewer means by \"sick\". But, the whole point of this set-up is to demonstrate the transformation Martin's character as a human being goes through at the end of the movie. Martin definitely is a non-believer in the religion he preaches. Until... ...and this is the point of the movie... The point is the profound effect events surrounding the crippled teenager have on Martin's character, and Martin's subsequent transformation INTO a believer, which is shown by his walking away from the false, hypocritical, wolf-in-sheep's-clothing existence he had been leading. That's the significance of his giving the ring to Winger. He's walking away to find something real now. As he rides away and it begins to rain and Martin cries: \"Thank you, Jesus!\" his transformation is complete, his shouts of praise are now sincere praises of the Lord, no longer are they the hollow words of a con man. He is no longer that con man. He IS a changed man. And THIS is the true point of this story.",
         "This is a fantastic movie, and proof that Steve Martin is more than just a comedian. The movie is well done, with solid character development and great direction. The production really captures the essence of the midwest setting. The gospel music - a joint effort between George Duke and Edwin Hawkins - is also great. The story itself is very thought-provoking and emotional. Contrary to what another reviewer said here, the ending is great and was the perfect climax to a thoughtful story. (How the other reviewer considered the ending to be pointless is beyond me. Oh well, pearls before swine and all that.) Excellent movie!",
         "This movie is really good on several levels. First of all, Steve Martin does an excellent job as a \"flashy preacher man\" by night, but conniving money hoarder by day. Debra Winger does a good job, and we're introduced to a young Liam Neeson and Philip Seymour Hoffman. However, what this movie also does is show how \"sideshow tent revivals\" pray on people by using their beliefs to mask their true intents. I highly recommend this movie to anyone who feels that religion and religious people are not what they seem to be!",
         "In the opening scene we see the tour buses that carry the `Miracles and Wonders' that Jonas Nightengale brings as they speed down a country road. A police officer stops them, and those who work on the show take bets on whether Jonas can finagle his way out of a ticket. Here we see just what tricks he uses to peddle religion, specifically, a sharp eye for details and a hidden mike, among other high-tech gadgets. When one of the trucks breaks down, the troupe pulls into the next town of Rustwater, Kansas. They proceed to set up shop, since they're stuck in town waiting for repairs, even though the town is less than ideal for their enterprise. When they first arrive in town, they stop at the local diner, and Jonas attempts to work his magic on the waitress. The place is too small to guarantee the large haul they can take from other places, so Jonas' assistant, Jane, grills him into memorizing the details of life there, to guarantee the maximum wallet-opening emotional impact. Sheriff Braverman is hostile to their form of fund-raising, but Jonas and Jane manage to get the necessary permit for a gathering. Marva, the waitress, is skeptical that miracles exist, and definitely believes that Jonas is not the one to work them. Later in the film, we see Jonas in the diner talking to Marva's brother, Boyd. When the boy asks Jonas, `So, you believe in miracles, right?', Marva says, `I believe in life, what it does to you, and what you do back,' while Jonas answers about faith, not miracles, evading any straight answer, as always. Besides the diner, the other important location is the tent. The gospel choir sings as the pieces are put in place, from the poles and canvas, to the staging and a giant crucifix. This latter item seems most out of place in an evangelistic setting of a healing service, but it points out how mixed up Jonas' idea of religion really is. The services held there seem to me to come across as extreme (almost offensively so), but goes to show how people can get caught up in the spirit of a vibrant personality. Truth and fiction are so intertwined that at times I was confused as to what were the motives. Was Jane's falling in love with the sheriff merely a show to allow them to stay in town, or did it only start out that way? Was her confession to him of Jonas' unhappy childhood that led to his behavior true? Were the black women in the diner really that dumb, or did they just say things as part of an act? (It's interesting to note that the only thing blacks are portrayed as doing is, stereotypically, playing basketball and singing gospel.) The lead role of Jonas is played by Steve Martin, but don't look for the `wild and crazy guy' we've come to expect. However, a comedian seems necessary to keep the movie from being overwhelming. But the humor is subtle, and the message of the existence of miracles seems more important. I considered the ending well done enough to make up for any flaws. Because Jonas' miracles are mere sleight of hand, we are led to believe that no miracles exist. Or perhaps miracles are not necessarily the large-scale healings that Jonas plies as his trade, and can be something as small as a flock of butterflies. But can a miracle-worker more interested in showmanship deal with a real miracle if one should come along?",
         "I am becoming a huge fan of Steve Martin's, after all we have the same birthday ;), no, I'm having fun, but I love his movies. My mom is also a huge fan and has a lot of Steve Martin movies, the next on my list of flicks to watch was Leap of Faith. She said it was an alright film, but it was always worth a watch. So I finally sat down tonite and watched it and over all, I'd say that this was a nice and honest film to watch that can touch anyone's heart. Jonas is a con man going from town to town claiming he is a miracle preacher, Jane, his sidekick, just finds out information about the town and Jonas acts like he knows everything by miracle. Of course he and his team just take the money and run after a couple days. But when Jonas realizes the town's good nature, he starts to feel bad and falls for a waitress with a crippled brother. But things start to happen when the town's faith grows stronger and miracles really do happen. I would recommend Leap of Faith for an afternoon of nothing to do, I think that it is an under rated cute little movie that could make you have a leap of faith for anything. Steve Martin isn't really funny in this film, but I think Leap of Faith actually showed his dramatic talents pretty well, he's awesome. 6/10",
         "very well done, and very well cast. really has a terriffic ending. i had not seen debra winger in a movie since the awful character she was stuck with in \"an officer and a gentlemen\". she is the shining light in this film, plays her part so well, in fact ALL the actors do. steve martin is superb."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Jonas is a fraudulent faith healer, who uses all the tricks in the book to con the people attending his shows. Jonas and his team of helpers, including Jane who is in need of some romance, travel the country stopping at big towns and cities to put on their show. When one of the trucks breaks down in a small town, Jonas is quick to accept the challenge of making money in this town. His other goal is to seduce Marva, a waitress in the town, but she's a hard nut to crack, as is Will, the local sheriff who's determined to expose Jonas as a fraud.",
         "Fake faith healer Jonas Nightingale is stranded in a small town where he finds he can't fool all of the people all of the time."
      ],
      "budget": 0
   },
   "movielensId": 6850,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-12-18",
      "dvdReleaseDate": "2003-09-23",
      "directors": ["Richard Pearce"],
      "runtime": 108,
      "movieId": 6850,
      "title": "Leap of Faith",
      "mpaa": "PG-13",
      "actors": [
         "Steve Martin",
         "Debra Winger",
         "Lolita Davidovich",
         "Liam Neeson",
         "Lukas Haas",
         "Meat Loaf",
         "Philip Seymour Hoffman",
         "M.C. Gainey",
         "LaChanze",
         "Delores Hall",
         "Albertina Walker",
         "Phyllis Somerville"
      ],
      "imdbMovieId": "0104695",
      "originalTitle": "Leap of Faith",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["rP6VDQ2J3QM"],
      "plotSummary": "Jonas Nightengale is a fraudulent Christian faith healer who makes a living travelling around America holding revival meetings and conducting 'miracles' with the help of his friend and manager, Jane, and their entourage. One of their trucks breaks down in Rustwater, a town in desperate need of rain to save their crops. While waiting for spare parts, Jonas decides to hold a revival meeting in the town. The local sheriff, Will Braverman, is skeptical and tries to prevent his town and its people from being conned. However a local disabled boy, Boyd, believes Jonas could make him walk again. Events in Rustwater make Jonas examine his own faith and doubts.",
      "tmdbMovieId": 12772,
      "avgRating": 3.06599,
      "releaseYear": "1992",
      "numRatings": 538,
      "posterPath": "/rTIdtL5e8qe1Uf8AsbKhLBEnY7J.jpg"
   }
}