{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "plastic surgery",
            "id": 4585
         },
         {
            "name": "hollywood",
            "id": 12396
         }
      ],
      "imdb_id": "tt0081110",
      "video": false,
      "title": "The Man With Bogart's Face",
      "recommendations": [],
      "backdrop_path": "/r961ehJgJkZ44atxwAu783yaQay.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Sam Marlow",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ee3",
               "name": "Robert Sacchi",
               "profile_path": "/i2m0xrFLMz9pCdlFLhBlaA6Niky.jpg",
               "id": 99789,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Hakim",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ee7",
               "name": "Franco Nero",
               "profile_path": "/lwXfTQrFqAw4zcVjrhgq3THfWCg.jpg",
               "id": 22383,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Gena",
               "gender": 1,
               "credit_id": "52fe45eb9251416c91042eeb",
               "name": "Michelle Phillips",
               "profile_path": "/jtEwruQjnnUxUkGovT6F0TvmIIr.jpg",
               "id": 29543,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Elsa",
               "gender": 1,
               "credit_id": "52fe45eb9251416c91042eef",
               "name": "Olivia Hussey",
               "profile_path": "/qe2QxkaW8yQEn9dzFpUhttLs46x.jpg",
               "id": 24695,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Duchess",
               "gender": 0,
               "credit_id": "52fe45eb9251416c91042ef3",
               "name": "Misty Rowe",
               "profile_path": "/y4suV8wyFrmZZ8VApvP5VuZZSlh.jpg",
               "id": 115488,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Commodore Anastas",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ef7",
               "name": "Victor Buono",
               "profile_path": "/dtD3eiFF4YIVJsxEKchtNvWOrKH.jpg",
               "id": 24811,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mr. Zebra",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042efb",
               "name": "Herbert Lom",
               "profile_path": "/85tCjSGBH778wpycsIDb7mxhZia.jpg",
               "id": 14503,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "52fe45eb9251416c91042eff",
               "name": "Sybil Danning",
               "profile_path": "/6WydVNd7JTYY0zbYtH2iwKGGo7k.jpg",
               "id": 29541,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Lt. Bumbera",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f03",
               "name": "Richard Bakalyan",
               "profile_path": "/flHUIu0hpigaZYXb7XfkEFmPc7j.jpg",
               "id": 12299,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Sgt. Hacksaw",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f07",
               "name": "Gregg Palmer",
               "profile_path": "/q9spyHdzAWsaJSBGPRjTs4eu7L3.jpg",
               "id": 16071,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Wolf / Zinderneuf",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f0b",
               "name": "Jay Robinson",
               "profile_path": "/eVZopDhNpFjeZyMg1OZn4LGPQF8.jpg",
               "id": 16097,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Petey Cane",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f0f",
               "name": "George Raft",
               "profile_path": "/orQya82STEGviY0ARuyo3AIt1Ud.jpg",
               "id": 3152,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Teresa Anastas",
               "gender": 1,
               "credit_id": "52fe45eb9251416c91042f13",
               "name": "Yvonne De Carlo",
               "profile_path": "/v2aCRQusYYePhBF2fS1xsVIPr5Z.jpg",
               "id": 41240,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f17",
               "name": "Mike Mazurki",
               "profile_path": "/s1alibwL5JiBhBNZQGiN91Hccc3.jpg",
               "id": 84229,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Mr. Chevalier",
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f1b",
               "name": "Henry Wilcoxon",
               "profile_path": "/3qJEMJDvOy2WVP45oo5GqmMrwed.jpg",
               "id": 51310,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ec7",
               "name": "Robert Day",
               "profile_path": null,
               "id": 40599,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ecd",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ed3",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042ed9",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eb9251416c91042edf",
               "name": "Houseley Stevenson Jr.",
               "profile_path": null,
               "id": 115487,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45eb9251416c91042f21",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eb9251416c91042f27",
               "name": "Richard C. Glouner",
               "profile_path": null,
               "id": 115486,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.429457,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36460,
      "vote_count": 2,
      "budget": 0,
      "overview": "In The Man With Bogart's Face, an affectionate send-up of the Bogart detective films of the 1940s, Robert Sacchi plays a man who idolizes Humphrey Bogart so much he has his features altered to look exactly like his idol. He then opens up a detective agency under the name Sam Marlowe (an amalgam of the names of Bogart's characters from The Maltese Falcon and The Big Sleep).",
      "similar": [
         10218,
         74643,
         188222,
         382589,
         599,
         1792,
         8012,
         1903,
         4944,
         7446,
         109414,
         59436,
         50546,
         194662,
         856,
         2118,
         522,
         681,
         509,
         371638
      ],
      "original_title": "The Man With Bogart's Face",
      "runtime": 106,
      "poster_path": "/wq1HnQGgpqJdmnpjPEjBM2fwjHL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Melvin Simon Productions",
            "id": 2124,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1980-10-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "He's cool under pressure and sophisticated between the sheets",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Day"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Andrew J. Fenady",
         "Andrew J. Fenady"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081110/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTE1MTUxOTI4N15BMl5BanBnXkFtZTcwNzU5MjEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Sacchi, Franco Nero, Michelle Phillips | See full cast and crew »"],
      "reviews": [
         "This amusing, sometimes poignant look at the Hollywood detective genre of the 1940's and 1950's stars Robert Sacci as an unnamed former cop who retires, uses his life savings to pay for plastic surgery to transform his image into that of his idol, Humphrey Bogart, then sets up shop as a private eye under the name \"Sam Marlowe\". Robert Sacchi, incidentally, is one of the rare few Bogart impersonators who got the lisp exactly right; more to the point, the body and facial language are there. For awhile, \"Sam\"'s only client is his landlady, who wants him to find her undersized boyfriend, and his only conversational foil is his secretary, simply called \"Dutchess\" (Misty Rowe), who in his own words, \"looked like Marilyn Monroe and made about as much sense as Gracie Allen\", and has a passion for banana splits. Then he encounters Elsa (Olivia Hussey), the plain, sweet, virginal daughter of a retired props-master who has been murdered for no discernible reason. In the process of investigating the murder, Sam shortly runs across: the Gene Tierney lookalike daughter (Michelle Phillips) of Anastas, an avaricious, obscenely wealthy Greek shipping tycoon (Victor Buono, turning in a creditable Sidney Greenstreet), his hapless, long-suffering second wife (Yvonne deCarlo, who manages to play a variety of put-upon emotions without saying a word), his two smarmy henchmen (Herbert Lom, channelling Peter Lorre, and Jay Robinson, doing a reasonably accurate Lionel Atwill), and Anastas' vicious, amoral Middle-Eastern potentate (Franco Nero) who comes complete with a glamorus and bafflingly loyal mistress (Sybil Danning), all of whom would give anything to acquire the \"Eyes of Alexander\", two huge, perfectly matched star sapphires. When Elsa is murdered, Marlowe's interest in solving the case becomes personal, and he sets out through a labyrinth of Los Angeles landmarks, including the Hollywood Bowl, the scatological and esoteric attractions of Hollywood Boulevard, and Santa Catalina Island in pursuit of the rocks, determined to get at them before either of the two wealthy competitors. Throw in cameos by Mike Mazurki and assorted others, the traditional dumb-but-sympathetic ally on the police force, and a plethora of nicely drawn character turns that provide dimension to practically all players, and despite an unfortunate title song, you have, to my mind, a thoroughly enjoyable movie experience.",
         "If you like Bogart, you will enjoy this film thoroughly. I only wish it was on video so I could buy it! Very nostalgic. Very Bogart...as he was in his Ace Private-Dick days as Sam Spade/Philip Marlowe.",
         "Sacchi is the best Bogart impersonator ever... dry and droll as Sam Marlowe. The music from award winning composer George Duning [From Here To Eternity, Picnic, The World of Suzie Wong], the cinematography of perfect locations [including the famous Ambassador Hotel] are all right on target as famous tv director Robert Day [Kojak, Streets of San Francisco, The Avengers] guides the most endearing group of well-known character actors through a spoof of every dark detective film every made. See this if you loved all the old serious flicks and have a sense of humor... this one is a hoot.",
         "Almost missed it. While visiting friends in Philadelphia sometime in the early 1980`s, I was channel surfing after everyone else went to bed. It wasn`t just Bogart he was obsessed with; but rather the entire era of those old flicks those of my age know so well. Add to that a plot liken to The Maltese Falcon - where so many different characters were interacting with Sacchi - and you have a piece of art as far as I`m concerned. About ten years later it appeared on TV and I taped it. >",
         "Making this short and to the point. This movie was great! I loved it! I actually picked this up at a Hollywood Video for 3 bucks on VHS and watched it about 5 times in the last couple weeks. I'm a big Bogart fan and I just latched onto this movie. I thought the song was funny and now have it as a ring tone on my phone. Robert Sacchi is great and pulls off a good Bogart. His nose is a little big, his voice is a Bogart-Columbo mix, and he does a few things that are awkward but otherwise, he was fantastic and this film was wonderful. No one can be a perfect Bogart but he was great. Remember, Sam Marlow is a fan of Bogart and isn't going to do everything he did. He mentions a lot of other movies and does some things that were never part of the real Bogart's character's. But, it's so funny and hilarious and has a great cast, including some beautiful women. Watch it and have fun!",
         "We meet Sam Marlow (professional Bogart impersonator Robert Sacchi), a freshly-minted private eye, just as he's having the bandages removed from the plastic surgery he's undergone to make himself resemble his idol Bogie. No sooner has Marlow (yes, that's how he spells it, without the \"-e\") opened his p.i. office in Hollywood than he's up to his fedora in a search for rare sapphires with heiress and Gene Tierney manque Gena Anastas (Michelle Phillips in an engaging performance and a makeup job worthy of Kevyn Aucoin) and other classic movie star lookalikes. Andrew Fenady wrote the script based on his own delightful tongue-in-cheek mystery novel, but the movie's never more than a cute little time-passer (not that a cute little time-passer isn't welcome now and then, mind you!). They could've had fun with it and tried to capture the look and style of Bogart's classic movies, but this modestly-budgeted affair is for the most part shot and staged like a 1970s TV movie, complete with a cheesy soft-rock title song! Sacchi, though amiable enough, is a better impersonator than actor. True, he's got Bogart's mannerisms and appearance down, and he sports a wry streak at times, but he becomes disappointingly wooden in love scenes and other parts of the story that require him to show emotion. (No, being wooden in a love scene is not the same as having a woody in a love scene! :-) Having said all that, BOGART'S FACE is still pleasant light entertainment if you just want some good-natured mind candy to while away a rainy afternoon at home. The interestingly eclectic cast also includes Franco Nero as a Zachary Scott wannabe, Herbert Lom as a Joel Cairo type, Victor Buono as Phillips's Sydney Greenstreet-esque father, Misty Rowe as Marlow's ditsy blonde secretary (\"...she looked like Marilyn Monroe and made as much sense as Gracie Allen...\"), and Olivia Hussey and Sybil Danning as damsels in various forms of distress. And don't blink during the opening credits, or you'll miss venerable character actor Philip Baker Hall as Marlow's plastic surgeon!",
         "This movie is a very enjoyable homage to the Bogart and other detective films of old. Robert Sacchi nails it as Bogie and Michelle Phillips is a truly timeless beauty as Gena Anastas. However, the most noteworthy portion of this film involves the longest belly dancing scene ever produced in a Hollywood film. One well-known professional instructor commented that nothing else in cinema comes close for dance excitement. The scene, which ends up being an important part of the plot, occurs in a lushly beautiful Middle Eastern nightclub and is by all accounts mesmerizing. The pulsating music, the swirling veils and ringing finger cymbals, free-flowing undulations and beautiful costumes - and a surprise twist involving the seductive Sybil Danning - build tension and excitement until the very end. The three talented and beautiful professional nightclub dancers are led by exotic brunette beauty Kamala Almanzar, one of the US' leading belly dancers since the mid-1970s. She was hand-picked by famed Armenian musician Guy Chookoorian to travel with his orchestra on the road. Guy's ensemble is the live band that the dancers perform to in the scene. If you watch the trailer on this site, you will see a glimpse of Kamala (playing the finger cymbals behind Sybil Danning). If you're not yet a fan of belly dancing, you will be after watching this movie, and if you're an aficionado, it holds up very well after repeated viewing.",
         "Welcome to a memory trip down nostalgic lane, as \"The Man with Bogart's Face\" is a neat, affable little homage to a Hollywood legend. It's a typical throwback to those hardboiled crime dramas Bogart appeared in, but set in modern times and the notable gimmick (Robert Sacchi's private eye getting plastic surgery to look like Bogart) is well implemented. It's a one-idea concept (the usual free-flowing narration), but it's old fashion story-telling, dry, razor sharp humour, tightly drummed mystery / suspense and voluptuous dames (Michelle Phillips, Misty Rowe and Sybil Danning) go on to make an appealing package. While in a way you can call it a spoof, it doesn't over do it and does everything in a rather low-key and witty manner. Robert Sacchi simply fit's the part and truly embodies the spirit --- as he spends most of the time decked out in that hat and trench coat, putting on the voice and he always has something to say. Also popping up is Olivia Hussey, Frank Nero (whose character has strange fascination for the colour blue), Victor Buono, Herbert Lom and Yvonne De Carlo. The thoroughly plotted story has a whole bunch of random investigations that eventually come together (the search for the Eyes of Alexandria - two sapphires), as once a struggling private-eye Sam Barlow finds himself being showered in clients, money and danger. He's constantly in someone's sights - for good (the ladies) or bad (hooded hoodlums). Also the script manages to throw around plenty of movie references and that's part of its self-knowing charm. It's well-crafted by director Robert Day and the funky opening theme is quite a catchy title.",
         "Humphrey Bogart is my favorite classic film actor; actually he's my favorite actor altogether. \"The Maltese Falcon\" is right up there on my list of Bogey favorites, so having that one under your belt probably gives you a leg up on the stuff going on in 'Bogart's Face'. Most of the references are right out there, like the 'Eyes of Alexander' sapphires in place of that evil black bird. But there are subtler ones as well, like Sam Marlow (Robert Sacchi) hiding a note in the bedpost, in an aside to \"Casablanca\". Even some of the characters parallel the greats - Buono for Greenstreet, and Lom for Lorre, but the depth of the talent doesn't carry on down the line. As the two detectives tailing Marlow and the gems, Richard Bakalyan and Gregg Palmer don't have the personality to parry with Marlow the way Barton MacLane and Ward Bond did in the original. As for Sacchi, he's a credit to Bogart and his mannerisms, and if you're watching a slightly fuzzy VHS copy of the film, there are a few scenes where he's a complete dead ringer. But he did overdo it with the facial grimace; Bogart did it for emphasis and effect. Sacchi just does it, all the time, and it gets a bit tedious. Still, you can have some fun with this one, Bogart fan or not. My recommendation - play it Sam, play it one time.",
         "Ex-cop turns private eye after he has plastic surgery to look like his movie hero. Send-up of 40's Bogart films will probably offend fans. Skewers familiar film noir scenes and characters, sometimes with subtlety. Similar to \"Dead Men Don't Wear Plaid\" (1982) and \"The Cheap Detective\" (1978). (Rating: B+)"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Melvin Simon Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": ["A man with a fixation on Humphrey Bogart gets plastic surgery to make him look exactly like Bogart. Then he changes his name to Sam Marlowe (after Sam Spade and Phillip Marlowe, two of Bogart's most famous characters), hires a ditzy blonde secretary, and opens up a detective agency. His first case is one that would do Bogie proud..."],
      "budget": 0
   },
   "movielensId": 68897,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-10-03",
      "dvdReleaseDate": "2001-07-10",
      "directors": ["Robert Day"],
      "runtime": 106,
      "movieId": 68897,
      "title": "The Man With Bogart's Face",
      "mpaa": "",
      "actors": [
         "Robert Sacchi",
         "Franco Nero",
         "Michelle Phillips",
         "Olivia Hussey",
         "Misty Rowe",
         "Victor Buono",
         "Herbert Lom",
         "Sybil Danning",
         "Richard Bakalyan",
         "Gregg Palmer",
         "Jay Robinson",
         "George Raft",
         "Yvonne De Carlo",
         "Mike Mazurki",
         "Henry Wilcoxon"
      ],
      "imdbMovieId": "0081110",
      "originalTitle": "The Man With Bogart's Face",
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["dJ3WjugzPVM"],
      "plotSummary": "In The Man With Bogart's Face, an affectionate send-up of the Bogart detective films of the 1940s, Robert Sacchi plays a man who idolizes Humphrey Bogart so much he has his features altered to look exactly like his idol. He then opens up a detective agency under the name Sam Marlowe (an amalgam of the names of Bogart's characters from The Maltese Falcon and The Big Sleep).",
      "tmdbMovieId": 36460,
      "avgRating": 2.83333,
      "releaseYear": "1980",
      "numRatings": 6,
      "posterPath": "/wq1HnQGgpqJdmnpjPEjBM2fwjHL.jpg"
   }
}