{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "condom",
            "id": 4313
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "girl",
            "id": 14659
         }
      ],
      "imdb_id": "tt0120376",
      "video": false,
      "title": "Trojan War",
      "recommendations": [
         149553,
         97609,
         134237,
         302135,
         291405,
         17140,
         131847,
         78309,
         212756,
         24585,
         39773,
         49804,
         44593,
         81996,
         71288,
         20648,
         29964,
         44909,
         39213,
         41582
      ],
      "backdrop_path": "/e6CJolA5FqLMfwaK3zqMLCpiWp2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Brad Kimble",
               "gender": 2,
               "credit_id": "52fe45e79251416c750666d1",
               "name": "Will Friedle",
               "profile_path": "/uWhmkddV4QHGH5xxv1pwLHF8Kui.jpg",
               "id": 76621,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Leah Jones",
               "gender": 1,
               "credit_id": "52fe45e79251416c750666d5",
               "name": "Jennifer Love Hewitt",
               "profile_path": "/kp8cLdEivtJD5yu8Ij8xMeZ1Jc8.jpg",
               "id": 33259,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Brooke Kingsley",
               "gender": 1,
               "credit_id": "52fe45e79251416c750666d9",
               "name": "Marley Shelton",
               "profile_path": "/n3XgupzMwQfX7YyTjolsnbhIIyV.jpg",
               "id": 6407,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Seth",
               "gender": 2,
               "credit_id": "52fe45e79251416c750666ef",
               "name": "Danny Masterson",
               "profile_path": "/vBC0mHPEVHwhFZYzhXgoHzBKYyK.jpg",
               "id": 18972,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Josh",
               "gender": 2,
               "credit_id": "52fe45e79251416c750666f3",
               "name": "Jason Marsden",
               "profile_path": "/qlZvyg48eUGth7pzU5UDi3CfdDR.jpg",
               "id": 61983,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Kyle",
               "gender": 2,
               "credit_id": "52fe45e79251416c750666f7",
               "name": "Eric Balfour",
               "profile_path": "/cdJF0WLFUwl9unbPjnpFZ7dUNP2.jpg",
               "id": 34489,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Trish",
               "gender": 1,
               "credit_id": "52fe45e79251416c750666fb",
               "name": "Jennie Kwan",
               "profile_path": "/fMwXljUES3idLGQoQbYdDswSAj0.jpg",
               "id": 183582,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe45e79251416c750666ff",
               "name": "Charlotte Ayanna",
               "profile_path": "/7gylpOlomdAFyx83NUaQqQqgen0.jpg",
               "id": 6281,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cashier",
               "gender": 1,
               "credit_id": "5305ccecc3a3685a871af45e",
               "name": "Kathy Griffin",
               "profile_path": "/psg895Ye46vGenRdX0EXvGOm92p.jpg",
               "id": 3138,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Homeboy",
               "gender": 2,
               "credit_id": "56ec219ec3a3682265002844",
               "name": "Julien Cesario",
               "profile_path": "/xhLfC2mjT6uarwkPPxcez0biG2B.jpg",
               "id": 1592534,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e79251416c750666df",
               "name": "George Huang",
               "profile_path": null,
               "id": 57028,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53fddd6bc3a3684c7a000ff1",
               "name": "Scott Myers",
               "profile_path": null,
               "id": 64879,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53fddda2c3a3684c89000fb7",
               "name": "Andy Burg",
               "profile_path": null,
               "id": 76623,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.086024,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14330,
      "vote_count": 32,
      "budget": 15000000,
      "overview": "Brad is about to hook up with the girl of his dreams, but runs into a problem, no condom. So Brad sets out into the night to find one, running into many obstacles along the way, while not knowing his best friend, Leah is in love with him.",
      "similar": [
         19053,
         8363,
         17899,
         179144,
         17130,
         11355,
         14922,
         9352,
         449176,
         14578,
         9777,
         86838,
         13416,
         15037,
         979,
         627,
         4771,
         122081,
         57214,
         2108
      ],
      "original_title": "Trojan War",
      "runtime": 85,
      "poster_path": "/hl57XN7fqbYuqwTqfRudrAGJQL.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Daybreak Pictures",
            "id": 4793,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1997-09-26",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "She has 24 hours to convince the guy of her dreams that she's the girl of his.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Huang"],
      "runtime": 84,
      "synopsis": "High school student Brad (Friedle) has had an unrequited crush on a classmate named Brooke (Marley Shelton) for years. After she asks him to come over one night to tutor her, she ends up wanting to have sex with him. But she only wants safe sex, and he does not have a condom. (The use of Trojan in the title is an obvious pun on the condom brand.) In his quest to buy some condoms, he runs into all sorts of trouble; his dad's Jaguar gets stolen and then wrecked, he has a run-in with a crazy bus driver (Anthony Michael Hall), he is held hostage, he is pursued by a school janitor (Paulo Tocha) who accuses him of tagging, an odd pair hispanic siblings (Christine Deaver and Mike Moroff) who think he's David Hasselhoff, Brooke's dog, Brooke's jealous boyfriend Kyle (Eric Balfour), and a homeless man (David Patrick Kelly) who wants two dollars from him (and secretly stolen his wallet), and he is nearly arrested. After all of this, he realizes that the perfect girl has been there for him all along: his best friend Leah (Jennifer Love Hewitt), who has had feelings for him for a long time unbeknownst to Brad. Finally, Brad realizes his own feelings for Leah while also discovering Brooke is not as great as he thought she was, after he finds out that she only wants a one night stand with him instead of a relationship. Brad runs out to find Leah and admits his feelings to her. After the end credits, Brad's parents are shocked by the sight of what is left of their car after the tow truck driver brings it back.",
      "writers": [
         "Andy Burg",
         "Scott Myers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120376/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMTYzODgxM15BMl5BanBnXkFtZTcwNDM1MTkyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Will Friedle, Jennifer Love Hewitt, Marley Shelton | See full cast and crew »"],
      "reviews": [
         "A fun little film in the mould of the great 1980's teen comedies which used to star the likes of Rob Lowe, John Cusack and Ally Sheedy!! This film is enjoyable from the off, although the subject may be a little touchy as it centres on a High School youth (Will Friedle) who desperately fancies the school beauty (Marley Shelton)and somehow manages to arrange a study date with her at her house. After a while things progress well enough until he finds himself without a condom!. Where can he get one from at this time?, can he get back while she is still interested?, his journey takes him all over the city and gets him in to some side-splittingly funny situations and scenarios along the way. Stand out is Jennifer Love Hewitt as Friedles best friend who is madly in love with him without him realising!",
         "What could be more entertaining than watching a teenage boy running around looking for a condom. I quite enjoyed this movie much more than I thought I would. Maybe it's because I expected it to be crap. Even though there were parts of this movie that were somewhat cheesy, I never for a second wanted to end the experience.",
         "This cute little film had one primary purpose: provide more exposure for Jennifer Love Hewitt, and encourage folks to watch her disappointing \"Last Summer\" flicks at the multiplex. Well, something went terribly wrong with that simple plan, because along the way an amazingly enjoyable film got made. Will Friedle (of TV's \"Boy Meets World, and at the time JLH's real-life boyfriend) plays a likable high school student who lucks out when the adorable little blonde he's tutoring (the sadly underexposed Marley Shelton) decides to give him a break. As he frantically takes Los Angeles apart searching for a condom (yes, that's what \"Trojan\" in the title refers to) his best bud JLH is realizing she wants to be more than just friends. Aside from the horrible case of envy I developed (Will Friedle got to kiss JLH both on and off-screen!) I had a lot of fun watching the result. If you're a parent, the additional good news is that this is one of the few flicks out there (surprisingly) in which the characters don't jump into bed without practising safe sex. That shows that at least there's SOME hope for Hollywood.",
         "If this movie was supposed to be a typical plotline 80's teenage throwaway film, it missed its audience. The \"Austin\" nametag on Lee Major's police uniform went over the heads of anyone who wasn't born before 1974. I caught this flick on HBO about three months ago. I thought Lee Majors as a cop was funny (named Austin a.k.a. Steve Austin from the \"Six Million Dollar Man\"). But I'm sure it didn't register with those who actually cared to see this film with the very attractive Jennifer Love Hewitt.",
         "IF your looking for like a short teen oriented comedy this one is good, it some of the jokes are kind of stupid but still funny its basically about Brad played by Will Fridele, and he finally gets to hook up with the girl he's had a crush on for a long time, but it turns out she's really using him to mess with her real Boyfriend, and of course there's the \"Best friend girl\" played by JLH. Normally with these kinds of plots the guy after wooing his dream girl chooses the best friend with the whole brains over beauty scenario, and it usually annoys me but this time so the best friend is played by JLH so it's really a win-win situation for Brad. So in short I really liked this movie especially with the comedic plot if your looking for like a serious movie this isn't for you, but if you like just want to hang out and watch a teen comedy with some over the top humor(yet still funny) this movie is a great choice.",
         "All men have had that girl that they had their eye on forever but never really had the cojones to say anything. We'll in this movie Brad (Friedle) gets his chance when he gets into the bedroom \"studing\" w/ Brooke (Shelton), the popular blond that has caught his eye. Brad has no idea that his best friend since they were \"sperm\", Leah (Hewitt), has a crush on him. Everything is great until Brooke stops Brad's fun by asking for some protection which starts one hell of a bad night for Brad, just to get a friggin' condom. The dose of humor also can come from Leah and Brad's friends; Seth (Masterson) and Josh (Mardsen). The whole movie has it's angle. So one man is trying to get laid with the girl of his dreams not knowing that his bestest friend in the whole world has the hots for him, all and all the movie is a great movie to sit down and watch, especially if Jennifer Love Hewitt is in it. Hewitt steals the show and the only reason why 90% of the people watch the movie because she is the only one besides Danny Masterson that keeps the movie together. Will Friedle needs to stick at being the brother on \"Boy Meets World\" then TRYING to act in a movie. So the movie had it's funny moments with the appearance of Anthony Michael Hall as the demented bus driver wanting 65 cents. I give this movie a 7/10 because some of the actors suck at what they do, but other then that this movie is a great movie because of how funny and witty it is... a \"guilty pleasure\" movie... :)",
         "Oh this was one of my favorite guilty pleasures! I've never been a huge fan of teen sexy comedies like this one, but I have to admit that it totally got my attention when it first came out. Sure, the situations are very similar if not identical to many Hughes' classics from the 80's but you can't help but feel the late 90's vibe. I mean, the music, the clothing, the vibe. The lack of the condom in the most important scene is displayed as a problem but be honest guys, who wouldn't like to be in the exact same situation?! Be honest! Also, the movie displays a battle of morality but it's something I wish would've happened to me back in the time. I mean, having a super sexy but shy love interest, plus having the chance to bang the hottest sexy slut of high school... Enjoy and remember your funny moments at high school. Don't watch this one otherwise you were a 90's pubert.",
         "This is a great movie filled with tons of fun and excitement. Will Friedle is the highlight of the movie with his goofy quirkiness. J-love Hewitt wasnt too bad either. It is a close cry to Hewitts other comedy soon after \"Can't Hardly Wait\" as far as a cute teeny comedy. But, the plot does not resemble really. I really recommend it to anyone who wants a good laugh.",
         "This is a thoroughly delightful teen comedy for the 90's. Although the story gets a little goofy at times, the great cast keeps the story from sinking. Will Friedle is a good choice for the lovestruck teen, while Jennifer Love Hewitt is great as his best friend pining for his affections. I think this is a better choice for \"Love\" than Can't Hardly Wait. In that movie she played the Babe role, and I think she's better as the girl next door. Anyway, it's a great video movie and can be watched several times. Also 80's teen comedy buffs, check out the funny perf from Anthony Michael Hall as the bus driver.",
         ".....Let's forget about Will Friedle or Jennifer Love Hewitt...There are 2 teenagers,a girl and a boy,best friends 'since like sperm',one in love with the other,the other in love with someone else...It's about the everyday struggle of an ordinary teenager who falls in love with only the most beautiful girl in the school and who now has the chance to live his dream ignoring his best friend's suggestions.Brad(Will Friedle) is a dreamer punched in the face by reality,but in a comic way,in an attempt to make him choose the smartest way.But will Rational take the same road as Love?What will he choose? If you are a teenager or looking for a comedy with teenagers,choose this classic genre for it's actors,for it's brilliant comic situations and well planned plot,choose it to laugh your way back to those early days of your adolescence when all you worried about was how to express your love without being disappointed and mocked at..."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Daybreak"],
      "summaries": [
         "Brad thinks he has found the girl of his dreams with Brooke. On the night when he thinks all his dreams will come true he runs into a problem...No condom. On his search to find a trojan he realizes that maybe it isn't worth the trouble. Brad is robbed, beaten up, arrested and everything else imaginable trying to get just one condom. His best friend Leah is disgusted at his behavior because she wants Brad all to herself and can't see why Brad would want someone like Brooke. Will Brad find what he wants or will Leah get what she has always wanted - Brad?",
         "Brad is about to hook up with the girl of his dreams, but runs into a problem, no condom. So Brad sets out into the night to find one, running into many obstacles along the way, while not knowing his best friend, Leah is in love with him."
      ],
      "budget": 15000000
   },
   "movielensId": 69075,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1997-09-26",
      "dvdReleaseDate": null,
      "directors": ["George Huang"],
      "runtime": 85,
      "movieId": 69075,
      "title": "Trojan War",
      "mpaa": "PG-13",
      "actors": [
         "Will Friedle",
         "Jennifer Love Hewitt",
         "Marley Shelton",
         "Danny Masterson",
         "Jason Marsden",
         "Eric Balfour",
         "Jennie Kwan",
         "Charlotte Ayanna",
         "Kathy Griffin",
         "Julien Cesario"
      ],
      "imdbMovieId": "0120376",
      "originalTitle": "Trojan War",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Jt3YM0Y96fc"],
      "plotSummary": "Brad is about to hook up with the girl of his dreams, but runs into a problem, no condom. So Brad sets out into the night to find one, running into many obstacles along the way, while not knowing his best friend, Leah is in love with him.",
      "tmdbMovieId": 14330,
      "avgRating": 2.88571,
      "releaseYear": "1997",
      "numRatings": 35,
      "posterPath": "/hl57XN7fqbYuqwTqfRudrAGJQL.jpg"
   }
}