{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0475286",
      "video": false,
      "title": "Graduation",
      "recommendations": [
         174343,
         249169,
         278990,
         21800,
         149592,
         179154,
         329556,
         24528,
         78088,
         191646,
         14167,
         163440,
         113693,
         99254,
         272636,
         31605,
         204761,
         44109,
         196305,
         135047
      ],
      "backdrop_path": "/uEJcTVu3sywAXVBbshdqZfv6myd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Polly Deely",
               "gender": 1,
               "credit_id": "52fe47c69251416c750a507d",
               "name": "Shannon Lucio",
               "profile_path": "/vppN3pu3CLbzXUmOUJTrnbeu94O.jpg",
               "id": 84299,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chauncey Boyd",
               "gender": 2,
               "credit_id": "52fe47c69251416c750a5081",
               "name": "Riley Smith",
               "profile_path": "/jdkypzjSf6S4NjpAuS6lBtohG2c.jpg",
               "id": 67850,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carl Jenkins",
               "gender": 2,
               "credit_id": "52fe47c69251416c750a5085",
               "name": "Chris Marquette",
               "profile_path": "/kKunkk6VksTnXGj0iK5MNqbYhBt.jpg",
               "id": 59238,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tom Jackson",
               "gender": 2,
               "credit_id": "52fe47c69251416c750a5089",
               "name": "Chris Lowell",
               "profile_path": "/tYvCwr8DUuKVcv7DgZIeSeSG42V.jpg",
               "id": 84300,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dean Deeley",
               "gender": 2,
               "credit_id": "52fe47c69251416c750a508d",
               "name": "Adam Arkin",
               "profile_path": "/zCLaZZMQxBMZ4DtXOecy84xnO2g.jpg",
               "id": 55257,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Suzy Winters",
               "gender": 1,
               "credit_id": "52fe47c69251416c750a5091",
               "name": "Aimee Garcia",
               "profile_path": "/lkXrwXShVpGhSTxGunNwJkkO84l.jpg",
               "id": 56457,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47c69251416c750a50a3",
               "name": "D. Cory Turner",
               "profile_path": null,
               "id": 84345,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47c69251416c750a50a9",
               "name": "Jason Blum",
               "profile_path": null,
               "id": 84348,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c69251416c750a50af",
               "name": "Robin Bradford",
               "profile_path": null,
               "id": 84349,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c69251416c750a50b5",
               "name": "Brian Ralston",
               "profile_path": null,
               "id": 84350,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "52fe47c69251416c750a50c1",
               "name": "Lindsay Chag",
               "profile_path": null,
               "id": 41654,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5aa909890e0a263dca033b04",
               "name": "Michael Mayer",
               "profile_path": null,
               "id": 1287446,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5aa909949251415e4802f1b3",
               "name": "Matthew Uhry",
               "profile_path": null,
               "id": 84351,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5aa90ae79251415e42030811",
               "name": "Michael Mayer",
               "profile_path": null,
               "id": 1287446,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.195786,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19203,
      "vote_count": 17,
      "budget": 0,
      "overview": "Four best friends, about to graduate from high school, must find a way to raise money to help a family member in need. When one of them discovers her banker father having an affair, the foursome plots to rob his bank during graduation ceremonies. When things don't go according to plan, they end up learning more about themselves in one day than they ever did in school.",
      "similar": [],
      "original_title": "Graduation",
      "runtime": 89,
      "poster_path": "/q7jxtKBBSieh3Rado12WeA018qi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Blueline Films",
         "id": 3938,
         "origin_country": ""
      }],
      "release_date": "2007-04-24",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Mayer"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Michael Mayer",
         "D. Cory Turner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0475286/",
      "coverLink": null,
      "actors": [
         "Catherine L. Albers",
         "Adam Arkin",
         "Greg Benson"
      ],
      "reviews": [
         "Well done! I was very pleased with this movie. I found it to be well written and executed. It was a little different from your usual bank robber type movie, as it involves pulling off the heist during your high school graduation ceremony! The suspense in this movie is off the charts, better take your bathroom break before it starts because your not going to want to leave your seat. Many young actors in this film, both in age and in their careers, and they were all very impressive. I liked that this was not a big name film, it gives it more of a personal feel. You really able to be in the moment with the actors. Great movie experience! Get off your rump and go see it, you'll be glad you did :)",
         "This is a decent bank robbery movie where the characters are teenagers who plan the heist for the day of their high school graduation. There are several side stories surrounding the main plot, and everything comes together at the end. It's not high drama or suspense; it's geared for a young audience and in that sense it delivers. The filming, sound and acting are all competent. All that being said, this is not a 10 star movie as several of the reviews posted here indicate. When I initially wrote this review back in early June there were five other reviews of this movie. Four of those reviews give this movie 10 stars, and those four reviewers (RBigs, hareyT, choul and MsMaryS) seem to be the same person. If you go and look at what else these reviewers have reviewed you will see that the reviews are for the same exact movies written on the same date and all are given incredibly high marks: mostly 10 stars, a couple of 9s. The reviews even read as if written by the same person. I've seen the movie \"Flawless\" which is one of the movies that this person reviewed and gave it 10 stars. \"Flawless\" is another good bank heist movie; it's a sleek, sophisticated and polished film that I'd rate at 7 or 8 stars. \"Flawless\" is a better film that \"Graduation\", but the this multiple reviewer gives them both ten stars. RBigs, summarizes one of the movies he/she reviewed as \"Finally, a good movie\". But, every movie that RBigs reviewed was given 10 stars --- so there is just no quality assessment to the reviews.",
         "I just wanted to give an advise to those who are wondering if the movie is good enough.Yes, it is. Its actually the perfect combination of action and drama. On the one hand you have good looking young actors, who gives a brilliant performance, and on the other you are truly involved in the plot. You are touched by the songs, played in the background, with one of the best alternative sounds like Iggy Pop, Bloc Party. The most considerable part of the movie are the characters. They are all different from each other, but are still together to fight for a good cause.(bank robbery is no more something bad D). Anyway I'm not sure that everyone will like the movie, but you can give it a try, but if you're a teenager I strongly recommend it to you ;)",
         "Four friends on the verge of graduation face a tough decision. One of their friends, Carl (Chris Marquette) has a mother who's battling cancer, and things look grim for her unless she gets a bone marrow transplant. They don't have insurance, and need $100,000 to perform the operation. Harvard bound student Polly (Shannon Lucio) plans an almost impossible scenario. She suggests the four of them rob her father's bank. Her jock boyfriend (Riley Smith) is against the idea - mostly because he doesn't want to screw up his chances in life. Rebellious Jackson (Chris Lowell), who has a secret crush on Polly, is all for the idea. So the four friends devise a masterful plan to rob the bank vault on their graduation day. There's been several bank heist movies lately, but what I liked the most about \"Graduation\" is that the characters are going through the typical teenage angst. Polly is dealing with her father's infidelity, Chauncey is dealing with the fact that Jackson likes Polly, Jackson is dealing with the fact that he likes Polly, and Carl is dealing with his ailing mother. They rob the bank not for their own personal gain, but to help an ailing woman. I couldn't help but to think if I was in Carl's situation, what would I do? I would do the same thing, anything to protect the one I love. Sure, it's not THE best heist movie ever made, but it was an enjoyable film, and it made you get involved in the characters' lives, and you root for them to complete this seemingly impossible task.",
         "You turn your back on the girl of your dreams....just when she finally wants you. You ignore your awesome IQ. You become 'violent' for the first time in your life .. and decide that is your best career choice. You wily nilly stick your unmasked face inches away from the person who's testimony will put you away for 20 years when she ID's you. So much for the gibberish, nonsensical and absurd final scene. Obviously the last scene represents writing gone 'amok.' Given all the planning and joint efforts of an entire group, a group that had 'special' help in making the robbery workable, it is ludicrous to tell us that any one person can go it alone as a career choice and hope to succeed. Might as well end the film with him putting a gun to his head and pulling the trigger. Make the hospital scene 'your' final scene for a way better film.",
         "most of the movies i rent from red box DVD or DVD express i have come to find are B movies and they are so terribly i wonder how they ever got made into movies. in fact the last four movies i have rented from these places i had to turn off they were just so bad. but finally i got a break this time Graduation was a very entertaining film. The color pallet chosen for this film was excellent. however i was never really sure what year this film took place. all the actors were equally talented no one really stood out as better than anybody else. I also appreciated the fact that i did not have to keep seeing laptop computers every five minutes with the apple logo on it. in fact not once did i see any computers in this film. i would have liked to see what happened to the mom in this film who was sick all the time i highly recommend this film to anyone",
         "I was taken to see this movie on a date last week or so. I really enjoyed it. I didn't recognize most of the cast, but Shannon Lucio ( I actually came to IMDb to find out what her name was) did a fabulous job! She is a beautiful girl with a beautiful talent. I was very impressed by all the talent in this movie, but most of all I just really enjoyed the story. I love a movie that doesn't involve a huge complicated plot that loses you ten minutes into it. This was just a sit back, relax and enjoy type movie. Hope you all enjoy it as much as I did, and hopefully we'll see more of the actors/actresses in the future~!",
         "I was so bored during my graduation ceremony, robbing a bank would've been really tempting! What a great story! This turned out to be a pretty good movie. I expected all action, typical bank robber stuff, but that's not what I got at all. There was a lot of drama involved too. The girl's dad is having an affair, the guy's family member is deathly ill, and there's a little romance in there! This was a very well rounded film, there is a little something in it for everyone. It would be a really good date movie. One that you both could enjoy. I say take over this movie a pizza and some wine, you got your self a hot date!",
         "This was a great heist movie. They found a way to keep it original and throw in some drama and romance. Shannon Lucio was great, everyone else was great as well. Love Chris Marquette! All in all, great movie. What a cool, fun story: A friend's family member is sick, you're mad at your dad for having and affair, so let's rob his bank! But, let's do it during the ceremony for graduation! Loved it, I'll watch it again when I get a copy.",
         "You can tell that this movie is going to be annoying right from the beginning. Not much buildup to make the viewers care about any of the characters. Do teenage kids really put their lives and future on the line to help out one of their friends' parent who's in dire need? Maybe. But this movie is very unconvincing of this notion. What I can't stand is over acting and meaningless distractions that are meant to be funny. It's just annoying and questions any hint of realism. The part that did it for me was when the wannabe good actor with green hair gets distracted by a cute bank teller rather than deliver a crucial item of their plan. Blah. I turned it off. No need to watch further. And I did enjoy movies like Sugar & Spice, Bring It on and even Stick It. All off the wall teenage movies that are charming and funny. This movie, Graduation, is a total mess, lacking in neither of these qualities.",
         "Graduation is an intense and clever thriller that surprised the hell out of me. It only got 3 1/2 stars, because the beginning drags on forever, but by the end of this film, you will be very satisfied. This young cast led by TV veteran, Chris Marquette, follows four best friends approaching their high school graduation. Unfortunate circumstances lead them to need a large sum of money and they come up with the only option available to them, rob a bank. This is a tough film to review without spoilers, so I can't say more than that, but this is a very clever film, with some great young actors. Although it was slow at first, the ending makes it all worthwhile, and you'll be very surprised at where the groups choices lead them. This may be a b-movie with a no-name cast, but it's one that will change the way you think about certain things and I highly recommend it!",
         "I was in Guatemala for a missions trip this summer, and while I was there we went shopping there. Now, they don't have regular DVD's like the US has, everything is bootleg. Well, l bought a few of them, one of them being Grace is Gone. Anyways, I get home, pop it int, and to my (though I really shouldn't be) surprise, it was Graduation. I was sort of disappointed because I wanted Grace is Gone, but I decided to give this a try anyways. It is not a bad movie by any means. Its actually pretty good. The story line is average, but some of the characters make it worth your while. Its got some good humor and drama, as well as being a crime film. Its not great, but not bad either. Worth a look if you like anyone in the cast. I rate this 6/10. (my rating) PG-13 for some sexual content, language and brief violence"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Hanson Film Group",
         "Blueline Films",
         "Blumhouse Productions"
      ],
      "summaries": [
         "Four best friends, about to graduate from high school, must find a way to raise money to help a family member in need. When one of them discovers her banker father having an affair, the foursome plots to rob his bank during graduation ceremonies. When things don't go according to plan, they end up learning more about themselves in one day than they ever did in school.",
         "The film follows a group of high school seniors who are uncertain where life will take them after they get their diplomas. One is concerned about a family member in need of medical treatment; another is worried that her banker father is having an affair. The seniors hatch a plan to rob his bank during their upcoming graduation ceremony.",
         "Four best friends plot to rob a bank during their high school graduation ceremony in order to help out one of the teen's sick relatives."
      ],
      "budget": 0
   },
   "movielensId": 69095,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-04-24",
      "dvdReleaseDate": "2008-05-13",
      "directors": ["Michael Mayer"],
      "runtime": 89,
      "movieId": 69095,
      "title": "Graduation",
      "mpaa": "",
      "actors": [
         "Shannon Lucio",
         "Riley Smith",
         "Chris Marquette",
         "Chris Lowell",
         "Adam Arkin",
         "Aimee Garcia"
      ],
      "imdbMovieId": "0475286",
      "originalTitle": "Graduation",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Four best friends, about to graduate from high school, must find a way to raise money to help a family member in need. When one of them discovers her banker father having an affair, the foursome plots to rob his bank during graduation ceremonies. When things don't go according to plan, they end up learning more about themselves in one day than they ever did in school.",
      "tmdbMovieId": 19203,
      "avgRating": 2.9,
      "releaseYear": "2007",
      "numRatings": 5,
      "posterPath": "/q7jxtKBBSieh3Rado12WeA018qi.jpg"
   }
}