{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fetish",
            "id": 2699
         },
         {
            "name": "sadomasochism",
            "id": 6373
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "bdsm",
            "id": 158713
         }
      ],
      "imdb_id": "tt0119935",
      "video": false,
      "title": "Preaching to the Perverted",
      "recommendations": [
         109477,
         19205,
         18395
      ],
      "backdrop_path": "/68dzZT9meusFOyE2UEGmc0p7u4g.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter Emery",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007acd",
               "name": "Christien Anholt",
               "profile_path": "/2HpTdq83tOiU03AoelFzmqwMNis.jpg",
               "id": 29409,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tanya Cheex",
               "gender": 1,
               "credit_id": "52fe43f3c3a368484e007ad1",
               "name": "Guinevere Turner",
               "profile_path": "/4TfrypzdT5ngoywRz7XyPexaDkN.jpg",
               "id": 32030,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Henry Harding MP",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007ad5",
               "name": "Tom Bell",
               "profile_path": "/ylBV5ZVw7GiPRqKu2gpqH3UbL8J.jpg",
               "id": 22169,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Fibbin' Gibbins",
               "gender": 2,
               "credit_id": "52fe43f4c3a368484e007aeb",
               "name": "Ricky Tomlinson",
               "profile_path": "/oTU9U8AfbII10LaX02vccT8WyXD.jpg",
               "id": 29699,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mr. Cutts Watson",
               "gender": 2,
               "credit_id": "52fe43f4c3a368484e007aef",
               "name": "Roger Lloyd Pack",
               "profile_path": "/6hWATATAe2Tv7v2EKefdjfAaI7.jpg",
               "id": 81024,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Esmeralda",
               "gender": 1,
               "credit_id": "52fe43f4c3a368484e007af3",
               "name": "Sue Johnston",
               "profile_path": "/szj85zAr85La2DQeloIqLovMyq9.jpg",
               "id": 21553,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Eugenie",
               "gender": 1,
               "credit_id": "52fe43f4c3a368484e007af7",
               "name": "Julie Graham",
               "profile_path": "/tTHLCb74VfmsVafX9gAm2ZiZ0Vt.jpg",
               "id": 47735,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Miss Wilderspin",
               "gender": 0,
               "credit_id": "52fe43f4c3a368484e007afb",
               "name": "Georgina Hale",
               "profile_path": "/nVq4XP4HsPN9U3L2OTEqwAjv3Vo.jpg",
               "id": 92434,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "M'Learned Friend",
               "gender": 2,
               "credit_id": "58a800afc3a3686685003e25",
               "name": "Julian Wadham",
               "profile_path": "/mOncV8nKgN0sb6GsvBq2YrraEft.jpg",
               "id": 5473,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Milkman",
               "gender": 2,
               "credit_id": "58a800cd92514156ab004485",
               "name": "Keith Allen",
               "profile_path": "/qLaiCqSlCrcGWETlMWQ4VTJTo9Z.jpg",
               "id": 20056,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bouncer",
               "gender": 0,
               "credit_id": "58a800d7c3a368661a003ff2",
               "name": "Shend",
               "profile_path": null,
               "id": 67210,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Night Porter",
               "gender": 2,
               "credit_id": "59e10f6a9251412cb300297c",
               "name": "Ian Embleton",
               "profile_path": null,
               "id": 1579987,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007adb",
               "name": "Keith Hayley",
               "profile_path": null,
               "id": 79138,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f3c3a368484e007ae1",
               "name": "Stuart Urban",
               "profile_path": null,
               "id": 133210,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f4c3a368484e007ae7",
               "name": "Stuart Urban",
               "profile_path": null,
               "id": 133210,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.108204,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 20684,
      "vote_count": 8,
      "budget": 0,
      "overview": "Henry Harding MP, a British government minister on a moral crusade, hires an inexperienced young computer whizzkid, Peter Emery who works for a Christian computer company called Holy Hardware, to infiltrate the United Kingdom BDSM scene.",
      "similar": [
         948,
         8810,
         298312,
         4638,
         11564,
         2142,
         141,
         185,
         10285,
         431,
         101,
         205,
         681,
         949,
         23483,
         769,
         793,
         4771,
         261023,
         238636
      ],
      "original_title": "Preaching to the Perverted",
      "runtime": 100,
      "poster_path": "/3bHGnpgLvAfasPLMjyA7phjF8RO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cyclops Vision",
            "id": 17436,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "PTTP Films",
            "id": 17437,
            "origin_country": ""
         }
      ],
      "release_date": "1997-07-04",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "He wants to save her. She wants to pervert him. Who will win?",
      "adult": false,
      "homepage": "http://www.preachingtotheperv.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stuart Urban"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Stuart Urban"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119935/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwNDk4MDA0N15BMl5BanBnXkFtZTcwODExNjQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Guinevere Turner, Christien Anholt, Tom Bell | See full cast and crew »"],
      "reviews": [
         "In Germany there was much fuss about this film, as we´ve heard much about it, but it was hard to obtain at first. Finally, someone managed, and meanwhile I´ve seen the film in its English original and in a translated version. I loved it at first sight! Tanya makes a dream of a domina, and Peter´s so sweet... I presume, you enjoy it more when you´re a member of the fetish/sm-community, but the gags - I mean jokes ;) - should be intelligible by everyone, I think. Of course you need a strong sense of humour, and you shouldn´t feel offended by people who feel good kneeling in a cage, being beaten and stuff like this. It´s in no way a true insight of the fetish-scene - it´s too much dreams coming true ;) - but it´s fun for the kinks and open-minded vanillas, too. And that´s more to say of than of any other film I know. Kaya",
         "A lot of people can't see beyond the SMBD of this film, but if you're able to get past that you can see the real message of the film. I was blown away after watching it. It's very beautiful and stunning, especially using pink to mark everyone who has a perverted life, public or no. The message of this film is that strange and \"normal\" can share a common bond. The hardcore Christian gets sucked into the SMBD world and the dominatrix... well, you have to see the movie to understand. I won't tell. Needless to say, look beyond the superficial implications of this film and root for the deeper meaning. It is one of the best films I have seen since I can relate to both Peter and The Mistress. If you can't stomach SMBD don't watch it. If you do watch it, I urge you once again: look beyond the superficial implications and find the real meaning of the film. You will be shocked with what you find.",
         "I love this movie and I love Stuart Urban for making this movie. It allows a person that may not be very knowledgeable of Fetish/BDSM culture into their world a bit. I like the plot of the story because I am so against Governments and Religious Grounds trying to force perfectly willing and competent people from doing what makes them happy. PTTP is a must see for anyone interested in films that may be considered Taboo. Or a fan of independent and/or foreign films. I have read some of the other reviews and must say to those that put negative reviews, it may not be the most popular or mainstream movie around and you could get all technical if you want too, but this movie is something different and that is refreshing in the film world of repetitive plot lines and same old same, old actors. This films have beautiful imagary from the costumes and makeup to the club scenes and set designs. Guin Turner was spectacular in this film and I for one am really glad she made it. She brings a wonderful sensuality that females or even males could look up to.",
         "I didn't have huge expectations of this movie, and thus was pleasantly surprised. It is basically a romantic comedy dressed up in outrageous clothing! Guinevere Turner from Go Fish is the super cool star, and spends most of the film strutting around in a selection of stunning fetish outfits. It is interesting to get an honest insight into the Fetish world, but thankfully the details are not too gory. It was also good to hear a soundtrack featuring dance music that you would actually hear in London/English clubs. The film has some good deadpan humour, and has quite a feel-good atmosphere. Definitely worth a look.",
         "Very, very seldom does a film come along and make me want to watch it over and over. This is one such case. Sure it has some corny story elements. For example, the ending was a little corny... a little too happy and perfect. And yes, the government would never send somebody to infiltrate subversive groups like this. But the entire film is laced with tongue in cheek satire so let's just sit back and enjoy the story can't we? From a very visual person such as myself, the costumes, makeup and set design are outstanding! True, most of the scenes are probably a little over the top compared to the real BDSM scene, but once again, this is film is not meant to be taken literally. Even the music is wonderfully chosen to reflect each scene. These technical and creative merits alone deserve an A+. Yes, Guinevere Turner is exceptionally beautiful and sexy in this film, but Sue Johnston deserves a WOW for flat out courage for shaving her head and still looking this gorgeous. This film has deservedly won a place on my list of top 10 films of all time. From a visual standpoint it's easily in the top 5, right next to The Cell, Moulin Rouge, and Bram Stoker's Dracula.",
         "A great film, and finally some media representation of the fetish scene. Gwin Turner looks great (as usual) as the US Dominatrix determined to put on shows in the UK much to the disgust of a certain MP. Perhaps not to everyone's taste, but people interested in the fetish scene in particular should not miss this.",
         "First of all, let me say that I know nothing about the S&M scene in London or anywhere else for that matter. But from an outsider's viewpoint, I enjoyed this film a lot. Guinevere Turner was stunning and a great dominatrix, the film was fresh and funny, an interesting, amusing take on somewhat of a taboo subject. The film was on the whole a visual feast with good direction but not without its bad points. Christien Anholt as Peter was appalling. He simply cannot act. Lucky for him, there was so much else going on. The script is a bit clumsy and the ending a little anti-climatic but who cares when the film itself is so much fun? Extra credit for getting some great bit-part roles from Ricky Tomlinson, Sue Johnston and Roger Lloyd-Pack (Trigger from \"Only Fools and Horses\"!).",
         "I found this to be a most entertaining movie. The cast were very convincing - one might almost think they WERE players. The SM action is, of course, less than extreme, and the party rooms were rather Hollywood grand, but well worth watching. Much of the film is based on the 'Spanner' case etc, and is very pertinent in all countries where the self identified \"Christians\" are always ready to tell the rest of us what to do. Certainly streets ahead of the dismal \"Exit to Eden\", and vastly more entertaining than \"Waterworld\", \"The Postman\" and the rest of that over priced drek.",
         "preaching to the perverted is i.m.h.o. an excellent film, one of the increasing number of well made british films that never really got anywhere (pity). A film that addresses the issues of censorship and consenting sado masochism you would think that it was all a little on the serious side, not the case, it manages to raise more than a few laughs along the way. The direction is superb with colour imagery being used very successfully throughout the film to bring to the for many of the topics that the film is trying to deal with. all in all worth a watch.",
         "*** Very Mild Spoilers*** Preaching to the Perverted is a fun little movie that had the potential to be more. Its production values are pretty high for such a \"non-commercial\" film and visually it is very attractive. It does a good job of satirizing both the fetishist and conservative communities, but its arguments don't really break any new ground. It represents a caricature of both worlds, rather than finding any deep truths. Watch it just for silly fun, and you will be satisfied. Guine Turner and Christien Anholt, although not the world's greatest actors, are both appealing enough to easily gain the viewer's empathy. Supporting actors do a great job and there's lots of eye candy to behold. Although I really enjoyed the humor of the film, a few things were dissatisfying. We never really get to know The Mistress (Turner) or Peter (Anholt) and so the dynamics of their relationship are figured out only through guesswork on the part of the viewer. That they change is obvious through the PLOT of the film, but never through their interactions. For this reason, the film fails to show us anything of significance about either Peter's sexual inhibitions and desires or The Mistress' \"darkest fantasy.\" Without this, it's just a movie to be forgotten in a few days. One other whine is that the MP conservatives are simply shown as hypocrites, which is just too easy. I would have loved to see this movie actually engage the idea that ultra-conservatives might believe the crap they spew forth. Peter, after all, begins as one of them ... so how does he end up where he does by the ending of the film? On the other hand, what has made The Mistress so dissatisfied with her own world? Exploring the faults of both sides would have made for a VERY interesting and significant flick! Again, these are just \"could haves.\" Overall, I really loved the movie and found it to be laugh-out-loud funny in some parts. If you have even a passing acquaintance with the fetishist community, you will see many jokes at the expense of types within the scene."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cyclops Vision",
         "PTTP Films"
      ],
      "summaries": ["Minister on a moral crusade employs young computer whizzkid Peter to infiltrate the London S&M scene. Peter has to gather evidence of physical \"assaults\" in order for the Minister to prosecute and shut the scene down. But Peter gets unwittingly drawn into it and falls for the Mistress Tanya Cheex."],
      "budget": 2000000
   },
   "movielensId": 6914,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-07-04",
      "dvdReleaseDate": "2003-10-21",
      "directors": ["Stuart Urban"],
      "runtime": 100,
      "movieId": 6914,
      "title": "Preaching to the Perverted",
      "mpaa": "",
      "actors": [
         "Christien Anholt",
         "Guinevere Turner",
         "Tom Bell",
         "Ricky Tomlinson",
         "Roger Lloyd Pack",
         "Sue Johnston",
         "Julie Graham",
         "Georgina Hale",
         "Julian Wadham",
         "Keith Allen",
         "Shend",
         "Ian Embleton"
      ],
      "imdbMovieId": "0119935",
      "originalTitle": "Preaching to the Perverted",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["YfqwPVnMgCA"],
      "plotSummary": "Henry Harding MP, a British government minister on a moral crusade, hires an inexperienced young computer whizzkid, Peter Emery who works for a Christian computer company called Holy Hardware, to infiltrate the United Kingdom BDSM scene.",
      "tmdbMovieId": 20684,
      "avgRating": 3.30645,
      "releaseYear": "1997",
      "numRatings": 31,
      "posterPath": "/3bHGnpgLvAfasPLMjyA7phjF8RO.jpg"
   }
}