{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "graveyard",
            "id": 166512
         },
         {
            "name": "cannibalism",
            "id": 208048
         }
      ],
      "imdb_id": "tt0415679",
      "video": false,
      "title": "Boy Eats Girl",
      "recommendations": [
         16634,
         13946,
         68878,
         95667,
         40059,
         28522,
         26962,
         29293,
         44811,
         114789,
         169644,
         39368,
         49877,
         10076,
         11607,
         16126,
         18278,
         4288,
         100669,
         2151
      ],
      "backdrop_path": "/tv4V2t6ekNdV1LN3CrYyuAoASny.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jessica",
               "gender": 1,
               "credit_id": "52fe452fc3a368484e04d04f",
               "name": "Samantha Mumba",
               "profile_path": "/tYN2uZAe0OWHM10epuNk1O74IWh.jpg",
               "id": 97049,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nathan",
               "gender": 2,
               "credit_id": "52fe452fc3a368484e04d053",
               "name": "David Leon",
               "profile_path": "/qpHGG0DPPMJrqmWrXbiO1vNzz4o.jpg",
               "id": 97050,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Diggs",
               "gender": 2,
               "credit_id": "543a6275c3a36819a500270d",
               "name": "Tadhg Murphy",
               "profile_path": "/moufXbTBTbyX6Fiyue10M9Ph6RA.jpg",
               "id": 1256162,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Henry",
               "gender": 2,
               "credit_id": "543a6282c3a368199000288b",
               "name": "Laurence Kinlan",
               "profile_path": "/a4eWlwkqLYfmmfTfXgAvDfVrr8h.jpg",
               "id": 17019,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Samson",
               "gender": 0,
               "credit_id": "543a62b8c3a368198c002904",
               "name": "Mark Huberman",
               "profile_path": "/1qxKNlmkxC6gX8n79xX9llez3oo.jpg",
               "id": 96522,
               "order": 4
            },
            {
               "cast_id": 26,
               "character": "Cheryl",
               "gender": 0,
               "credit_id": "5960cf98c3a3680d59091108",
               "name": "Sara James",
               "profile_path": "/r0pKk69aqUanpAc7t2hQ0CqNu5f.jpg",
               "id": 1233561,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Shane",
               "gender": 0,
               "credit_id": "543a62d2c3a368199c002843",
               "name": "Paul Reid",
               "profile_path": "/1HRaOvP91vh3tizLgTaHxVVlDPL.jpg",
               "id": 1373165,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Glenda",
               "gender": 0,
               "credit_id": "543a62db0e0a2649a800295b",
               "name": "Jane Valentine",
               "profile_path": "/xsqpA8lWX89mOmGbhLhmCQXjScW.jpg",
               "id": 1373166,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Grace",
               "gender": 0,
               "credit_id": "54f438dc92514179920019e9",
               "name": "Deirdre O'Kane",
               "profile_path": "/aBNsZeIlVK5Unz0HXvFHO9rIm6t.jpg",
               "id": 158637,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "555438d39251416ddf001708",
               "name": "Sarah Burke",
               "profile_path": "/c6JsDEjYdhf6knWl3UyqQ5qruN7.jpg",
               "id": 208485,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "Mr. Frears",
               "gender": 2,
               "credit_id": "5960e096c3a3680d590927ce",
               "name": "Bryan Murray",
               "profile_path": "/rLbKNOvJ1FhWf8MEMtfVPB9jOwW.jpg",
               "id": 1486723,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Kenneth",
               "gender": 0,
               "credit_id": "5960f4a9c3a3680d59093dc6",
               "name": "Conor Ryan",
               "profile_path": "/qGUmOSjhmkKwb3lzWI4ygILDDEP.jpg",
               "id": 1847384,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Mrs. Brumble",
               "gender": 1,
               "credit_id": "5960f8c09251417904024ee0",
               "name": "Doreen Keogh",
               "profile_path": "/357p149NYSKthg7YRq6F52lttSV.jpg",
               "id": 1236632,
               "order": 13
            },
            {
               "cast_id": 30,
               "character": "Craig",
               "gender": 2,
               "credit_id": "5960fb39c3a36828a10d204e",
               "name": "Denis Conway",
               "profile_path": "/lnnOJpfdTLtVNIrPngfrNC4IgTm.jpg",
               "id": 63360,
               "order": 14
            },
            {
               "cast_id": 31,
               "character": "Fr. Cornelius",
               "gender": 2,
               "credit_id": "5960fb869251415a4008e302",
               "name": "Lalor Roddy",
               "profile_path": "/z3NXDVD6a6bwnvBu2j77aGGnSA2.jpg",
               "id": 182043,
               "order": 15
            },
            {
               "cast_id": 32,
               "character": "Dympna",
               "gender": 0,
               "credit_id": "5960fc419251410a590bcc0f",
               "name": "Elaine Murphy",
               "profile_path": "/fOZGFRRTgqzMyY1ysDzqGuYR0EQ.jpg",
               "id": 1847409,
               "order": 16
            },
            {
               "cast_id": 33,
               "character": "Bernard",
               "gender": 2,
               "credit_id": "59e392f39251410b6700020d",
               "name": "Domhnall Gleeson",
               "profile_path": "/yu9bBCF0tJwa2PIQahch83IfIBI.jpg",
               "id": 93210,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "543a63450e0a2649a5002a6d",
               "name": "Stephen Bradley",
               "profile_path": null,
               "id": 1373168,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "543a63500e0a2649ab0028ae",
               "name": "Derek Landy",
               "profile_path": null,
               "id": 549339,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "543a635fc3a36819a5002720",
               "name": "Ed Guiney",
               "profile_path": null,
               "id": 43147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "543a63760e0a2649a5002a75",
               "name": "Andrew Lowe",
               "profile_path": null,
               "id": 43144,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "543a63bf0e0a2649a5002a7b",
               "name": "Dermot Diskin",
               "profile_path": null,
               "id": 1324921,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "586c48e6925141087e0019bc",
               "name": "Stephen Rennicks",
               "profile_path": null,
               "id": 551482,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "586c48f092514108750019d7",
               "name": "Hugh Drumm",
               "profile_path": null,
               "id": 590922,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "586c48fc925141086d001a63",
               "name": "Balazs Bolygo",
               "profile_path": null,
               "id": 71285,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 3.031184,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 27134,
      "vote_count": 23,
      "budget": 5000000,
      "overview": "A boy declares his love for his girlfriend, only to die the same night. He is brought back to life by his mother as a flesh-craving zombie, who sires more teen undead while trying to control his, er, appetite for his beloved.",
      "similar": [
         485415,
         400136,
         24920,
         1562,
         72190,
         19908,
         170,
         82654,
         766,
         16288,
         10925,
         13648,
         8408,
         336843,
         294254,
         24935,
         923,
         16871,
         1576,
         49524
      ],
      "original_title": "Boy Eats Girl",
      "runtime": 80,
      "poster_path": "/6982IQ8M16T36QxGwA0xcwfhsY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lunar Films",
            "id": 2568,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Element Films",
            "id": 2274,
            "origin_country": ""
         },
         {
            "logo_path": "/trP3GsUyIztMwcqev3jK1gOeCSA.png",
            "name": "Irish Film Board",
            "id": 5267,
            "origin_country": "IE"
         }
      ],
      "release_date": "2005-06-07",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Bradley"],
      "runtime": 80,
      "synopsis": "The film begins with Nathan's mother finding a voodoo ritual book in the church. Nathan, a school boy, is talking to his friends Diggs and Henry about girls in their year who they like. Nathan had been friends with Jessica for a while and planned to ask her out, but as approaching her she gets into Kenneth's car. In distress, he returns home, drinks alcohol and prepares to hang himself. At the last minute he hesitates and pulls at the noose, only for his mother to walk into his room, knock him off the chair and turn his music down. Turning around, she notices him hanging there, dead. She then uses the voodoo \"reanimation\" book to bring Nathan back to life. The Priest warns the mother that a book has gone missing from the church, and that if used it can create flesh eating people. On awakening, Nathan seems fine, and seems to be hungry but human. He goes to school, unbeknown to his mother bringing him back to life, or his suicide attempt. Nathan overhears a conversation between Samson, Shane and Kenneth about Jessica, and what a whore she is. Nathan then calls Jessica a slut and says \"you're just like all the other girls\". Jessica hits him and walks off. Later on at the school disco Cheryl , Samsons girlfriend, takes an interest in Nathan, and so Samson antagonises Nathan. Nathan bites Samson, creating the first of the infected. Nathan wakes up in the morning, and complains that all the food in the fridge is \"off\". His mother then realises what Nathan has become, and he leaves in search of Samson. He finds a bloody trail at the scene of the biting, and follows it to find a lifeless womans corpse. He runs to the police station, and attempts to tell the police but they laugh and send him away. Meanwhile, Henry and Diggs are waiting for Nathan so they can pick a film from a video store. The decide to go ahead without him, and when reaching the counter see the boy who's meant to be at the counter eating another man. They then scream and run out. Hiding behind some bins, they see more infected chasing a women. They hide, and one comes back, looks around and leaves again. Noticing this is not just a one-insane-person situation, they look up, seeing a dead body hanging over them. They scream and run again. Nathan is realizing that his veins are turning black, as he can see them going up his neck. He returns home, to find his mother has locked him out, saying she will \" fix this\". He sits in the garage. Henry and Diggs get into their car, see the infected and duck. The infected head towards Jessica's house, and they call her and tell her to hide. They then drive to Nathans house, and Nathan drags them into the garage. They see Nathans face and gasp, noticing that he must be infected as well, though he seems sane, if hungry. Cut-scene of the Priest biting someone... Jessica wards off a few infected, and hides in the barn. Nathan and crew arrive,and Nathan runs into the barn. Meanwhile Cheryl has escape a few infected from a bar and runs through a graveyard, letting an infected Charlotte bite Glenda. She steals a teachers motorcycle and is chased all the way to Jessicas house. Cheryl, Henry and Diggs hide in a closet from the infected.Nathan explains a few things to Jessica, and Cheryl, Henry and Diggs climb out of the closet. Nathans mother goes back to the church to return the book, and gets attacked by the priest. She grabs a snake that was slithering around since the start and lets it bite him. The Priest is returned to normal. Now the mother knows the solution. Jessica cuts up a load of the infected (except for Shane and Samson) with presumably her father's tractor, cutting and ripping them to shreds. They all run back into the barn.The two remaining zombies hands break throw the door and grab Cheryl, Cheryl attempts to escape but the grip is to strong,they bust throw completely and pull Cheryl on the ground, were she is eaten by Shane and Samson, and the others continue to climb up the ladder into the attic. Nathan is on the brink of changing, and his mother drives in, throws the snake at him and gets back in the car. Nathan lunges for the snake, but it falls down and Samson kicks it away. Cheryl, now infected, Shane and Samson hit and smash the car. Nathan jumps down onto Samson as his mother runs away,Nathon rips Samsons head off, but by now Nathan is one of the fully-infected. He climbs back up to Jessica, Henry and Diggs. Jessica sets a bale of hay on fire, and gives it to Nathan,who in a second after being given the bale is bitten by the snake. He throws the bale down onto the two zombies and gets dragged down with it, where a huge flame appears. Jessica, Henry and Diggs walk away. Nathan is hooked by his hood away from the fire, and survives. He gets the abandoned motorcycle and drives after Jessica and his two friends. They catch up, and Nathan says the words he's been dying to say all along : \" I have something to say to you...\" Jessica and Nathan kiss and its happily ever after.",
      "writers": ["Derek Landy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0415679/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwNzU3Nzk1N15BMl5BanBnXkFtZTcwNTM1MjA0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Samantha Mumba, David Leon, Tadhg Murphy | See full cast and crew »"],
      "reviews": [
         "From the title \"Boy eats Girl\" it's pretty clear that this film is one that requires you to leave your brain outside the door. Do that and you should enjoy it. If you're hoping for anything more than a bit of enjoyable fluff, look elsewhere. The film starts off great, the audience gets to know the main characters quite well, and there are more than a few good laughs. It goes downhill slightly from the moment in the film were the infection begins to spread. This is mainly because it all seems so rushed. However the gory bits (which there is quite a lot of for a 15A film) are varied and inventive enough to keep the viewers entertained. The main cast all do a good job, in particular David Leon and Tadhg Murphy. Samantha Mumba is good in her role, but she hasn't got as much dialogue as you'd expect from the films lead. Some of the supporting cast however (for example, Bryan Murray as Fr.Frears) are awful. Overall it is an entertaining, funny, gory movie, and one of the best Irish productions in a long time.",
         "This is a brilliant take on a real life zombie invasion, that makes you think what would i do? Yes i do admit that the storyline when it comes to the bit about how the zombies were created ( by voodoo) was a bit weak and also the love story between the two main characters was a bit too soppy, but you've got to expect that from a teen movie. But as for the amount of gore that definitely deserves a 10 out of 10, not only is the tractor kill scene the best gore i've seen in a zombie movie ever it was stomach churning as well as funny. As for the comment i have just read bout it not being a very good teen horror movie, thats just wrong, yes not a good teen horror movie but thats because its not one, its a comedy and its not meant to scare the hell out of you and make you jump every five seconds. Anyway definitely another good zombie film from this area of the world, definitely deserves to be up there with Shaun of the dead and 28days later!",
         "I didn't expect a whole lot from this movie, and to be honest I didn't get that much. From the onset the movie was pretty tame and I felt the set up was a bit long, I was praying for the carnage to just start already. However once it did, the movie found some very funny moments. The main characters weren't all that compelling but the two comic relief friends Diggs (Tadhg Murphy) and Henry (Laurence Kinlan) did manage to get a few good lines in. The movie had its share of plot holes (quite a few of these were pretty big.) But on the whole I did find it funny and I was smiling by the end so it wasn't too bad, just nothing to write home about. I felt it tried a little too hard to fit with what are usually American high school stereotypes and could have been a little more homegrown. The over the top gore (which was my whole reason for viewing) was good but the movie ended very quickly and after such a long set up I was a little disappointed. All in all a vaguely entertaining watch with a few (but not enough)laughs.",
         "The restorer and single mother Grace (Deirdre O'Kane) is working in an ancient church and she finds a hidden crypt with a voodoo book of resurrection. However, Father Cornelius (Lalor Roddy) asks her to go home and forget her findings. Her son Nathan (David Leon) is a sensitive and shy teenager bullied by Samson (Mark Huberman) at school. He has a crush on his friend Jessica (Samantha Mumba), but he does not declare to her. His best friends Diggs (Tadhg Murphy) and Henry (Laurence Kinlan) schedule a date of Jessica with Nathan. However her father grounds her in her bedroom and when Nathan calls Jessica, her father tells that she has dated a good looking guy in a car. Jessica flees through the window, but Nathan and Jessica fail to meet each other. Jessica takes a ride in Kenneth's car and Nathan believes that she is dating the schoolmate. He goes home, drinks whiskey and puts a rope around his neck. When Grace comes home, she opens Nathan's bedroom door and accidentally she hangs her son. Grace resurrects Nathan, but soon she finds that something did not work out when her son bites Samson and his schoolmates start eating each other. \"Boy Eats Girl\" is an unoriginal Irish comedy about a group of zombies that are not living dead, but teenagers infected by the bites of their schoolmates that follows the American style with Irish accent. This B- movie entertains, but is not funny enough for a comedy or frightening for a horror movie. The lead actress is miscast for the role of Jessica and the slut Cheryl is never naked along the story; therefore one of the basic rules of a B-movie is broken. But there are also funny dialogs that make laugh. My vote is five. Title (Brazil): Not Available",
         "Boy Eats Girl is the kind of film to watch when you're in a non-committal mood, something that demands only vague attention and which doesn't try to be clever. If you want a horror or a zombie movie then look elsewhere, it's neither nor does it try to be. It is a comedy, let's get it straight right now, not a zombie film. Romero's legacy to pop culture and the film industry certainly gets a good outing here, but this isn't a film to make gorehounds feel fat and happy, nor will zombie purists find anything to debate over. A lot of the characters are like those from sappy American Teen comedies but with Irish accents and in situations involving blood and throw-away limbs. Perhaps this helps: It's California Man with gore. It entertained me for the short running time (about an hour I made it) and I liked it enough to cough up £5 for it. If you give it a chance as a silly gory comedy, you may well like it too.",
         "\"Boy Eats Girl\" is an Irish-made romantic zombie comedy (\"RomZomCom?\") about a high schooler who, when he thinks he's lost the girl of his dreams, commits suicide ... only to end up becoming Patient Zero of a zombie outbreak thanks to his well meaning but misguided mother, who resurrects him from the dead with the help of a voodoo spell book. After reading that description, I'm sure those of you who are looking for a serious zombie movie are already going to look for something else. For those who are still reading, \"Boy Eats Girl\" was a hilarious horror/comedy treat with -- gasp! -- a sweet side!! As the film begins, our high school hero Nathan has already got enough problems -- being bullied by the jocks, abused on the rugby field - but when he accidentally misses a chance to tell his long time friend Jessica how he really feels about her, he goes home and hangs himself. Re-awakening the next morning after a last minute \"rescue\" by his mother, Nathan begins to notice some, errrr, \"changes\" in his body, chief among them the urge to munch on human flesh. Turns out Mom used a voodoo spell book \"borrowed\" from the local church to bring Nathan back from the dead... but there was a page missing from the book so she accidentally left out a step. Whoops. Nathan is able to contain his, errr, \"appetite\" for only so long, until he finally takes a bite out of one of his high school tormentors at a school dance. This, of course, is a bad idea. His victim goes on to bite some people, who then go on to bite some more people, who go on to bite even MORE people, until sure enough, his quaint little Irish village is being overrun by zombies. Even though he may be one of the Undead now, Nathan still doesn't want anything to happen to his beloved Jessica, so he and his two doofus friends race to her family's home to rescue her just before the horde of undead descends upon the place. Hilariously over-the-top mayhem ensues. It takes a little while for the zombie shenanigans to really get going in \"Boy Eats Girl\" but once it does I doubt any gorehound will be disappointed. (The scene where Jessica charges into the horde on her father's farm machine is friggin' EPIC!) From then on, the blood and guts, as well as the one liners, come fast and furious. The compact run time (just about 80 minutes) keeps \"Boy Eats Girl\" from overstaying its welcome, and wraps everything up nicely. Fans of \"Shaun of the Dead\" or \"Zombieland\" should get a few kicks out of \"Boy Eats Girl,\" and the film is a worthy addition to the growing Zombie Comedy genre.",
         "I thoroughly enjoyed this movie. It's gotten a lot of stick but to be honest I can't see anything wrong other than the stick up it's critics backsides. It isn't a full-on horror movie, it's more like the Buffy movie with zombies instead of vampires and a lot more gore. People like to gripe and moan about more accessible movies, declaring in a grandiose fashion that 'what has become of our once great cinematic history' blah blah blah, then instantaneously undermining their argument by finding something like Scary Movie more to their tastes. Seems Boy Eats Girl has been on the receiving end of the kind of folks who think their ability to use a keyboard makes them some kind of Brian Sewell. Well, it won't be the first time. Aside from the aforementioned gore, Boy Eats Girl is a horror-comedy with the emphasis on the comedy. It's premise is pretty similar to Shaun of the Dead, but it's a much more mainstream kind of humour, seeing as it relates to high-schoolers. Thankfully the clichés of the 'high-school horror' are largely dodged through the combination of zombies (a surefire way of spicing anything up. The horror equivalent of a horde of angry ninjas lol) and an ace script that flips most of the clichés on their head. For instance, the preppy bimbo character who's dating the jock is not only quite intelligent and resourceful, she's also given a lot of lines and a fair chunk of plot to get on with. The characters are one of the two key places this deviates wonderfully from the teen-horror crowd. All of these characters have a little story of their own, none of them just feel like they're serving as a box-ticker in a genre movie. You almost feel sad to see them meet a sticky end. Almost. Why you won't entirely is the hilarious and OTT ways they go out. For instance, at one point an ageing Science teacher swears at the bimbo girl as she flies by on a scooter, only to pitch headfirst into a ditch and be jumped by five zombies. Once there's a horde of hungry Irish zombies wandering the neighbourhood, things get really interesting, really bloody and above all satisfyingly silly. It isn't a classic horror, I'll grant you that, but it's endearingly stupid and has some of the best one-liners ever. It's funny, it's gory and it has hordes of zombies. I can't see what the problem is.",
         "Part satire and part romantic-comedy, Boy Eats Girl should be looked upon as a homage to the classic 70s horror genre and not a poor effort at recreating the success of Shaun of the Dead. Hailing from Ireland, it takes plenty of liberties in its character's settings and mannerisms. Not wholly European as you'd expect but it works on most levels, just not so much on the humour however. Nathan (David Leon) is the heartbroken teenager who accidentally kills himself after making the mistake of witnessing the love of his young teenage life, Jessica (Irish pop sensation, Samantha Mumba) in a compromising situation with his school's Lothario. Nathan's mother (Deirdre O'Kane) finds his lifeless body in his room and remembers the handy book of resurrection spells that she'd found just days earlier in the bowels of the church that she works at. As easy as you can say beginner's luck, she manages to bring back her son and gets him ready for the next day of school. Nathan starts to feel the effects of his zombification when he starts to feel impervious to pain and feels hungry all the time. His 2 pals, Henry and Diggs (Laurence Kinlan and Tadhg Murphy) who at times seem even less shiftless than their dead friend, get worried when they see Nathan's disenchantment with Jessica vanish. At the night's school disco, resident slut and girlfriend of the toughest jock in school, Cheryl (Sara James) propositions Nathan. Not exactly willing to do what Nathan wants from her, she ditches him. Unfortunately for Nathan, the jock boyfriend follows him as he stumbles on to the rugby pitch. Normally, this would be a cakewalk for bully-kind everywhere but Nathan's newfound undead ability of super-strength makes it easy for him to overpower the jock. He finally gives in to temptation and takes a couple of deadly chunks out of him. Nathan runs home and is given the bare bones of his worsening condition by his mother who promptly locks him in the garage as she finds a cure. Things start to get a whole lot worse for him after last night's attack starts a chain reaction of killings, each spawning a much more vicious version of Nathan's condition. The plot and situation 'borrows' heavily from a handful of movies, especially the 1993 cult classic, My Boyfriend's Back with virtually the same sub-plot of unrequited love between the unfortunate undead and his high-school sweetheart. As most will use Shaun of the Dead as a touchstone in understanding the film's comedy/gore tandem, it's intended use of black comedy and detached humour falls short. The backyard splatter that comes from fending off ravenous classmates and neighbours is refreshing to see and it does it well. The violence and the reactions of the harried survivors are always tongue-in-cheek which is satisfying, as the zombie horde never comes close to being scary, just downright silly. The flaying of skin and removal of limbs is a requisite in any good romp through a town full of undead. However, the gore starts of perfunctory, not exactly a good sign when it takes almost half the movie to get there. As the film progresses to its climax, a visible shift in priorities takes place. Suddenly, the story stops and a zombie free-for-all take place, courtesy of a pimped out tractor and surge of adrenaline from the heroine. As the movie is a relatively short enterprise, clocking in at about 77 minutes (including credits), it almost makes up for the lack of spilled blood and guts when the horror aspect of the film finally kicks in. Most satires succumb to taking themselves too seriously at some point in their films and Boy Eats Girl is no different. The romance between Nathan and Jessica felt too overdone in the beginning, leading to the most controversial scene in the movie that initially got it banned in its native Ireland. The attempted suicide scene was clumsy and awkward; not exactly an endorsement for depressed teenagers everywhere. The film starts out slow, working out the set-up of the eventual suicide that triggers the rest of the plot, leaving just a third of the movie for bona fide zombie mayhem. Each transition is disjointed and rushed, especially the weak example of a deus ex machina during the last minutes of the film. The 1-note characters and unresolved story lines are indicative of the apathetic acting and lack of fleshed out character development. Mumba does not show any signs of being a tough female character in the beginning, making a transformation into the movie's heroine seem out of character. Leon's Nathan seems too self-aware and confident to pull off being the angst-ridden chump who finds it hard to bring up his true feelings around Jessica. From start to end, its campy throwback to nonsensical horror-comedy masks over its inability to find its feet and its problematic attempts at satire. Suffering from a painfully short running time and an overly brisk pacing, Boy Eats Girl does not fulfill the potential that it has. What it does achieve is a quick and harmless way to spend just over an hour when bored. Rating: 2 out of 5 stars",
         "Story about a teenager who accidentally kicks the bucket, but only to return as a zombie like teenager. Thirst for blood and need for human flesh included. Throw in some lovey dovey side-plot crap and you basically have Boy Eats Girl. The flick most importantly, isn't that bad. It's actually kinda entertaining. With a decent amount of grue and silly Irish teen humor, it ain't that bad. But the flick just wasn't that memorable. With alright gore, alright acting, and alright ideas being presented, it just doesn't grab you like a comedy or a horror should. It wasn't truly funny or scary. It's basically a rehash of everything you've probably seen before in the Zom/Com/Rom sub-genre. I can tell you one thing, there was a female character in this flick, that desperately needed to get naked. But she did not. She played the bitchy slut, and showed off her cleav throughout. I guess the makers thought they were making a flick that didn't need it. Wrong. Note to all horror film-makers everywhere: If you're gonna have a slutty chick in a movie (with big tits in this case), have her show some damn skin. Only good can come from this. Boys Eats Girl is a pretty damn average RomZomCom flick that was entertaining based solely on the amount of blood it spilled. But where it matters, like in the laugh and chills department, it just didn't get it done. Though it is recommendable, it has a \"teen movie\" charm, uses a slightly different approach to zombie flicks and, yep, the blood.",
         "If you scratch the surface of this film you will find so many plot holes and problems that you won't enjoy it. Easy solution - Watch it for what it is. A COMEDY. We expe3ct people to behave in strange ways in comedy films and we understand that it is essential to the plot. Some people here have complained about the Zombies and why this or that happened and would it have happened, etc, etc. For me I treated the film as mental flow and thoroughly enjoyed it. Lots on Blood, guts and limbs, lots of violence and hints of sex. What more can you ask of a black comedy. So what if the mothers first thought was black magic rather that the paramedics. Who cares that some zombies changed immediately. If you watch the film for what it is then you should enjoy it, treat it like Citizen Caine or some deep french drama and you'll ruin it for yourself. All the clues to what it's going to be like are there, from the title itself to the animated chase scene after the introductory screen finishes and the title screen begins. If you want a film to analyse I'd suggest Death Tunnel or Asylum BTW. Angelfish"
      ],
      "genres": [
         "Horror",
         "Comedy"
      ],
      "productionCompanies": [
         "Element Films",
         "Irish Film Board",
         "Lunar Films"
      ],
      "summaries": [
         "The restorer and single mother Grace is working in an ancient church and she finds a hidden crypt with a voodoo book of resurrection. However, Father Cornelius asks her to go home and forget her findings. Her son Nathan is a sensitive and shy teenager bullied by Samson at school. He has a crush on his friend Jessica, but he does not declare to her. His best friends Diggs and Henry schedule a date of Jessica with Nathan. However her father grounds her in her bedroom and when Nathan calls Jessica, her father tells that she has dated a good looking guy in a car. Jessica flees through the window, but Nathan and Jessica fail to meet each other. Jessica takes a ride in Kenneth's car and Nathan believes that she is dating the schoolmate. He goes home, drinks whiskey and puts a rope around his neck. When Grace comes home, she opens Nathan's bedroom door and accidentally she hangs her son. Grace resurrects Nathan, but soon she finds that something did not work out when her son bites Samson and his schoolmates start eating each other.",
         "A boy declares his love for his girlfriend, only to die the same night. He is brought back to life by his mother as a flesh-craving zombie, who sires more teen undead while trying to control his, er, appetite for his beloved."
      ],
      "budget": 5000000
   },
   "movielensId": 69211,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-06-07",
      "dvdReleaseDate": "2008-01-01",
      "directors": ["Stephen Bradley"],
      "runtime": 80,
      "movieId": 69211,
      "title": "Boy Eats Girl",
      "mpaa": "R",
      "actors": [
         "Samantha Mumba",
         "David Leon",
         "Tadhg Murphy",
         "Laurence Kinlan",
         "Mark Huberman",
         "Sara James",
         "Paul Reid",
         "Jane Valentine",
         "Deirdre O'Kane",
         "Sarah Burke",
         "Bryan Murray",
         "Conor Ryan",
         "Doreen Keogh",
         "Denis Conway",
         "Lalor Roddy",
         "Elaine Murphy",
         "Domhnall Gleeson"
      ],
      "imdbMovieId": "0415679",
      "originalTitle": "Boy Eats Girl",
      "genres": [
         "Fantasy",
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A boy declares his love for his girlfriend, only to die the same night. He is brought back to life by his mother as a flesh-craving zombie, who sires more teen undead while trying to control his, er, appetite for his beloved.",
      "tmdbMovieId": 27134,
      "avgRating": 2.53226,
      "releaseYear": "2005",
      "numRatings": 31,
      "posterPath": "/6982IQ8M16T36QxGwA0xcwfhsY.jpg"
   }
}