{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0025455",
      "video": false,
      "title": "The Man From Utah",
      "recommendations": [
         22602,
         53830,
         40799,
         23590,
         40797,
         49640,
         84905,
         22612,
         53828,
         23391,
         40717,
         98413,
         40743,
         36499,
         22606,
         84902,
         53781,
         40684,
         80193,
         173267
      ],
      "backdrop_path": "/tBYuEoBk3sitV11tUH40jNWsd80.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Weston",
               "gender": 2,
               "credit_id": "52fe4873c3a36847f81676bd",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marjorie Carter",
               "gender": 1,
               "credit_id": "52fe4873c3a36847f81676c1",
               "name": "Polly Ann Young",
               "profile_path": "/oYrFQYWjHUEwvFxOWsCzdnAxziR.jpg",
               "id": 89681,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dolores",
               "gender": 1,
               "credit_id": "52fe4873c3a36847f81676c5",
               "name": "Anita Campillo",
               "profile_path": null,
               "id": 148616,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marshal George Higgins",
               "gender": 2,
               "credit_id": "52fe4873c3a36847f81676c9",
               "name": "George 'Gabby' Hayes",
               "profile_path": "/bW3k2dyTraxwWJTRB5UoUI8JD3H.jpg",
               "id": 88978,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4873c3a36847f81676b9",
            "name": "Robert N. Bradbury",
            "profile_path": null,
            "id": 88648,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.319203,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53622,
      "vote_count": 8,
      "budget": 0,
      "overview": "The Marshal sends John Weston to a rodeo to see if he can find out who is killing the rodeo riders who are about to win the prize money. Barton has organized the rodeo and plans to leave with all the prize money put up by the townspeople. When it appears that Weston will beat Barton's rider, he has his men prepare the same fate for him that befell the other riders.",
      "similar": [],
      "original_title": "The Man From Utah",
      "runtime": 55,
      "poster_path": "/bIB4dk0QJKnWbq4VlA5dP5OGzrV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Paul Malvern Productions",
         "id": 35430,
         "origin_country": ""
      }],
      "release_date": "1934-05-15",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "FRAMED BY A GANG of Murderig Thieves!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert N. Bradbury"],
      "runtime": 55,
      "synopsis": null,
      "writers": [
         "Lindsley Parsons",
         "Lindsley Parsons"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025455/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3NjU1NDI3Nl5BMl5BanBnXkFtZTcwNTI5ODYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Wayne, Polly Ann Young, Anita Campillo | See full cast and crew »"],
      "reviews": [
         "\"The Man From Utah\" is another of the Lone Star Westerns Wayne made in the 30's. This one has a rodeo setting with the Duke trying to outsmart the gang behind the murders and deceptive practices occurring therein. The producers make extensive use of footage shot at some long forgotten rodeo. With the money they saved they actually were able to come up with a pleasant enough musical score, a rarity for poverty row quickies. They even were able to incorporate a left over \"musical\" number from one of Wayne's ill-fated \"Singin'\" Sandy Saunders efforts at the beginning, even though it has nothing to do with the rest of the picture. The cast includes Polly Ann (sister of Loretta) Young as the heroine and Anita Compille as the good/bad girl competing for the Duke's affections. George (pre-\"Gabby\")Hayes is along again, this time as a Marshal. Edward Piel Sr. is the chief bad guy and once again proving that as an actor, he made a great stuntman, Yakima Canutt. Not the best of the Lone Star series, but not the worst either.",
         "I just watched a couple of John Wayne's old B-westerns on the Encore Channel and was taken aback by someone's brilliant idea to replace the musical soundtrack! Instead of the original music, new and much louder music is present--and it sounded especially weird with the electronic instruments used to make it. After all, it wasn't like they used synthesizers in 1934!! Overall, this is a BAD thing--and I recommend you just download the free movie as linked by IMDb, as the music is just annoying--and even worse than in \"The Lucky Texan\". What idiot thought doing this was a good idea?! Like the other new tricked-out B I just saw (\"The Lucky Texan\"), this one also featured George \"Gabby\" Hayes. And, like \"The Lucky Texan\", you might have trouble recognizing Gabby at first, as he doesn't sport his usual huge raccoon-like beard...and is a bit more macho than usual. After all, you certainly don't expect to see him playing a US Marshall! As for the plot, it's pretty bad...even by B standards. That's because HUGE segments of the film consist of nothing but old rodeo footage and the plot involving a fixed rodeo competition is a cheap way to make use of this film. Wayne plays 'Weston'--a guy who shows himself to be very handy with his fists, on a horse and with a gun. As far as his singing goes, like Wayne's 'Singing Sandy' films, it is very, very obvious that it's not him doing the singing and fortunately this singing persona soon was abandoned in upcoming films. As a result of lots of padding and the Encore soundtrack, it's definitely among the least watchable of Wayne's B-westerns. It's really a shame, as normally Wayne's Bs hold up pretty well...just not this one. By the way, please note the 1930s fashions on the leading lady. I guess historical anachronisms weren't much of a concern with this film!",
         "\"The Man From Utah\" opens with a singing cowboy strumming a guitar on horseback. This is how we're introduced to John Weston (John Wayne), heading into town and looking for work. When he helps Marshal Higgins (George pre-Gabby Hayes) foil a bank robbery with his fancy shooting, the marshal offers him an undercover job as a deputy to investigate the Dalton Valley Rodeo. Apparently, the annual winners of the big prize money in the rodeo are a tight knit band of bad boys in the employ of Spike Barton (Ed Peil), who also happens to head up the rodeo committee. Serious challengers to the supremacy of Barton's top henchman Cheyenne Kent (Yakima Canutt) wind up severely ill or dead. Even back in these 1930's Lone Star Westerns John Wayne had a charismatic presence that hinted at future star quality. If for nothing else, seeing Wayne so young in these films is a real treat. The movie itself clips along at a quick fifty three minute pace, much of it taken up by stock rodeo footage of roping, bulldogging and Indian parade and dance. In the deciding rodeo event, Weston avoids disaster by discovering a poisoned needle inserted into the saddle of \"Dynamite\", a formerly unridden bronco on which he must outlast Cheyenne. The ending is no surprise, as Barton's bad boys forsake winning the rodeo events and go for the whole thirty thousand dollar pot of prize money deposited in the local bank. But the marshal and Weston are there to foil their plans and save the day for the Dalton Valley Rodeo. And as we've seen before in films like \"Neath the Arizona Skies\" and \"Randy Rides Alone\", Wayne's character closes out the film in a clinch with a pretty young lady, this time the judge's daughter Marjorie Carter (Polly Ann Young), who pined for him throughout the film.",
         "Too much stock footage (almost one third of this 53 minute film) really slows this one down. Granted that the plot is that John Weston (John Wayne) is sent by Marshall George Higgins (George Hayes) to participate in a fixed rodeo (say \"Ro-DAY-oh\"), but character development and interaction are sacrificed. The relationship between the Bad Girl (usually a Latina-- even in the great \"Duck Soup\" [1933]) and the 'heroine' Polly Ann Young, a Loretta Young look-alike (hey! it's her sister!) could have benefited from more screen time. The happy ending is too abrupt-- although this time John Wayne actually kisses the girl. The most interesting stock footage was the lengthy rodeo parade of real Indians, squaws, and papooses. But when the best part of the movie is the stunt work by the Mighty Yak, Yakima Canutt, who gives us jumping from one horse to another and several different running leaps onto a horse, you know we're in trouble. As noted by others, the final fight with the villain is very poorly done. My copy, from 'Platinum Disc Corporation' featured an added,sparse, ill-fitting (pseudo-classical) stereo music track that ruins the authenticity of the original film.(The DVD box had 'enhanced audio 5.1' on it.) If you're going to modernize and colorize it you should add a 'western' sounding score with acoustic guitars, 'klip-klopping' hoofbeats, harmonicas, and an accordion. Finally, we have to say this is one of the weakest Lone Star efforts.",
         "At the start of this Lone Star cheapie, the Duke strays into Roy Rogers territory as he warbles in a worryingly light voice while trotting along on his trusty steed - and one can only speculate on how foolish he must have felt. Thankfully, our hero quickly becomes too involved with a crooked rodeo gang to 'entertain' us with any more serenades as he 'bulldogs' and 'Roman Rides' and does all the other things an honest cowboy has to do to get in with a gang of crooks. Subsequent fame has given us a kinder opinion of Wayne than he probably deserves in terms of his potential in these early days. Ford saw something there, but nobody else in Hollywood did, and Wayne spent most of the 30s trudging from one no-budget potboiler to another. He's better than most of the cast in this flick, but there's little to indicate the massive star power he would one day possess - it's only his size that seems to give him a presence (and that, if truth be told, is what Wayne was - a screen presence rather than an accomplished actor). All these flicks were padded out with interminable shots of cowboys riding very fast on their horses, and this one's no different. But in this one we're also treated to lengthy scenes of rodeo riders - which are actually more interesting than the horse-riding fillers, even though the numerous shots of men twisting steers' necks to near-impossible angles in order to floor them and prove their macho status are not pleasant to watch. And the Indians - who were rarely a feature in the Lone Star flicks - are relegated to the status of rodeo sideshow acts here. THE MAN FROM UTAH is by no means the worst of the Lone Stars pics (of the ones I've seen, that particular wooden spoon is reserved for RANDY RIDES ALONE) although the superhuman status given to Wayne's character is a bit over the top. Probably the best from this era is THE LUCKY TEXAN, so if, for some bizarre reason, you're in a position to choose between the two, be sure to plump for the Texan.",
         "In this low budget oater from Monogram we've got John Wayne helping U.S. Marshal Gabby Hayes bring down some bank robbers in the very act of same. Gabby liked the way young man handled himself so he takes him on as an undercover agent to smash a rodeo racket. You heard it folks, a rodeo racket. This bunch comes to a given town sets up a rodeo, take in bets from the locals on their best cowboys and the gang's cowboys always seem to win by hook or deadly crook. They also do a few other things on the side like bank robbery, rustling, your usual western crimes. They've also got a unique way of dispatching competition into eternity which I won't get into. The Duke was lucky to discover what they had in store for him. I will say that modern forensic science would have had the mystery solved. This was one of those films where they tried to make John Wayne a singing cowboy. The film begins with him on a white horse, strumming a guitar, singing some forgettable ballad. Some Nelson Eddy wannabe's voice is dubbed in and you know it isn't Wayne. It's so bad that even audiences in 1934 would have known this wasn't John Wayne, And this was before he became JOHN WAYNE.",
         "Forget the guitar-strumming opening. This is Wayne at his youthfully charming best, relaxed and easy-going before the pressures of super-stardom and the booze bottle began to show .This is really a rodeo picture with lots of well-integrated footage of calf-roping, bull-dogging, and more, but no gun-play. (Am I wrong or do some of the pageant paraders look like they just staggered out of a saloon.) The baddies are trying to rip-off the town sponsors of the rodeo and only Wayne and the marshal stand in their way. It's fun watching the cantankerous Gabby character trying to break out from Hayes' serious marshal role. Polly Ann Young (Loretta's sister) with a really big smile makes a fetching love interest-- watch Wayne really plant one on her at fade-out. I don't know, but I thought the girl who played the Mexican Delores had a really phony accent. Then I checked the cast and came to find her movie credits are mostly Spanish language productions! Oh well, maybe she don't speak Spanish so good. Anyway, this is average Lone Star fare, mainly for rodeo fans who like seeing a bull's big neck get stretched or a scrawny little calf get thrown to the ground.",
         "Even if The Man From Utah looks like a cheap production with its spliced in scenes from a rodeo, it still is a lot of fun to watch. Having been to a rodeo the night before viewing this John Wayne western, the movie was all the more interesting for me. Those old rodeo scenes are exciting because they are real! It is also interesting to compare the calf roping techniques of seventy plus years ago to the way rodeo competitors do it today. Looking too deep into the story shows its flaws. Flowing with the scenes as they are presented makes viewing easier. What is really missing most is the background of the character, John Weston. We know nothing about him, and for that reason it is odd that the marshal immediately hires him to go undercover at what is suspected to be a fixed rodeo. We know John Wayne is playing a good guy, but when the marshal just says he knew that John Weston is a good guy after having met him minutes before a robbery... that is a bit of a stretch. It is possible that the original story had more depth, but a little more revealing dialog about the character of John Weston would have helped the final product of this movie. At least The Man From Utah was not haphazardly edited together like The Lawless Frontier, leaving some continuity holes to ponder. If you want to see an outstanding performance by George Hayes before he was to become known as \"Windy Halliday\" or \"Gabby Whitaker\" this is a great example. Even if Hayes did not have any more screen time than normal, he had perfected what it took to look good on screen by 1934. In contrast, John Wayne looked good on screen, but in The Man From Utah he sometimes tripped through some of his lines. Usually this is attributed to Wayne's \"delivery.\" Not this time. That in itself is not a bad thing. The more the an actor looked like a genuine cowboy trying to play one in a movie, the better he was liked. Wayne was working through another quickly made low budget production, and he was always improving. The Man From Utah was another stepping stone in John Wayne's path to greatness.",
         "Marshal George Higgins appoints John Weston a deputy after the latter helps save the Wells Fargo office from being robbed. Higgins wants Weston to use his riding skills to enter the rodeo and prevent a gang from having the contests fixed and some of the riders killed before they win the prize money. Weston notices that Barton, a promoter in town, is the head of the crime ring and takes heed before he can enter the final races. Barton also has another sideline, robbing Carter's bank of the gate receipts following his attempted \"snake bite\" treatment for Weston. Very good Lone Star film for Wayne being one of Bradbury's better directorial and writing efforts. Considering Canutt was one of the riders in the rodeo, it would have been nice to see some actual riding shots instead of the stock footage. Nice interaction between Wayne and Young (she was quite fickle). The climactic fight between Wayne and Peil was a bit of a letdown, but the rest of the film was able to make up for it. Rating, based on B westerns, 7.",
         "John Wayne made a number of crummy movies at Lone Star. Trying to decide which was worst is not easy, but \"The Man From Utah\" is hard to beat. John Weston (Wayne) rides into a new town looking for work, and immediately jumps in to stop a robbery in progress. U. S. Marshal George Higgins (George Hayes, later known as Gabby Hayes) then asks Weston to help solve a series of mysterious rodeo deaths he believes are caused by insiders running the rodeo, whose hired hands always win when these rodeos end in sudden death. \"It's mighty peculiar that these outsiders fall off those tough broncs sufferin' from snake bite,\" Higgins says. \"I tell you it just ain't natural.\" That's some mighty fine po-lease work, I tells yuh. Everything about \"The Man From Utah\" suggests a cut-rate, hurry-up production, more so than the usual Lone Star offerings Wayne made with director Robert N. Bradbury. The movie is slathered with minutes of footage of real rodeo action which seems a decade older than the rest of the film. Parading American Indians, steer roping, stagecoach races, people in stands waving and cheering, it just goes on and on. Wayne is terrible in this one, stiff and wooden. He talks in a monotone and barely seems engaged in what he's doing. A weak script supplies his character with zero motivation to do more. Asked by this guy he never met to go undercover and risk his neck to solve the rodeo mystery, Weston simply smiles and says \"Sounds great to me!\" without even asking about pay. \"I'm kind of green at this racket,\" he says at one point. Green don't cut it here. For some reason, the film introduces Weston on a horse and singing. I think it was him singing, and not the horse, though each seems to lip-sync as well as the other. When Weston reaches town, he puts the guitar behind a tree and the singing never comes up again. Why bring it out in the first place? Padding. It's the reason for the stock footage, too, and a lot of other things in this movie. Take a sequence where Higgins takes Weston to meet a man chopping wood, who then takes Weston to a canoe on a river, whereupon they paddle to a small corral where the guy gives Weston a horse and tells him there's a trail to the town where the rodeo is being held. Why did we need to see all this, if not to fill time? Fifty-two minutes never seemed so hard to fill. Everything is off in this film, from the opening gunfight (everyone including Wayne wave their pistols up and down when firing them, like finger jabs) to the closing battle, where Wayne rides up on two men who shoot and shoot at him, not breaking stride until he jumps off and tackles them to the ground simultaneously. Hayes is fun to watch at times, and so was Polly Ann Young as the pretty love interest, though like everyone else she's saddled with bad dialogue trying to shoehorn a love story in the off minutes. Everyone else plays their parts like rejected extras from a social- disease short. It's hard to rustle much love for this one. Even one of the more positive reviews of this movie notes: \"Looking too deep into the story shows its flaws.\" I second that sentiment, provided \"looking too deep\" means watching it for more than 90 seconds. \"The Man From Utah\" is something you don't want to watch unless you are a John Wayne fan, in which case you REALLY don't want to watch it."
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Romance",
         "Sport",
         "Western"
      ],
      "productionCompanies": ["Paul Malvern Productions"],
      "summaries": [
         "The Marshal sends John Weston to a rodeo to see if he can find out who is killing the rodeo riders who are about to win the prize money. Barton has organized the rodeo and plans to leave with all the prize money put up by the townspeople. When it appears that Weston will beat Barton's rider, he has his men prepare the same fate for him that befell the other riders.",
         "John Weston (John Wayne), the man from Utah, drifts into town just as Marshal Higgins (George 'Gabby' Hayes), is shooting it out with three bank robbers. Higgins asks Weston to assist him in the investigation of a crooked rodeo-promoting gang that has been cheating neighboring towns of the their money and the mysterious deaths of the top rodeo performers.",
         "In a horse-riding rodeo contest bad guys want John Weston to lose. When he doesn't go along they add some insurance: a poisoned needle just under his saddle."
      ],
      "budget": 0
   },
   "movielensId": 69217,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-05-15",
      "dvdReleaseDate": "1998-02-24",
      "directors": ["Robert N. Bradbury"],
      "runtime": 55,
      "movieId": 69217,
      "title": "The Man From Utah",
      "mpaa": "G",
      "actors": [
         "John Wayne",
         "Polly Ann Young",
         "Anita Campillo",
         "George 'Gabby' Hayes"
      ],
      "imdbMovieId": "0025455",
      "originalTitle": "The Man From Utah",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": ["rmGmfKlem4U"],
      "plotSummary": "The Marshal sends John Weston to a rodeo to see if he can find out who is killing the rodeo riders who are about to win the prize money. Barton has organized the rodeo and plans to leave with all the prize money put up by the townspeople. When it appears that Weston will beat Barton's rider, he has his men prepare the same fate for him that befell the other riders.",
      "tmdbMovieId": 53622,
      "avgRating": 3,
      "releaseYear": "1934",
      "numRatings": 6,
      "posterPath": "/bIB4dk0QJKnWbq4VlA5dP5OGzrV.jpg"
   }
}