{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cannon",
            "id": 3242
         },
         {
            "name": "slapstick",
            "id": 9253
         },
         {
            "name": "crown jewels",
            "id": 208126
         }
      ],
      "imdb_id": "tt0106827",
      "video": false,
      "title": "Ernest Rides Again",
      "recommendations": [
         39129,
         39128,
         20551,
         34600
      ],
      "backdrop_path": "/hDDDxD9ERsx1mPmAtHG8EnZ25uz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ernest P. Worrell",
               "gender": 2,
               "credit_id": "52fe455f9251416c9102ff9f",
               "name": "Jim Varney",
               "profile_path": "/eIo2jVVXYgjDtaHoF19Ll9vtW7h.jpg",
               "id": 12899,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Abner (as Ron K. James)",
               "gender": 2,
               "credit_id": "545139120e0a263a04004c15",
               "name": "Ron James",
               "profile_path": "/z2FatYUMADjSCyQCGQco5pvUC3Z.jpg",
               "id": 1231704,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dr. Glencliff",
               "gender": 2,
               "credit_id": "5451391e0e0a2642c200195c",
               "name": "Tom Butler",
               "profile_path": "/25mdyFUsVexK1eTHBvlfd8GPmF0.jpg",
               "id": 85922,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nan",
               "gender": 1,
               "credit_id": "5451392a0e0a2639fe004b90",
               "name": "Linda Kash",
               "profile_path": "/8rhFeK1ZUPvBxXpeuXCESQCzR4f.jpg",
               "id": 14893,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe455f9251416c9102ffa5",
               "name": "John R. Cherry III",
               "profile_path": null,
               "id": 83961,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545138f7c3a368532b004acb",
               "name": "John R. Cherry III",
               "profile_path": null,
               "id": 83961,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54513900c3a368023c004900",
               "name": "William M. Akers",
               "profile_path": null,
               "id": 314339,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "56bd36229251417344001615",
               "name": "Helen Jarvis",
               "profile_path": null,
               "id": 22061,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.343151,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 34300,
      "vote_count": 6,
      "budget": 0,
      "overview": "Buffoonish Ernest and his dimwitted pal Abner unearth a huge cannon reputed to contain the crown jewels of England.",
      "similar": [
         3082,
         607,
         87818,
         9530,
         28333,
         19133,
         13161,
         11576,
         961,
         992,
         10098,
         3063,
         936,
         400028,
         28448,
         11937,
         6283,
         20678,
         115210,
         23988
      ],
      "original_title": "Ernest Rides Again",
      "runtime": 94,
      "poster_path": "/yJtkKhm14q2mOfZvDm2EuAIgd0L.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Emshell Producers",
         "id": 36791,
         "origin_country": ""
      }],
      "release_date": "1993-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": {
         "backdrop_path": "/vTlcbHNWrAf77AZFDZ9yCjHm8ag.jpg",
         "name": "Ernest Collection",
         "id": 330555,
         "poster_path": "/m8CTuM76DbvFvpCHBepso5Bu7nw.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John R. Cherry III"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "John R. Cherry III",
         "William M. Akers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106827/",
      "coverLink": null,
      "actors": ["Stars: Jim Varney, Ron James, Tom Butler | See full cast and crew »"],
      "reviews": [
         "This film really exposes William Akers as the cinematic genius that he is. While on the surface the story of goofy Ernest may see superficial and desultory, Akers manages to delicately weave a thought provoking and life-changing story that tugs at your heart while keeping you at the edge of your seat. I have seen the film many times and each time I am reminded what an amazingly durable and lasting work it is. It endures because of the underlying meaning - a man is faced with the choice of being a responsible person or simply following his emotional whims. There is an Ernest in all of us. 10 out of 10!!",
         "This was probably one of the better \"Ernest\" movies in that it moves fast which means it's pretty entertaining without being too stupid, as some of Jim Varney movies were. However, even this you can except a lot of \"stupid\" but some of that is part of Varney's charm as the lovable \"Ernest P. Worrell,\" a man he made famous first with TV commercials and then with a handful of inane-but- Innocent comedies. This 100-minute film would have much better chopped to 80 or 85 because there are some legitimate laugh-out-loud scenes. Varney does a lot of impressions, some of which are very good. The two nerdy salesmen in here are also funny. As with all the \"Ernest\" films, there is nothing really offensive in here. Today, this could almost be rated \"G.\"",
         "\"Ernest Rides Again\" is yet another great installment of the \"Ernest\" movie franchise. With this film, the plot is much more solid, and more serious than the plots of past \"Ernest\" films, but that doesn't mean it's not a funny movie. The movie is funny, and enjoyable. Jim Varney once again does a great job as lovable knuckle head Ernest P. Worrell, and Ernest's sidekick Abner is OK. The movie overall is excellent, so if you're a die-hard \"Ernest\" fan, and haven't seen this installment yet, then check this out, and be impressed.",
         "The Ernest films are pretty much all the same: amiable, clunky, dumb, with an inspired moment every half hour or so. This is the exception. Same writers, same production company, but for some reason they decided to forget about plausibility and go straight for surrealism -- and the result is one of the funniest movies ever made. There's a story of sorts (lots of people chasing a revolutionary war cannon purported to contain the Crown Jewels of England), and a moral of sorts (don't be afraid to risk), but they're just scaffolding for the gags and shtick. The script abounds in throwaway lines that have no relation to anything else (\"I haven't seen anything like this since the Bay of Pigs\"), scraps of ridiculous dialogue (the history professor sees Ernest with a possibly valuable artifact: \"Where did you get that?\" \"France.\" \"Where in France?\" \"Outside Paris\"), and all sorts of off-the-wall bits (the professor doing Elvis, the Mighty Workboy song). Jim Varney does a few of his standard issue klutzy-Ernest bits, but they just set the real humor in higher relief. Plus, the supporting cast is great: Tom Butler as the villain, alternately sadistic and zoned-out (\"Yes...but many men died\"); Ron James as the nebbishy professor (\"Herpetology is not my field\"); and the magnificent Linda Kash, stealing the picture as the professor's domineering wife (\"Really hate that tie, dear. Really do.\") I've seen this movie maybe ten times, and it gets stranger and funnier every time. If you're expecting something that makes sense, you'll be disappointed, but if you just sit back and watch the weirdness, you're in for a comic classic. 10 out of 10, no hesitation.",
         "The final Ernest movie released in theaters is all about the cannon ride. Like the previous movies, it's an excuse for Jim Varney (who was also known as the voice of Slink in \"Toy Story\") to be silly in the role of the gold-hearted dimwit. I was never really a fan of the Ernest movies, but they were always good for a laugh. The cannon ride in \"Ernest Rides Again\" is entertaining enough. The rest of the movie doesn't quite equal it, though. Ever since Varney died, I've wondered if he felt content only being known as the lovable, buffoonish hick. Sure, it left him with a cult following, but wouldn't he have wanted something more than that? Anyway, this movie is nice, cheap entertainment.",
         "Move over Indiana Jones. Here comes Ernest P. Worrell, our underdog hero. Let me start out by saying this: 'Critics-Schmitics'. Don't let the nay saying critics and reviewers dissuade you from picking up this classic movie. No disrespect, but they obviously don't have a humorous bone in their bodies and don't know how to remove the stick from their butts. I love the Ernest genre and can be biased about Jim Varney but even if I didn't like some of the other Ernest movies, this is a true gem. This is like a live action cartoon and Varney is his own cartoon character. As he once said, \"Oh, I guess I would be if I weren't just THAT close to being an actual cartoon.\" Listen to me and the other positive reviews. This was very well written and very well acted and consistent. The opening song is wonderful and describes Ernest to a T. You've got a 5 ton historical cannon named, \"Goliath\", lots of gun fire, a healthy dose of slapstick by the master himself, Varney, who voices a plethora of characters in top notch form. You have Dr. Abner Melon(Ron James and the 'Vern' of the movie), a meek history professor who is uptight, but thanks to Ernest, learns to loosen up and enjoy an adventure. There is Nan Melon(Linda Kash), Abner's annoying, and overbearing wife and two pesky salesman that finish each other's sentences with perfect timing. Tom Butler(Dr. Radnor T. Glencliff), who has played in various Lifetime movies as a lawyer and all around 'good guy', has the villainous role in this one and is great. He will stop at nothing, even to the point of killing Ernest to get at 'Goliath' and the crown jewels. Comedy ensues as Ernest is the one to find 'Goliath' and takes it for a wild ride everywhere a cannon should not be going. Varney and James play well off each other and this movie couldn't have been cast any better. But unlike other Ernest movies, Ernest seems to have a bit of a higher intellect in this one while still being that lovable hayseed we all know. Even if you're not a big fan of the Ernest genre, I urge you to give this one a chance and form your own opinions because, unlike the reviews of some critics, this movie definitely has merit. Not only did Varney bring back slapstick, he did it even better and was/is still one of the best at this brand of humor. As with all Ernest movies, this is free of vulgarity and filth but still a great ride, 'KnoWhutImean?'",
         "This is an excellent comedy. Varney was just a genius at characterization. I have not seen such funny stuff packed into a movie for awhile. (And I have just watched three other Earnest movies in as many days, and this one is above the rest.) This is a very fast paced movie with lots of stuff going on. Every scene is good. The characters in this movie are great. The action is good, with few special effects, and Earnest's antics are just great, the lines he comes up with. There is an error in the description, the Professor is not some Dimwit...he is timid and insecure, but not stupid. It is sad that we have lost such a great talent in Varney. He did good consistent work with his parodies and characters, and I wish he was still around making more Earnest movies. This one deserves an award of some type....how about a \"Funny\" award?",
         "(note: this review might contain a spoiler warning of sorts!) \"Ernest Rides Again\" builds up a lot of potential but ruins itself, especially at the very end with bad acting and poorly-done scenes. The criminals we would like to see brought to justice are instead flattened against the wall, shot in the legs by darts, and knocked out cold. Yes, it is funny to watch, but it's so disappointing not to see any real justice done to them. Unfortunately for this commedy, there are slow parts to the movie. Some scenes go on forever and we're saying \"Ya, ya, get to the next part of the movie, please!\" Fortunately it was only for a couple of scenes. Like most other slapstick movies, believability hoovers around zero here. We all know that in real life, a non-powered vehicle on wheels can't go on for very long on level or uphill ground. And of course, a truck just can't go by itself without somebody giving it gas or providing the steering. Some of the scenes would have been made even funnier if they were a little more believable. All that aside, most of the acting done on this film was rather poor. The only actor I can say who acted decently was Varney (Ernest). All the other actor were either extremely annoying or had no life in them whatsoever. Good actors grab your attention right away and keep you for the duration of the film. Can't find hardly anything here. All in all, this film would have never made it if weren't for Jim Varney and the laughs that he was able to provide here.",
         "[MIGHT CONTAIN SPOILERS] Ernest P. Worrell was playing near a construction site one afternoon, when he found a piece of ancient material. It was a metal plate, so he decided to show it to his \"friend', Dr. Abner Melon. Dr. Melon is a historical professor at the university, and he has a theory that the crown jewels of England are not in England, but burried in the barrell of a cannon Goliath, buried in the area. But nobody believes him, except for Dr. Glencliff. Ernest shows Abner the relic and after some convincing that it's real, Abner is confident it has the rank number of Goliath on it so his theory is true. Ernest takes Abner to where he found it. They take Abner's wife's brand new car. Ernest doesn't get to drive though. They find a cannon ball--as well as destroy the construction site. Then they head into the woods and find an old mine where the cannon is buried!! Ernest pulls a wheel block out from underneath the cannon, it flies out of the mine and right into Abner's wife's car! Ernest attempts to search for the crown jewels in the cannon, but get's stuck. Then Dr. Glencliff and his team of maurauders show up and snatch the cannon. Ernest becomes released then and hops aboard. The towing cable from the truck to the cannon comes loose, and Ernest speeds down the highway on the runaway cannon. Meanwhile, Abner's wife looks for Abner with two simultaneous talking vacuum salesmen. Also, Dr. Glencliff and his maurauders look for the cannon. Ernest runs through a fair, and into an RV. Also, the British authorities are looking for the cannon also, because they believe the crown jewels are in it. Abner get's aboard the cannon with Ernest and they crash into a barn. They tow the cannon on Farmer John's tractor, who wasn't too pleased, but are soon stopped by Apple Maggot's! They fire off the cannon to stop Dr. Glencliff's limo, but Abner thinks there are no crown jewels in the cannon, so he leaves. Just as Ernest breaks open a wooden barrel tied to the cannon and in it was the crown and jewels! He put's the crown on but can't take it off! Dr. Glencliff takes Ernest back to his headquarters and attempts to get the crown off. Abner, his wife, and the vacuum salesmen come to the rescue, the British authorities also show up and declare he who wears the crown becomes king. Ernest, the king of England? He'd have to learn the language. But fortunately for England, the crown comes off. This Ernest movie is somewhat different from the others. I suppose it's because this one has more action and Dr. Melon represents Vern so much. Jim Varney made this one and Ernest Goes to School at the same time. So do see this movie, Ernest fans! You will not be disappointed! -",
         "This is the third best in the Ernest line, second to Ernest Scared Stupid. It was odd that they went this route with an Ernest film. It almost seemed like they were trying to take Worrell too seriously, and in some places, this film comes off as rough and crude, rather than funny. In spite of that, the story is interesting...intriguing even, but the supporting character, the professor, is a detriment to this work. His interpretation of the character, or maybe even the character itself, is too brash and harsh to fall into the usual Ernest formula, thereby derailing what should have been the best Ernest movie of the line. I always hoped Varney's Ernest would attempt something more substantive like this again, but alas! it is not to be. RIP Jim Varney. You are sorely missed by those of us who loved you. It rates a 6.2/10 from... the Fiend :."
      ],
      "genres": [
         "Family",
         "Comedy"
      ],
      "productionCompanies": ["Emshell Producers"],
      "summaries": [
         "Ernest P. Worrell becomes a new adventurer along with his History Professor partner, Abner Melon. Once they team up together, they discover a really huge existing historical cannon and the crown jewels hidden near the jungle. Ernest must save the jewels especially, before a lousy mob keeps it.",
         "Buffoonish Ernest and his dimwitted pal Abner unearth a huge cannon reputed to contain the crown jewels of England."
      ],
      "budget": 7000000
   },
   "movielensId": 69227,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-01-01",
      "dvdReleaseDate": null,
      "directors": ["John R. Cherry III"],
      "runtime": 94,
      "movieId": 69227,
      "title": "Ernest Rides Again",
      "mpaa": "PG",
      "actors": [
         "Jim Varney",
         "Ron James",
         "Tom Butler",
         "Linda Kash"
      ],
      "imdbMovieId": "0106827",
      "originalTitle": "Ernest Rides Again",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["qgUGuhBiNWQ"],
      "plotSummary": "Buffoonish Ernest and his dimwitted pal Abner unearth a huge cannon reputed to contain the crown jewels of England.",
      "tmdbMovieId": 34300,
      "avgRating": 2.00943,
      "releaseYear": "1993",
      "numRatings": 53,
      "posterPath": "/yJtkKhm14q2mOfZvDm2EuAIgd0L.jpg"
   }
}