{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         }
      ],
      "imdb_id": "tt0054936",
      "video": false,
      "title": "Goodbye Again",
      "recommendations": [
         109815,
         106224,
         37315,
         23283,
         43236,
         4025,
         78339,
         84050,
         14689,
         53712,
         60792,
         25773
      ],
      "backdrop_path": "/uPHOsMXcNakO7Pebtb4SbeC53nM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paula Tessier",
               "gender": 1,
               "credit_id": "52fe48db9251416c9109a78d",
               "name": "Ingrid Bergman",
               "profile_path": "/jXEE0P6705JbMAJ2nwtHjmqkd5F.jpg",
               "id": 4111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Roger Demarest",
               "gender": 2,
               "credit_id": "52fe48db9251416c9109a791",
               "name": "Yves Montand",
               "profile_path": "/zrDxGcU5r1T6arsSRu17fXKArWN.jpg",
               "id": 2565,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Philip Van der Besh",
               "gender": 2,
               "credit_id": "52fe48db9251416c9109a795",
               "name": "Anthony Perkins",
               "profile_path": "/8M8Bt20z0M587lrjkdXrEqYtQKU.jpg",
               "id": 7301,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Van der Besh",
               "gender": 1,
               "credit_id": "52fe48db9251416c9109a79f",
               "name": "Jessie Royce Landis",
               "profile_path": "/o7NngdQPrvEfN3m3UVcjVPwC3Co.jpg",
               "id": 2640,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Maître Fleury",
               "gender": 2,
               "credit_id": "52fe48db9251416c9109a7a3",
               "name": "Pierre Dux",
               "profile_path": "/fkjY2GF1teETttG0DP32lYNGhvu.jpg",
               "id": 27441,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dritte Maisie",
               "gender": 1,
               "credit_id": "57a79d38c3a3680842001819",
               "name": "Michèle Mercier",
               "profile_path": "/6fRJSsHqaw1FKugKmTjcI2WqneD.jpg",
               "id": 19270,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "58734e719251410e6500812a",
               "name": "Jocelyn Lane",
               "profile_path": "/idyuP9SAemjIEVx99tnZD55xKRq.jpg",
               "id": 39768,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "58734edf9251410e770079eb",
               "name": "Diahann Carroll",
               "profile_path": "/t6avXJWcaUh9yZBT6ZWBzvmUAft.jpg",
               "id": 20158,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 1,
               "credit_id": "58734eefc3a368174c008b27",
               "name": "Alison Leggatt",
               "profile_path": "/s9ij033zAp4tY3HiBPN4QGcKs8N.jpg",
               "id": 31942,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "58734ef9c3a3681731006c93",
               "name": "Uta Taeger",
               "profile_path": null,
               "id": 578330,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Queen's Counsel",
               "gender": 2,
               "credit_id": "5988de02c3a36874f2003b8e",
               "name": "David Horne",
               "profile_path": "/7FkB36qWz6EFz3sl1lWtGjaidLt.jpg",
               "id": 119342,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "58734f369251410e62007d3e",
               "name": "Peter Bull",
               "profile_path": "/iIh6WkuefTUVrEybz1CXdz86puI.jpg",
               "id": 6600,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "58734f44c3a368174c008b7c",
               "name": "André Randall",
               "profile_path": null,
               "id": 1096439,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48db9251416c9109a79b",
               "name": "Anatole Litvak",
               "profile_path": "/fq8SaiMXrKZOx1TmYmI5jWpWFTu.jpg",
               "id": 37361,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48db9251416c9109a7a9",
               "name": "Samuel A. Taylor",
               "profile_path": "/1gbnU6wefpK9gMPGgTGEUAYyp2H.jpg",
               "id": 5736,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe48db9251416c9109a7af",
               "name": "Françoise Sagan",
               "profile_path": null,
               "id": 20134,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "58734e17c3a368174600739a",
               "name": "Anatole Litvak",
               "profile_path": "/fq8SaiMXrKZOx1TmYmI5jWpWFTu.jpg",
               "id": 37361,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58734e24c3a368174c008a72",
               "name": "Georges Auric",
               "profile_path": null,
               "id": 2578,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58734e42c3a368174c008a93",
               "name": "Bert Bates",
               "profile_path": null,
               "id": 10185,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a94660b0e0a2616cc03b436",
               "name": "Armand Thirard",
               "profile_path": null,
               "id": 2579,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.365374,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 84119,
      "vote_count": 11,
      "budget": 0,
      "overview": "Stranded by her lover, a 40-ish interior decorator in Paris turns to a U.S. client's playboy son.",
      "similar": [
         269,
         3989,
         255,
         591,
         95,
         707,
         342473,
         147,
         283227,
         8195,
         16869,
         37247,
         858,
         2501,
         2503,
         8055,
         9313,
         350,
         194,
         612
      ],
      "original_title": "Goodbye Again",
      "runtime": 120,
      "poster_path": "/w2afnFbmHVbYK6BQ8h2fDvRSWv2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Argus Film Produktie",
            "id": 233,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mercury Productions",
            "id": 11447,
            "origin_country": ""
         }
      ],
      "release_date": "1961-05-23",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "This is how love is...and always will be...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anatole Litvak"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Françoise Sagan",
         "Samuel A. Taylor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0054936/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNDY1Nzg5MF5BMl5BanBnXkFtZTcwNTI1ODcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ingrid Bergman, Yves Montand, Anthony Perkins | See full cast and crew »"],
      "reviews": [
         "For better or worse, the book on which this film is based, Francoise Sagan's highly-touted French best seller, \"Aimez-vous Brahms?\" was a key document in the early 60's feminist awakening, depicting as it does a horrendous case study of gallic male chauvinism toward an intelligent and faithful woman. Despite the obvious soapiness of the plot, Bergman makes the movie version credible. Her soulful eyes and sad little smile enhance a lovable portrayal of the heroine Paula. Few other actresses of the time had the presence and skill to bring this off -- allowing us to fathom the almost tragic depth of the jejeune Phillip's fascination with a gorgeous \"older woman\" while avoiding the appearance of silliness which might have, but does not, taint Paula's irrational loyalty to Roger. In short, Ingrid probably set the standard for the many subsequent portrayals of more successful independent yet loving women. The rest of the cast helps too -- Montand's magnetism makes Paula's continuing love for the cad almost believable and, for once, Anthony Perkins' stereotypical \"spoiled rich boy \" portrayal is right on target and his infatuation convincing.",
         "I've only just read the other comments on this beautiful film. I first saw it on its release in 1961 - and nearly spent a whole week of evenings at the cinema.I was 16 I'd become a fan of Ingrid Bergman two years before this, on seeing her in \"The Inn of the Sixth Happiness, which was her best film [in my opinion!]. Also then saw and loved \"Indiscreet\", but was bowled over by her next film -\"Goodbye Again\". I wish they had kept the original French title: \"Aimez-Vous Brahms?\". It evokes the atmosphere and meaning of the film and you don't have to be fluent in French to understand it - so why change it? Once again, Ingrid hardly seemed to be acting - she just swept you along with her character, Paula. Some people said that the film didn't work because Ingrid was 45 at the time, supposed to be 40 and looked younger. True! Her make-up artist, John O'Gorman, had to put in a suggestion of dark circles under her eyes and lines on her neck, in order to make her seem 40! All through the film I felt so much for the character of Philip [Tony Perkins], because you could understand why he fell totally in love with Ingrid . You also wondered if Roger [Yves Montand] was out of his mind, drifting around from girl to girl, when he had the most beautiful woman in the world. This was another reason why some people thought the story didn't work. But I don't care - I'll always love it! Ingrid never acts, she just IS her characters, and she always cries \"for real\". That's why there has never been anyone like her and there never will be. This film should be issued on DVD [as I have already suggested for \"A Walk in the Spring Rain\" ]. Owning the video is all right, but it deserves to be preserved for future generations on DVD, so that they can see what a GOOD film really is!!!! Mary",
         "Wow! what a film! I cannot believe I never saw this movie until this evening. Great performances by all. The script is perfect in my opinion. The cinematography by Armand Thirard is simply beautiful; giving a real Parisian early 60's Be-Bop nuance. Auric's film score is great. Ingrid is in excellent acting form & stunning. Yves plays his character very close to the vest which is exactly how this kind of personality needs to be played. Diahann Carroll is so beautiful & cool as the nightclub singer. Jessie Royce Landis is wonderful as Perkins' mother. I've only seen Anthony Perkins in 3 other films & he in my opinion is always excellent. He was obviously a very intuitive actor & so very gorgeous & I think his incredible looks may have hampered others from seeing his incredible acting talents. What else can I say without giving away this magnificent story? A must see for all young girls. The ending scene is so moving I couldn't even cry although I understand why so many other viewers wrote that this is a movie where you need to have plenty of tissues handy. It was a shocking film for me to watch on so many levels because it offered exactly what you expected & then it didn't - too true to life in a most poignant way. Heart wrenching - a definite must see.",
         "I do agree that the film was a little too long, but I still loved it. I had fully expected this film to end happily. I was heartbroken when it didn't come out the way I had pictured it. But, that's a good thing. The point of this movie isn't to show a picturesque life, it's to give a glimpse at what one could be like. I liked some of the running themes in the movie. The \"mask\" theme was pretty easy to pick up on, yet it worked. The full circle the movie does from the beginning to the very end is great, too. But still, so sad. Worthy of a good cry. The cast is all fine, but I believe Tony Perkins steals all his scenes. As Phillip, he does play many different parts. But he manages to be sincere in all of them. He did a splendid job, and I laughed heartily at many of his little \"play-acting\" bits. Tony proved in several movies that he is not Norman Bates; it's just a shame too few people realized it during his lifetime.",
         "Ingrid Bergman's excellent performance is what makes this film. She sincerely deals with the problem of September love; I've never seen her more beautiful or more committed. Anthony Perkins as the young spoiled mama's boy is excellent, and the scenes with the two of them are very believable. (It's called acting) Yves Montand is terrible---he's longing to be speaking in French. The scene at the end between Bergman & Perkins from the top of the stairs could move a stone to tears. Only Bergman could convincingly pull off a perfect soap opera--there will never be anyone like her.",
         "The most sobworthy romantic film I've ever seen. I would've cried, except my brother was present. Perkins was the only fun thing in it, with his \"play-acting\". In one part, he single-handedly did an impression of an entire U.S. law court, speeded up. I will take that sequence with me to the grave. And of course, the other brilliant bit when Perkins, COMPLETELY drunk, decides to join Bergman and Montand in the club. It ends up with him being driven home with his head knocking against the car window... But the end was the most distressing part - well, I won't spoil that for you. Not a classic, but I highly recommend it if you want a good old cry. A Maud rating of 4 out of 5.",
         "I absolutely loved Anthony Perkins in this film! To see him smile and be so charismatic and sneaky none of the eerie, psychotic Norman Bates and I welcomed this departure. Some have posted that Anthony Perkins was too skinny to play the role. What the hell does that even mean? We can all relate to having fallen for someone who was \"not what we want\" and there is noting wrong with that! By the way it is completely believable that Ingrid's character would be intrigued by him. His youth, his brazen attitude, openness and desire for this older woman. Oh and what of the lovely Ingrid Bergman. Need I say more? The woman is fantastic. Yves Montand is sexy and awful at the same time. A great performance. There were some lovely supporting roles throughout the film. And the back drop of France makes this a beautiful film visually. I feel this is a great film to see.",
         "All three characters are distinct in their expression and pursuit of \"being loved.\" We have all encountered a Roger - cool, indifferent, the free spirit that cannot be tamed, and furthermore, does not WANT to be tamed. Yet he cannot be alone. We all have personally experienced the terrifying moment in our lives of becoming a man/woman over night. Phillip is clearly not prepared to emerge from his childhood of security and entitlement, his choices always having been guided by a mother, or the underlying norms of his social circle. The daunting task of assuming his own identity leads him to attach his self to Paula, forming a classic example of codependency. His choice for an older woman is his way of prolonging the actuality of having to develop his own identity, his own path. For example, when Paula goes to work his day consists of nothing but finding things to do to kill time until she is back to entertain him. It is as if without her presence he is on the \"pause button,\" and only resumes life on her cue. Paula, however, sees this as is not pleased. Paula is the most interesting character, because her feelings and behavior in this film are so diverse that just when we think it is apparent how she is feeling she does something that questions our previous assumption. Roger is the classic ladies' man, his stance staunch against the wind. Phillip is the typical tragedy that happens to a boy who has been given everything, yet has never asked for anything. These two men are simply unilateral characters framing the abstract piece that is Paula. Does she really want Roger to commit to her? We think the obvious answer is yes, but then we see her with young Phillip - we see her with this sexual energy and freedom that she cannot suppress, and we wonder whether Phillip is simply an outlet for her emotional frustrations with Roger or whether he is not actually a venue for her to express her own longings for excitement, trysts and desires. Yet we learn more from the scene in the bedroom, with the single shot of Paula lying in bed after (we assume) Paula and Phillip have shared an intimate moment. Her facial expression tells us she has reservations about leading this lifestyle; she knows it will not work. It is almost as if in that moment, watching Paula's facial expression, we are swept back to a time when we ourselves were caught in a relationship, or an act, that we knew were were going to regret later, but could not stop ourselves in the moment. Diane Lane's subway scene in \"Unfaithful\" draws many similarities to Ingrid Bergman's bedroom scene. Another scene where Paula bears her emotions, yet reluctantly, is when she is having lunch with Roger after he has just returned from his 10 day trip. She reveals to him that her friendship with Phillip has become more serious. She tells him this not for honesty, nor to inform him that she is moving on, yet she tells him this to see his reaction. This is a pitiful scene. When Paula complains that she always has to hear about his girls, he says something along the lines of that at least his is normal. In other words, he has called Paula a joke. There is a beat, and we feel the impact that she feels. As she stumbles away from the table we see exactly how vulnerable she is, how insecure she actually is about her age. We don't want to, but we feel sorry for her. We feel pity for her because there are moments when she is with Phillip when she appears truly happy, and yet the stigma attached to the relationship causes just as much misery. However, in the end, when we learn that she will never find that true happiness (with love), we are hesitant to feel that same sympathy for her. Is it because she pursued a love that she knew she would have to share? Or is it because she sacrificed the only love that ever really made her feel happy, and young?",
         "I feel like I have split personality after watching this film. Usually I immediately know how I feel towards a film - sometimes early on as I'm watching, but definitely by the conclusion. But this one leaves me unsure of how I feel. One thing I know for sure is Ingrid's performance is stellar as usual. She is so believable and honest in her emotions. But Perkins is a little squirrelly to me. Like other viewers, I have a hard time seeing Ingrid's character falling for such a immature excuse for a man. Perhaps the only explanation is that her esteem is so wounded, and Perkins so lavish in his affection, admiration and even worship of her, that she can't help but turn to Perkins. I don't know. I hate that she goes back to that cad played by Yves Montand. Its so obvious that a tiger can't change its stripes. What I don't understand, is I read how many viewers were moved to tears. I will readily admit that I'm usually easily moved to tears with a good tear-jerker. But this movie didn't even come close. So I'm still left wondering - what did I miss?",
         "Came in on this 30 minutes late yesterday, with no adolescent experience from yesteryear to back reference, I found it amazingly sappy, and inexplicably magnetic. I couldn't believe I would watch the rest, but did! Perhaps it's Paris, perhaps it's Bergman's effortless magnetism. It's not that she's so lovely or desirable--it's that she's so honest. An actress of this much grace is worthy of something more useful than the milksop of Anthony Perkins as Philip. Sure, he's supposed to be dense, naive and a mama's-boy. And at this point in time Perkins was being worked as a leading man he never became. For good reason. There's no substantive distinction between this role and his role in Psycho. Opaque. His smile/smirk frozen, false and inscrutable. In initial courting he really does come off more oppressive and menacing than lovelorn. The \"light switch\" scene: I'm not sure if he's going to kiss her or kill her. Oh, if only they had cast a believable actor. The scenes where he stops going to work have no veracity at all. He is a wooden marionette. Montand does his Montand thing but it's direct and simple anyway. No significant hopeful would have taken the second role of dumpee, but if Philip had been played by a young Redford-type this movie could have been much more. I've loved that Brahms piece for years so it was amazing to hear it singled out with such fury as a plot element, and the continual thematic variations in the background. A bit heavy- handed but appreciated. Many of the last few scenes are just delicious. The \"viewed-from across the floor\" scene during Philips resignation celebration was completely believable, despite it's melodrama. And that hang-dog look that Bergman gets--who could guess she could wear that kabuki mask believably!? The real gems are all in the last 15 minutes. The ending itself is stunningly modern for the tone of this movie. Honest and direct and unflinching. I had heard of the make-up removal scene before but it was beautiful to watch."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Argus Film",
         "Mercury Productions (I)"
      ],
      "summaries": ["In this adaptation of Françoise Sagan's best selling novel, Paula is a beautiful and highly successful 40-year-old businesswoman. She is deeply in love with Roger, her mature consort of five years. Roger is a very charming gallant who loves Paula but is too selfish to give up his freedom to be promiscuous. When Paula meets Phillip, the 24-year-old immature lawyer son of one of her rich clients, he falls hopelessly in love with the glamorous, sympathetic older woman and insists that the age difference will be no barrier to a romance. Paula resists the young man's persistent advances, but she finally succumbs when Roger initiates yet another affair with one of his young Maisies. An affair begins, and society does not approve."],
      "budget": 0
   },
   "movielensId": 69387,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1961-05-23",
      "dvdReleaseDate": null,
      "directors": ["Anatole Litvak"],
      "runtime": 120,
      "movieId": 69387,
      "title": "Goodbye Again",
      "mpaa": null,
      "actors": [
         "Ingrid Bergman",
         "Yves Montand",
         "Anthony Perkins",
         "Jessie Royce Landis",
         "Pierre Dux",
         "Michèle Mercier",
         "Jocelyn Lane",
         "Diahann Carroll",
         "Alison Leggatt",
         "Uta Taeger",
         "David Horne",
         "Peter Bull",
         "André Randall"
      ],
      "imdbMovieId": "0054936",
      "originalTitle": "Goodbye Again",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["xVKLwOXYRNg"],
      "plotSummary": "Stranded by her lover, a 40-ish interior decorator in Paris turns to a U.S. client's playboy son.",
      "tmdbMovieId": 84119,
      "avgRating": 3.42308,
      "releaseYear": "1961",
      "numRatings": 13,
      "posterPath": "/w2afnFbmHVbYK6BQ8h2fDvRSWv2.jpg"
   }
}