{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "reporter",
            "id": 12193
         },
         {
            "name": "crime syndicate",
            "id": 190636
         },
         {
            "name": "serial",
            "id": 197161
         }
      ],
      "imdb_id": "tt0006206",
      "video": false,
      "title": "Les vampires",
      "recommendations": [
         163336,
         151312,
         50182,
         105552,
         86303,
         85479,
         212101,
         104863,
         132367,
         143551,
         109364,
         144943,
         42529,
         122479,
         88421,
         86811,
         87981,
         63951,
         143554,
         1388
      ],
      "backdrop_path": "/4AkeytemMzYzvM4Pb4IFFaPIecx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Irma Vep",
               "gender": 1,
               "credit_id": "52fe45c6c3a368484e06e3db",
               "name": "Musidora",
               "profile_path": null,
               "id": 102846,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Philippe Guérande",
               "gender": 0,
               "credit_id": "52fe45c6c3a368484e06e3df",
               "name": "Édouard Mathé",
               "profile_path": "/ab13EpvO4aBQOPsYSo1iKjYWe8L.jpg",
               "id": 102847,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Oscar Mazamette",
               "gender": 0,
               "credit_id": "52fe45c6c3a368484e06e3e3",
               "name": "Marcel Lévesque",
               "profile_path": "/3FfCIA9RWzUh9Ix3AHYid0OhxwW.jpg",
               "id": 102848,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Le Grand Vampire",
               "gender": 0,
               "credit_id": "52fe45c6c3a368484e06e3e7",
               "name": "Jean Aymé",
               "profile_path": null,
               "id": 102849,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Juan-José Moréno / Brichonnet",
               "gender": 0,
               "credit_id": "52fe45c6c3a368484e06e3eb",
               "name": "Fernand Herrmann",
               "profile_path": null,
               "id": 102850,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marfa Koutiloff",
               "gender": 1,
               "credit_id": "52fe45c6c3a368484e06e3ef",
               "name": "Stacia Napierkowska",
               "profile_path": null,
               "id": 102851,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mère de Guérande",
               "gender": 0,
               "credit_id": "5abc54aac3a368439601f485",
               "name": "Florense Simoni",
               "profile_path": null,
               "id": 1425140,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c6c3a368484e06e3d7",
               "name": "Louis Feuillade",
               "profile_path": "/nDgYpE9kEgPoeaQhh3WvaT2pXaK.jpg",
               "id": 102844,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c6c3a368484e06e3f5",
               "name": "Louis Feuillade",
               "profile_path": "/nDgYpE9kEgPoeaQhh3WvaT2pXaK.jpg",
               "id": 102844,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54d92f609251410a420003ab",
               "name": "Manichoux",
               "profile_path": null,
               "id": 1425137,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.679908,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 29082,
      "vote_count": 21,
      "budget": 0,
      "overview": "Two journalists attempt to uncover the truth behind the criminal organisation, known as The Vampires, who are terrorizing Paris.",
      "similar": [
         1949,
         11355,
         11615,
         269,
         16995,
         891,
         15,
         496,
         1924,
         9772,
         1573,
         65754,
         241,
         562,
         15472,
         12113,
         38055,
         3078,
         858,
         350
      ],
      "original_title": "Les vampires",
      "runtime": 412,
      "poster_path": "/tv4o4wQOyehsJo612eiV9DJgGpz.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Société des Etablissements L. Gaumont",
         "id": 1342,
         "origin_country": ""
      }],
      "release_date": "1915-11-13",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Louis Feuillade"],
      "runtime": 399,
      "synopsis": null,
      "writers": ["Louis Feuillade"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0006206/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NTY3NDIzNl5BMl5BanBnXkFtZTgwNTIyODg5MTE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Musidora, Édouard Mathé, Marcel Lévesque | See full cast and crew »"],
      "reviews": [
         "Lensed in an eerily abandoned Paris in 1915, Louis Feuillade's stark chapterplay LES VAMPIRES is a grim and powerful work which is worlds apart from the later glitz and polish of the golden age serials produced by the American studios. It should be noted that serials were nothing new at this point in time. Formative efforts such as THE PERILS OF PAULINE had already established the appeal of these generally inexpensive actioners, with their bizarre twists and inventive death traps. The emphasis was generally on a resourceful protagonist pitted against an equally inventive and determined fiend -- frequently an unsuspected heir or lawyer out to obtain an undeserved inheritance. LES VAMPIRES did this formula one better, making the menace a vast and largely unsuspected criminal empire which is devouring Paris from inside. With members taken from all classes, the dark society is able to plunder, blackmail and murder without dear of action from the authorities. This continues until their removal of a government investigator brings ambitious reporter Philippe Guerande (Edouard Mathe) into things. Sent to the country to search for details on the official's murder, Philippe plans to combine business and pleasure by meeting Dr. Lox, an old family friend who has a chateau in the area. Arriving at Lox's estate at the same time as an American heiress who means to purchase the property, the reporter is promptly framed for theft by the hooded agents of the gang, who are secreted in the ancient building. Locating the dead investigator's head, Philippe manages to turn suspicion on Lox. Murdering the heiress and making his escape across the rooftops, the \"doctor\" is revealed as the Grand Vampire the (evident) leader of the criminal society. Philippe falls into the Vampires' hands but is rescued by Oscar Cloud Mazamette (Marcel Levesque) -- a clerk and minor member of the gang whom he had helped earlier. Philippe and Mazamette combine to try to expose the society's operations and bring the gang to a deserved end. A series of adventures follow, with the Grand Vampire (Fernand Herrmann) and exotic dancer/criminal Irma Vep (Musidora) providing much of the opposition. In a surprise development, it is revealed that the Grand Vampire is not the gang's ultimate leader. When it is convenient, his superior eliminates him. He, in turn, commits suicide when he is imprisoned by the police. Satanas, the criminal mastermind behind the group's poisons and explosives steps in and assumes co-command with Irma Vep. This occurs too late, however, as Philippe is closing in on the gang's chief meeting place. After a series of close calls, the reporter and the reformed Mazamette succeed in destroying the Vampires' leadership and bringing the rank and file members to justice. Not enough emphasis can be placed on the serial's grim and stark look, which almost functions as a characters of its own. This is a Paris where the gang's activities have seemingly terrified the people to the degree that they refuse to venture out unless it is absolutely unavoidable. Production took place during WW I, when the streets were largely abandoned, and this strange desolation combines with the scurrying of the few characters to present a powerful emphasis that goes beyond the actual turns and twists of the plotline. The result is compelling, entertaining, and more than a bit weird in spots. Tinted scenes add to the welcome air of unreality. Definitely a 9 out of 10 possible points.",
         "A ten-part serial that took eight hours to watch with breaks, this thing defies not just summary but reliable recall: describing it is like trying to describe a year in my life. Chaotic, unpredictable, upside down, with endless sneaky tricks that defy our conception of 'movie' magic because they mainly involve Cirque-type human machines doing things that couldn't have been faked so convincingly at this date. I mean, you can see the splice whenever a character turns on the light, so when the bitchy criminal mastermind Irma Vep gets wrapped up in rope, then rolls down the side of a four-story building like a human yo-yo, you know you're watching history in the making. What's more, and redemptively, the stupid detectives are REALLY stupid, including this outrageous Italian stereotype who keeps nyuk-ing straight into the camera. There's a wild chase-fight scene on a moving train, a gas attack on a large high-society do, a kid accidentally shooting his father in the nose, and God knows what else. This dumbfoundingly imaginative, yet consistently goofy and crowd-pleasing movie could only have happened in a medium whose limits had not yet been properly defined - in fact you can see the definition happening on screen. When I grow up I want to be Henri Langlois, founder of the Cinematheque Francais, who rescued the world's only print of this film from the curb on garbage day. Hooray!",
         "What an incredible piece of history and cinema this is. \"Les Vampires\" is an 10 episodes long French serial, by Louis Feuillade. A sort of early 20th century mini-series, you may call it. I can't imaging how incredibly gripped the audience must have been while watching one of the episodes in the theater and couldn't hardly wait for the next chapter of the story. Of course these sort of chapter-plays weren't really anything new at the time of 1915 but still \"Les Vampires\" is one of the best and most unique as well as accessible of its kind. It has a greatly written and intriguing story, that shows the dark side of common men and the criminal and more disturbing, less peaceful and dangerous side of beautiful Paris. The serial tells the story of an organized criminal organization, known as 'Les Vampires'. A sort of more rebellious than criminal, organization, who blackmail, kill and steal from the high society in Paris. The episodes follow this organization as well as the groups who battle them; a rivaling criminal organization, the police and a journalist and his friend, who are the real main characters of the movie. Perhaps the entire serial can also be seen as a social commentary on the life of the rich in Paris but I can't be completely sure of this were the creators intentions. The first four episodes are perhaps a bit of a drag, since it mostly focuses on development of the characters and the events. After that the gloves are off and the serial turns into a very exciting and tense serial, in which lots is happening, both action- and story-wise. The first few episodes also differ widely in its running time and some are around 15 minutes long, while other are around 30 or 45 minutes. The later episodes are all around an hour long. The serial features lots of daring escapes, traitorous characters and criminal plans to cause mayhem in the everyday society. Yes, at times the serial gets overlong, since it often repeat itself. Basically the serial is about the characters constantly chasing and capturing each other, until they escape again and things seem to start all over again. It probably is also the reason why you shouldn't watch all the episodes just as once. Best is to watch around 2 episodes a day, to keep the tension and intriguing aspects of the story and characters to a maximum level. The story telling is surprising good, for 1915 standards. The entire production is a silent one and it forces it to tell the story entirely by its visuals and acting. It does this well and makes the story understandable, although it gets a bit too hard to follow at certain points. Because it has to explain and tell everything with its visual, some of the sequences are overlong. The acting is of course also exaggerated at times, to put down a certain emotion or tension in the story but not as much as some of the early American of that time show. In that regard, the acting in this is truly about 20 years ahead of its time, compared to American and most German productions, of the same time period. I was absolutely gripped by the storytelling, especially the last 4 episodes or so and even founded it to be tense and excitement, something not too common for an over 90 years old production, even though the story also became quite ridicules at times. Perhaps the only flaw in the storytelling is that they kept bringing in new characters, also very late in the serial, such as the real main villain that only gets revealed in I believe the 7th episode. if I remember correctly. It makes the whole story a bit too hard to follow- and not always completely interesting and credibly at times. It is well cast and especially Musidora as the über-lady vamp Irma Vep is great and impressive. She is both sensual as dangerous in her role. What a great early classic character of cinema. Also Marcel Lévesque is great, as the sort of comical relief of the serials and Édouard Mathé also plays a likable main character. There are some really daring and dangerous, for its time looking, stunts in this production. It also really adds to the tension and excitement of it all. The production design is great and its like going back in time when watching this. The serial cleverly uses some camera-color filters for each location and mood, to add to the atmosphere and storytelling of the entire serial. It all in all is an overall very well put together interesting historical big-production, that still remains perfectly watchable by todays standards, thanks to its exciting storytelling and build up. 10/10 http://bobafett1138.blogspot.com/",
         "\"Les Vampires\" (1915 - 398 minutes - B&W) is a classic of the mute cinema series directed by Louis Feuillade. In ten episodes, it counts the adventures of a masked assailants group who haunt Paris. The mythical actress Musidora [ the first \"Vamp\" of the European cinema ] is the star in the series, that achieved fame due to the great admiration among the surrealists (Andres Breton and Luis Buñuel were its bigger fans), seduced by the dreamily scenes that sometimes appears in the narrative. At first \"Les Vampires\" was rejected for the French vanguard directors, that considered it like a mere policeman series. The film was saved from destruction thanks to the efforts of the founder of the French Film library, Henri Langlois, and after years forgotten, \"Les Vampires\" was exhibited again in the sixties, in concurred sessions that had marked time, especially in Paris, London and New York, causing a reevaluation of the critics relatively to the work of Feuillade. Andres Bazin, the great critic of the French cinema, said that \"Les Vampires\" was \"one of the biggest film of all the times\", admiration shared with the directors of the new French cinema. Today, Feuillade is placed side by side to other geniuses of the mute period of the cinema, as Griffith, Stroheim, Murnau and Gance. The episodes: 1: The Cut Head (31 minutes); 2: The Ring that Kills (13 minutes); 3: The Red Book (39 minutes); 4: The Specter (30 minutes); 5: The Escape of the Dead Man (35 minutes); 6: Hypnotic eyes (53 minutes); 7: Satanus (42 minutes); 8: The Master of the Thunder (50 minutes); 9: The Poisoner (48 minutes); 10: The Terrible Marriage (57 minutes).",
         "Seeing a police drama that is a favorite of surrealists like Luis Bunuel ought to tell you that this isn't an episode of Law and order. It take place in a Paris that is empty because of WWI. The dreamlike scenes add to the story of a reporter Phillipe Guerande (Edouard Mathe) who is looking to a criminal organization known as The Vampires (sorry, bloodsucking fans, it's not about Dracula or his minions.). The crime syndicate could be considered a forerunner of the Mafia as it had it's tentacles in every level of society from the Chief Justice of the Supreme Court to nobility. A classic silent film. Louis Feuillade, who directed over 600 films is the film great grandfather of Alfred Hitchcock and David Lynch. Musidora, who played Irma Vep is probably the first screen vamp.",
         "I can't say enough about this film--I've pursued and studied it for the last twenty years! I'm so happy it's finally been made available on video. The first time I saw it was at the Videoteque de Paris...everyday for a week I watched episode after episode but, to my horror, when I requested the last episode I was told it was unavailable! It seems that, just the day before, the grandson of Louis Feuillade--I believe he is Jacques Champraux--had the video pulled from public viewings while it was in litigation. I thought I was going to fall over! The singular reason I was in Paris was to see LES VAMPIRES and suddenly, I was swallowing a very bittersweet pill. Anyway, eventually I saw the last episode, \"The Bloody Wedding,\" but not until some years later when the serial was shown in its entirety at the Art Institute of Chicago. FIN",
         "Feuillade has become much more popular abroad than in his native France where his movies are seldom screened on \"cultural TV ,the Arte Channel or the \"Cinema De Minuit\".Some critics call \"Les Vampires\" brainwashing at a time when France was at war .Some critics praise it to the skies.I'm for the golden middle .Feuillade was certainly important in the shaping of the serial (along \"the perils of Pauline\" in America)but he was not as great a director as his contemporaries David Wark Griffith and Abel Gance (whose career did not begin with \"Napoleon\" in 1926). The screenplay of \"Les Vampires\" is pretty silly,definitely weaker than that of \"Fantomas\" and it is sure easy to see why: \"Fantomas \" was first a set of volumes written by Pierre Souvestre and Marcel Allain -and Feuillade botched the first chapters which were the best of the saga :see Paul Fejos's \"Fantomas\" (1932) for that matter.But the rest was quite acceptable,some movies(the third episode :\"Le Mort Qui Tue\" notably) highly commendable. \"Les Vampires\" was a different matter ,because it was an original screenplay and the writer/director had to kill the \"Chef Des Vampires\" ,not because he thought the audience needed change ,but because it was the war and the actors were mobilized.That's why Feuillade gave up making \"lEs Vampires\" after 10 episodes and opted for a \"good \" hero ,Judex ,a conjurer fighting against the villains.The stories are far-fetched to a fault ,pleasant to watch,but not particularly memorable (Maurice Leblanc was writing much more brilliant stories at the time featuring his hero Arsene Lupin who is much more exciting than his bland hero Philippe Guérande and his mate/undertaker. Much more than the stories,it's the details that are interesting: the maid Mrs Guerande hires is a Girl from Britanny ,and at the time most of the servants came from that region:this was the subject of Becassine ,a comic strip of the era;it's interesting to note that whereas the villains have lovers,the hero,after losing his fiancée in the second chapter-and he doesn't even shed a tear-,remains chaste till the ...ninth episode in which he finds another one.Musidora's famous black tight caused an outcry : the series remained famous for her but she only appears in her outfit in two brief moments: one when she's scrawling on the roofs and the other one in a hotel where she also appears (that crowns it!) dressed as a young man complete with mustache . Feuillade's most salutary quality was story -telling :even if the plot seems too often too much ,we can't help but admire the way he uses the pictures and thus keeps his lines to the minimum -a thing many of his colleagues could not do-. Feuillade's influence in France?One sees little of it in the great directors of the Golden Era (Carné,Renoir,Guitry,Duvivier,Et Al). Feuillade's influence shows ,however,in one of Duvivier's silent films \" Le Mystere De La Tour Eiffel\" or even in Clair's \"Le Fantome Du Moulin Rouge\" . Feuillade 's most dedicated follower was Georges Franju who made a remake of \"Judex\"(1963) and \"Les Nuits Rouges\"(1973) ,a failed attempt at a seventies \"Vampires\".Most of this director's works have something of Feuillade : \"Les Yeux Sans Visage\"(1959) \"La Tête Contre Les Murs\" (1960)\"Pleins Feux Sur L'Assassin\".(1961) In the seventies,Feuillade's touch appeared again in Rivette's stuff ,but it's reserved for intellectuals.What was once the most popular French cinema of an era became one inspiration for the most cerebral (who said boring?) art.",
         "Now here's a movie that doesn't require a replication of Paris in the early 20th century. The real McCoy is used for the settings, vehicles, costumes, firearms, etc. Since it was filmed in 1916 one can see for example how horse-drawn carriages were still a very popular means of transport in the \"modern\" sense. If you a true fan of motion picture history -- then you can't afford to miss this gem. It represents the dawn of the motion picture industry before we had well-known movie stars and blockbusters like Intolerance (1916) and Cabinet of Dr. Caligari (1919). This film, a series of 10 episodes, tells the story of a gang of thieves and murderers (The Vampire Gang) who are out to create havoc in Paris for their own personal goals. The heros of this tale are a newspaper reporter, Phillipe Guerande, and his hilarious sidekick, Mazamette. Together they aim to foil the latest capers of the gang and find themselves in unexpected trouble throughout the entire series. Ingenious methods by the criminals are used in each episode. Each episode builds upon the first, so I strongly recommend you watch it in sequence (as if you watching the Sopranos on HBO). It's interesting to see how the characters develop and improve their acting as they gain experience and confidence within their roles. Irma Vep and Mazamette, especially are a treat to watch. Later in the series, both Irma Vep and Mazamete deliberately ham it up for the viewing audience and camera just for fun! Guerande reminded me a lot of Gene Kelly with his clean-cut facial expressions and haircut. Only the last episode (#10) was a disappointment. For some reason, much of the print was washed out in the interior scenes, the tinting inconsistent (many outdoor scenes were red instead of green etc.) and the storyline was unrealistically forced forward (i.e., how did Mazamette enter into Guerande's house at 2:00 am uninvited and how did Guerande climb down the 3rd floor balcony of the Vampires' mansion after he threw away their knotted rope, the Vampires' only means of escape from that level?) Most episodes are 45 minutes in length, except #10 which is nearly a hour. Even though the entire series runs over 8 hours, don't watch it a double speed as suggested by a previous reviewer. The score adds ambience, suspense & excitement to the Parisian scenes at the appropriate places. Lastly there are two supplements on the DVD. The first is a royal waste (a true supernavel, or \"turnip\" according to the French), the second is a cute story starring the young boy who played Mazamette's son in \"Les Vampires\".",
         "This 1915 French mystery serial is fascinating. Its device of using gadgets (poison rings, poison fountain pens, cabinets with fake back panels, etc.) predates James Bond's by decades, and makes each new episode something to look forward to. The comely Irma Vep is one of the most mysterious and darkest screen heroines of all times. The filmmaker makes extensive use of real Parisian street locations, which seem always, oddly, to be drained of pedestrian life; watching \"Les Vampires\" is like getting into a time machine. View \"Les Vampires\" first, then see \"Irma Vep\" (France, 1996) so you have a point of reference.",
         "An intrepid reporter and his loyal friend battle a bizarre secret society of criminals known as The Vampires. Director Louis Feuillade is something of a legend, having directed an astonishing 630 films in the silent era (and perhaps more). He is best known for \"Fantomas\", the serial he made prior to \"Vampires\", and while the former may be marginally superior, they are both exquisite in their own way, and a great example of early thrillers. Indeed, it is quite impressive that a film is seven hours long and still exists one hundred years later. Given how many silent films have since been lost forever, it is incredible that Feuillade's work seems to be intact and in great shape."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Société des Etablissements L. Gaumont"],
      "summaries": ["An intrepid reporter and his loyal friend battle a bizarre secret society of criminals known as The Vampires."],
      "budget": 0
   },
   "movielensId": 69509,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1915-11-13",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Louis Feuillade"],
      "runtime": 399,
      "movieId": 69509,
      "title": "Les vampires",
      "mpaa": "",
      "actors": [
         "Musidora",
         "Édouard Mathé",
         "Marcel Lévesque",
         "Jean Aymé",
         "Fernand Herrmann",
         "Stacia Napierkowska"
      ],
      "imdbMovieId": "0006206",
      "originalTitle": "Les vampires",
      "genres": [
         "Crime",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two journalists attempt to uncover the truth behind the criminal organisation, known as The Vampires, who are terrorizing Paris.",
      "tmdbMovieId": 29082,
      "avgRating": 3.53571,
      "releaseYear": "1915",
      "numRatings": 28,
      "posterPath": "/tv4o4wQOyehsJo612eiV9DJgGpz.jpg"
   }
}