{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0312848",
      "video": false,
      "title": "Journeys with George",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 2,
            "credit_id": "55b0130992514172ef00ade6",
            "name": "George W. Bush",
            "profile_path": "/8X7iJym7kDUBMFxsk6RPhWpFz3q.jpg",
            "id": 19011,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55b01287c3a368648e00b56b",
               "name": "Alexandra Pelosi",
               "profile_path": null,
               "id": 134328,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55b012e89251411e0f00ce45",
               "name": "Aaron Lubarsky",
               "profile_path": null,
               "id": 1489544,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.111378,
      "production_countries": [],
      "id": 158413,
      "vote_count": 2,
      "budget": 0,
      "overview": "Documentary account of George W. Bush's presidential campaign.",
      "similar": [],
      "original_title": "Journeys with George",
      "runtime": 79,
      "poster_path": "/jHJdHGIXk0yUNgpR4ygbVUrQS7b.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2002-03-08",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Alexandra Pelosi",
         "Aaron Lubarsky"
      ],
      "runtime": 79,
      "synopsis": null,
      "writers": ["Alexandra Pelosi"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0312848/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3MTQxMTk0Ml5BMl5BanBnXkFtZTcwMzU3MTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: George W. Bush, R.G. Ratcliffe, Wayne Slater | See full cast and crew »"],
      "reviews": [
         "Alexandra Pelosi covered George W. Bush's yearlong campaign for the Presidency with a video camera, and this is the result. The film -- or rather, video -- shows the Prez to be humorous in a glad-handing, political kind of way, flirtatious in a ditto way, addicted to Cheetos (tm), bologna and cheese sandwiches on white bread (which he doesn't find ironic -- or does he not understand \"ironic\"?), and some near-beer from Holland. Speaking of cheesy, it's revealed the \"hand-lettered\" signs you see at political rallies are pre-printed plants from the candidate's campaign funds. Who knew? Very entertaining, enlightening -- and funny! As a lifelong Democrat, I was surprized and pleased to see Dubya's more human side. Within the genre of documentaries-that-don't-take-their-subjects-too-seriously, a nine. As a film, a seven.",
         "Just caught this movie on HBO. See Dubya bowling oranges, eating Cheetos, and drinking Non-Alcholic Beer. Instead of the serious statesman we usually see on TV, we get this fun charismatic guy we never get to see. George jokes around and has fun. This movie never takes George or itself seriously and the post election Florida fiasco is short and sweet. If you just want to know more about what kind of man the president is \"behind the scenes\"; this is the movie to see. My favorite moment from the film was when the filmmaker yells out to ask Mrs. Bush who she's voting for.",
         "What a fun film! George W. Bush, the snarky third generation of an important political family, as filmed by Alexandra Pelosi, the snarky third generation of an important political family. It's interesting to watch the movie keeping that element in mind. Who was Bush at her age, and who will she be at his? In a time when the public side of politics is so vicious, it was refreshing to see the personable side of the President, and the playful side of the child of one of his loudest critics. Neither of them is an automaton, or stupid, or thoughtless; it's hard to imagine that family gatherings in either the Bush household or the Pelosi one are anything but rowdy, open, and a blast. Left or right, these come off as good, non-strange people who might not do everything right, but probably don't set out to do wrong.",
         "I got to see a screening of this movie at the Newport International Film Festival a few summers ago. The sold out show made it a joy to have a theater full of people laughing at the series of segments captured during his 2000 campaign for President. I got to see the movie for free since I was volunteering my services to the film festival. After the movie, I had to drive the director of Journey's with George to the train station in the nearby town. She was dressed all in purple. From her blouse to her pants and sneakers, she stuck out like a sore thumb that was bruised purple. Like her wardrobe, the movie stuck out amongst the rest of the film screened at the festival. It was a hit amongst its audience and fans of the local republican base in Newport, Rhode Island.",
         "This is an interesting if ultimately disappointing documentary following G.W.Bush's campaign for the presidency. It is filmed entirely by Alexandra Pelosi as a member of press pack on the campaign buses and planes across the US. It is interesting because it shows the scale of the electioneering business and it shows an inside view of Bush. The overall impression one gets is that US elections are mostly about rallies and bus trips. What Bush stands for never comes into the picture. The result is mixed. Initially Bush comes across as a bit of a buffoon, not slow-witted, as he has been portrayed, but cheeky and a bit chauvinistic, like a college prankster. He never takes Pelosi seriously, and wise-cracks his way through all her questions. However, they strike up a rapport and ultimately he is shown to be more of a friend to her than her colleagues in the press corp. Democrats will probably hate this documentary because it doesn't show him to be a dim-wit monster. Karl Rove type Republicans will not like it too much either because Bush certainly does not look presidential. The press comes off worst, portrayed basically as willing poodles as they are bussed from one rally to another. Although very watchable, by the end I was disappointed with this documentary because it really doesn't have much bite.",
         "Despite being warned by her Democrat mother to stay out of the media and politics, Alexandra Pelosi winds up working for NBC and spending a year with Texan Governor George Bush as he heads out on the campaign trail to become the next American President. Joining the press core as the Republican primaries start with Bush being viewed as the underdog to John McCain, Pelosi decides to film her campaign journey with a camcorder. An interesting prospect this one. Not only does it offer an insight into the machine that is the political campaign machine but the subject happens to be George W. Bush \u0096 not only one of the most unpopular and controversial Presidents of my lifetime, but also one who's nature of election should make for an interesting conclusion to the film. The results are mixed though. I'm not convinced that Pelosi had totally decided what she was trying to do when she first picked up the camcorder as she doesn't really deliver a good documentary/polemic on the nature of the media as part of a well-oiled political process. Yes she gets interviews with her colleagues talking about how what they are shooting isn't real, or complaining about the pack or being self-effacing about being lemmings, but this didn't really convince considering in later scenes we see them all back in the feeding frenzy and doing just what they criticised their peers for doing. It probably didn't help to have interviewed people who look down their noses rather smugly at the subject and talk in a condescending way about it either, since it just made them like snobs as well as being hypocritical. She doesn't really have a structure either; not just in regards the film (which you can understand is already set by the passage of time) but her points are not well made. The tone varies from the sort of stuff that concerns her fancying a fellow journalist, to attempts at more serious questions about impartiality when being so buddy-buddy with Bush and his staff. It is never dull because at worst it is amusing (bemusing?) to see behind the media curtain, but if she had genuine aims to make her film a look at the media within this process then I'm afraid that the material mostly undermines her status as a documentary maker as well as taking away from her points. If some of the film is about that, then the main appeal to the casual viewer will be the fly-on-the-wall access to the most powerful man in the world, George Bush. This part is engaging because there is no doubt that Bush is far from the stupid man that he is painted as. Sure he has a rather homely \"average Joe\" swagger about him that doesn't totally fit with the demands of his position, but he is a very charismatic man and it shines through in this film. Problem I had though was again to do with structure as she just seemed content with pointing and shooting without having an overall point or argument to make. I appreciate that this was fly-on-the-wall and that the point is not to manipulate to make things fit \"a point\", but I'm only suggesting a reason for the film being decided with the material structured around that, not spin. A shame then that it is nowhere near as good as it should have been, but even with the rather aimless footage has sufficient access to Bush and sufficient fly-on-the-wall insight into how the media covers the political campaign to be of interest to many a casual viewer.",
         "This is a kind of haphazardly organized documentary of W's campaign for prez, with lots of wide-angle shots of the boys and girls on the bus, and W himself mugging and chatting, and with occasional mostly editorial voice-over comments by Alexandra Pelosi. I used the word haphazardly before because things are brought up and left hanging, though perhaps deliberately. For instance, I have no idea why the hell Pelosi's hair was falling out or what, if anything, she did about it. The first ten or fifteen minutes are rather like a home movie of somebody's adventurous trip to the Galapagos or something and I was about to switch channels when I realizing that some development was taking place. W comes across as rather a likable guy, with light-hearted moments if not exactly witty ones. He seems genuinely friendly. Then I realized that he more or less HAD to give the impression of warmth and friendliness. I mean, the guy is addressing a planeload of reporters covering his campaign! Still, he's quite good at impression management. At the start of the campaign he rarely makes himself cozy with the press. But when he slips in the polls and loses a state or two his appearances on the press vehicles increase in number and in the degree of their relaxation. On the other hand, when it is clear that he has won, he disappears and pretends not to hear the questions thrown at him by his friends in the fifth estate whose first names he has taken the trouble to memorize. He doesn't need them anymore. They're quite a bunch too, those journalists, when you come right down to it. Reporters certainly know how to throw a party in the back of the bus. And it seems to help in gaining access to the candidate if you're a pert-nosed lively young brunette, as Pelosi is. (W gives her a peck on the cheek at one point.) But she's a dyed in the wool democrat and throws him a fast ball at a public Q & A session, about Texas having such a high rate of executions. For a while thereafter he punishes her by not answering her questions, and spells out the reason for it -- on camera too. It's difficult to see through W's (or any other politician's) rhetoric and frozen smiles, but I must say that he seems smoothly amiable as far as we can tell. He shows no evidence of being intellectually challenged. I wound up asking myself how such a normal guy could be such a stupid president. Of course every politician blows the occasional line. But this? \"There's nothing more deep than Israel's right to exist. That's the most deep thought of all. I can't think of anything deeper than that right.\" And how could such a normal guy be so enthusiastic about beginning an unprovoked war against a nation who's name half of our leaders can't pronounce properly. More recently Pelosi called to Bush from a crowd of reporters. He recognized her, waved, and shouted, \"I made you famous.\" A revealing response, which boils down to \"You owe me.\"",
         "I watched the whole thing hoping that some bright pinnacle or dark depth might be reached. It was not. I suppose there's some inherent value to seeing and being around this group and getting a feel for the process but the 60's documentary \"Primary\" of Robert Drew's seems to do a better job of displaying the campaign process, even though its a much older film. The one item I felt this video did impart was that the press is just following their 'target' around and trying not to be noticed and living in fear that they might p*** off the person their supposed to be covering and there by loose precious access. The candidate & crew seem to hold most of the cards and will on occasion dole out some 'face time' - especially when they're down in the polls.",
         "This documentary gives a real in-depth, behind-the scenes view of the journey for politically campaigning. From its infancy up until the end of the election. For one, George W. Bush personifies a go-getter from the beginning hopefully becoming triumphant at the end of his 'journey' to become president. It shows his highs and lows in the political race as he is faced with constant scrutiny as well as great accomplishments along the way. You can't have a comment without a compliment in the media. The two are inseparable and George W. Bush allows for both the bad and good to be reinforced always into a positive. For some reason, he can take any comment and make it into a compliment. He keeps battling these obstacles and successfully rising above them, only to allow them to resemble him as a go getter in his 'journey'.",
         "This is an excellent, astonishing documentary. Here, it's all incredibly intimate, close-up (literally 1 foot away) footage of George Bush on his campaigning trips around America prior to his eventual election as president. Not surprisingly, Bush Jnr is actually not particularly interesting as a person - he appears a rather simple, uninteresting person of very simple tastes and abilities. He never says anything profound and, indeed, every statement he makes on policy (including keynote speeches at various venues around America, with audiences of 3000) appears to be nothing more than the usual meaningless platitudes. 'I pledge to return to honour' and the like, all delivered in his usual John Doe, ebulient yet simple manner. You get him kind of flirting here with the film-maker, Pelosi; she is AWFUL! She has one of those terrible, yawning, boring, whining and unengaging American accents that just sends you to sleep. We get her personal observations and voice-over narration whether we like it or not! The film would've been more interesting without ANY of her comments at all. However, the amazing spectacle is looking at the film from now, 2003. You get this Worlds Most Powerful Man stuff in, probably, the most intimate portrait ever of a President. Poor quality film; amateurish editing, too! Some of it filmed personally by the Man himself (but who was filming Him using Pelosi's camera filming the press pack around him?)."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Purple Monkey Productions"],
      "summaries": ["Documentary account of George W. Bush's presidential campaign."],
      "budget": 0
   },
   "movielensId": 6965,
   "movielens": {
      "languages": [""],
      "releaseDate": "2002-03-08",
      "dvdReleaseDate": "2004-02-24",
      "directors": [
         "Alexandra Pelosi",
         "Aaron Lubarsky"
      ],
      "runtime": 79,
      "movieId": 6965,
      "title": "Journeys with George",
      "mpaa": "",
      "actors": ["George W. Bush"],
      "imdbMovieId": "0312848",
      "originalTitle": "Journeys with George",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary account of George W. Bush's presidential campaign.",
      "tmdbMovieId": 158413,
      "avgRating": 3.59322,
      "releaseYear": "2002",
      "numRatings": 59,
      "posterPath": "/jHJdHGIXk0yUNgpR4ygbVUrQS7b.jpg"
   }
}