{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "sadism",
            "id": 4426
         },
         {
            "name": "hostage-taking",
            "id": 7188
         },
         {
            "name": "serial killer",
            "id": 10714
         }
      ],
      "imdb_id": "tt0119167",
      "video": false,
      "title": "Funny Games",
      "recommendations": [
         1791,
         8689,
         1987,
         445,
         8740,
         17609,
         10692,
         10683,
         11075,
         11481,
         41428,
         994,
         4689,
         8461,
         16,
         37903,
         9539,
         38810,
         9696,
         837
      ],
      "backdrop_path": "/rTEvTSaFk7OYTdmssot0b2g56wx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Georg",
               "gender": 2,
               "credit_id": "52fe43469251416c7500a371",
               "name": "Ulrich Mühe",
               "profile_path": "/jpWubOAj7GnSfxmf1DlcpMpvseY.jpg",
               "id": 8196,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe43469251416c7500a375",
               "name": "Susanne Lothar",
               "profile_path": "/7Lbdxz43iVMlKrNTnc7AE6gfULs.jpg",
               "id": 19123,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe43469251416c7500a397",
               "name": "Arno Frisch",
               "profile_path": "/qpigBkroP77sAqRQk6Rpx41oOZl.jpg",
               "id": 20449,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe43469251416c7500a39b",
               "name": "Frank Giering",
               "profile_path": "/i3Q8gyNZw3WyXobHRA5Iz9nfBNw.jpg",
               "id": 18490,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Schorschi",
               "gender": 0,
               "credit_id": "52fe43469251416c7500a3ab",
               "name": "Stefan Clapczynski",
               "profile_path": null,
               "id": 551782,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Gerda",
               "gender": 1,
               "credit_id": "52fe43469251416c7500a3af",
               "name": "Doris Kunstmann",
               "profile_path": "/1kij2hGPBVPdFUoePC0hpczU045.jpg",
               "id": 45699,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Fred",
               "gender": 2,
               "credit_id": "52fe43469251416c7500a3b3",
               "name": "Christoph Bantzer",
               "profile_path": null,
               "id": 551783,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Robert",
               "gender": 0,
               "credit_id": "52fe43469251416c7500a3b7",
               "name": "Wolfgang Glück",
               "profile_path": null,
               "id": 221293,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Gerdas Schwester",
               "gender": 0,
               "credit_id": "52fe43469251416c7500a3bb",
               "name": "Susanne Meneghel",
               "profile_path": null,
               "id": 551784,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Eva",
               "gender": 0,
               "credit_id": "52fe43469251416c7500a3bf",
               "name": "Monika Zallinger",
               "profile_path": null,
               "id": 551785,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a36d",
               "name": "Michael Haneke",
               "profile_path": "/uRcHQ895xDeeaXoSRPoPgjbLe9L.jpg",
               "id": 6011,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a37b",
               "name": "Veit Heiduschka",
               "profile_path": null,
               "id": 6098,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a381",
               "name": "Veit Heiduschka",
               "profile_path": null,
               "id": 6098,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a387",
               "name": "Michael Haneke",
               "profile_path": "/uRcHQ895xDeeaXoSRPoPgjbLe9L.jpg",
               "id": 6011,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a38d",
               "name": "Jürgen Jürges",
               "profile_path": null,
               "id": 5639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a393",
               "name": "Andreas Prochaska",
               "profile_path": "/pIAO6bpaAE2p4OFzR6TPSDanv21.jpg",
               "id": 16794,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43469251416c7500a3a1",
               "name": "Christoph Kanter",
               "profile_path": null,
               "id": 6032,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43469251416c7500a3a7",
               "name": "Lisy Christl",
               "profile_path": null,
               "id": 6033,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a89a43f0e0a26535a065952",
               "name": "Waldemar Pokromski",
               "profile_path": null,
               "id": 17084,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a89a44d0e0a26535a065968",
               "name": "Walter Amann",
               "profile_path": null,
               "id": 1142746,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5a89a4570e0a2653db06daf6",
               "name": "Bernhard Bamberger",
               "profile_path": null,
               "id": 1980865,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a89a4629251410a1f0640c0",
               "name": "Hannes Eder",
               "profile_path": null,
               "id": 1980866,
               "department": "Sound",
               "job": "Sound Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 10.85822,
      "production_countries": [{
         "iso_3166_1": "AT",
         "name": "Austria"
      }],
      "id": 10234,
      "vote_count": 510,
      "budget": 0,
      "overview": "Two psychotic young men take a mother, father, and son hostage in their vacation cabin and force them to play sadistic \"games\" with one another for their own amusement.",
      "similar": [
         10781,
         1696,
         8090,
         12521,
         1991,
         10285,
         948,
         5486,
         40102,
         984,
         30833,
         39867,
         123109,
         24124,
         39874,
         9299,
         2832,
         238636,
         13567,
         276488
      ],
      "original_title": "Funny Games",
      "runtime": 103,
      "poster_path": "/mISZcSru00OqBr9nTfdUrHLSmfE.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wega Film",
         "id": 224,
         "origin_country": ""
      }],
      "release_date": "1997-05-14",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Austria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Haneke"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Michael Haneke"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0119167/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNDIxMjk2M15BMl5BanBnXkFtZTcwOTUyNzgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Susanne Lothar, Ulrich Mühe, Arno Frisch | See full cast and crew »"],
      "reviews": [
         "Okay... I just read most of the 144 user reviews.... Basically I wanted to make up my mind about this film, a film that is a very heavy load. I've seen this movie 5 years ago, the good thing is most of the time you forget about (having seen) it but now and then you recall it. I can understand that many people hate this film, it is not nice to watch, the more when you see it in a theatre where the only chance to break its spell is leaving the theatre. Regardless if you leave or stay and watch it leave it beats you one way or the other. I fully agree with many other reviewers that I have no idea whom I should recommend it too. I am tempted to watch it a second time but didn't make it happen in 5 years. Don't get me wrong. I think it is an excellent movie. It is also very disturbing and upsetting, I can't think of the right mood to watch it cause it'll take you down. And I think here is where the movie polarises. If, after watching, you find yourself deducting some message in the violence, and perhaps rethink violence - in both real life and movies - you will, well, also will have found some reason for this movies existence, if not - and it might be better if one does not - you will join in the 'crappiest movie ever chorus'. I do however want to point out some achievement of this production: *) The movie catches the audience in theatre. *) It does shock the audience but most of the violence is off-screen. You see more people dying in many fast-driven action movies. Only here you care. There is minor suspense, but I, personally, wouldn't put it into that category. (But then I am no horror/shocker/suspense fan and can easily err here) *) It's hard to compare it with any other movie (that I have seen). I am not sure if this is an achievement, but it's outstanding. The reason I think Haneke made this movie. or, what I deducted from it is how far away violence and death are in our everyday lives today. While Hollywood - and other film productions serve them daily right in our living room, we hardly notice them anymore. Violence also sells movies, and we're meanwhile pretty used to that. Haneke also serves violence, and he dishes it next-door. He turns into a moral figure that asks the audience if they want more (after all me and you consume it every day) - and while HERE we want to say 'no please stop' he doesn't do our silent bidding. He pushes us down the drain, forcing us to deal with aspects of the violence we don't (want to) see. He even goes one step further. He offers us a 'good' ending, a payback that would make it easier for us to bear the movie, only to snatch it back and rip us of any cheerful emotion, telling us like 'no, sorry, here it doesn't work that way'. I also read reviews mentioning the unsatisfying (often used, cliche) end. One more time Haneke manages to disappoint us, so far we were driven and didn't know what would happen, what to expect. Only in the ending, we see it coming, and so it ends, obviously similar to many other movies. We're back standard movie stuff, the arc bent and the connection made. \"Funny games\" is everything else but the title. Perhaps it refers to the funny games built on standard film violence in everyday movies. Perhaps it doesn't. Perhaps Haneke wants to stress that violence is a bad thing. Perhaps he's just sick. One thing for sure, regardless if you like it, don't care, or hate it. You might have seen something somewhat like it, but nothing similar. If you hate shockers, don't watch it. It will only be torture. If you love suspense, sorry, only very little gore here. If you plan to watch it, calculate a few hours before you will manage to put your head to rest. And don't watch it it personal crisis. This movie will make you feel bad. If you watch it in a cinema, just look around. You're not alone with this feeling.",
         "I saw this movie again last night, for the third time, and once again had to keep watching each torturous minute until its chilling end. Going through the comments index, I see the expected responses: it was boring: it was pointless: it was too long: it's a satire: the games aren't actually that funny: it involved the audience in a neato way: it's nothing new: it's been done before. So I here offer an interpretation to add to the cacophany of reactions that FUNNY GAMES seem to engender. What this movie reminds me of is the Book of Job, in the Bible, where God and Satan decide for their own amusement to torture this guy Job, killing his family, racking him with boils, and various other divine amusements. While watching this movie last night, I thought of another reference, this time from \"King Lear\": \"Like flies to wanton schoolboys are we to the gods;/ They kill us for their sport.\" What this movie does is challenge the audience's own involvement in visual narrative -- usually, we watch movies from somewhere on-high and omniscient; we're invisible but we see all; we're voyeurs, just like God. In Haneke's film, we identify not with the victims but with the all-powerful killers as they set about their funny games. The two polite young men are performing their entertainments for us, the viewers; they're slaking our bloodthirst, our desire for gory spectacle - - after all, isn't this why we watch movies like this in the first place? Haneke, however, doesn't play the usual evasions; he makes explicit the audience's participation in violence; and he forces upon us the need to take responsibility for it. I find this fascinating. I also find the negative comments here fascinating as well -- \"not violent enough!\" \"the victims deserve to die...\" \"all the violence is off-screen...\" \"no gore at all, 'LAST HOUSE ON THE LEFT' did it first, with more blood....\" etc. as being inadvertantly revealing of those viewers' psyche. I especially love the comment made by that one Viking guy, who writes that Haneke's film has \"no point,\" and goes on to say \"...I just hope those people break into MY house, so I can break them in two!\" I think Haneke made his point.",
         "First things first, Michael Haneke HATES Quentin Tarantino's films. He hates the way violence and death are shown as being 'cool' - Cool gangsters executing their enemies whilst saying cool lines (And you will know, that my name is the Lord! etc,etc)with a cool song playing in the background. This is not how violence is in the real world, violence is a horrible fact of life, not a glamourous thing for youths to copy, and I think Haneke intended Funny Games to show it how it really is. I watched Funny Games without the slightest clue what the film was about, so I just had to sit back and take it as it comes. At first, I wasn't too impressed. I thought the scenes were too long and dragged out, yet at the same time, I felt a strange feeling of suspense. The incredibly long camera shots leave you that bored, that you think \"Something bad is going to happen soon, I can tell...\". The suspense also lasts right through the film 'til the very end. You don't want to watch it, but at the same time, you feel hypnotised by it. I will not detail any events of the film, to save spoiling the atmosphere, but I will note one thing that people tend to be confused about:- \"Why did the family let them into the house in the first place?\" The two characters of Peter and Paul are let to walk all over the family because of one flaw in the bourgios psyche - 'The more polite a person is, the better a person they are.' This absurd way of thinking is played on by Peter and Paul and they obviously score, plus 'getting into the house without breaking in' is also one of their 'games'.For those who haven't seen the film, I definitely wouldn't recommend this for a night in with the parents/girlfriend, but I definitely would for people who want to see the difference between death and Tarantino-glam. Prepare for a highly suspenseful yet sickeningly violent, non-Hollywood, edge-of-the-seat piece of art. 8/10",
         "Psychological horror masterpiece presses all the right buttons to disturb at an epidermal level. On the surface of this movie, the mere plot about two psychopaths terrorising a family doesn't seem to be particularly interesting, or critically, original either. Indeed, the fact that the entire story takes place in pretty much one place would suggest it might struggle to capture the viewer's attention, certainly for its duration. However, the simple combination of the mechanics of the performances, the script and the general tension make this story work outstandingly well; indeed, its isolated feel simply adds to the overall claustrophobia. Peter and Paul are two apparently genial young men, who show up at the isolated boathouse of Anna and Georg, a mature couple with a child, who are all taking a couple of weeks holiday. When Peter seems to be making a nuisance of himself, Anna starts to lose her patience with him. Paul then arrives on the scene and before long it has converted from an underbelly of irritation to outright intimidation, followed by crude violence. It is extremely hard to sum this movie up without making it sound like a highly unoriginal piece of cinema, but there can be no question it is anything but. The script is simply incredible; the overtone of terror slowly creeps up on the viewer, and on Anna and Georg, with more than a dose of psychological manipulation. Almost by pretending they are doing nothing wrong, with more than a hint of cordiality along the way, the two perpetrators manage to inflict a disturbing level of fear upon the family, and yet it is the most subtle form of assault. Rather than constant threats, the two act like dinner guests who just happen to be terrifying the heck out of their hosts. When things go further, and violence joins in, it takes the trauma to a new level, as it is gritty horror rather than a splatterfest. These are two psychos who take intimidation, violence, and all round fear to a thoroughly psychological pane. The movie is also laced with some deliciously dark humour, with a few addresses to camera by Paul, who steps out of the character and joins the viewer on occasion. Absolutely marvellous. However, it cannot be forgotten that the performances all round are simply outstanding. Each actor plays their part to perfection, and hats off to all - the victims were especially convincingly terrified, and the perpetrators frighteningly cool. Haneke, the director, delivered a masterpiece with this. It's not conventional, doesn't end traditionally, and makes superb use of direction to construct an honestly masterful affair. Highly recommended, but it should be noted it's not for everyone.",
         "This is one of those I nearly didn't watch (I thought it would be pseudo-intellectual drivel about the evil nature of video games) - I'm very glad I got over myself and finally did watch it one day. What an amazingly done film! I've never seen such great acting in a German language movie (the film is Austrian - just to be precise); the script is full of surprises and the whole film has a tightness that is very rare; every little detail is in the right place. Michael Haneke always likes to challenge his audience, but even among his more controversial films 'Funny Games' stands out. The story follows the logic of a nightmare; uneasy tension gives way to unreal horror as you stare in disbelief at what's happening on screen. This is one of the most gripping films about the dark side of human nature I have ever seen; pure cinematic entertainment and yet it goes beyond that (and stays with you long after you've finished watching). A masterpiece \u0096 10 stars out of 10. Favorite Films: http://www.imdb.com/list/ls054200841/ Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/ Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/",
         "In this cross between Who's Afraid Of Virginia Woolf and A Clockwork Orange, two insolent young psychopaths torment a vacationing family. It was hard to organize my thoughts on this movie, never mind rating it. As a thriller, this is a tense, well-acted, and relentless experience, marred only by a contrived sequence two-thirds through in which characters behave in unbelievably stupid fashion. However, said sequence is preceded by an incredibly effective ten-minute take. Unusually lengthy takes are often deemed self-indulgent, but this one is anything but. As an ideological statement, though, this film is a failure. And there is no doubt that writer-director Michael Haneke is trying to make a statement. By having one of the psychos address the camera a few times, saying things to the effect that they have to give the viewers their money's worth, Haneke is essentially wagging his finger at anyone who has ever enjoyed the portrayal of violence in a film. This theme is certainly open to debate, but the problem is that Haneke expresses it in such a condescending way. His harrowing treatment of violence already serves as an excellent counterpoint to other films that glamorize it. There was no need to then leave viewers feeling as though they'd just been lectured by a stern parent. The last time a filmmaker made me angry, it was when I saw Independence Day, and it was for the same reason. In both cases, the writer and the director display contempt by assuming their audiences are idiots. My anger didn't really ignite, though, until I watched a short interview with Haneke on the DVD. It made me never want to see another one of his films. The man is disgustingly full of himself. So why the relatively high rating? Because as pretentious and self-important as Haneke is, he is also very talented. The movie is very effective on an emotional level, and it's possible to watch it while ignoring the director's wrong-headed decisions.",
         "This supposedly shocking, humorless and grim thriller is about an affluent couple (Susanne Lothar and Ulrich Muhe) and their young son, whose attempt at a peaceful retreat is turned into a nightmare. While vacationing at a remote and (so they think) ultra-secure lakeside home, the family is tormented by two clean-cut young men who initially stop by to borrow a few eggs, then won't leave. They try to provoke violence, break the dad's leg with a golf club, kill their dog, make the mother strip and lie about being gay, having horrible childhoods and being drug addicts for a motive (although it's made quite clear that they don't have or necessarily need one). When asked why, one says \"Why not?\" and it's all for \"entertainment value.\" The commentary here, I suppose, is to illustrate that society is often pointlessly brutal and sadistic, and there's no real way to pinpoint an exact cause for the increasing violence in the world. Apparently the director is also doing some finger pointing of his own toward audiences who enjoy lapping up simulated violence in their popular entertainment, as well as those who tune into the nightly news to get the scoop on all the real-life horror stories taking place. In taking on this kind of material, Haneke creates the exact kind of film he is demonizing, which will make this a tough sell to certain people. Who doesn't look at the car accident site while they're passing by hoping to see what happened to the poor sucker involved in the wreck? Who doesn't see a violent scenario playing out in a film or on a TV show and stop to take a look? Most of us do... In my estimation, it's completely natural and healthy to fill one's morbid curiosity about the darker aspects of life and death via film, art and music. I'm not entirely sure what the point is in making us feel bad or guilty about it. If the director is simply wondering why violence and horror are so appealing to the masses, then his film completely lacks any insight, depth or psychological credibility when it comes to that topic. There's some flashy direction, but unfortunately, a lot of it just doesn't work... like long, unbroken takes that seem to go on for hours and a character who talks to the camera (\"Is that enough?\") and then grabs a remote and rewinds the movie after something doesn't go his way. This was an official selection at Cannes and has a fan following, but I found it unpleasant, pretentious and downright boring at times, and it's nothing that numerous other films didn't already do (and do better) in the early 1970s.",
         "A family is terrorized by two psychos in an isolated vacation house. That's the whole plot. The movie is sick, degrading and sadistic (people walked out when I saw it)--but it won't leave me. I saw it a few years ago and I still can't shake it. It is well-directed and extremely well-acted and it is horrifying. My guess is that it's trying to show how madness and evil can show up anywhere at any time and how any one can be destroyed. But there's one aspect of this film I HATE. One of the killers keeps turning to the audience and making comments like, \"You want to see more, don't you?\" It seems it's implicating the audience and pointing out that they are just as responsible as the killers for these people being degarded and tortured. In other words we're guilty of watching this. I don't buy that for one second. If that's true, what does that make the director who directed this? He made this violent sick movie...but that's OK? He's clean because he's not watching? That's bull. Also, when one of the killers is shot and (hopefully) killed the other REWINDS the movie to save him! That's cheating and a pretty dumb device. Still it does stay with you, but do you really want to sit and watch a family being terrorized AND be blamed for it? View at your own risk.",
         "A little over a month ago, I saw a film called \"Devil\". In it, a group of people are stuck in an elevator that has come to a dead stop, presumably because the presence of the devil is in with them. Throughout the movie, the people act dumb and just stand there wondering what to do, as opposed to actually doing anything, getting slaughtered one by one. They just START to act towards the end, and that's mainly when we find out who the Devil in question is. If you're following me, you should have a similar idea of what Funny Games is like. A family of 3 go on vacation to a nearby lake. They're a perfectly happy family, or so it seems. That is until the backstreet boys... whoops, I mean two boys visit them and they're all nice. Apparently the ma has had enough of them, and even getting the pop to remove them won't work. How do they respond? Whacking him in the leg. WITH A GOLF CLUB. The dad COULD respond by fighting back. Instead, he just moans and groans and hugs his leg because he's so scared he's going to get killed by the evil golf club of doom. I will also point out that there are 2 bags worth of golf clubs, but the wife is dumb enough not to GRAB ONE AND USE IT AS DEFENSE. Throughout all this pointless time of fourth wall breaking and pretentiousness, the family could be responding by fighting back, but no, all they can do is weep and moan at the evil golf club of doom. The wife is forced to strip down and the son is blasted away with a shot gun, all because they couldn't do anything to defend themselves. Oh, but then the two creeps leave for a short period of time. Good, they can do something to defend themselves, right? Like, grab one of the kitchen knives, create a barricade,or best of all, GET IN THE CAR AND GET THE HELL OUT OF THERE, right? No. NO. Capital N, Capital O. Instead they spend what seems like an hour blowdrying a phone. When they can use it, instead of saying something like \"911, police!!! Two crazy teenagers are invading our home!!! Please get to (address) as soon as possible!!!\", they spend what seems like an eternity shouting \"HELLO???? HELLO????\" into the phone. And because of it, when the two psychos come back, it's back to the game. Oh, I will give the mom credit for manning up and grabbing the gun!!! Oh wait, she only shot one of them and because she apparently, for unknown reasons to the viewer, can't shoot the other, the other grabs a remote and rewinds it. I KID YOU NOT. I could go on and on, but I'm just getting angry about it. I, for once, am getting tired of movies where a group of people is terrorized and they aren't smart enough to defend themselves. Apparently this was the intention of Haneke, as he usually beats his viewer over the head with the theme because we're too dumb and can only watch a simplified story. Either way, avoid this trash. The only thing more terrifying than two teenage boys terrorizing a family with a golf club is a house full of morons who aren't smart enough to defend themselves.",
         "Mr Haneke seems to love observing family member characters dealing with extreme situations. On one hand we have a typical family which one could call civilized, and on the other hand two young violent sadists. The two worlds are opposed to each other, but then in reality they meet everyday in every part of the world. Their difference is the difference of classical music and black metal (both musical styles can be listened in this movie)...But yet, what is the difference of a normal humorous pretty bomber pilot with Paul and Fatty? They both guarantee a fatal sadistic without hope end. Maybe some people have these realities inside them too. Yet Mr Haneke did not present the beauty of violence as Hollywood movies would (mainstream or Tarantino), nor he directed an hymn to violence as it is clearly seen in \"Clockwork orange\". The \"normal\" watcher sympathizes the normal family. On the contrary in real life situation, maybe reading through a newspaper or watching TV, he would feel sympathy for them for 5 minutes. The power of \"evil\" is presented unquestionable. No hope can survive, even time rewinds and cannot beat the violent (re)actions of these young monsters. The personalities of Paul and Fatty are very interesting as in the end they express some questionable pseydophilosophies. What's their difference again with Nazis and current aggressive wars? Maybe this is a reference to Chaplin's \"Monsieur Verdoux\"... The movie can also be seen through the \"shocking effect\" theory. We question the strength of the family especially father’s protectiveness, but we miss the point that in reality people with normal lifes become easily victims, one can say they are conformists. The shock is less intense for a person who lives an abnormal life and is ready to protest against violence... The actors perform excellently. One must be ready for a \"disturbing\" movie no happy end, no cheap Hollywood violin music, no Deus ex machina, but as it was written above this is an every day incident...We cannot expect from people who are hypnotized all their lifes by \"happy endings and superheroes\" to credit this movie."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Filmfonds Wien",
         "Wega Film",
         "Österreichischer Rundfunk (ORF)"
      ],
      "summaries": [
         "Two seemingly well-educated young men, who call each other Paul and Peter among other names, approach a family on vacation. They are, apparently, friends of the neighbors, and, at the beginning, their true intentions are not known. But soon, the family is imprisoned and tortured in its own house violently, which the viewers are forced mostly to imagine and to share a certain complicity with the criminals. It might be some kind of game with the lives of husband, wife, son, and dog, but why are they doing it?",
         "In this deconstruction of the way violence is portrayed in the media, a family settles into its vacation home, which happens to be the next stop for a pair of young, articulate, white-gloved serial killers on an excursion through the neighborhood.",
         "Georg and Anna, and their son Georgie, are traveling to their lakeside summer home. Upon arrival, Georg and Georgie head off to the lake for sailing while Anna prepares dinner in the kitchen. The serenity is shattered by a young man named Peter, who knocks at the door asking to borrow some eggs. The unwanted visitor is joined by Paul, a brash, arrogant young man. It soon becomes clear the pair has no intention of leaving. When Georg returns and tries to throw them out, physical violence erupts, and the family is held captive. What ensues are highly disturbing and violent games that are initiated by Paul and Peter with Georg, Anna, and Georgie as the unwilling participants.",
         "Two psychotic young men take a mother, father, and son hostage in their vacation cabin and force them to play sadistic \"games\" with one another for their own amusement."
      ],
      "budget": 0
   },
   "movielensId": 6975,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1997-05-14",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Michael Haneke"],
      "runtime": 103,
      "movieId": 6975,
      "title": "Funny Games",
      "mpaa": "NR",
      "actors": [
         "Ulrich Mühe",
         "Susanne Lothar",
         "Arno Frisch",
         "Frank Giering",
         "Stefan Clapczynski",
         "Doris Kunstmann",
         "Christoph Bantzer",
         "Wolfgang Glück",
         "Susanne Meneghel",
         "Monika Zallinger"
      ],
      "imdbMovieId": "0119167",
      "originalTitle": "Funny Games",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["tkbG1uSH0to"],
      "plotSummary": "Two psychotic young men take a mother, father, and son hostage in their vacation cabin and force them to play sadistic \"games\" with one another for their own amusement.",
      "tmdbMovieId": 10234,
      "avgRating": 3.75075,
      "releaseYear": "1997",
      "numRatings": 1332,
      "posterPath": "/mISZcSru00OqBr9nTfdUrHLSmfE.jpg"
   }
}