{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "taiwan",
            "id": 9322
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "youth gang",
            "id": 10766
         },
         {
            "name": "1940s",
            "id": 207883
         },
         {
            "name": "1950s",
            "id": 208611
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0090185",
      "video": false,
      "title": "A Time to Live, a Time to Die",
      "recommendations": [
         45996,
         17422,
         78450,
         36895,
         88811,
         49982,
         213587,
         88752,
         12130,
         99600,
         45935,
         222463,
         176651,
         125829,
         97943,
         121036,
         283711,
         91067,
         8943,
         51549
      ],
      "backdrop_path": "/5QEzabLuWVkGXbEwjBJEJGDD0cC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Hou Fen Ming",
               "gender": 2,
               "credit_id": "58499eb3c3a36814080120af",
               "name": "Tien Feng",
               "profile_path": "/t2EvlAPRt9DcFdzbq8dGasbUFHs.jpg",
               "id": 121394,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Ming's wife",
               "gender": 1,
               "credit_id": "58499ebf92514119b3014a33",
               "name": "Mei Fang",
               "profile_path": null,
               "id": 69835,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Ming's mother",
               "gender": 1,
               "credit_id": "58499fb1c3a3681411014c52",
               "name": "Tang Ru-Yun",
               "profile_path": null,
               "id": 555380,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Hsiao's sister",
               "gender": 1,
               "credit_id": "5849a00892514157fa003073",
               "name": "Hsiao Ai",
               "profile_path": null,
               "id": 1715266,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Ah Ha / Ah Hsiao",
               "gender": 2,
               "credit_id": "5849a05692514159b0002d9f",
               "name": "Yu An-Shun",
               "profile_path": null,
               "id": 1559780,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Hsiao's love interest",
               "gender": 0,
               "credit_id": "5849a273c3a3681411014e0c",
               "name": "Hsin Shu-Fen",
               "profile_path": null,
               "id": 1719810,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 1,
               "credit_id": "5849a27bc3a36814140162a8",
               "name": "Ng Siu-Ying",
               "profile_path": null,
               "id": 1719811,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 1,
               "credit_id": "5849a281c3a368140a015cb7",
               "name": "Grace Chen Shu-Fang",
               "profile_path": null,
               "id": 1609496,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "5849a28992514119af014a7c",
               "name": "Hu Hsiang-Ping",
               "profile_path": null,
               "id": 1627950,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "5849a29092514157fa003224",
               "name": "Lam Shung-Man",
               "profile_path": null,
               "id": 1719799,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 2,
               "credit_id": "5849a2a792514119b6014c1e",
               "name": "Chan Hon-Man",
               "profile_path": null,
               "id": 1418632,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "5849a2aec3a36814140162f7",
               "name": "Kao Chung-Li",
               "profile_path": null,
               "id": 1719815,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 0,
               "credit_id": "5849a2b492514159b0002f23",
               "name": "Luo Cheng-Ye",
               "profile_path": null,
               "id": 1719816,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "5849a2b9c3a3681428013657",
               "name": "Cheung Ning",
               "profile_path": null,
               "id": 1719817,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 2,
               "credit_id": "5849a40d92514159b000314f",
               "name": "Jim Tao",
               "profile_path": null,
               "id": 1092246,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 1,
               "credit_id": "595003aa925141311105095c",
               "name": "Yang Li-Yin",
               "profile_path": null,
               "id": 136891,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46dec3a36847f8116caf",
               "name": "Hou Hsiao-hsien",
               "profile_path": "/lIr03NsssQ8i6pbujxKfanr4a07.jpg",
               "id": 64992,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "532ebff59251413a7b00321d",
               "name": "Mark Lee Ping-Bing",
               "profile_path": "/onbu25VDFwNshSdrgqQtFKA2XSb.jpg",
               "id": 232804,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "584999ef92514157fa002c90",
               "name": "Liao Ching-Song",
               "profile_path": null,
               "id": 69834,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "584999a6c3a3681408011e28",
               "name": "Wang Chi-Yang",
               "profile_path": null,
               "id": 1211186,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "584997c892514159b0002897",
               "name": "Chu Tien-Wen",
               "profile_path": "/geURr9VUYnmbcwAr5KEHMVWIb27.jpg",
               "id": 69831,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "584997cf92514119bc0149a3",
               "name": "Hou Hsiao-hsien",
               "profile_path": "/lIr03NsssQ8i6pbujxKfanr4a07.jpg",
               "id": 64992,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "584997ff92514119b30146a6",
               "name": "Hui San-Chi",
               "profile_path": null,
               "id": 1719776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58499a07c3a368141a015d2e",
               "name": "Chu Ching-Man",
               "profile_path": null,
               "id": 1719782,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "58499a59c3a368140a015772",
               "name": "Chang Hung-Yi",
               "profile_path": null,
               "id": 1540807,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58499b86c3a368140a01580c",
               "name": "Ng Choh-Choh",
               "profile_path": null,
               "id": 1719785,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58499bc5c3a3681414015e0c",
               "name": "Tsui Siu-Ming",
               "profile_path": "/kJYejfLNjMJuG0mm2DjMqp0N0p1.jpg",
               "id": 1145614,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "58499e5bc3a368141f014bc6",
               "name": "Lam Shung-Man",
               "profile_path": null,
               "id": 1719799,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.718477,
      "production_countries": [{
         "iso_3166_1": "TW",
         "name": "Taiwan"
      }],
      "id": 45999,
      "vote_count": 18,
      "budget": 0,
      "overview": "The semi-autobiographical film on director Hou Hsiao-Hsien's childhood and adolescence, when he was growing up in Taiwan, living through the deaths of his father, mother and grandmother.",
      "similar": [
         112160,
         403,
         42984,
         15804,
         235,
         13,
         14,
         11216,
         238,
         376867,
         258480,
         2604,
         11421,
         294016,
         746,
         24684,
         14748,
         80271,
         13466,
         31439
      ],
      "original_title": "童年往事",
      "runtime": 138,
      "poster_path": "/oB1tuyw5xk7EoFcDBuUStO1bhea.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Central Motion Pictures Corporation",
         "id": 25346,
         "origin_country": ""
      }],
      "release_date": "1985-08-03",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Taiwan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Hsiao-Hsien Hou",
         "Jia-hua Lao"
      ],
      "runtime": 138,
      "synopsis": null,
      "writers": [
         "T'ien-wen Chu",
         "Hsiao-Hsien Hou"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0090185/",
      "coverLink": null,
      "actors": ["Stars: Chia-bao Chang, Neng Chang, Chih-chen Chen | See full cast and crew »"],
      "reviews": [
         "I recommend A TIME TO LIVE AND A TIME TO DIE as a great introduction to the films of Hou Hsiao Hsien, who I consider the greatest director working today. Like most of his films, this one is about the telling of history, the effort to recreate the memories of the past, in this case his childhood memories growing up in rural Taiwan. His family has escaped Communist China but live as if they will make their return someday. That someday never comes, the family grows old, and members die one by one. These tragedies (filmed with heartbreaking solemnity) serve as punctuation marks for the film's narrative, which isn't so much concerned with plot details as it is with capturing the sense of what it was like to live at that time, as the kids develop their own sense of belonging, in a country they have adpoted just as it has adopted them. His method of editing and storytelling is something close to revolutionary, and he would refine it in his later films. His ability to set scene after impeccable scene and let the ideas ferment over their totality is unparalleled. This is perhaps his most accessible film, full of heart and pathos. It may seem slowgoing by Hollywood standards, but if you have the willingness to let it wash over you, you will be transported, both mentally and emotionally.",
         "This film, which first brought Hou and the Taiwanese New Wave to international attention, seems deceptively simple, like your run-of-the mill growing-up-humbly-in-a-third-world-country narrative: a young boy, whose family has been transplanted from China to Taiwan, faces a hard path to adulthood complete with neighborhood tussles and family deaths. But gradually its manner of telling draws you in: at first, events seem like fragmented vignettes, but are actually blended in a succession that has been described as `like watching clouds floating by.' His propensity towards graphically composed, image-driven storytelling recalls the styles of Ozu, Satyajit Ray and even Tarkovsky, but where Hou excels is in applying his style towards an examination on the nature of history. For my money, there has never been a filmmaker as consumed by the idea of history than Hou, and this deeply autobiographical film may shed light on his motivations. By the time we reach the devastating ending, there's an overwhelming feeling of a time and place, an entire way of life, that has slowly disappeared before our eyes, but even more heartbreaking is the profound sense of guilt, of youthful opportunity squandered in hoodlum-like loitering, of parents whose presence was taken for granted until the sudden arrival of their ineffable absence. Watch this film to see how movies are humankind's noble, anxious attempt to retrieve lost time, and how the retrieval only reflects back on the mournful permanence of that loss.",
         "Seeking a better life, a teacher brings his family from Mei County in the Kwangtung Province of mainland China to Fengshan in the south of Taiwan in 1947. As a result of the Communist takeover on the mainland, the family is forced to remain in Taiwan, estranged from their traditional home and culture. The Time to Live and The Time to Die, a semi-autobiographical film by Taiwanese director Hou Hsiao-Hsien, is a compassionate story of a family's struggle to adapt to living in a new society. Loosely based on the childhood memories of Taiwanese director Hou Hsiao-Hsien who came to Taiwan in 1948, the film chronicles the passing of the older generation and the emergence of the new. The director narrates the film from the point of view of the youngest son, Ah-Hsiao (You Anshun), called Ah-ha by his grandmother (Tang Yu-Yuen). The Time to Live is shot in a reflective style that allows an intimacy with the material. In the first half, the family learns to adjust to their new environment: the children play outside, the family eats dinner together and engage in small family rituals. Hou is observant of the political and technological changes taking place in the background, noting, for example, the increasing number of cars and motorcycles on the streets, the installation of electricity in their home, the improving medical treatment that the parents receive, and a letter from an aunt revealing the Great Leap Forward in China. What doesn't change, however, is the continued second class status of women, depicted in a scene where the mother lectures the daughters about their responsibilities for housework and how it must come before an education. As the family gets older, the longing for their homeland increases. On several occasions, the old grandmother becomes disoriented and asks shopkeepers for directions to the Mekong Bridge (in China). When she gets lost, she has to be returned home via taxicab. The second half of the film painfully shows the loss of parental guidance and the disintegration of the family. As illness sets in, the parent's pain and slow disintegration takes place directly in front of the camera, not in the background. Ah Hsiao and his siblings stoically endure the loss of both parents, but their growing involvement in delinquency and petty crime underscores the loss of structure in their lives. This is Hou's most personal film and one that is filled with images of extraordinary power. I was moved to see Ah Hsiao face when he sees death for the first time while walking into the room containing his father's body, and when the family shares loving recollections of the father soon after his death. Backed by a lyrical soundtrack, the street scenes and images of family life convey a rare authenticity and visual poetry. As in the film \"Pather Panchali\" by Satyajit Ray, the tiny village in Taiwan becomes a microcosm of the outside world. Like Ray's masterpiece, it is a sad film, yet, in its celebration of the wonder of life and the strength of the human spirit, it is also triumphant. The Time to Live and the Time to Die is not only a loving tribute of one son to his family but a testament to the strength of all families.",
         "SPOILER insofar as events towards the end are mentioned This study of family life is Hou Hsiao-Hsien's most personal and deeply felt film. The voice-over narration by the central character is clearly autobiographical and there can be little doubt that these are recollections of the director's childhood and in particular of his parents. As in other Taiwanese films by Hou and his outstanding compatriot, Edward Yang, a sense of history is crucial to understanding how the families they portray think and feel. These are Chinese cut off from their mainland roots by revolution. For the adults the dream is to return and it is a question of making do with the island as a temporary refuge, albeit one that has become all too permanent. For the senile grandmother reality is poignantly blurred and she imagines her mainland home to be just down the road. Meanwhile the children happily play their games, spinning tops and occasionally wondering at such mysteries as telegraph poles being erected, until adolescence brings disillusionment, their loss of innocence manifesting itself in gang conflict. In an attempt to show things as they are, Hou eschews narrative connections which is why his films sometimes seem confusing at first acquaintance. How many young members of this family are there for instance? In itself this is rather unimportant as the interest mainly centres on Ah-ha the autobiographical son. It is only as we get into the film that we realise that the boy has three brothers, one of them much older and a sister. This is a film that does not give up its secrets during its first half-hour, so much so that whenever I watch it, I start by wondering if I have overrated it. It seems sketchy and formless - a wealth of domestic detail not leading anywhere in particular. Then suddenly there is a sequence that tears me apart. During a powercut the asthmatic father, who has long been in poor health, dies. This unleashes a torrent of family grief so powerfully traumatic that it is almost without equal in cinema. Only Satyajit Ray in his \"Apu\" trilogy has captured family bereavement as movingly. From this point onward the film exerts a compelling power. The middle section alludes to the type of youth gang warfare that is explored more fully in Yang,s \"A Brighter Summer Day\". Death dominates the final third of the film , first the lingering one of the mother who refuses cancer treatment and then the grandmother whom those younger members left behind unwittingly neglect. We as Westerners can perhaps empathise with young adolescents placed in this position, but, in the eyes of the Eastern mortician, they are irredeemably guilty of filial neglect. Although \"The Time to Live and the Time to Die\" is arguably Hou's greatest work, it is at the same time his most depressing. Like Helma Sanders-Brahms in \"Germany, Pale Mother\", a film depressing almost to the point of morbidity, the director forces us to confront aspects of life we would rather not think about, but by so doing enriches our understanding of the human condition in a way that only the very greatest can achieve.",
         "Besides being a great film about an emerging new generation in Taiwan after the war, this film is also full of authentic atmosphere. There is the Japanese style house the family lives in; Japanese sandals, nowadays still worn by some elder people. Ah-ha and his granny eating water ice after he passed the entrance exam for middle school - the ice machine with it's big wheel in the foreground. The only street lamp, the kids play under in the evenings; the games they play in the streets. The haircut of school children - boys three centimeters, girls three centimeters below their ears. Their school uniforms, some of them still the same in Fengshan today (believe me). Gangs fighting with water melon knifes and the little red police jeep. The film is close to real everyday life in Taiwan at that time, although you won't find much of it there nowadays.",
         "Although I think The Puppetmaster is the real best masterpiece of Hao, Time to live and the time to die is the one I love most. Despite the implication and background of Taiwan history in the film, as I am not so clear about it and not close to me, the story about growing-up is the reason that the film move me so much. The trip of the main kid \"ar Ha\" and his grandma become the warmest and most unforgettable part of the film. By the way, I think the relatively slow and quiet style of Hao extremely suit the story of rural and history background, much better than modern city background.",
         "I wouldn't say that this movie is one of my favorite, since though aesthetically cinematographed, it at some times seems like a drag, in terms of the plot. But a few scenes touched me, and were reminiscent of my own childhood. As such, it is a great movie to see. Personally I don't like the English title A Time to Die, A Time to Live, which a reviewer said reveals the tragedies bound to happen in this film. In fact, the Chinese title simply means childhood memories. Besides, the deaths are not like orchestrated by Hou to make the audience cry as in a tearjerker. The scene of the mother's crying over the father's death seems natural to me. This might be a cultural difference so I don't blame western audience who failed to feel the pain as the mother did. For some, it might not be touching, but I did cry when the mother (Mei Feng) started crying. It's not at all like a laugh track. Again, it's a cultural difference that makes the audience feel that there's too little interaction among Ah-ha and his parents and it makes little sense for the audience to feel empathized when the parents died. Even today, reservation is still a characteristic of many parents in Taiwan, especially in rural areas. The way they care about their kids is simple, and one way is cooking food for them (I don't see much of this in western movies). In this film, people don't say \"I love you\" often or hug everybody wholesale. The audience need to feel the (eastern or more politically correct, Taiwanese) older generation's way of expressing love through subtle details.",
         "\"A Time to Live and a Time to Die\" reads like a family saga, but it is just as much a film about the passing of traditional China and the dislocation of exile. Of course the plot points are given away; Hou isn't interested in dramatic tension and Aristotelian unities--these are so dependent on Western ideas of personality and the separation of individual and world that they make little sense in China. He doesn't push the events in our faces, either--they just happen, often in the middle distance with a tree in the foreground, the way real life happens. (Remember Auden's \"Musee de Beaux Arts\", with Icarus plunging in the sea far off while a ploughman works on his field?) The space Hou gives his events and his characters doesn't give us the intimacy with people that we expect in the West. But it gives us a rich sense of the texture of life and the things that pass among members of a family and a community, even one that is thrown together and can just as suddenly fall apart, as it begins to here. It's that feeling for social space, in part, that allows this film and others of his to address social and historical questions without ever losing the sharp particularity of a personal story.",
         "For me, this transparent, transcendental film ranks with with the very best of Bresson and Ozu. Meandering, episodic and deceptively detached in tone, A TIME TO LIVE AND A TIME TO DIE is quite probably Hou Hsiao-Hsien's most daring formal experiment, as well as--surprisingly--his most moving film to date.",
         "Hou Hsiao-hsien's most autobiographical film portrays a family whose older generation came -temporarily in their mind- to Taiwan at the end of the Chinese Communist revolution and longs to go back to a China that no longer exists, and a younger generation that grew up in Taiwan and considers it their home. It's a film that moves to the rhythms and cycles of life, from childhood to adolescence, observed by Hou in long takes at a distance, but it's remarkable how much intimacy he nevertheless achieves, like in that moving scene where a mother opens up to her daughter, filmed in a single master shot, yet there is a lot of closeness in that highly universal and very recognizable moment of growing up, where, for the first time, you find you're no longer just parent and child, but two adults having a conversation. The film is full of moments like that as well as little details of childhood, like the patterns droplets form on windowpanes, the way a carpenter crafts an ornament or the movements of spinning tops, all the things that fascinate children, but that as an adult, you become to jaded to appreciate. It takes a filmmaker like Hou Hsiao-hsien to make us notice their beauty again. Like many great films, A Time to Live, a Time to Die makes you see the world anew, as if for the first time."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Central Motion Pictures",
         "Yi Fu Films"
      ],
      "summaries": [
         "This depiction of childhood and adolescence draws heavily from the filmmaker's own boyhood. Like many of their compatriots, Hou's family moved from the mainland to Taiwan in 1948 and was unable ever to return. The film focuses on the widening generation gap in a family cut off from its cultural heritage.",
         "The semi-autobiographical film on director Hou Hsiao-Hsien's childhood and adolescence, when he was growing up in Taiwan, living through the deaths of his father, mother and grandmother."
      ],
      "budget": 0
   },
   "movielensId": 70423,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1985-08-03",
      "dvdReleaseDate": null,
      "directors": ["Hou Hsiao-hsien"],
      "runtime": 138,
      "movieId": 70423,
      "title": "A Time to Live, a Time to Die",
      "mpaa": "",
      "actors": [
         "Tien Feng",
         "Mei Fang",
         "Tang Ru-Yun",
         "Hsiao Ai",
         "Yu An-Shun",
         "Hsin Shu-Fen",
         "Ng Siu-Ying",
         "Grace Chen Shu-Fang",
         "Hu Hsiang-Ping",
         "Lam Shung-Man",
         "Chan Hon-Man",
         "Kao Chung-Li",
         "Luo Cheng-Ye",
         "Cheung Ning",
         "Jim Tao",
         "Yang Li-Yin"
      ],
      "imdbMovieId": "0090185",
      "originalTitle": "童年往事",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The semi-autobiographical film on director Hou Hsiao-Hsien's childhood and adolescence, when he was growing up in Taiwan, living through the deaths of his father, mother and grandmother.",
      "tmdbMovieId": 45999,
      "avgRating": 4,
      "releaseYear": "1985",
      "numRatings": 21,
      "posterPath": "/oB1tuyw5xk7EoFcDBuUStO1bhea.jpg"
   }
}