{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "lesbian interest",
            "id": 34215
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0830570",
      "video": false,
      "title": "I Can't Think Straight",
      "recommendations": [
         31031,
         56743,
         51736,
         71325,
         18212,
         1544,
         19344,
         15647,
         12808,
         165603,
         17612,
         38645,
         106538,
         26491,
         125233,
         107257,
         29371,
         44991,
         286817,
         370663
      ],
      "backdrop_path": "/baYbbMtKRDoDWYJeVWkbygAvAj8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tala",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fce7",
               "name": "Lisa Ray",
               "profile_path": "/dQ8wm5CSCQofP18MYjOVm2jKiks.jpg",
               "id": 52969,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Leyla",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fceb",
               "name": "Sheetal Sheth",
               "profile_path": "/gH9aOMdvmcGu7247TsOvpEeqsx5.jpg",
               "id": 94308,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Reema",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd01",
               "name": "Antonia Frering",
               "profile_path": "/2juDS3TepeQhQqocnMTkgiGKWXX.jpg",
               "id": 1184846,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Omar",
               "gender": 2,
               "credit_id": "52fe44699251416c9100fd05",
               "name": "Dalip Tahil",
               "profile_path": "/gEJ9KxcMBnrrRpl9NHJ0eIktHlu.jpg",
               "id": 11861,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Housekeeper",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd09",
               "name": "Nina Wadia",
               "profile_path": "/vr2x8ghsDwq5h592FuTq7nAMbds.jpg",
               "id": 150469,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd0d",
               "name": "Ernest Ignatius",
               "profile_path": null,
               "id": 1184847,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Maya",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd11",
               "name": "Siddiqua Akhtar",
               "profile_path": null,
               "id": 1184848,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Yasmin",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fd15",
               "name": "Amber Rose Revah",
               "profile_path": "/cThPovs1j59Vs5iejgLqUZRBchv.jpg",
               "id": 574378,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lamia",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd19",
               "name": "Anya Lahiri",
               "profile_path": null,
               "id": 157817,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Zina",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fd1d",
               "name": "Kimberly Jaraj",
               "profile_path": null,
               "id": 1111561,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Kareem",
               "gender": 2,
               "credit_id": "52fe44699251416c9100fd21",
               "name": "Sam Vincenti",
               "profile_path": "/nuiD5xbdFJUC5GYoenexYKmntYD.jpg",
               "id": 1184849,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Ali",
               "gender": 2,
               "credit_id": "52fe44699251416c9100fd25",
               "name": "Rez Kempton",
               "profile_path": "/d7r7wjKjs3dYiq036oFaGIZRbC9.jpg",
               "id": 144311,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Hani (as Daud Shah)",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd29",
               "name": "Darwin Shaw",
               "profile_path": "/d9GZ0MbHuBYgqhnowL5JUfJp2nq.jpg",
               "id": 1070749,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Uncle Ramzi",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd2d",
               "name": "George Tardios",
               "profile_path": null,
               "id": 1184850,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Sami",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd31",
               "name": "Ishwar Maharaj",
               "profile_path": null,
               "id": 1184851,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Aunty Ramzi",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd35",
               "name": "Gabrielle Amies",
               "profile_path": null,
               "id": 1184852,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Jennifer",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fd39",
               "name": "Jessica Allsop",
               "profile_path": null,
               "id": 1184853,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44699251416c9100fcf1",
               "name": "Shamim Sarif",
               "profile_path": null,
               "id": 107753,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44699251416c9100fcf7",
               "name": "Kelly Moss ",
               "profile_path": null,
               "id": 224611,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44699251416c9100fcfd",
               "name": "Shamim Sarif",
               "profile_path": null,
               "id": 107753,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.082315,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 31216,
      "vote_count": 66,
      "budget": 0,
      "overview": "I Can't Think Straight is a 2007 romance movie about a London-based Jordanian of Palestinian descent, Tala, who is preparing for an elaborate wedding. A turn of events causes her to have an affair and subsequently fall in love with another woman, Leyla, a British Indian. The movie is distributed by Enlightenment Productions. It was released in different theatres between 2008 and 2009. The DVD was released on 4 May 2009. The movie is directed by Shamim Sarif and stars Lisa Ray and Sheetal Sheth. The two actresses star in another movie with lesbian characters, namely The World Unseen, released in 2008.",
      "similar": [
         370663,
         184352,
         449176,
         152584,
         258480,
         21060,
         160165,
         126331,
         513,
         338189,
         401898,
         376867,
         12793,
         26280,
         382475,
         455661,
         347136,
         10938,
         11703,
         142
      ],
      "original_title": "I Can't Think Straight",
      "runtime": 80,
      "poster_path": "/brzCDIzH3gO4BnAnzrTRxaOMXTy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Enlightenment Productions",
         "id": 15073,
         "origin_country": ""
      }],
      "release_date": "2008-06-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.icantthinkstraightfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shamim Sarif"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Shamim Sarif",
         "Kelly Moss"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0830570/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODU4Njg3OTkwOF5BMl5BanBnXkFtZTcwMjg5NzAwMg@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Lisa Ray, Sheetal Sheth, Antonia Frering | See full cast and crew »"],
      "reviews": [
         "I recently saw this movie screened at USC. Since I was going for extra credit in a gender studies class, I expected it to be awful. I have to say I was very pleasantly surprised. The only issue I had with it was an awkward transition from Tala's engagement party to the first scene with Leyla. Overall, the movie was very entertaining, with well developed characters and plot, while at the same time dealing with the issues lesbians face in different cultures in a very effective manner. I strongly recommend this movie to anyone with an open mind and a sense of humor. 9/10.",
         "This is an interesting film from a variety of perspectives. It addresses sexuality as well as issues of middle eastern faith and culture. Light hearted though it is, it shows several cultures few have seen from the inside out. Modern Britain plays host to many cultures of middle eastern descent. And the stereotype of \"angry fathers\" and \"downtrodden women\" is a commonly repeated meme. This film shows strong women, compassionate men and loving families. Filmed in Britain, with very few imported actors, one sees a cross section of cultures working together to produce a good project. This is a great film to take almost anyone to.",
         "This movie, if you have watched \"The Making Of I Can't Think Straight,\" is autobiographical. It is based upon a true story of Shamim Sarif's life, or at least a part of it. In doing that, do you expect her to be politically correct or present it the way it was? I prefer the latter It's how it was for her and her partner, not how it should be in a perfect world. For a first time director, I think she did a good job. It's not a great movie, but it is entertaining. You can't deny the chemistry between the two main characters, either.",
         "Amazing. I loved it so much. The two main actresses were fantastic, very talented young women. The chemistry between the two of them was phenomenal. The suspense they created just held you right there, watching the film and unable to turn away. Moving from Jordan to England, the settings created a background to an incredibly unique film not only about coming out but also about religion, family and culture. It was pretty much just a wonderfully unique film, that gave an entirely new perspective on things and that should be applauded over and over again. The characters were hilarious- all of them. From the maid, to sisters to boyfriends and parents, all the characters complemented each other perfectly and the entire film had me laughing and crying the entire time. Absolutely fantastic!!",
         "I enjoyed 'I Can't Think Straight' (which i think is a very clever title indeed given the content of the film). It raises the issue of lesbianism but in the context of Indian culture. Arranged marriages and a mother who is wanting to marry you off to the most suitable husband. Usually the man who comes from the most prestigious family, who is very successful, tall, very hansom, etc. All because the mother of the family wanting to marry off their daughter wants to gain some financial security and prestige for the family. (Or at least this is how it has been portrayed to me in the film). But what about if the daughter is gay? Much harder to imagine I feel, and 'I Can't Think Straight' portrays this matter very well. The movie is full of alluring cinematography and well constructed dialogue. Particularly I found, when the characters of Lisa Ray and Sheetal Sheth go for their ramble in the park. This is an especially elegant scene but the whole film screams decoration and harmony. The acting from the main characters is spot on and they must have received clear direction from Shamim Sarif. Some of the minor character's acting is quite poor and does not do justice to the script. but on the whole, it makes little difference to the story.",
         "The absolutely gorgeous Indian actress Lisa Ray (Vancouver critics named her Best Actress for Water) plays Tala, an upper class Jordanian of Palestinian origin, whose family lives in London, and who is about to get married. She meets Leyla, played by Sheetal Sheth, the first Indian-American actress to appear in Maxim. She plays an Indian Muslim who also lives in London. Clearly, the casting of the leads is meant to appeal to audiences that wouldn't normally watch a lesbian film, even one that is billed as a romantic comedy. They are both accomplished actresses, but they are also very attractive. Not only do we get a film about becoming aware of one's sexual identity, but one about Arabs and Jews, Christians and Muslims, and, most importantly, family and acceptance. Leyla tells her parents that she is gay. Her mother flips out, but her father is extremely supportive. Tala calls off, what is it her 5th, wedding, but does not immediately tell why. The family is used to her changing her mind at the last minute. When she does, the maid (Nina Wadia) does a little dance, as the mother treats her so badly that she spits in her antacid when she brings it. You knew how it was going to end, but the journey was a real pleasure. It's PG-13, so there won't be any nudity, just kissing and touching.",
         "Director (Shamim Sarif Discussion Group-http://movies.groups.yahoo.com/group/shamim_sarif_fans/). First, let me say that I first became familiar with Shamim Sarif's work, while visiting the Philadelphia Gay Film Festival over the last few years. This will be long, as I ABSOLUTELY LOVE both films, and can't recommend them enough for some humor, realistic drama and a journey beyond any existing borders of the mind. My partner of 10 years and I have become life-long fans of Shamim's work, as this writer/director has captured our hearts and souls with relevant and poignant story lines that could serve as crossover projects for the mainstream media. I believe the latter is crucial in engaging America and the world in a dialogue of equality which transcends sexuality or gender. ***SPOILER ALERT*** I CAN'T THINK STRAIGHT- ===================== This has taken its spot among my favorite romantic comedies of all time. The soundtrack was up-tempo, fun and playful. The colors, costumes and set design where expertly integrated, and both this, and THE WORLD UNSEEN should be re-released on Blu-Ray. The look of both films is amazing and begs for hi-definition treatment. This time Shamim Sarif uses humor effectively to shed light on the cultural taboo of being in a same sex relationship. She re-casts Lisa Ray as the confident, bold and seductive Tala, working on her own business, opposite Sheetal Sheth as Leila, the shy, beautiful and insightful writer, and object of Tala's affections. Together they explore this very forbidden, but inevitable love, and find their way to each other, with each other's help. But on the way, they are aided by friends in very humorous situations, and hindered by family members, still loyal to reserved tradition. The soundtrack is virtually its own character, as it includes catchy and sexy songs ranging from ethnic to ballad, which compliment Tala and Leila's journey perfectly. The cultural taboo of being in this relationship is a relatable conundrum that many same sex couples have faced, and despite this film's focus on Jordanian and Indian cultures, the overarching theme of being threatened, disowned and shunned by family is universal and sadly, very relevant. All of the characters are funny and charming, and the dialogue is hilarious and smart, but never preachy. I found it particularly interesting how the fathers in both THE WORLD UNSEEN and I CAN'T THINK STRAIGHT were overall very supportive-another rare depiction, given the theme and cultures depicted. ***SPOILER ALERT*** THE WORLD UNSEEN: ===================== For me, this film is a stunning, visual masterpiece, based on the book of the same name. The sweeping visual landscape, and texture and layers of the setting, costumes, characters and lifestyle are simply magnificent and breathtaking. The film also masterfully captures the inhumanity, humiliation, cruelty and robbing of dignity caused by the laws of the period. It is a period piece, set in 1950's South Africa and tells the heartfelt and heart-breaking story of two women who find each other under during a chance encounter which awakens an emotional connection that ultimately unites them in heart, mind and soul. This occurs during a time period, where mixed race relationships are considered criminal, and the country has taken for granted that this should be acceptable. That is, except for those that characters that fight to revolt against this, and believe in equality. This includes Amina, the rebellious, courageous character (Sheetal Sheth) who ultimately reminds Miriam (Lisa Ray)-an oppressed and abused housewife, who has lost herself and her interests, in her \"role\"- that she the latter has the strength to stand on her own and be who she wants to be-personally and professionally. Both Sheetal Sheth and Lisa Ray do an incredible job of conveying their individual plights on screen-sometimes with little spoken word and an artistic journey that entrenches you into their quiet pain, caused by the situation. Their scenes are some of the most skillful, yearning and heart-wrenching I have ever seen. The story is told with such subtle and emotional complexity that I've rarely seen on film. Many feelings are conveyed with glances, the score itself, and unsaid words, which make this film incredibly powerful. Although the film leaves much implied, I was completely captivated by the power of the performances of the leads, as well as the supporting cast. I learned a great deal about the time period, as well as how much courage each character had to find within him/herself to ultimately emerge independent and dignified. Amina is playful, bold, flirty and powerful and Miriam is reserved, curious and taken with Amina and all that she represents. There is passionate chemistry between the two female leads, who ultimately risk everything to grasp that which is most important-love for each other and for life and happiness. The film has an open end, but keen viewers can deduce the outcome and will remember this powerful story forever. This is the winner of numerous awards, including the official selection at the Toronto Film Festival & London Film Festival. Do not miss this film! Again, Shamim Sarif achieves the kind of crossover appeal, whether intentional or not, that allows the universal themes of unstoppable love to trump the sometimes \"hot button\" issues of gender, political and sexual orientation components. Both leads and the entire supporting cast envelop us with hope, laughter and inspiration. These two films are truly must- sees and the behind the scenes extras on both DVD's are great additions. Regardless of your sexual orientation, or interest in the genres, I highly recommend these 2 pieces as examples of genius book to film transitions and films that stand on their own (I've not read the books yet), that deliver a poignant message of hope, equality, inspiration and entertainment. Stay updated on Shamim's work by joining her Facebook page. Stay updated with Lisa Ray & Sheetal's Facebook pages (search for each). Enjoy!",
         "Wow! This is a great movie. I felt the actors were actually having this relationship. They dealt with conflict, misunderstanding, and love as if it was something they actually shared. While the premise was a lesbian relationship, this could happen to anyone. Lisa Ray and Sheetal Sheth are also very attractive women. This physical attraction made me feel that this movie was more than a movie. I felt that perhaps the story shared on the screen was true. That is, it actually happened between these two women. I enjoyed this movie. I would watch any future films featuring either of these actors. I suggest folks seek movies with either of these performers.",
         "If this were simply a story about your average, every day, star crossed lovers, one might describe it as a \"chick flick\". It is a romance with some comedic elements, but I doubt it can honestly be called a \"romantic comedy\". Instead, it is a rather simple love story that, toward the end, threatens to leave the viewer hanging. The characterizations by the two lead actresses is stunning and highly believable. They do not play their roles over the top, but in a somewhat subdued manner that is consistent with the behavior of women from their respective cultures. Even so, Tala (played by Lisa Ray) is something of a maverick in her opinions, outlook and something of a problem for her family even before she meets Layla. I fell in love with both the characters early in the film and they took me on an enjoyable ride.",
         "I have always thought this movie would be funny and quirky, and it is. I loved the way they put comedic scenes in certain parts without being inappropriate. I loved it even more because in so many ways, I also find it extremely sexy (unlike the many other lesbian films that needed to show pure nudity). Although it might be one of the many I'm-gonna-marry-but-I- fell-in-love-with-another story, it hit off just right. 'Cause it did not just focus about that, but having to come up to your parents. It is about standing for who you are and for the one you love. Such a good love movie. A must-watch. Lisa (Tala) and Sheetal (Leyla) are both so bloody gorgeous I think I am a pebble - or less than."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Enlightenment Productions"],
      "summaries": [
         "A 2008 romance film adapted from a same name novel about a London-based Jordanian of Palestinian descent, Tala, who is preparing for an elaborate wedding. A turn of events causes her to have an affair and subsequently fall in love with another woman, Leyla, a British Indian.",
         "In the upper echelons of traditional Middle Eastern society, Reema and Omar prepare for the marriage of their daughter Tala. But back at work in London, Tala encounters Leyla, a young British Indian woman who is dating Tala's best friend Ali. Tala sees something unique in the artless, clumsy, sensitive Leyla who secretly works to become a writer. And Tala's forthright challenges to Leyla's beliefs begins a journey of self-awareness for Leyla. As the women fall in love, Tala's own sense of duty and cultural restraint cause her to pull away from Leyla and fly back to Jordan where the preparations for an ostentatious wedding are well under way. As family members descend and the wedding day approaches, the pressure mounts until Tala finally cracks and extricates herself. Back in London, Leyla is heartbroken but learns to break free of her own self-doubt and her mother's expectations, ditching Ali and being honest with her parents about her sexuality. When Ali and Leyla's feisty sister Zara help throw Tala and Leyla together again, Tala finds that her own preconceptions of what love can be is the final hurdle she must jump to win Leyla back."
      ],
      "budget": 0
   },
   "movielensId": 70637,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-06-01",
      "dvdReleaseDate": null,
      "directors": ["Shamim Sarif"],
      "runtime": 80,
      "movieId": 70637,
      "title": "I Can't Think Straight",
      "mpaa": "",
      "actors": [
         "Lisa Ray",
         "Sheetal Sheth",
         "Antonia Frering",
         "Dalip Tahil",
         "Nina Wadia",
         "Ernest Ignatius",
         "Siddiqua Akhtar",
         "Amber Rose Revah",
         "Anya Lahiri",
         "Kimberly Jaraj",
         "Sam Vincenti",
         "Rez Kempton",
         "Darwin Shaw",
         "George Tardios",
         "Ishwar Maharaj",
         "Gabrielle Amies",
         "Jessica Allsop"
      ],
      "imdbMovieId": "0830570",
      "originalTitle": "I Can't Think Straight",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["KIetcsELZvo"],
      "plotSummary": "I Can't Think Straight is a 2007 romance movie about a London-based Jordanian of Palestinian descent, Tala, who is preparing for an elaborate wedding. A turn of events causes her to have an affair and subsequently fall in love with another woman, Leyla, a British Indian. The movie is distributed by Enlightenment Productions. It was released in different theatres between 2008 and 2009. The DVD was released on 4 May 2009. The movie is directed by Shamim Sarif and stars Lisa Ray and Sheetal Sheth. The two actresses star in another movie with lesbian characters, namely The World Unseen, released in 2008.",
      "tmdbMovieId": 31216,
      "avgRating": 3.59,
      "releaseYear": "2008",
      "numRatings": 50,
      "posterPath": "/brzCDIzH3gO4BnAnzrTRxaOMXTy.jpg"
   }
}