{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1047494",
      "video": false,
      "title": "Meet the Browns",
      "recommendations": [
         26367,
         16186,
         15670,
         17202,
         16781,
         35688,
         16555,
         51017,
         15450,
         62008,
         27360,
         16428,
         103370,
         19489,
         43814,
         13490,
         175555,
         44944,
         350616,
         257249
      ],
      "backdrop_path": "/9Rwfa7Tylu3tseRx8MK7qAaI7oQ.jpg",
      "revenue": 41939392,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Madea",
               "gender": 2,
               "credit_id": "52fe46e79251416c75087653",
               "name": "Tyler Perry",
               "profile_path": "/fdBvkrv4lSKZ97eDLpmjlK1Tnbx.jpg",
               "id": 80602,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Leroy Brown",
               "gender": 2,
               "credit_id": "52fe46e79251416c75087657",
               "name": "David Mann",
               "profile_path": "/s6KHTMjbgdBlMmfSxRST0T2tsXN.jpg",
               "id": 78739,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cora Brown",
               "gender": 1,
               "credit_id": "52fe46e79251416c7508765b",
               "name": "Tamela Mann",
               "profile_path": "/cO78zqUvoTz1RnOKyqVU2DNZOAp.jpg",
               "id": 78738,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Brenda Brown",
               "gender": 1,
               "credit_id": "52fe46e79251416c7508765f",
               "name": "Angela Bassett",
               "profile_path": "/tHkgSzhEuJKp5hqp0DZLad8HNZ9.jpg",
               "id": 9780,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Michael Brown",
               "gender": 2,
               "credit_id": "52fe46e79251416c75087663",
               "name": "Lance Gross",
               "profile_path": "/21NjcNRJLgM5Z4yeClWPwpXR47B.jpg",
               "id": 112566,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tosha Brown",
               "gender": 1,
               "credit_id": "52fe46e79251416c75087667",
               "name": "Chloe Bailey",
               "profile_path": "/fTC2xhYYqmLUIyisVh1a7nNouGP.jpg",
               "id": 86800,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lena Brown",
               "gender": 1,
               "credit_id": "52fe46e79251416c7508766b",
               "name": "Mariana Tolbert",
               "profile_path": null,
               "id": 137178,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe46e79251416c7508766f",
               "name": "Rick Fox",
               "profile_path": "/7S1meb6vWJKLQPV62MGrtpaJzk5.jpg",
               "id": 119870,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Cheryl",
               "gender": 1,
               "credit_id": "52fe46e79251416c75087673",
               "name": "Sofía Vergara",
               "profile_path": "/8B2KF6BkkZZ3xswUzq4Gs9KIkWQ.jpg",
               "id": 63522,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mildred",
               "gender": 1,
               "credit_id": "52fe46e79251416c75087677",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Sarah Brown",
               "gender": 1,
               "credit_id": "52fe46e79251416c750876c3",
               "name": "Margaret Avery",
               "profile_path": "/heWNDxiHXDRg71UJgfsvpGubN1r.jpg",
               "id": 13307,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "L.B.",
               "gender": 2,
               "credit_id": "52fe46e79251416c750876c7",
               "name": "Frankie Faison",
               "profile_path": "/3717JOXK2Z8qelfyvScDGimfFBf.jpg",
               "id": 13936,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "5745802192514129a000236c",
               "name": "Shawn Shepard",
               "profile_path": "/eF3E3HAuFjpMKpjU65NjTl076Mc.jpg",
               "id": 1477823,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c7508767d",
               "name": "Reuben Cannon",
               "profile_path": null,
               "id": 62028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c75087683",
               "name": "Tyler Perry",
               "profile_path": "/fdBvkrv4lSKZ97eDLpmjlK1Tnbx.jpg",
               "id": 80602,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c75087689",
               "name": "Michael Paseornek",
               "profile_path": null,
               "id": 40513,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c7508768f",
               "name": "Aaron Zigman",
               "profile_path": "/rog2NT9wnEPHhVVRsoq51zRpAF0.jpg",
               "id": 40384,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46e79251416c75087695",
               "name": "Sandi Sissel",
               "profile_path": null,
               "id": 137179,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "52fe46e79251416c7508769b",
               "name": "Maysie Hoy",
               "profile_path": null,
               "id": 48443,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe46e79251416c750876a1",
               "name": "Kim Williams",
               "profile_path": null,
               "id": 80606,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe46e79251416c750876a7",
               "name": "Ina Mayhew",
               "profile_path": null,
               "id": 61653,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe46e79251416c750876ad",
               "name": "Judy Rhee",
               "profile_path": null,
               "id": 9547,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c750876b3",
               "name": "Lance Totten",
               "profile_path": null,
               "id": 80801,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c750876b9",
               "name": "Keith G. Lewis",
               "profile_path": null,
               "id": 31131,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c750876bf",
               "name": "Tyler Perry",
               "profile_path": "/fdBvkrv4lSKZ97eDLpmjlK1Tnbx.jpg",
               "id": 80602,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e79251416c750876cd",
               "name": "Tyler Perry",
               "profile_path": "/fdBvkrv4lSKZ97eDLpmjlK1Tnbx.jpg",
               "id": 80602,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.058157,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16710,
      "vote_count": 39,
      "budget": 0,
      "overview": "A single mother living in inner city Chicago, Brenda has been struggling for years to make ends meet and keep her three kids off the street.But when she's laid off with no warning, she starts losing hope for the first time - until a letter arrives announcing the death of a father she's never met.Desperate for any kind of help, Brenda takes her family to Georgia for the funeral. But nothing could have prepared her for the Browns, her father's fun-loving, crass Southern clan. In a small-town world full of long afternoons and country fairs, Brenda struggles to get to know the family she never knew existed...and finds a brand new romance that just might change her life.The story is adapted by Tyler Perry from his stage play \"Meet the Browns.\" Perry will portray Madea and Uncle Joe in the film.",
      "similar": [],
      "original_title": "Meet the Browns",
      "runtime": 100,
      "poster_path": "/q8dg5thzI6wIAKzVaodbyAOoZg4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/eNdCXEfW6rDxjnO3VdqIzWVuviH.png",
         "name": "Lions Gate Films",
         "id": 35,
         "origin_country": ""
      }],
      "release_date": "2008-03-21",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Check your baggage at the door.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tyler Perry"],
      "runtime": 100,
      "synopsis": "A single mother living in inner city Chicago, Brenda has been struggling for years to make ends meet and keep her three kids off the street. But when she's laid off with no warning, she starts losing hope for the first time - until a letter arrives announcing the death of a father she's never met. Desperate for any kind of help, Brenda takes her family to Georgia for the funeral. But nothing could have prepared her for the Browns, her father's fun-loving, crass Southern clan. In a small-town world full of long afternoons and country fairs, Brenda struggles to get to know the family she never knew existed...and finds a brand new romance that just might change her life. The story is adapted by Tyler Perry from his stage play \"Meet the Browns.\" Perry will portray Madea and Uncle Joe in the film.",
      "writers": ["Tyler Perry"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1047494/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNTgyMjgxMF5BMl5BanBnXkFtZTcwMjc3NzI2MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tamela J. Mann, Angela Bassett, Tyler Perry | See full cast and crew »"],
      "reviews": [
         "My theater that I work at got Meet the Browns, I have never ever seen a Tyler Perry movie, so this would be my first. But I didn't see it opening weekend and it took me a while to decide to see the movie, because of one thing, the rating on IMDb. Usually most of the ratings on the movies are pretty accurate. But when I finally decided to just go ahead and watch the movie, I have to say that I am very much disgusted with the rating here. I just don't understand why people are being so harsh with this movie, I felt like it was just a decent and uplifting film. I agree the stereotypes are bit much, but I've seen oh so much worse. Angela Bassett, who must of made a deal with the devil to look that good at 50, pulls in a great and heart felt performance as a mom who is just trying to do right by her kids despite the hard times she's facing. Brenda is a single mom in Chicago who is just struggling like crazy to take care of her three kids, trying to do the right thing, she looses her job, her electricity has been shut off, she's being judged by everyone, and the dad of her son just refuses to pay any child support what so ever. But when she finds out that her dad(who she never met) died, she and the kids go down to Georgia for the funeral, and she finds out that he gave her a house, which her family and a handsome family friend pull together to put her dreams back into place and to give her star basketball son a great future. Meet the Browns is just generally a good film, there are things that are a little off key, but it's all good. This film made me laugh, it made me cry, and it made me remember how lucky I am to have family and friends who love me and how I love them as well. The ending is just such a relief and makes you think about the good things in life that make it worth living. I would recommend Meet the Browns, it's a fun film that I'm sure will make you feel good, please ignore the harsh rating, this is a totally misjudged film. 6/10",
         "After seeing last year's excellent Daddy's Little Girls and Why Did I Get Married I thought Tyler Perry had finally come into his own as a film maker. Granted Mr. Perry doesn't have the visual flair of Spike Lee,John Singleton or the underrated Ernest Dickerson but what he does have is heart. Sadly even an A-list actress couldn't save Meet The Browns from being a trite affair that may hugely disappoint Perry's fans. For starters Mr. Perry needs to fire the editor of this film. Maysie Hoy who edited Perry's two previous films comes of as a first timer here which is ironic because she's been doing movies since 1992 and has worked with talented directors such as Robert Altman (The Player)and Theodore Witcher (Love Jones). I counted at least three scenes which didn't transition well at all and did nothing to progress the story. As for the script it seems as Perry wrote this script on a whim; and the film was just made to cash in on his success because it lacks the heart of Daddy's Little Girls and Why Did I Get Married. As for the acting Margaret Avery who was excellent in The Color Purple & the recent Welcome Home Roscoe Jenkins gives a paper thin performance as does Lamman Rucker who was excellent in Why Did I Get Married. As for Angela Bassest she's good as always and plays the mother role very well, I'm anxious to see what she bring Notorious next year. I would say two of the strongest performances in the film come from Lance Gross as Angela and much to my surprise Rick Fox as her would be suitor. The big question though is how well does David Mann's Leroy Brown translate to film ? In my opinion not as well as Madea and some of his jokes seemed forced and unneeded. As for the big screen return of Madea it's unwelcome at best and she hasn't been missed. Tyler Perry has the potential to be one of the strongest black filmmaker in Hollywood, he knows a good story, has a knack for finding talent hence Lammon Rucker and Lance Goss who will both go on to do great things. But with his latest Perry sticks to a formula that he successfully broke out with two back to back winning film released last year. Here's hoping his next film The Family That Preys gets him back on track.",
         "I was never \"big\" Tyler Perry fan, but at the same time, I've never been a \"Tyler Perry Hater\" either. I always give his films the benefit of the doubt, and I really enjoyed \"Why Did I Get Married?\" This movie though, \"Meet The Browns,\" could have been an ABC Television Network After School Special. Everything about the storyline was cliché', formulaic, and predictable. The characters were CARICATURES of real people. I laughed here and there in this movie, but overall, I was vastly disappointed in this effort. It's like Mr. Perry just \"threw this movie together\" without much thought.",
         "I was SO upset when I saw this movie because it's like Tyler took three of his plays (Meet the Browns, What's Done in the Dark, and Madea Goes to Jail) and used the SAME LINES in most cases. It's like you knew where the story was gonna go in the first 15 minutes of the film. Angela Bassett wore the same 4.5\" shoes throughout the whole movie because Rick Fox is so tall and she is only 5'4\". I thought it was a bad casting choice to cast two people with such a HUGE height difference opposite each other. I think Tyler is fresh out of creative ideas because he has used ideas from all his plays in the three movies that he has done. So, I can't see his next movie being great. I am not knocking the black cinema hustle, because I am black, but he could have done better to represent black America and made more of an effort. I will say that David Mann certainly brought on the FUNNY (as he always does in the play), but the outtakes were so much funnier than the movie to me. So, stick around after it ends.",
         "This movie does not deserve the rating it has. Any more I can't go by the ratings here on IMDb because I must have a different taste in movies than everyone else. The acting in this was a toss up. Some of the actors/actresses were , imo, not very good. Angela Basset was terrific as well as Rick Fox. The Leroy Brown character was funny at first and then he just got annoying. Same goes for Vera. The story line was very good and very touching. I'm sure there is a lot of single parents, not just mothers, out there that have felt or do feel the same as Brenda does. I don't want to go in to the movie that much because I don't want to spoil it, but Brenda is a single mother that is struggling with money and finds out that her father that she never knew had died. She takes her kids to GA for the funeral and meets family she never knew she had. In the will he leaves a house for her that needs some TLC. Since she doesn't Have the money her new Family helps restore it without her knowing. Some of the previews may be misleading. It is not completely about basketball although it has some in it. It is a very touching story and I recommend it ton anyone. But like i said. Everyone has their own opinions on movies.",
         "Tyler Perry is so talented. I was very disappointed with the casting of the movie. Frankie Faison, Margaret Avery, Jenifer Lewis and Angela Bassett are all well seasoned actors but their acting roles in this movie was that of an amateur. Their talents were not displayed at all. I was very disappointed in their lines, role, acting just everything. David and Tamela Mann were outstanding as always. They were the glue to hold the movie together. Jenifer Lewis was the worst. She did Vera no justice. The actress that played Vera in the play should have been cast for the movie. Actually all of the same actors should have been cast in the movies. I expected more from the movie.",
         "Pity my poor friend who spent all day telling me how hil-lar-ious Tyler Perry movies are, tsk-tsking all day that I had not ever seen one of his movies. Chuckling about how funny this was going to be and how i was going to run right out and rent all the others. Sadly, she spent the whole rest of the evening over coffee and cannoli reflecting on how great Tyler Perry's OTHER movies were. I forgive her - we're friends. This movie was OK - it had its funny moments and good Lord don't we ALL have those family members? I don't care if you're black, Italian, Jewish or white-bread American - we've ALL got that same cast of characters sitting around our family table. And OK, i understand that unless i saw the other movies i would not have a clue who Madea is or why she's being chased by the police. But that's OK - i can let an inside joke slide, especially considering the huge hoot and roar that accompanied her appearance. Overall, i understand that this was not Tyler Perry's finest hour. But i sense that he has a LOT to say about families, standing proud, sticking with convictions when the rest of the world says \"settle for less\" and working hard to overcome circumstances. I will go out and rent his other movies, just to get a more fair picture of this filmmaker.",
         "I am a huge fan of Tyler Perry, most of all as he is a Christian! And of course as a playwright, director and producer. If you have not seen his plays, watch them first, if you are able to attend a live performance sometime, go and do that. I think a lot of people do not realize that the plays are much different than the movies, the movies are much more toned down than the plays. Meet the Browns on stage, the play contains dope smoking references and some guns here and there, but it's all in jest. There is also beautiful gospel singing, and prayer and faith in God is the key that solves all the problems in the plays, and the mainstay. Madea is a gun wielding pot smoking tough big mama. And this movie is more like the plays than the others. Take it with a grain of salt, enjoy and watch the Brown plays first.",
         "I have seen all of Tyler Perry's movies (that I know about) and have enjoyed them all...until now. Angela Bassett was very good in her role and I enjoyed the young man who played her son, but the rest of the relatives were WAY too over the top! One of the things I like about Mr. Perry's movies is the likable, believable characters...but Leroy and Vera? COME ON! Especially painful was the speech by Leroy in the church. I laughed very little in this movie, which surprised me. I was also expecting to see more Madea (my favorite character of Mr. Perry's), not the ridiculous 15 second scene they had with her. Unfortunately, if I was asked to recommend this movie to anyone, I would have to say, see something else. Sorry Tyler! I know you're an extremely talented man, but I would give this movie a \"C\" at best.",
         "This movie should be #58 on the top 100 list! You cannot give any movie with great actresses like Jenifer Lewis and Angela Bassett a bad rating. Irma P hall once again plays the grandmother type character with all the wisdom. What was the point of putting that Latina's character in this movie. Madea has a walk on role. It would have been better if they would have gave Madea more lines in this movie. It was more than a coincidence that Rick Fox's character happened to live in Georgia and visiting Chicago. This movie does what very few movies do. It mixes comedy with serious tones. The Brown family was crazy throughout the movie. We also have a single mother trying to raise three children whose job just got terminated and lights got cut off. Then she inherits a run down house in Georgia. Then the lady's son gets shot. Then he gets well and becomes a professional basketball player. Then she ends up getting married. And they live happily ever after. The son's father who never wanted to be in his life shows up after he becomes a professional basketball player."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Tyler Perry Company, The"],
      "summaries": ["A single mom takes her family to Georgia for the funeral of her father -- a man she never met. There, her clan is introduced to the crass, fun-loving Brown family."],
      "budget": 0
   },
   "movielensId": 70661,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-03-21",
      "dvdReleaseDate": "2008-07-01",
      "directors": ["Tyler Perry"],
      "runtime": 100,
      "movieId": 70661,
      "title": "Meet the Browns",
      "mpaa": "PG-13",
      "actors": [
         "Tyler Perry",
         "David Mann",
         "Tamela Mann",
         "Angela Bassett",
         "Lance Gross",
         "Chloe Bailey",
         "Mariana Tolbert",
         "Rick Fox",
         "Sofía Vergara",
         "Irma P. Hall",
         "Margaret Avery",
         "Frankie Faison",
         "Shawn Shepard"
      ],
      "imdbMovieId": "1047494",
      "originalTitle": "Meet the Browns",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["wuBrjKKWkEM"],
      "plotSummary": "A single mother living in inner city Chicago, Brenda has been struggling for years to make ends meet and keep her three kids off the street.But when she's laid off with no warning, she starts losing hope for the first time - until a letter arrives announcing the death of a father she's never met.Desperate for any kind of help, Brenda takes her family to Georgia for the funeral. But nothing could have prepared her for the Browns, her father's fun-loving, crass Southern clan. In a small-town world full of long afternoons and country fairs, Brenda struggles to get to know the family she never knew existed...and finds a brand new romance that just might change her life.The story is adapted by Tyler Perry from his stage play \"Meet the Browns.\" Perry will portray Madea and Uncle Joe in the film.",
      "tmdbMovieId": 16710,
      "avgRating": 3.26923,
      "releaseYear": "2008",
      "numRatings": 26,
      "posterPath": "/q8dg5thzI6wIAKzVaodbyAOoZg4.jpg"
   }
}