{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "multiculturalism",
            "id": 5976
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "senegalese",
            "id": 181316
         },
         {
            "name": "multilingual",
            "id": 181317
         }
      ],
      "imdb_id": "tt1095442",
      "video": false,
      "title": "Goodbye Solo",
      "recommendations": [
         159414,
         217411,
         141906,
         5717,
         15555,
         85692,
         85410,
         25656,
         229173,
         57969,
         44305,
         64209,
         116303,
         82624,
         116351,
         124315,
         26518,
         27658,
         259231,
         25465
      ],
      "backdrop_path": "/lCCt5lMiwMrIKT4t2x5TOXvaTBV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Solo",
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ebeb",
               "name": "Souleymane Sy Savane",
               "profile_path": "/qXY5v1UM2i9ChvvfuVTBkTyuUQT.jpg",
               "id": 87466,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe4416c3a368484e00ebef",
               "name": "Red West",
               "profile_path": "/acW4XSH8M1CYgfoJLpceOX9XOBe.jpg",
               "id": 60508,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec41",
               "name": "Diana Franco Galindo",
               "profile_path": null,
               "id": 1102574,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Roc",
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec45",
               "name": "Lane 'Roc' Williams",
               "profile_path": null,
               "id": 1102575,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Mamadou",
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec49",
               "name": "Mamadou Lam",
               "profile_path": null,
               "id": 1102576,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Quiera",
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec4d",
               "name": "Carmen Leyva",
               "profile_path": null,
               "id": 1102577,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ebf5",
               "name": "Ramin Bahrani",
               "profile_path": "/hTDE6FV4El2Se4fazSLWzdvBz8c.jpg",
               "id": 45730,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ebfb",
               "name": "Ramin Bahrani",
               "profile_path": "/hTDE6FV4El2Se4fazSLWzdvBz8c.jpg",
               "id": 45730,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec01",
               "name": "Bahareh Azimi",
               "profile_path": null,
               "id": 78383,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec07",
               "name": "Ramin Bahrani",
               "profile_path": "/hTDE6FV4El2Se4fazSLWzdvBz8c.jpg",
               "id": 45730,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4416c3a368484e00ec0d",
               "name": "Kathryn Dean",
               "profile_path": null,
               "id": 928603,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec13",
               "name": "Jason Orans",
               "profile_path": null,
               "id": 1102569,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4416c3a368484e00ec19",
               "name": "Summer Shelton",
               "profile_path": "/5OyqJcjT3M0ZoW9rGLLYboVASU5.jpg",
               "id": 1102570,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec1f",
               "name": "Brian Devine",
               "profile_path": null,
               "id": 1102571,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec25",
               "name": "Brooke Devine",
               "profile_path": null,
               "id": 1102572,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec2b",
               "name": "Steve Bannatyne",
               "profile_path": null,
               "id": 12590,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec31",
               "name": "M. Lo",
               "profile_path": null,
               "id": 1102573,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4416c3a368484e00ec3d",
               "name": "Ramin Bahrani",
               "profile_path": "/hTDE6FV4El2Se4fazSLWzdvBz8c.jpg",
               "id": 45730,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5476fce892514104d8001876",
               "name": "Michael Simmonds",
               "profile_path": null,
               "id": 45738,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.517728,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21371,
      "vote_count": 29,
      "budget": 0,
      "overview": "A man planning to commit suicide hires a taxi driver to take him to his jumping-off point.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         339692,
         281957,
         241
      ],
      "original_title": "Goodbye Solo",
      "runtime": 91,
      "poster_path": "/6taW4hf8CmLu1Pjy0UVw52zq5Bq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "Wolof",
            "iso_639_1": "wo"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gigantic Pictures",
            "id": 3788,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ITVS",
            "id": 10943,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lucky Hat Entertainment",
            "id": 8510,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Noruz Films (I)",
            "id": 10944,
            "origin_country": ""
         }
      ],
      "release_date": "2008-08-09",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.goodbyesolomovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ramin Bahrani"],
      "runtime": 91,
      "synopsis": "The film begins in Winston-Salem, North Carolina, with Solo (Souléymane Sy Savané), a Senegalese cab driver, who is working to provide a better life for his young family. William (Red West), an old man with a lifetime of regrets, hires Solo to take him to Blowing Rock, a peak in which updrafts cause objects that are dropped from it to fly upwards. William does not ask for a ride back from the rock and is obviously depressed, so Solo assumes that the old man intends to commit suicide there. Solo befriends William, in hopes of talking him out of ending his life. He introduces William to his girlfriend and her daughter, hoping to inspire the old man with the joys of life. It is not revealed whether William commits suicide or not. [D-Man2010]",
      "writers": [
         "Bahareh Azimi",
         "Ramin Bahrani"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1095442/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3MDQyODE4MTJeQTJeQWpwZ15BbWU3MDcxNjM1MjI@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Souleymane Sy Savane, Red West, Diana Franco Galindo | See full cast and crew »"],
      "reviews": [
         "This third feature from Iranian-descent North Carolinian Bahrani takes a theme from Abbas Kiarostami's 'The Taste of Cherries,' of a man seeking a driver to help him commit suicide, and makes it as American and Edward Hopper as night movie ticket windows, sleazy motel rooms, road houses, cabs on call, and fractured families. Bahrani's surefooted story blends elements of Kafkaesque nightmare and shaggy dog story and, though well grounded in realistic, no-nonsense images and everyday settings, is also surrounded in mystery. What's behind this plan of William (Red West) to be driven from Winston-Salem to the windy heights of Blowing Rock? We only know that he has some sketchy relationship to a boy selling tickets at a movie theater, has sold his house, and then, helped by the cab driver, grimly moves into a cheap motel room with a few belongings. For a driver, William has somehow gotten saddled with Solo (Souleymane Sy Savane), a friendly and garrulous Senegalese with a Mexican wife, Quiera (Carmen Leyva), and a clever little stepdaughter, Alex (Diana Franco Galindo. Quiera is pregnant with Solo's child, but they are at odds over his plan to become a flight attendant, and Solo seems half in and half out of the house. From the evening when William gives him a hundred dollars as advance on a $1,000 payment to take him to Blowing Rock on a set day, which he strongly suspects is to do away with himself, Solo refuses to let the gruff old man alone. He takes William out to play pool and drink and then sleep it off at his house. When his wife objects he moves into William's motel room for a while. He makes sure no other drivers from the W.C.C. cab company pick up William. William is trying to shut down, but Solo won't let him. After a while you realize the focus is not so much on what will happen to William as what will happen to Solo, that Solo's own situation is shaky, mysterious, and perhaps desperate, and that you're not going to find any ultimate answers about either of the two men who are now so oddly conjoined. The key to the story is the story, and Bahrani makes excellent use of the inner and outer nature of his two principals and their checkered careers. Red West was a Marine, stuntman, and boxer, and later a bodyguard for Elvis Presley, and his face has a John Ford cowboy hero's weathered graininess. When he lights a cig and stares into space it's no act. Sy Savane is a one-time fashion model and African TV star and a Winston-Salem cab driver who was a flight attendant for an African airline. He knows the answers to the flight attendant exam Solo's studying for, except that Solo fails the interview. He is athletic and handsome and the radiance of his smile suffuses his whole face. But for all his confidence there's a sense that Solo's dodging about the edges of Winston-Salem because he has friends on the dark side, but he's still an outsider. Bahrani's previous 'Chop Shop' focused on Latino kids eeking out a living amid the competing de facto car parts dealers in the Iron Triangle of Willets Point, Queens. Here he takes it all back home, because North Carolina is where he grew up, even if he felt like an outsider. 'Goodbye, Solo' feels more securely grounded but also more open--an impression visually underlined when Solo drives Alex and William out into the softly multicolored mountainsides around Blowing Rock. The virtue of the film is that it focuses so simply and wholeheartedly on its actors and their characters. There is no quirky Jim Jarmusch wit in the taxicab scenes, never any loss of focus on the confused urgency of Solo's and William's divergent quests. The conclusion may leave you feeling lost in uncertainty amid the fog and whirling winds of Blowing Rock. There's nothing particularly neat or tidy about this ending. But the whole movie is worth the long look William and Solo give each other before they part for the last time. This moment more than the rest of the movie conveys a sense of Bahrani's attention and curiosity--which come with a healthy awareness that he hasn't got the answers, but he has got a grip on some of the big questions by now. Though he gives us only a piece of the puzzle, his interest in new immigrants is admirably free of indie cuteness or dramatic flourishes, and the whole movie is edited with a sure and classic touch that makes this feel like the second great American movie of the year about real people, after James Gray's 'Two Lovers.'",
         "I was trying all week to get these tickets for GOODBYE SOLO at the London Film Fest because I've seen both the directors previous works which had also played there- Man Push Cart and Chop Shop. As soon as the film began i became mesmerized by the seamless blend of the story and photography. Solo is a good natured cabbie from senegal, trying to balance happiness for himself as well as the responsibilities he has for his wife and daughter alex. As Solo develops a relationship with an old man, William - it hits him, he realizes this old man is going to jump off a mountain and he must save him- and his day to day responsibilities shift dramatically, creating a new world for Solo. He even brings in Alex to help him- the three make a new, simply warm friendship. I really felt for Solo and his desire to save the old man who wouldn't bend from his own path. the evolution of their relationship to the very end- made this a truly captivating and real experience you just don't get from the theaters nowadays. not only i really wanted to know what would happen next, but the first half was really funny. i mean, people were laughing out loud, which is different from ramin bahrani's other films. i absolutely recommend this film because it digs deep into you and doesn't let go for days after. I was also lucky enough that the director and the actor (whose name is also Solo) were there and i was able to personally congratulate them on their creation. that guy solo is really good. everyone was commenting on him. check this out if you get a chance.",
         "Without a doubt this was the best film I saw at the Toronto Film Festival. My girlfriend and I decided to make a trip up there for a few days to see some films, enjoy the city and catch Niagara Falls. We saw some good films, and some not-so-good films, but most of them were good... but none of them captivated us like Goodbye Solo. It was on our short list because we had seen and really liked Chop Shop-- by the same director. This one is even better. The lead actor is just amazing!! This guy is going to win some awards. He is so charming that you can't help but want to watch everything he does. The whole audience was laughing for like the first half of the film because him and the old man - the big dawg! - are just so funny together and the things they say and do together are just great... but it was the ending that really got us. My girlfriend was crying. So were a lot of people around us... And the last shots are really beautiful. I don't know where they filmed it, but the location was amazing. The mountain and the trees and fog... it was just amazing how the filmed those colors and fog, like it wasn't real or something. The film really, really moved us and stayed with us for the rest of our trip and we talked about it a lot on our drive home. Solo changed so much in the film... that guy is a great actor. We will see it again when it comes out for sure.",
         "Some people are so attached to their story that they manage to continually sabotage their aliveness and their capacity for love. Even when someone reaches out to them and challenges the skewed way in which they have constructed their world, they effectively shut them out. Ramin Bahrani's third feature, Goodbye Solo, is about William, a man clinging to his victimization act so tightly that he turns away from the only person who cares, a high-energy cab driver from Senegal who is willing to go the extra mile to tear down the wall that separates William from his fellow human beings. Similar in narrative to Abbas Kiarostami's masterpiece A Taste of Cherry, Solo (Souléymane Sy Savané) a Senegalese immigrant living in Winston Salem, North Carolina (where the director grew up) picks up a 72-year-old Caucasian passenger named William, played by Red West, a former Marine, stuntman, boxer, and bodyguard for Elvis Presley, who Solo refers to as \"Big Dog\". We learn next to nothing about the cantankerous old man. He refuses to engage the gregarious Solo in conversation except to offer him $1000 to drive him to Blowing Rock, a windy mountainous area, in two weeks with the depressing implication that it will be the end of the road for him, both literally and figuratively. Similar in theme to Mike Leigh's Poppy in Happy-Go-Lucky, Solo does not back off from his selfless display of good humor even when confronted by William's cold rejection. He maintains his optimism when studying for an exam to become a flight attendant. Solo knows where to find drugs or a sexual partner but there is no hint that he ever partakes. Eventually some of his positive attitude begins to break down barriers. William helps Solo in his studying, and allows him to move into his motel room when he runs into marital difficulties with his pregnant Mexican wife (Carmen Leyva). They go out drinking together, Solo introduces him to his stepdaughter Alex (Diana Franco Galindo), does his laundry for him, checks his medicine stash to see if he has some hidden terminal illness, and even searches the motel room to try and find a picture of a relative he could contact. Gradually the two men appear to draw closer, at times showing moments of connection, and then falling back into uncertainty and rejection. Solo still searches for the clue that can prevent the inevitable, even going so far as to find out why William continually attends a local movie theater and engages in conversation with the young cashier at the box office. Bahrani's Solo is not a stereotype of the cool hip black man out to rescue the forlorn white man from himself. Solo is a multi-faceted human being with his own set of problems who is always depicted with respect. The finale, shot in the beautiful North Carolina Mountains in October, captures the stirring symphony of autumn color, and the long look that William and Solo give each other before they part is the essence of compassion, given freely with an open heart - even to the point when no payback is achieved or expected.",
         "\"The basis of optimism is sheer terror.\" Oscar Wilde The two improbable \"travelers\" in Patrice Leconte's Man on the Train seem like old men at a nursing home compared to the dynamic layers of regret and hope between Senegalese cab driver Solo (Souleymane Sy Savane) and grizzled old man William (Red West)in Goodbye Solo. Solo takes him on several rides in Winston-Salem, North Carolina, culminating in a life-changing one in the Smokey Mountains. This tense little drama of ordinary people has a distant relationship to Beckett and Pinter, whose dramas introduce unknown forces and people who change things, even if those elements don't appear. Iranian director/writer Ramin Bahrani, along with co-writer Bahareh Azimi, has neatly shown the quotidian events of Solo's life, from the joys of a loving step-daughter and new son to strain of trying to become a flight attendant. Upon the entrance of the troubled William into his life, Solo deals with his urge to help William overcome depression and disappointment and Solo's own existential uncertainties. Goodbye SOlo has large ambitions about showing the need to understand the end of life for the desperately disappointed and the beginning of a happy life for the positive, optimistic newcomers in the great melting pot. Solo remains hopeful in both arenas despite the forces allied against him, finding strength in his alliance with William just as characters in Beckett and Pinter find theirs. The coda is as impressive as any other this year: the top of one of the North Carolina hills is circumscribed by an eccentric wind that seems to blow up and back at the same time, figuratively signaling the end and beginning. Solo and step-daughter Alex take comfort in the danger of the wind and precipice adjoining the safety of each other. The message is clear�life goes on, sometimes dangerously, sometimes beautifully.",
         "Souleyman Savane is a natural. His taxi driver character is the focus of the film and in spite of Savane's complete lack of acting experience he carries the movie with his beautiful, expressive face and the warmth, goodness and simple joie de vivre of his character's nature and, one suspects, Mr. Savane's. The scenes of unexceptional small city life match up right for this story and the scenes toward the end in the Great Smokies are almost as transcendent as they are in person. At 90 minutes it is the perfect length for a movie whose central predicament is made plain from the start and it's resolution never really in doubt. An understandable determination to die by one man inspires renewal in another.",
         "I saw CHOP SHOP at the film forum and loved it, so when a friend told me to go see GOODBYE SOLO, I took the recommendation. SOLO was different from what I expected. It was a lot funnier than CHOP SHOP. I laughed so hard, especially in the beginning. Toward the end, things start to get a lot more emotional. It's a life-affirming film with such a subtly of power that it's haunting. Once the film was over and everything sunk in, it stayed with me, even after leaving the theater and into the night. This is proof enough that Ramin Bahrani has made something original and vital. Like in CHOP SHOP, you can feel the soul of these characters. I can't wait to see what he will be working on next. I hope these actors go up for huge awards or make great careers for themselves, and I hope that Bahrani keeps making movies as good and as sublime as this one.",
         "I admit, I was very worried when I saw the trailer for this film that Bahrani had sold out or made his first bad film. I was worried this was going to be something awful like The Legend of Bagger Vance or The Bucket List. Something cheesy, sentimental, or with an angel black man who saves a white man. Thank God none of that was true! The film is sooooooo GOOD! I loved Bahrani's first two films and wish more people had seen them. But this is his best film yet and I am glad it has a wider release! The characters are real, honest, sincere and once again Bahrani manages to avoid all the normal plot devices that ruin films. Compared to Man Push Cart and Chop Shop, Goodbye Solo has a much stronger story-line and is really tense. You always want to know what happens next, but especially the last 30minutes the audience I saw it here at SXSW were rivited. AND-- it is funny! The first half of the film is really funny and I didn't expect that at all! A lot of that is the writing and directing, but a lot is the acting. That guy playing Solo is so charming he has star written all over him. His warmth and personality make the film something really special, especially next to the old man playing William. He is just perfect in the role, as if it was written for him. The movie left me feeling a little sad, but also really strong and hopeful, which sounds weird, but it's true. Its been days since I saw the film, and I saw many others at the festival, some good ones too, but this is the one that stayed with me. It is the best film I have seen all year and I will see it again when it opens in Austin.",
         "Solo was a relentlessly optimistic character, regardless of the setback, he rebounded immediately. Or, he brought himself back to a sunny state by a deep and touching effort that was illuminated with care and beauty. The older man, William, on the otherhand, worked hard to maintain his life-has-beaten-me-down disposition. So when a happy/touching moment overtakes him, the director shares the ray of hope, the precious glimmer of being touched despite himself. So the film is filled with these gems welling from opposite natures pushing against each other. The buds of nature push forth despite the obstacles. Solo was the everchanging sunshine in this film. The pacing was not rushed and only 1 or 2x did I find myself saying \"I got it, move on\". The acting was genuine and I was amazed how everday, duldrum existence was portrayed with compassion among people who have little possessions, yet no glories imposed, no moments of drama asking for viewer's awe (i.e. Streepless). The cinematography was expertly crafted: people were positioned that complimented and complemented the background scene. The bleakness of the tobacco-industry sooted parts of town was not beautified, rather its interest captivated me in showing its richness in layers of aging infrastructure moaning as a tired, old beast. Again, I was consistently sated when I looked at the mis-en-scene. This film is a big reward for seeking out independent, small-budget films---something I seldom have with any film.",
         "I watched this film at the London Film Festival, where the filmmaker has become a regular feature in recent years with his first two films 'Man Push Cart' and 'Chop Shop'. His third outing is his strongest work yet. The film communicates profound feelings and ideas through achingly powerful characterisation, finely nuanced storytelling and poetic visuals. I don't know how Bahrani achieved such brilliant performances from the cast, but Souleyman Sy Savane, Red West and Diana Franco Galindo all did something really special in this film. I will carefully touch upon the matter of the end of the film (avoiding spoilers). Bahrani has eschewed the manipulative beast that is 'the resolution' in his past films, in the name of truthfulness and integrity. As inspired as I have been by such choices, I said to myself two thirds into 'Goodbye Solo', \"this time, there has to be a resolution, right?\" But what the filmmaker has done with the last ten minutes or so of the film is what I could only describe to my wife in the screening as discovering 'Cinema Gold'. The film navigates those of us who are willing to engage with the characters to a spiritual final stretch, where the viewer is no longer a passive participant, but thinking and feeling for the characters and about our own lives and those we love dearly. I could hardly breathe over the stirring guitar score over the end credits. I honestly can't remember when that last happened. Maybe it was 'Magnolia' or '21 Grams'. It's a perfect ending to a really powerful, moving piece of cinema - that must be seen again and again. 'Goodbye Solo' is a truly engaging and emotional experience. The film furthers the great tradition of humanist cinema that masters such as Satyajit Ray, Ken Loach and Abbas Kiarostami have become legends pioneering. It is so hopeful that cinema-lovers of my generation can begin to look at Ramin Bahrani as a filmmaker with a talent and depth that exudes respect for the medium and towards those who love it. Find out where this film is showing and go and watch it, regardless of the 'kind of film' you think you like to see. From the first scene, you will feel welcomed, engaged, amused, challenged and moved. You will leave the screening when it's finished, but the film might not leave you for a long time."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Gigantic Pictures",
         "ITVS",
         "Lucky Hat Entertainment"
      ],
      "summaries": [
         "On the lonely roads of Winston-Salem, North Carolina, two men forge an improbable friendship that will change both of their lives forever. Solo is a Senegalese cab driver working to provide a better life for his young family. William is a tough Southern good ol' boy with a lifetime of regrets. One man's American dream is just beginning, while the other's is quickly winding down. But despite their differences, both men soon realize they need each other more than either is willing to admit. Through this unlikely but unforgettable friendship, GOODBYE SOLO deftly explores the passing of a generation as well as the rapidly changing face of America.",
         "Two men form an unlikely friendship that will change both of their lives forever."
      ],
      "budget": 0
   },
   "movielensId": 70912,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Español",
         "Wolof"
      ],
      "releaseDate": "2008-08-09",
      "dvdReleaseDate": "2009-08-25",
      "directors": ["Ramin Bahrani"],
      "runtime": 91,
      "movieId": 70912,
      "title": "Goodbye Solo",
      "mpaa": "",
      "actors": [
         "Souleymane Sy Savane",
         "Red West",
         "Diana Franco Galindo",
         "Lane 'Roc' Williams",
         "Mamadou Lam",
         "Carmen Leyva"
      ],
      "imdbMovieId": "1095442",
      "originalTitle": "Goodbye Solo",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A man planning to commit suicide hires a taxi driver to take him to his jumping-off point.",
      "tmdbMovieId": 21371,
      "avgRating": 3.52577,
      "releaseYear": "2008",
      "numRatings": 97,
      "posterPath": "/6taW4hf8CmLu1Pjy0UVw52zq5Bq.jpg"
   }
}