{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "molotow cocktail",
            "id": 5343
         },
         {
            "name": "health food",
            "id": 172496
         },
         {
            "name": "speech impediment",
            "id": 172497
         },
         {
            "name": "reverend",
            "id": 172504
         },
         {
            "name": "ice sculpture",
            "id": 172505
         },
         {
            "name": "miranda warning",
            "id": 172507
         },
         {
            "name": "orange county california",
            "id": 172509
         },
         {
            "name": "female police commissioner",
            "id": 172512
         },
         {
            "name": "homage",
            "id": 172514
         },
         {
            "name": "yugo",
            "id": 172517
         }
      ],
      "imdb_id": "tt0092925",
      "video": false,
      "title": "Dragnet",
      "recommendations": [
         9080,
         9749,
         10859,
         12309,
         10905,
         10466,
         11584,
         2565,
         14628,
         10890,
         6951,
         11566,
         2107,
         11418,
         11718,
         9409,
         9941,
         11974,
         2617,
         1406
      ],
      "backdrop_path": "/wtC1KX6ZmmYrZZEE5WAgFxmoS0L.jpg",
      "revenue": 66673516,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sgt. Joe Friday",
               "gender": 2,
               "credit_id": "52fe430a9251416c7500115f",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pep Streebeck",
               "gender": 2,
               "credit_id": "52fe430a9251416c75001163",
               "name": "Tom Hanks",
               "profile_path": "/pQFoyx7rp09CJTAb932F2g8Nlho.jpg",
               "id": 31,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Reverend Jonathan Whirley",
               "gender": 2,
               "credit_id": "52fe430a9251416c75001167",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Captain Gannon",
               "gender": 2,
               "credit_id": "52fe430a9251416c7500116b",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Connie Swail",
               "gender": 1,
               "credit_id": "52fe430a9251416c7500116f",
               "name": "Alexandra Paul",
               "profile_path": "/bTE5wVsPxRB5ZWPn8bSo5fE9hGR.jpg",
               "id": 55567,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Emil Muzz",
               "gender": 2,
               "credit_id": "55a67df1c3a36845a9000080",
               "name": "Jack O'Halloran",
               "profile_path": "/4SOjjPdLLFimJXixndFSANZOR9z.jpg",
               "id": 41224,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Jane Kirkpatrick",
               "gender": 1,
               "credit_id": "55a67e3692514142c600006e",
               "name": "Elizabeth Ashley",
               "profile_path": "/zN6fHWl2NHiMHY741YIxbtRRFoj.jpg",
               "id": 44845,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Jerry Caesar",
               "gender": 2,
               "credit_id": "55a67e4c92514142d1000070",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Enid Borden",
               "gender": 1,
               "credit_id": "55a67e5e92514142db00007a",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Baitmate",
               "gender": 1,
               "credit_id": "55a67e8dc3a3684584000083",
               "name": "Shannon Tweed",
               "profile_path": "/cfHhjZIPqXXOZ9rsQguofYrTQL9.jpg",
               "id": 45379,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "1982 Redhead",
               "gender": 1,
               "credit_id": "56e76d969251410917000b7f",
               "name": "Lisa London",
               "profile_path": "/1ni5vic163eJQeLM7wZgzfe8VUK.jpg",
               "id": 60152,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Betsy Blees",
               "gender": 1,
               "credit_id": "5a13e6c5c3a3684ef0003388",
               "name": "Kimberly Foster",
               "profile_path": null,
               "id": 1006838,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c75001175",
               "name": "Tom Mankiewicz",
               "profile_path": "/ldYH2f8UPevGExyCzwN7Mn3ZPjZ.jpg",
               "id": 7190,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c7500117b",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c75001181",
               "name": "Alan Zweibel",
               "profile_path": "/jql7ycDalpFOh8xn7Tf1NXfwLkX.jpg",
               "id": 62055,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c75001187",
               "name": "Tom Mankiewicz",
               "profile_path": "/ldYH2f8UPevGExyCzwN7Mn3ZPjZ.jpg",
               "id": 7190,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c7500118d",
               "name": "David Permut",
               "profile_path": "/7pAjvPIcB8a6aGefNJqMMvqKOKU.jpg",
               "id": 11405,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c75001193",
               "name": "Robert K. Weiss",
               "profile_path": null,
               "id": 7181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c75001199",
               "name": "Bernie Brillstein",
               "profile_path": "/mLFQdesNwMtvo3E64U2LnV8s4tG.jpg",
               "id": 8859,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c7500119f",
               "name": "Ira Newborn",
               "profile_path": null,
               "id": 12939,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c750011a5",
               "name": "Matthew F. Leonetti",
               "profile_path": null,
               "id": 2507,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c750011ab",
               "name": "William D. Gordean",
               "profile_path": null,
               "id": 30918,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe430a9251416c750011b1",
               "name": "Richard Halsey",
               "profile_path": null,
               "id": 1918,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 8.234559,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10023,
      "vote_count": 168,
      "budget": 20000000,
      "overview": "LAPD Sgt. Joe Friday -- the equally straight-laced nephew of the famous police sergeant of the same name -- is paired up with a young, freewheeling detective named Pep Streebek. After investigating some strange robberies at the local zoo and the theft of a stockpile of pornographic magazines, they uncover cult activity in the heart of the city and are hot on the case to figure out who's behind it all.",
      "similar": [],
      "original_title": "Dragnet",
      "runtime": 106,
      "poster_path": "/vaFsRAleYZ6tIPxrDP2iwUpO3kU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1987-06-25",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "\"Just The Facts.\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom Mankiewicz"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Dan Aykroyd",
         "Alan Zweibel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092925/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyOTMzNjk0M15BMl5BanBnXkFtZTcwNzc5MjUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan Aykroyd, Tom Hanks, Christopher Plummer | See full cast and crew »"],
      "reviews": [
         "I noticed that many of the comments on this film were negative. Those people need to loosen up and get \"just the facts.\" Maybe I see more of the humor because I am a law enforcement officer, but this film is a scream. It takes everything that the original series did, and does it with tongue firmly planted in cheek. Dan Ackroyd's deadpan Jack Webb impersonation is a riot, as are the remarks he makes to Hanks' Pep Streebeck. A typical example would be after Joe ignores Sylvia Wiss' advances, and Pep calls him on it. Joe looks him dead in the eye and says, \"Streebeck, there are two things that separate us from the animals. One, we use cutlery. Two, we can control our sexual urges. I don't know about you, but don't drag ME into your private HELL!\" That line is so Jack Webb-DRAGNET that I'm surprised it never showed up in the 1960's version. Like the Austin Powers films, DRAGNET spoofs a cultural icon in such a way as to evoke the original. Ignore the silly plot, and just enjoy the ride.**PS**I have actually used the line I quoted above in the line of duty!",
         "Tom Hanks reminds us of just how good a comic actor he is, and Dan Ackroyd just \"becomes\" his character! I found the movie to be part dead-on parody, part slapstick, part cop movie (with a twist). Christopher Plummer and Dabney Coleman have a ball with their supporting roles, and Alexandra Paul adds just a dash of sex appeal. I was smiling from start to finish, and could watch it over and over.",
         "Although Tom Hanks and Christopher Plummer and Dan Ackroyd have certainly done better work than Dragnet, I can't think of a movie where any of them would have had better fun making it. Dragnet is one of the guilty pleasures I have, a film that will never be rated as one of the greatest of all time, but a film that I split a gut laughing at even though I know all the jokes coming. Dragnet is a satirical version of the famous documentary style police show from the Fifties and the later color version from the sixties. Dan Ackroyd's dead-on impersonation of the no-nonsense monotone Jack Webb that a generation of Americans grew up remembering is excellent. Like Webb he plays it completely straight or maybe I should say straight man. Because he's got a new partner fresh from undercover narcotics in Tom Hanks. Ackroyd's not quite used to the girl chasing, motorcycle loving partner that he's been assigned to. He's been brought up in the strict traditions of his Uncle Joe and he has a photograph of Jack Webb on his desk. He's even got Harry Morgan as his captain and we well remember that Harry Morgan was Jack Webb's partner in the sixties version of Dragnet. Anyway the two of them are assigned to investigate an assortment of crimes that a motorcycle gang called the PAGANS are responsible for. I can't explain any more because the plot gets positively surreal from here. All I can say is the laughs never stop. Look for some good supporting performances in addition to those mentioned from Elizabeth Ashley as the new police commissioner, Alexandra Paul as 'the virgin Connie Swale', Jack O'Halloran as a Pagan member, Kathleen Freeman as a foulmouthed landlady, and Dabney Coleman as a Hugh Hefner type publisher. But most of all this film belongs to Christopher Plummer in every scene he's in. He plays the whole thing with a twinkle in his eye when he's being the most sanctimonious as the Reverend Jonathan Whirley. I can't think of a film where Plummer is funnier in or one where it looks like he's having such a good time. The good time is positively infectious. The most hidebound stuffed shirt will love this film as I did.",
         "I'm a big fan of the TV series, both the '50's and '60's versions, but I couldn't help watching this one on TNT. The impersonation of Joe Friday is so hilarious it hurts, and his Partner Pep Streebeck was excellent. Harry Morgan from the '60's version was in this, promoted to captain. Next time the film came on, I taped it, and laughed again. Even though it's making fun of the old series, it's fun to watch, and the acting is great. Top-notch comedy.",
         "It's Saturday, November 6. 9:21 a.m. I've just watched \"Dragnet.\" A lot of old television shows have been made into movies. Most of them, frankly, have been disappointments. I have to say that the movie version of \"Dragnet\" is one of the better ones. Based on the cast, it should be. I'm not sure you could do any better than casting Dan Aykroyd and Tom Hanks in the lead roles, respectively, of Sgt. Joe Friday (supposedly the great-nephew of the Joe Friday from the series) and Tom Hanks as his new partner Pep Streebek. Both played their roles perfectly. Aykroyd was a great satirical take on Jack Webb's character, and Hanks was the perfect balance. The supporting cast - with names like Christopher Plummer and Dabney Coleman and Harry Morgan (reprising his character of Gannon from a 1969 \"Dragnet\" movie, who's now the police captain) - also made this worth watching. The story has Friday and Streebek investigating some type of pagan cult that's been causing havoc on the streets of the city. Their undercover encounter with the cult at one of its gatherings was hilarious. Overall, mind you, this isn't an outrageously funny movie. It's more humorous than anything, with appeal mostly to those who've seen the original series. If you've never seen the original series a lot of the subtle humour (which revolves around Aykroyd's parody of Webb's character) will be lost. However, for those who do know the original series, it's a fun nostalgia trip with a good cast.",
         "Most people remember Dragnet with Jack Webb as the buttoned-up police sergeant Joe Friday. Dan Akyroyd plays the nephew of that character here. He is so much like Webb that he even appears to be channeling him spiritually. Tom Hanks has a great time with the new character of Pep Streebeck, the antithesis of Friday. The rest of the cast is fun, never quite taking the whole business seriously. Dabney Coleman, Christopher Plummer and even Harry Morgan reprising his Bill Gannon role (now the captain of detectives). The marginally fleshed out plot involves P.A.G.A.N.s attacking Coleman's smut magazines and advocating for \"good sex and bad drugs\" as the key to a great society. The jokes in this movie fly fast and furious and are aimed at all kinds, not just the lowest common denominator. Lots of fun, randomness abounds. The best way to enjoy this movie is to relax and not take it too seriously, because it is half spoof-half cop action comedy. This is a fun ride. 9/10",
         "dragnet is by no means a great film. but it is a funny, goofy light hearted film that both actors play well. i thought it was unusual to see christopher plummer in such a movie but he was good as the founder of \"mama\". this wont go down as the best film of either tom hanks or dan akroyd.dan has the jack webb impersonation down well though. it still is entertaining and if you want a decent laugh it's worth renting.",
         "\"Oh, thank God, vibrator repair!\" This is the story of a cop who investigates a series of goofy crimes in the city of Los Angeles. The comedy is awkward, the script is full of flat jokes, but at least the supporting cast is great. Dan Aykroyd tries his hand at writing comedy, spoofing the old TV series with the same title. His character is a stiff cop, with a unique take on life and an exaggerated care for taxpayer's money and procedure. His jokes are delivered in a matter of fact manner, as if he is saying: \"Here you are, Sir, here are your jokes.\" Which would be fine, if they were funny. But as it was, I didn't quite know what to do with them. Raise them until they grew a funny bone? Send them to comedy school? Put them it in a pie and throw them in somebody's face? Not sure. I don't know if intentionally or not, but just about everybody else in this movie is funnier than Mr. Aykroyd. Tom Hanks is in this movie, just one year before his big break with \"Big\". Harry Morgan of \"M.A.S.H.\", Jack O'Halloran of \"Superman II\", Alexandra Paul of \"Babewatch\", all have great little roles in this movie. Dabney Coleman is particularly hilarious with his whistling. Dragnet. If your taste is cop comedy, there are much better offerings out there (Naked Gun, Beverly Hills Cop, Police Academy, to name just a few). 5/10.",
         "this is without a doubt one of the funniest films of the 80's, which i feel is quite an easy pair of shoes to fill seeing as though the 80's wasn't all that funny. Dan aykroyd which by the way isn't a very good actor in my eyes plays a stuffy, keep to the rules cop brilliantly and tom hanks plays a laid back and some what streetwise cop. the two get paired up and there's the comedy right there. they play of each other brilliantly, there's no other actors who could of pulled this of like tom and Dan. all round this is a very good movie, no award winner though mind you but if your up for some fast paced comedy then this is the one to watch 8/10 j.d seaton",
         "I managed to catch Dragnet on one boring late night on HBO and how glad I am to have done that! Without going into the small details, this is a must see. The chemistry between Dan Aykroyd and Tom Hanks is just awesome. Both Dan and Tom manages to play their respective characters with sheer conviction. The plot is simple and the dialog hilarious: just the sort you need for straight unadulterated fun. Best of all, the move has some of the most brilliant comic moments from 1980's. I'm not giving anything away, you'll need to watch to find out ;-)"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Applied Action",
         "Permut Presentations",
         "Universal Pictures"
      ],
      "summaries": [
         "Friday and Streebek are assigned to some very strange robberies, like i.e. the stealing of one bat, a 30 feet long snake and the mane of a lion from a zoo. All the latest BAIT magazines were also recently stolen, and some chemichals that when are mixed correctly develops a very deadly gas. All these thefts have one thing in common; visit cards with the word \"PAGAN\" left at the crime scenes. Solving these crimes, including why plenty of police vehicles have been stolen lately, involves the usual; to drink coffee at strip tease bars, rescue kidnapped virgins from drowning and lose the job.",
         "The equally-straight-laced and \"by the book\" nephew of Joe Friday must work with his more laid-back partner to solve a mystery."
      ],
      "budget": 0
   },
   "movielensId": 7102,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-06-25",
      "dvdReleaseDate": "1998-10-27",
      "directors": ["Tom Mankiewicz"],
      "runtime": 106,
      "movieId": 7102,
      "title": "Dragnet",
      "mpaa": "PG-13",
      "actors": [
         "Dan Aykroyd",
         "Tom Hanks",
         "Christopher Plummer",
         "Harry Morgan",
         "Alexandra Paul",
         "Jack O'Halloran",
         "Elizabeth Ashley",
         "Dabney Coleman",
         "Kathleen Freeman",
         "Shannon Tweed",
         "Lisa London",
         "Kimberly Foster"
      ],
      "imdbMovieId": "0092925",
      "originalTitle": "Dragnet",
      "genres": [
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["D3AmdKuFYSM"],
      "plotSummary": "The equally-straight-laced and \"by the book\" nephew of Joe Friday must work with his more laid-back partner to solve a mystery and save \"The Virgin\" Connie Swail...",
      "tmdbMovieId": 10023,
      "avgRating": 2.89556,
      "releaseYear": "1987",
      "numRatings": 833,
      "posterPath": "/vaFsRAleYZ6tIPxrDP2iwUpO3kU.jpg"
   }
}