{
   "tmdb": {
      "original_language": "fi",
      "keywords": [],
      "imdb_id": "tt0331041",
      "video": false,
      "title": "The Handcuff King",
      "recommendations": [
         173865,
         68190,
         29040,
         46814,
         224659,
         55522,
         38821,
         25335,
         17794,
         38215,
         20158,
         62719,
         53500,
         20164,
         29670,
         49320,
         78479,
         18279
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Esko",
               "gender": 0,
               "credit_id": "52fe4ea19251416c7515cf31",
               "name": "Miikka Enbuske",
               "profile_path": null,
               "id": 1261444,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Patrick",
               "gender": 0,
               "credit_id": "52fe4ea19251416c7515cf35",
               "name": "Emil Lundberg",
               "profile_path": null,
               "id": 1261445,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eskon Isä Toivo",
               "gender": 2,
               "credit_id": "52fe4ea19251416c7515cf39",
               "name": "Heikki Hela",
               "profile_path": "/pv2l2MjQ23FSpatyA7GSPpmnKGS.jpg",
               "id": 88919,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Eskon Äiti Aino",
               "gender": 0,
               "credit_id": "52fe4ea19251416c7515cf3d",
               "name": "Maija Junno",
               "profile_path": null,
               "id": 148368,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ea19251416c7515cf43",
               "name": "Arto Koskinen",
               "profile_path": null,
               "id": 1093734,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ea19251416c7515cf49",
               "name": "Arto Koskinen",
               "profile_path": null,
               "id": 1093734,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.348085,
      "production_countries": [],
      "id": 227370,
      "vote_count": 7,
      "budget": 0,
      "overview": "It is winter in the mid-1970s in Tornio, a village near the northern border between Finland and Sweden. Esko is a boy with a lot of problems. He has succeeded in getting on the wrong side of his gang.",
      "similar": [],
      "original_title": "Kahlekuningas",
      "runtime": 94,
      "poster_path": "/iP7Ju0rcC2kaHsvFcM1wS2ojzCh.jpg",
      "spoken_languages": [
         {
            "name": "suomi",
            "iso_639_1": "fi"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         }
      ],
      "production_companies": [],
      "release_date": "2002-10-04",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Finland",
      "color": "Color",
      "budgetCurrency": "FIM ",
      "directors": ["Arto Koskinen"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Arto Koskinen"],
      "originalLanguage": "Finnish",
      "imdbLink": "http://www.imdb.com/title/tt0331041/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMTgzMTAyNl5BMl5BanBnXkFtZTcwNTUzMzMzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Miikka Enbuske, Maija Junno, Heikki Hela | See full cast and crew »"],
      "reviews": [
         "This film is a top-quality coming-of-age comedy-drama from Finland. It is set in 1976 in the northern Finnish town of Tornio, on the Swedish border, and it is the story of 12-year-old Esko. He and his friends get into trouble following a run-in with some Swedish lads from across the river. When Esko refuses to accept his share of the responsibility, he is ostracized by the other Finnish boys. Desperate for companionship, he bonds with Patrick, a Swedish boy his own age who is also ostracized by his compatriots (for very different reasons). The two boys form a great admiration for Harry Houdini, and escapology becomes part of their play. What is fascinating about the film is the contrast and tensions between the two cultures (who nevertheless live a short stroll apart). There is ritualized violence between the teens of the two adjoining communities, and this prejudice continues into the adults, as Patrick's father forbids the lads to see each other (even though his runaway wife was Finnish). It is clear from the film that the Swedish town is the far more prosperous, so there are class distinctions involved as well. We also see a daily coping with the problems of two languages and cultures in a way that suggests it is a well-known routine to the local townsfolk: when one lad appears to be threatening suicide while masked, virtually the first question asked is whether he speaks Finnish or Swedish. Other similar details abound: Esko is once late for dinner because he forgot Sweden is in a different time zone; another time, the two boys are running down the street and shout \"Nothing to declare\" as they go by the customs post without breaking stride. One slight surprise in the film was the information that, apparently, schools in Finland play baseball...I never would have guessed that! Aside from language, this would be a fine film for family viewing, and it was released for 7+ in Finland (it would rate an American \"R\" for the language in the subtitles).",
         "A teenager boy, Esko, with a vivid imagination lives near the border of Finland and Sweden. After a trip to Sweden, he gets into disagreement his old friends, and he meets Patrik, a boy across the border. They share similar interests to two different people: Esko is living through the tales about German war-hero Rommel, and Patrik is trying solve the secrets of Houdini, great handcuff king. By and by, Esko starts to get more interested in Houdini's tale. Esko's family (father, mother, brother, and grandpa) live in the same house in rural area, near Tornio. All the other family members seem to live a little bit disconnected lives from Esko, they are part of the tales of Rommel, but also stories of Esko turning into a handcuff king. Story seems rather simple, and all the technical parts do not promise a quality film. However, the persons are fascinating, and the story goes on forward smoothly. Also, a peculiar anecdote is that, the young leading actors are one-time actors on silver-screens, by far. Amateurs they are, but do a nice job, taking the stories of Rommel and Houdini to the end. There is also an encouraging message to deliver, but that is for every viewer to find out.",
         "\"The Handcuff King\" is another entry in the \"nostalgic yet painful adolescence in rural Scandinavia\" genre. This film has its share of sweet moments, but there are more painful ones as the central character, a young Finnish boy named Esko, has to deal with a dysfunctional family living in poverty. At the same time he is abused and shunned by his classmates and former buddies. The only redeeming feature in his other dismal life is the tenuous friendship he forms with a nice Swedish lad from across the border. Esko is appealingly imaginative, but the film is marred by some technical flaws, as well as by its descent into emotional manipulation. At the end, I couldn't help feeling that what Esko and his family really needed was a very good therapist and access to a steady supply of anti-depressants.",
         "Most nordic films are about a young boy/girl approaching adulthood in the 50's-70's. That is a commonly accepted practice and i have nothing to complain about that. The period settings give nice flashbacks, and often these films have great dialogue, good child / adult characters and interesting stories. However Kahlekuningas, despite its favorable reviews, seemed to me as a complete failure. It is a superfluous imitation of other similar films, a shapeless mess of little incidents and characters that never form a satisfying story. Miikka Enbuske in the lead tries hard to be symphatetic and brisk but ends up sounding fake and irritating. This is probably largely the directors fault. Other actors are more skilled, but their roles aren't much to talk about. Sulevi Peltola is wasted as the grandpa who is stuck in wartime memories (what a novel idea!). Is his wetting of his pants supposed to be comical or tragic? Overall Kahlekuningas is quite lame, but has a few genuinely funny moments. If you like this sort of stuff, you may want to check this out for yourself, maybe you won't be as disappointed as i was."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Kinoproduction",
         "Eurimages",
         "Filmpool Nord"
      ],
      "summaries": ["In the 1970s, a 12-year-old boy Esko lives in Tornio, northern Finland, a town bordering Sweden across the river. Esko befriends a Swedish boy, Pate, and learns to share his obsession for Harry Houdini, the legendary escape artist. While standing handcuffed on the railway bridge, contemplating a stunt jump into the icy river, he reminisces the dramatic events of the summer before. For the viewer, his problems are presented with warm humour # gang fights, feeling guilty for lying, Father losing his job, Mother losing her nerves, not to mention Grandfather having lost his willingness to speak since a traumatic war experience 30 years earlier."],
      "budget": 10500000
   },
   "movielensId": 71110,
   "movielens": {
      "languages": [
         "suomi",
         "svenska"
      ],
      "releaseDate": "2002-10-04",
      "dvdReleaseDate": "2004-01-01",
      "directors": ["Arto Koskinen"],
      "runtime": 94,
      "movieId": 71110,
      "title": "The Handcuff King",
      "mpaa": null,
      "actors": [
         "Miikka Enbuske",
         "Emil Lundberg",
         "Heikki Hela",
         "Maija Junno"
      ],
      "imdbMovieId": "0331041",
      "originalTitle": "Kahlekuningas",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "It is winter in the mid-1970s in Tornio, a village near the northern border between Finland and Sweden. Esko is a boy with a lot of problems. He has succeeded in getting on the wrong side of his gang.",
      "tmdbMovieId": 227370,
      "avgRating": 3.25,
      "releaseYear": "2002",
      "numRatings": 12,
      "posterPath": "/iP7Ju0rcC2kaHsvFcM1wS2ojzCh.jpg"
   }
}