{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "oxford",
            "id": 8095
         },
         {
            "name": "car accident",
            "id": 13063
         },
         {
            "name": "aristocrat",
            "id": 155697
         },
         {
            "name": "torment",
            "id": 173977
         },
         {
            "name": "flashback",
            "id": 187844
         }
      ],
      "imdb_id": "tt0061328",
      "video": false,
      "title": "Accident",
      "recommendations": [
         60437,
         42744,
         42791,
         4990,
         96419,
         59231,
         94655,
         26186,
         42740,
         83957,
         32969,
         69040,
         6360,
         167928,
         81120,
         60792,
         25939,
         65611,
         17875,
         92819
      ],
      "backdrop_path": "/qJQULspNOGiFcEFn42iXjlPE3pU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stephen",
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c653",
               "name": "Dirk Bogarde",
               "profile_path": "/rIoedSTXnSooIh4zZV3K4M48gBh.jpg",
               "id": 21605,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Charley",
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c657",
               "name": "Stanley Baker",
               "profile_path": "/tuxxdeqxX8kTS8tBFon31IrXPvb.jpg",
               "id": 67449,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe48d1c3a368484e10c65b",
               "name": "Jacqueline Sassard",
               "profile_path": "/5k5tVXItxYkykOgjn8zrdSYX9ew.jpg",
               "id": 19091,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c665",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Francesca",
               "gender": 1,
               "credit_id": "52fe48d1c3a368484e10c669",
               "name": "Delphine Seyrig",
               "profile_path": "/4JzI3nS7kOKq9bkaIuMG6RxvmDy.jpg",
               "id": 3508,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Rosalind",
               "gender": 1,
               "credit_id": "52fe48d1c3a368484e10c671",
               "name": "Vivien Merchant",
               "profile_path": "/zsXeQnbwrW3WC1VNcZvkt83bezL.jpg",
               "id": 35314,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Provost",
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c66d",
               "name": "Alexander Knox",
               "profile_path": "/gWwgGHhIGHw9T7vZE4eyo9JFb4g.jpg",
               "id": 40529,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Laura",
               "gender": 1,
               "credit_id": "579e0cbfc3a3683d66000576",
               "name": "Ann Firbank",
               "profile_path": "/xFCoMlE02MUrc1bD26ef0q5jAn4.jpg",
               "id": 17161,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Plainclothes Policeman",
               "gender": 2,
               "credit_id": "579e0cd3c3a3681db8000d8a",
               "name": "Terence Rigby",
               "profile_path": "/cmg8qwt7Wo649ocgs2vxTPC2MnH.jpg",
               "id": 10748,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Police Sergeant",
               "gender": 0,
               "credit_id": "579e0ce692514110d00004ff",
               "name": "Brian Phelan",
               "profile_path": null,
               "id": 1079413,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Bell",
               "gender": 2,
               "credit_id": "579e0cfec3a3683d2b0005bd",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Man In Bell's Office",
               "gender": 2,
               "credit_id": "579e0d0bc3a3683cfd0005e4",
               "name": "Freddie Jones",
               "profile_path": "/mh2aJ6fuzsjsCG8bNyelPuqPHt3.jpg",
               "id": 12517,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Clarissa",
               "gender": 0,
               "credit_id": "579e0d21925141106e000507",
               "name": "Carole Caplin",
               "profile_path": null,
               "id": 1659237,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Hedges",
               "gender": 0,
               "credit_id": "579e0d4592514110220005b5",
               "name": "Nicholas Mosley",
               "profile_path": null,
               "id": 39010,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Ted",
               "gender": 2,
               "credit_id": "5629a065c3a3681b61000f14",
               "name": "Maxwell Caulfield",
               "profile_path": "/x0lq13DjVXDmfvrTiuBVk7MRmxF.jpg",
               "id": 101908,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c64f",
               "name": "Joseph Losey",
               "profile_path": "/5OIfdtROzTqUxUCdzyOe5fM8GXl.jpg",
               "id": 39009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c661",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48d1c3a368484e10c677",
               "name": "Nicholas Mosley",
               "profile_path": null,
               "id": 39010,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c67d",
               "name": "Norman Priggen",
               "profile_path": null,
               "id": 232013,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c683",
               "name": "Joseph Losey",
               "profile_path": "/5OIfdtROzTqUxUCdzyOe5fM8GXl.jpg",
               "id": 39009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48d1c3a368484e10c689",
               "name": "Gerry Fisher",
               "profile_path": null,
               "id": 40052,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe48d1c3a368484e10c68f",
               "name": "John Dankworth",
               "profile_path": null,
               "id": 132879,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48d1c3a368484e10c695",
               "name": "Reginald Beck",
               "profile_path": null,
               "id": 133869,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.276203,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 74544,
      "vote_count": 19,
      "budget": 600000,
      "overview": "Stephen is a professor at Oxford University who is caught in a rut and feels trapped by his life in both academia and marriage. One of his students, William, is engaged to the beautiful Anna, and Stephen becomes enamored of the younger woman. These three people become linked together by a horrible car crash, with flashbacks providing details into the lives of each person and their connection to the others in this brooding English drama.",
      "similar": [
         27066,
         1259,
         28468,
         263472,
         22705,
         2149,
         489,
         1813,
         1903,
         44214,
         64682,
         244772,
         346685,
         8834,
         11004,
         11027,
         283227,
         84997,
         37265,
         36630
      ],
      "original_title": "Accident",
      "runtime": 105,
      "poster_path": "/1M5j6se30q5xQfNepeeKRD15vHu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Royal Avenue Chelsea",
         "id": 17270,
         "origin_country": ""
      }],
      "release_date": "1967-02-05",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "The story of a love triangle... and the four people trapped in it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joseph Losey"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Nicholas Mosley",
         "Harold Pinter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061328/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTE3NTM2OTAwNF5BMl5BanBnXkFtZTgwMjg2Njc3MTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dirk Bogarde, Stanley Baker, Jacqueline Sassard | See full cast and crew »"],
      "reviews": [
         "Following their work on \"The Servant\" (1963) and before the more well-known, \"The Go-Between\" (1971), \"Accident\" can be seen as the best - certainly the most understated - of the collaborations between the English playwright, Harold Pinter, and the expatriate American director, Joseph Losey, who had lived and worked in London for some years. As Pinter said in a 1966 interview: \"So in this film everything is buried, it is implicit. There is really very little dialogue, and that is mostly trivial, meaningless. The drama goes on inside the characters.\" In the published screenplay his directions for one scene indicate that \"the words are fragments of realistic conversation. They are not thoughts...\" and what comes across is the brilliant contrast between the nondescript, mundane, day-to-day attempts at communication between the characters combined with a hard look at the underlying reality of the characters' situations. Nothing is like it seems to be. If you like the work of Harold Pinter, this rarely-available film, is a brilliant addition. See it in combination with the other two to get a full picture of what Losey and Pinter achieved. I've seen the films at least 10 times each and they formed the basis of my 1974 MA thesis on the Pinter-Losey collaboration.",
         "Not a lot happens, but we were glued to The Accident. The script is wonderfully understated. Pinter as screenplay writer is a different style from Pinter the playwright. Pinter teases us, though, with a small cameo performance of his own using almost mock-Pinter dialogue for that one short scene. Also of note script-wise is the scene soon after Pinter's scene when Dirk Bogarde visits his old flame in London and the dialogue is almost thoughts, almost dialogue - you don't see either of them actually speaking. The cinematography on this movie is superb. Oxford in the summer is a soft target for beautiful shots, but this film fills its boots with that beauty. Yet the dark mood never leaves you despite the beauty - partly because 90% of the movie is a flashback, so you have already seen most of the tragedy unfold. Also, the behaviour of the two professors is just so awful. Dirk Bogarde comes across somewhat sympathetically because he is Dirk Bogarde, but the character is a more or less unmitigated toad. The Stanley Baker character is also horrible. The acting of all the main characters is superb. This is high class stuff - seek it out.",
         "From the very first shot Losey lets us know that to get the most from this film it's not what you see, but what you perceive, that matters. The opening shot of a country house is held steady for our eyes whilst the sound of an approaching (speeding) car and, inevitably, the grinding of metal on gravel as the accident happens, dominates our hearing. And so it is for the rest of the film. What is important is not, necessarily, what we see, but what we discern. The complexities of the relationships between the main characters, the effect on all of them brought by the simple presence of Anna (Sassard), their infidelities and insecurities all contribute to make this a spell-binding 100 minutes or so of classic cinema. The spare, Pinteresque, dialogue inspires the viewer to attempt to untangle the dynamics between the characters. Some poignant photography (for instance, the symmetry of Anna and Stephen (Bogarde) as they gaze out over picturesque English countryside whilst leaning on a gate but, at the same time, teasing us as to whether or not they will draw closer,) adds to our desire for a better understanding of these people and their relationships. The photography of rooms shot from odd angles (indeed, some of these shots seem designed to accentuate the angles of the characters every bit as much as the rooms themselves) all contribute to a complex web of relationships. Some sexy, sixties sax from John Dankworth adds an appropriate musical blend to the whole. And how many times does Stephen say to others `What are you doing?' as he strives to come to terms with his own infidelities and insecurities, let alone those of all those around him? It's an intense, but approachable, movie with little concession to humour, save perhaps for a couple of comments from Stanley Baker's picaresque character, Charley. But don't let that put you off; this is intelligent, challenging cinema, a welcome refuge from the shoot \u0091em up stream of movies we've become used to over the years.",
         "Accident is mesmerizing. Floating through the details of an appropriately Pinter-esque life, we are given a kind of psychological portrait in which we learn little more than what we can visually observe. The most emblematic scene in the movie shows two people standing with their backs to us, leaning against a fence. One of them, just before the cut, breaks a twig from of the branch above him with a swift, almost violent motion. The movie itself keeps its back to us, refusing to yield its secrets while occasionally holding out before us strangely telling details. The quiet narrative is punctuated by shots of cold, precise symbolic weight. Although they do not generally interrupt the pace, or shock us, they have a feeling of violence to them; shots of a house, tracking in extremely slowly until we hear the sound of a terrible car crash, or in which the camera moves, in close-up, between stone gargoyles to the beat of a cathedral bell hint at the ugliness behind the veneer of the character's lives. If nothing else, Accident is triumphant in its ability to convey a sense of existential rot that is somehow simultaneously hidden and apparent.",
         "Watching this film again in 2010, it is amusing to see how much they smoked and drank. Students would arrive for tutorials and the professor would pour out a generous glass of the hard stuff or at least sherry. Stephen's pregnant wife takes an afternoon nap with a bottle of beer on the bedside table. Charley arrives for lunch carrying a couple of bottles of liquor, which gets consumed in the afternoon. Not surprisingly William ends up passing out face down in the salad! Anyone playing the drinking game and trying to keep up with the characters would be out cold halfway through the film. Everything about the film was note perfect, with the exception of Jacqueline Sassard's stiff performance. Her character was supposed to be Austrian, so why did she try to look like an Italian starlet with that dreadful eye makeup. Perhaps they could not afford Gina Lollobridgida! Not only did she not look the part, but her voice was flat and harsh. I spent the movie wondering what on earth any of the men saw in her. If only they had used Marianne Faithful, who would have looked like an Austrian and given off an air of unattainability, at least until her affair with Charley was discovered. I could not help feeling that if Anna had been written out altogether and the object of desire had been the beautiful William, played to perfection by Michael York, it might have been more interesting. Perhaps there was an subtle undercurrent which I missed. Filmmakers were not quite so obvious in 1966. Other than that, the wonderfully atmospheric film beautifully conveyed the long hot humid summer days of the south of England and the polite banter of the elite academics disguising an envious loathing of each other as they drank their way through the day. 40 years on I have never forgotten one little quote in the film by the provost who, upon hearing that a study into the sex habits of students at the University of Wisconsin revealed that 0.01% had intercourse during a lecture on Aristotle, remarked that he was surprised to find Aristotle on the syllabus in Wisconsin. With snappy one liners like that, how can you forget this film.",
         "Late one evening in the English countryside two inebriated students on their way to visit Stephen (Dirk Bogarde) an Oxford professor who has been tutoring both, crash the car they are in killing the male ( Michael York). Stephen pulls Anna (Jaqueline Sassard)from the wreck and then possibly covers up for her part. The story then moves backwards in objective and dispassionate detail that first brings them and others together before the climax returns you with a group of facts to assess your own feelings about each character as the film plays itself out. Accident is one cold and remote study of human behavior even for English academia. Director Joseph Losey and writer Harold Pinter erase any hints of compassion and understanding while ironically rendering men of vast knowledge non communicative to intimates as they try to come to terms with their own repressed desires. Bogarde is tailor maid to play Stephen. Defrosting little from his character in The Servant created by the same team he remains in a perpetual dark night of the soul even during moments of bliss. Fellow prof Charley ( Stanley Baker) is more nuanced and well played against type by Baker, even more deluded in his mid life crisis. The two have some excellent scenes together as Pinter's script and Losey's long takes build suspense fully but sometimes misleadingly. Vivien Merchant provides her usual laid back style of deceptive power while Michael York exudes youth and life with Jaquelline Sassard beautiful and comatose. There's also an excellent cameo by Harold Knox as a senior provost foreshadowing Stephen's future, who has to be reminded of his daughter's name. It's an almost soul less existence with all emotion cut off. Accident reflects its title perfectly and in doing so makes it impossible for you not to look away. It is a challenging, exasperating and for some rewarding experience.",
         "I can't agree with one reviewer here who states that \"Accident\" is the best of the Losey-Pinter collaborations. I much prefer \"The Servant.\" \"Accident\" is about just that -- the film begins with a dreadful car crash and Stephen (Dirk Bogarde), an Oxford don, coming to the site and rescuing the young woman, Anna (Jacqueline Sussard) and taking her back to his house. The other occupant is dead. The story unfolds from there, going back to what led up to this event. Stephen is going through a midlife crisis. He has two children, a pregnant wife, and not quite the success of his friend Charley (Stanley Baker) who has a television show. Stephen finds himself attracted to one of the students he tutors, Anna, but can't quite muster up the courage to approach her. Another student, William (Michael York) is a friend of hers; Stephen can't quite figure out the relationship, even after a night of boozing it up a la Virginia Woolf. Then he finds out something very interesting. This has to be one of the slowest-moving films on record, filled with those famous Pinter pauses and emotions underneath the surface. And here, they're really underneath. Buried. John Coldstream quotes Michael York in \"Dirk Bogarde\" about being told \"you can't underact,\" that film is so subtle a medium, the less you do, the better it is. Well, in \"Accident,\" that's been taken to a new art form. York was impressed that while doing the scenes, it didn't come off like they were doing anything until you saw it on film. I don't know what film he saw. The other problem with this film, and maybe it was just me going into an advanced stage of blindness, which I wasn't aware of, is that the night shots were black. I really couldn't see what was going on. That all being said, the basic story is certainly a compelling one, of people leading normal, outwardly successful lives, with turgid emotions and unhappiness churning underneath. The scenes after the accident between Sussard and Bogarde are very striking and disturbing, as is the final moment of the film. We are reminded that what's on the surface has nothing to do with what really is in the heart. \"Accident\" was a terrible emotional drain on Dirk Bogarde; unfortunately, because of the direction, we don't get to see why. He was a remarkable actor, but like any actor, he's a victim of the director's pacing and concept, not to mention the script he's handed. This could have been much better, right up there with the searing drama of \"The Servant.\" Alas, it isn't.",
         "This is arguably Losey's masterpiece, overtaking in my mind the more renowned THE SERVANT (1963; see review above). In place of his trademark directorial stylistics, a more formal but equally assured approach to film-making - signaled perhaps by being his last outing with frequent collaborators Dirk Bogarde (with whom he made 5 films), Stanley Baker (4), Alexander Knox (4) and composer Johnny Dankworth (4) - is in evidence here. The only concessions to 'style' are some temporal flourishes a' la Resnais and a superbly enigmatic interlude with Bogarde, where the dialogue between him and former lover Delphine Seyrig is heard as voice-over while the characters are seen interacting in different surroundings! Still, the film's flashback structure is perhaps famed playwright Harold Pinter's doing who contributes a fine, nuanced script. The characters say very little to one another: indeed the film as a whole may be too low-key for most viewers but the real emotions (lust, contempt, pity, hypocrisy) they feel for each other come to the fore regardless through fleeting glances, hesitant remarks, etc.; Bogarde even gets into a stammering fit in especially stressful moments, and only gets to concede to his repressed desires i.e make love to his pupil Jacqueline Sassard, when she is at her most vulnerable - immediately after her boyfriend's tragic death, even though his own wife is pregnant with their third child! The film features an excellent ensemble cast, led by a vulnerable Bogarde and a particularly despicable Baker. This was also Michael York's first major role; in fact, he flew to Cannes specifically to talk with Losey - who was presenting MODESTY BLAISE (1966; see review above) - about getting the part! On the contrary, Sassard would go on to make just one more film - Claude Chabrol's masterly LES BICHES (1968) where, again, she was the 'prize' in a ménage-a'-trois that also comprised Jean-Louis Trintignant and lesbian Stephane Audran! - before disappearing from cinema screens altogether!! Freddie Jones, Pinter himself and Nicholas Mosley (the author of the source novel) appear in small roles, while Gerry Fisher's beautiful cinematography and Dankworth's jazzy score effectively complement the film's pervasive brooding mood. ACCIDENT was nominated for 4 BAFTAs and won the Grand Jury Prize at the Cannes Film Festival but, again, Losey was criminally neglected at the Oscars.",
         "One of the best films ever made, this movie oozes atmosphere. The cinematography is impeccable, the script disturbingly brilliant. It makes rural Oxfordshire feel like the African weld. This movie is the perfect example of style in accord with content. A glistening original of sixties cinema and a rare example of how British cinema can equal its French counterpart. It's impossible to describe why you should see this movie, it simply justifies itself. If you thought films began with Star Wars then prepare to be amazed. Anyone with a soul can't fail to appreciate this picture.",
         "\"Accident\" was a somewhat ripe little novel by Nicholas Mosley about the sex lives of dons, (of the Oxbridge type rather than the Juan or Giovanni kind). It was a good book but hardly memorable. The film that Joseph Losey made of it, however, was a different kettle of rancid fish altogether. Harold Pinter wrote the script and it's a brilliant piece of work, as acerbic, as nasty and, by God, as intelligent as any of his celebrated theatre work and Losey's direction is pitch-perfect. Perhaps no writer and director were ever quite as in simpatico as Pinter and Losey. The film is told in flashback. It opens stunningly with the accident of the title that introduces us to three of the central characters; the driver of the car, the young woman with him and the don who finds them. The driver is a young Michael York, the girl is Jacqueline Sassard and the don is Dirk Bogarde, magnificent here in a performance as fine as his work in \"The Servant\" or \"Death in Venice\". The film then jumps back in time as we meet the other characters caught up in the sexual shenanigans; Stanley Baker as another don, raffish and full of bluster where Bogarde is introverted and ineffectual and Vivien Merchant as Bogarde's pregnant wife. They, too, are superb but then everyone, no matter how small their part, is superb; everyone is there for a reason. Primarily this is a film about sexual tension and unfulfilled desires, about petty jealousies and how all this sublimated sexual longing can lead to disaster. It is a film made up of long, virtuoso passages; a drunken Sunday lunch that turns into a drunken evening of recrimination and which brings all the main characters together, Bogarde's visit to an old flame, (Delphine Seyrig), a cricket match and, of course, the crash itself and it's aftermath which is, naturally, sexual. This is great film-making, quite rare in British cinema. Paradoxically the film is among the most English and, at the same time, among the least English of pictures. Superbly photographed, too, by Gerry Fisher and with another great Johnny Dankworth score this is a masterpiece."
      ],
      "genres": [
         "Drama",
         "Crime"
      ],
      "productionCompanies": ["Royal Avenue Chelsea"],
      "summaries": ["Stephen is a married Oxford professor experiencing the pangs of a mid-life crisis as he begins to bristle at the stifling emotional repression of the society in which he lives. Things begin to change for him when he meets Anna, a beautiful student who is engaged to William, another of Stephen's students. Though he begins to feel alive again in her presence, Stephen's feelings for Anna can only end in tragedy for them and those around them."],
      "budget": 600000
   },
   "movielensId": 7112,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-02-05",
      "dvdReleaseDate": "2001-12-18",
      "directors": ["Joseph Losey"],
      "runtime": 105,
      "movieId": 7112,
      "title": "Accident",
      "mpaa": "",
      "actors": [
         "Dirk Bogarde",
         "Stanley Baker",
         "Jacqueline Sassard",
         "Michael York",
         "Delphine Seyrig",
         "Vivien Merchant",
         "Alexander Knox",
         "Ann Firbank",
         "Terence Rigby",
         "Brian Phelan",
         "Harold Pinter",
         "Freddie Jones",
         "Carole Caplin",
         "Nicholas Mosley",
         "Maxwell Caulfield"
      ],
      "imdbMovieId": "0061328",
      "originalTitle": "Accident",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["aFAowLwslHU"],
      "plotSummary": "Stephen is a professor at Oxford University who is caught in a rut and feels trapped by his life in both academia and marriage. One of his students, William, is engaged to the beautiful Anna, and Stephen becomes enamored of the younger woman. These three people become linked together by a horrible car crash, with flashbacks providing details into the lives of each person and their connection to the others in this brooding English drama.",
      "tmdbMovieId": 74544,
      "avgRating": 3.475,
      "releaseYear": "1967",
      "numRatings": 60,
      "posterPath": "/1M5j6se30q5xQfNepeeKRD15vHu.jpg"
   }
}