{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "undressing",
            "id": 14557
         },
         {
            "name": "lifeguard",
            "id": 160961
         }
      ],
      "imdb_id": "tt0110936",
      "video": false,
      "title": "Radio Inside",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Matthew Anderson",
               "gender": 2,
               "credit_id": "53b23c2ac3a3682ee60071e2",
               "name": "William McNamara",
               "profile_path": "/c19069KdW7VW4h8Q5Cq35j8sOMl.jpg",
               "id": 18687,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Natalie",
               "gender": 1,
               "credit_id": "53b23c3cc3a3682ee20074bf",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Michael Anderson",
               "gender": 2,
               "credit_id": "53b23c4ec3a3682edf006e4b",
               "name": "Dylan Walsh",
               "profile_path": "/6rOQgNjIJUqXDiM06K2hrL68Eky.jpg",
               "id": 21043,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "T.J. (as Pee Wee Love)",
               "gender": 0,
               "credit_id": "5457c1360e0a26297a0023b9",
               "name": "Peewee Love",
               "profile_path": "/iwwZdkKLjtXiWGddzRF5TMf7Wns.jpg",
               "id": 98887,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Father Anderson",
               "gender": 2,
               "credit_id": "5457c143c3a3686902003703",
               "name": "Steve Zurk",
               "profile_path": null,
               "id": 93692,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53b23c6ec3a3682ee20074c6",
               "name": "Jeffrey Bell",
               "profile_path": "/nZV8oaC1p3gWPsYTC8Dzk9Ss3eU.jpg",
               "id": 1236075,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5457c1040e0a2648cb009dbf",
               "name": "Jeffrey Bell",
               "profile_path": "/nZV8oaC1p3gWPsYTC8Dzk9Ss3eU.jpg",
               "id": 1236075,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.025374,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 279606,
      "vote_count": 0,
      "budget": 0,
      "overview": "As two brothers fall in love with the same woman they must come to grips with the accidental death of their father in this sensitive drama set in Miami.",
      "similar": [
         1903,
         638,
         377,
         10014,
         10072,
         1429,
         258230,
         381283,
         181886,
         11596,
         11284,
         81188,
         11360,
         31011,
         1018,
         2675,
         1955,
         38,
         627,
         242224
      ],
      "original_title": "Radio Inside",
      "runtime": 91,
      "poster_path": "/tzHnUysVTZ9yaCF4MvAqaKWmuq4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Polar Entertainment",
            "id": 17411,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Burnside Distribution Company",
            "id": 37260,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-03-15",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "What do you do if the one you want is the one you can't have?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeffrey Bell"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Jeffrey Bell"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110936/",
      "coverLink": null,
      "actors": ["Stars: William McNamara, Elisabeth Shue, Dylan Walsh | See full cast and crew »"],
      "reviews": [
         "I caught this tv movie late the other night...and I was pleasantly surprised. I know you can say almost anything about it's shortcommings and probably most of it is correct. ...But why did I watch this film and was I moved long after it had finished? Couple of reasons: * the story: flawed and messy at times but really heartfelt. In a way not many films can measure up to...Especially towards the end where Matthew finally reaches the moment where he can let go of his feelings of guilt (for not being able to save his father). Water plays a special part in this story...His love for fish, his job in the pool, his fear of drowning... The thing where he talks to Jesus is funny...but should have been worked out better... * the characters: likable persons in believable relationships. Although we do not know everything about them they make us care about them and what happens to them. The relationship that grows bewteen Matthew and Shue is very very touching. * the acting. Very well acted by all of the three leads. McNamara stands out in a difficult performance. Watch the final scene where he breaks down: this is one of the most realistic \"crying\" scenes I 've ever seen...Compare this to the crying scene of a \"great\" actor like Edward Norton in American History X....It shows that there can be great acting in very small films, by relatively unknown actors. * and last: Shue: This is the most charming, real and startling actrice in Hollywood today. It is so sad that she doesn't know how to pick the right parts. She is the only modern day actrice that comes close to capture the magic for the screen like Marilyn Monroe did in the fifties. She is immensely atractive without being too beautiful. Has a body that is not perfect but still you can't keep your eyes of her. She is no Roberts, Jolie, Bullock or Diaz...but she shines brighter than all of those stars together. I think I sort of fell in love last night.... (This is a very unusual review coming from me...but I can't help it!)",
         "This is one of those films for people who don't need to have everything spelled out for them and can imagine for themselves, the presence of unusual yet unexplained elements. This film is basically about a young man \"Matthew\" and his older brother \"Michael\" dealing with personal loss, each in his own way and the woman \"Natalie\" who is at the center of their \"present\" It deals mostly with how the younger of the two spends much of his time in his head. An interesting if not curious place to be. His past, present and conscience appear in an unusual way but this sweet kind soul is not disturbed nor disturbing but rather, comforting in the sense that he shows the viewer the possible upside to living, at least sometimes, detached from the meaningless rush and empty pursuits of daily life as most people live it. He may appear to be doing nothing, going nowhere, but in fact is probably going farther and doing more than all around him, and is in fact more sensitive to the world around him than most would be in his place. We should all watch this and try to find a way to remove ourselves at least in part from the rest of the world to take time to deeply contemplate life, our place in it and hope to find ourselves as visible and loved as he. As for the rest of the film. Well, The only other main Characters. His older Brother,(Walsh Of \"Nip and Tuck\") and the Brother's Girlfriend(Shue, in a characteristically easygoing, naturally offbeat and immensely sensitive role) with whom the protagonist (Walsh, an undeniably underestimated and grossly underused actor in mainstream Hollywood) has a symbiotic relationship grown from what appears to begin as an innocent crush. To say more would give away too much of the film's simple message. There are elements that only the most sadly dense of viewers will find confusing or underwritten. This is a film to simply take as a window into the lives of three people who are in the purest of ways, compelling as much for their approach to life and love as for their sheer personal charisma and likability. A thinker's film, for the thinker who understands living deep inside one's self and those who know what it is like to at sometime in life have little more than their imagination and inner life with which to handle that which life throws at them. As well as the presence of loved ones who's love transcends the need to completely understand them and that which makes them tick. Truly a little Gem of a film.",
         "This gentle, even sweet, film is quite unusual in presenting in a non-mocking manner a person, Matthew (William McNamara), with real, heartfelt religious beliefs. Matthew does have a rather quirky relationship with Jesus, however! Basically, this is a three-character story with the actors (Dylan Walsh, Elisabeth Shue and McNamara) all giving fine performances. I also liked the cinematography, with its nice use of Miami Beach locales.",
         "With \"Stealing Home,\" this is William McNamara's best work. He subtly and effectively delivers the conflict and angst of Matthew Anderson, who has recently moved to Florida and taken a job as a Life Guard after the drowning death of his father. Cinematography and supporting cast (pre-'Vegas' Elisabeth Shue) are excellent as well. The story never strays from Matthew's dilemma, complicated by a sudden crush on his brother's girlfriend. If only we all had a direct phone line to Jesus.",
         "I think this movie had a catcher in the rye feel to it, you either loved it or you hated it. I really felt moved by this movie and I don't know if it was because I watched it alone one sat. night or because I felt my old Elisabeth shue crush come back... In all a great story that's well told and played out by characters that are easy to like. (also watch and listen for Matt's catcher in the rye reference in the phone booth)- Great Movie for adults.",
         "It's hard to put my finger on exactly what I liked about this movie. The three lead actors, especially McNamara and Shue are certainly a big part of it. The interesting locations (Miami Beach). On-screen exploration of a person's rather eccentric religious beliefs in a very creative way. Some very creative daydream/mood-setting scenes. I really connected with certain elements of the plot: a person's feelings of loss/guilt over the death of a family member, the big-brother/little-brother relationship, along with a few more standard movie plot elements like \"love triangle\", etc. Overall, the movie has a sort of slow, dreamy quality. Not a good movie to watch if you're in the mood for action, car chases, gunfights, etc. Overall, not a whole lot happens in the movie. It is largely a character study and is tightly tied to McNamara's character's perspective. I am generally conservative with my ratings, but I rated this movie very highly. I have seen it several times and i find myself thinking about it a lot, even though it has been quite a long time since the last time I saw it. Not having heard anything about it or seen a preview, this is one of a very, very rare category of movies for me that i selected off the rack at the video store (probably when they were out of the other five movies i wanted to get) and ended up being blown away. Now I feel lucky for having found it. I only wish it would come out on DVD (as of 6/01, it is only available on VHS).",
         "Great movie, very deliberate pace, mainly a very thick and somewhat hidden love story, with great subtext around important relationships in one's life. If you're looking for a face-paced, action-packed movie, this isn't it....however, if you appreciate the many aspects of love on every level, you'll enjoy this independent-feeling movie with great spacing and room to intersect your own thoughts and history in past and present relationships. Complimenting the great acting and risk-taking simplicity with which the story is told, is a great soundtrack, that is to say, great music. Also, as is the case with many other great movies, the ending is left very open-ended, not in a way that suggests a sequel (which there was not) but rather to further support the ability for one to inject there own experiences into how the characters might move-on.",
         "I have not seen this movie in awhile, it was right around the time that Bronx Tale came to HBO I believe and was happy that there were two good movies with some heart and originality. I saw it on HBO before Bronx Tale and was just very happy with the development of the characters. I thought that the acting was superb. It had some humor and had three to four things going on. I felt that this movie did not get the recognition it deserved. I am curious how this happens. It was quirky true but Elizabeth Shue with the two fairly unknowns in William McNamara and Dylan Walsh in my mind as two brothers out of college was done very classy and the way movies should be.",
         "Basically,this is a film about a guy who thinks he's Holden Caulfield,keeps flashing back to when he's about six years old,talks to Jesus from a payphone,and can't keep his hands off his older brother's girlfriend.My mind started to wander after about fifteen minutes.Skip this one unless you're really desperate.The acting isn't all that bad,and technically nothing is wrong with it,it's just that the story isn't particularly interesting.",
         "There is nothing very special about this movie, it is light romantic entertainment. The characters are interesting enough and the plot moves along at a leisurely pace. This movie doesn't expect too much from its viewers and you shouldn't expect too much from it. The actors are pleasant and solid."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Burnside Distribution Company",
         "Capitol Films",
         "Polar Entertainment Corporation"
      ],
      "summaries": ["A year after their pious dad's death, just graduated bright, erudite but distracted Matt Anderson, an angelic dreamer who talks with dad's ghost and phones with his confident God, moves in with his only relative, prosaic but well-meaning elder brother Michael 'Mike' Anderson, who has a materialist career in advertising in Miami Beach and tries to push kid brother into professional life too. Matt however, who adores thinking in the bath and watching fish in an aquarium despite a recurring near-drowning nightmare, takes a lifeguard job in the municipal pool well below his brilliant degree and only does some copy-writing for Mike's agency as a reluctant favor to big brother, no praise or fat check can make him like the greedy advertising business. Going along with Mike and his sexy girlfriend Natalie, a bookshop clerk who enjoys private tutoring, and standing in when Mike stands her up, Matt discovers she's rather his type, caring and romantic; soon they are irresistibly drawn to each-other, but even after a ball -a success although Matt can't dance- and a kiss she stole he can't risk losing Mike, who denies it when she dumps him. When it seems Tyler 'T.J.', an obnoxious black rascal Natalie and Matt both tried to take under their wing and teach to swim, has drowned when he was late, gentle Matt's tender heart breaks beyond panic..."],
      "budget": 0
   },
   "movielensId": 71266,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-03-15",
      "dvdReleaseDate": null,
      "directors": ["Jeffrey Bell"],
      "runtime": 91,
      "movieId": 71266,
      "title": "Radio Inside",
      "mpaa": "",
      "actors": [
         "William McNamara",
         "Elisabeth Shue",
         "Dylan Walsh",
         "Peewee Love",
         "Steve Zurk"
      ],
      "imdbMovieId": "0110936",
      "originalTitle": "Radio Inside",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["5uOKf2CXhdI"],
      "plotSummary": "As two brothers fall in love with the same woman they must come to grips with the accidental death of their father in this sensitive drama set in Miami.",
      "tmdbMovieId": 279606,
      "avgRating": 2.5,
      "releaseYear": "1994",
      "numRatings": 1,
      "posterPath": "/tzHnUysVTZ9yaCF4MvAqaKWmuq4.jpg"
   }
}