{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0108137",
      "video": false,
      "title": "The Silver Stallion",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Man",
               "gender": 2,
               "credit_id": "52fe465dc3a36847f80faf29",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elyne Mitchell",
               "gender": 1,
               "credit_id": "52fe465dc3a36847f80faf2d",
               "name": "Caroline Goodall",
               "profile_path": "/f3L5WmEtGjjONTe8qvBZOy2dWTJ.jpg",
               "id": 6692,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Indi Mitchell",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf31",
               "name": "Amiel Daemion",
               "profile_path": null,
               "id": 1153740,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jock",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf35",
               "name": "Johnny Raaen",
               "profile_path": null,
               "id": 1153741,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Darcy",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf39",
               "name": "Buddy Tyson",
               "profile_path": null,
               "id": 1153742,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Auctioneer",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf3d",
               "name": "Graeme Fullgrabe",
               "profile_path": null,
               "id": 1153743,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Rider",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf41",
               "name": "Gary Amos",
               "profile_path": null,
               "id": 1153744,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rider",
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf45",
               "name": "Murray Chesson",
               "profile_path": null,
               "id": 1153745,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf4b",
               "name": "John Tatoulis",
               "profile_path": null,
               "id": 79113,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf51",
               "name": "Elyne Mitchell",
               "profile_path": null,
               "id": 1153746,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf57",
               "name": "Jon Stephens",
               "profile_path": null,
               "id": 217024,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe465dc3a36847f80faf5d",
               "name": "John Tatoulis",
               "profile_path": null,
               "id": 79113,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.60157,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 43757,
      "vote_count": 3,
      "budget": 0,
      "overview": "Australian adaptation of Elyne Mitchell's \"The silver Brumby\".",
      "similar": [],
      "original_title": "The Silver Stallion",
      "runtime": 93,
      "poster_path": "/rkcYteAua7NVH8sRnSMBD4QqixE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Film Victoria",
            "id": 11840,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Media World",
            "id": 13344,
            "origin_country": ""
         }
      ],
      "release_date": "1993-09-16",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "The magic of the mountain. The obsession of a man. The beauty of the Silver Brumby.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Tatoulis"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Elyne Mitchell",
         "Jon Stephens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108137/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NTI3MTEwMl5BMl5BanBnXkFtZTcwMTQ4MjUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Caroline Goodall, Russell Crowe, Amiel Daemion | See full cast and crew »"],
      "reviews": [
         "Well, in my continuing quest to see every movie Russell Crowe was ever in, I stumbled across this little film. (As long as I'm disclosing biases, I might as well mention that I have not read Elyne Mitchell's novel.) It is a film for children--specifically, girls ages 8-12 or so who love horses. And they will love it. Younger children may be disturbed by some of the content; these are wild horses trying to survive in the wild, in all weather and situations. It's framed as a fable, with Elyne Mitchell (Caroline Goodall) writing a story for her daughter Indi (Amiel Daemion) about Thowra, the great silver brumby, and the Man (Russell Crowe) who wants to tame him. It's meant to be a fable, which explains how all these wild horses are so beautifully groomed. The horses also occasionally seem to be deaf, since they fail to react at all to sounds that any horse would prick its ears at. As a horse film, it's highly successful. We see lots of lovely horses, doing fascinating horse things. The horse part of the movie is perfectly developed. The humans are more troublesome. I suspect that Mrs. Mitchell and her daughter were not characters in the book; adding them causes a fundamental shift in the relationships between the characters. Instead of relationships between Thowra and other horses (especially the Brolga, his archrival) and between Thowra and the Man, the most important relationships are those between humans (between the two Mitchells, between Indi and the various men who catch and tame brumbies) and between humans and nature, with the relationships among the horses and of the humans to the horses receding into the background. Instead of a simple pair of conflicts--between Thowra and the Brolga (the natural challenge); between Thowra and the Man (the unnatural challenge)--we get instead a large number of relationships, which changes the entire dynamic. Despite these problems, the new concept could have worked, if simplified a bit. The basic point is that both Indi and the Man love Thowra, and for the same reasons: he is beautiful, strong, proud, and free. However, because Indi loves Thowra, she wants him to remain free; because the Man loves Thowra, he wants to own and tame the horse. Such a conflict could have provided ample opportunity for lessons on \"listening to the bush\" and on the difference and inherent contradiction between love and possession (etc., etc.). In the film, however, the Mitchells dominate. Elyne gives her daughter lessons on nature and life, with the help of an injured kangaroo they find, which serves to teach that wild things belong in the wild, that if you truly care about something you give it its freedom--all lessons that could have been communicated via the story of Thowra. (I loved the kangaroo, but it wasn't necessary.) Meanwhile, the Man is underdeveloped, and sometimes demonized--which runs entirely counter to the purpose of the film. The Man is not evil, just obsessed. The filmmakers undoubtedly decided to focus on the girl and her mother because that's their audience. A reasonable decision, and yet one which weakens the film. Overall, a nice, solid horse film which should be very popular with its target audience.",
         "I usually have pretty low expectations for \"children's movies\" not to mention animal adventures. This film turned out to be a fabulous surprise in every way. Sure, I came to it solely to finish out my search for Russell Crowe films; but I came away extremely moved by both the story, the breathtaking visuals of Australia and the lack of heavyhandedness so usually present in these films. This film provided a mesmerizing, compelling film experience. Oh yeah...Russell looks absolutely gorgeous..... Try it...you'll be glad you did.",
         "I truly wish that this movie would have been shown in theatres in the US instead of going directly to video. The visuals were absolutely stunning, especially the scenes of the brumbies galloping freely. The basic premise of the story about the Man's obsession for the Silver Brumby was excellent. The medium of the mother relating the story to her daughter was also handled well, but some of the other scenes with the mother and daughter distracted from the flow of the film. Especially the scenes with the kangaroo. To me they seemed disjointed as if they were just thrown in hodgepodge. Overall I loved the movie and will watch it again for the Australian scenery and horse scenes.",
         "*May contain slight spoilers* The main motive for my getting out this movie is because it is Australian and because the front featured a large picture of a young and very hunky Russell Crowe. It's a sweet story which horse lovers and young viewers would absolutely adore. However, while having an appreciation for horses, one and a half hours of what was mostly horses had me a little bored. To be perfectly honest, the Crowe to horse ratio was far too low. If you simply want to perve on Russell Crowe as I did, the best part of the film is when he is washing himself in the creek. Don't get your hopes up, there will be no more half naked Crowe after this. If your interest in this movie is purely to perve, then you may as well turn it off after the creek scene. On a more positive note; some shots of the Australian alps were beautiful and the sound track was very fitting to the mystical atmosphere which the movie was trying to create. The horse chase sequence in the end had me in fits of laughter however, as it lasted for what felt like twenty minutes, the chorus of dramatic singing becoming more and more heightened. I was imagining people in the recording studio passing out. I agree with other comments here, that the various parts showing mother-daughter storyline seemed to be a little out of place and at times didn't quite tie with what the story was trying to communicate. Their dialogue (not the overall narration), seemed to provide a very inadequate kind of commentary which cheapened or completely missed what it was essentially about. I couldn't help but remember while watching this movie that horses are not native to Australia and are actually quite damaging to Australian ecosystems. I couldn't help but feel how unnatural their presence was. Towards the end I actually wanted \"The Man\" to catch the Silver Brumby and stop it from producing any more damaging offspring. Another thing - if this horse has the ability to conjure storms and highly precise lightening bolts at whim, could it not have struck down both the enemy \"Brolga\" horse AND \"The Man\"? The camera work was pretty good, apart from one shot where Crowe is laughing manically, which was zoomed in so far you can actually see one of his fillings. Crowe did a terrific job of course, it was not his fault that the people who did the story board for this movie were amateurs. Overall, it is a sweet though slow moving movie, which younger viewers and horses lovers should watch - not the best for Crowe perving however, for that I heartily recommend one of my favourite movies - \"The Sum of Us\".",
         "Unlike the other reviewers (it appears), I came to this movie after a long love affair with the original story*. I borrowed 'The Silver Brumby' off of a friends mother as a child, and read it six times through before handing it back. It is one of those stories that just captures the heart and the imagination, and is truly an Australian classic. I was 12yo when the movie was released. Now, 11 years and many viewings later, I feel a little melancholy that while they did a wonderful job, they may have just missed the mark in some aspects. The subplot of Elyne Mitchell and her daughter Indi was never in the book, and I do feel it was ultimately unnecessary and more often than not disrupted the movies flow. The 'Man' was portrayed as to hard, almost possessed. True he was fairly obsessed by Thowra, but he also greatly respected him, and the bush in general. I also missed Storm, Thowra's bay half brother, who was such a large part in the story and a personal favourite of mine. It was bordering on being a bit sugary at times as well. On the other hand some scenes were just about perfect, like the pages of the book come to life before my eyes, and for that I'm very thankful. The soundtrack also is beautiful, and particularly haunting during the final chase. There are other small changes that seem unnecessary to me, such as the blending of Golden's owner and 'the man on the black horse' into one person when in the book they were separate people, but I suppose they thought that children would get confused (a common, and often wrong, assumption from my experience) so they strove to simplify it as much as possible. Ultimately I feel that the story was simplified too much, therefore losing some of the depth and power of the original. Over all the visuals were about perfect, the story surprisingly close to the original for a lot of it (unlike many other book to movie adaptations), the sense of magic and mystery quite well portrayed. You could really feel that the bush was almost a character in it's own right. After 11 years I still thoroughly enjoy watching it (unlike the total travesty of the cartoon series released in the late 90's which was mildly horrendous even by young children's cartoon standards). As a book to movie adaptation I give it 5 out of 10. As a movie in it's own right, 7 1/2 out of 10. *I'd urge any child, or adult who still loves a tales full of wonder, joy and excitement, to seek out the source material. There are 6 books in the original series, written from 1958 to 1973. 1. 'The Silver Brumby', 2. 'Silver Brumby's Daughter', 3. 'Silver Brumbies of the South', 4. 'Silver Brumby Kingdom', 5. 'Silver Brumby Whirlwind' and 6. 'Son of the Whirlwind'. There is also 'Moon Filly' which was written between numbers 4 & 5 and ties into the later books. From 1993 onwards she added more to the saga; 'Silver Brumby, Silver Dingo', 'Dancing Brumby', 'Brumbies of the Night', 'Dancing Brumby's Rainbow' and 'The Thousandth Brumby'. I don't think these later books quite match up to the earlier ones, but they are still most enjoyable and it is lovely to read about the later generations. Elyne Mitchell is also the author of many other books for both adults and children. I could not recommend her highly enough.",
         "I absolutely loved the movie. It was a very enjoyable and moving film to watch after the hectic pace of Christmas . The idea and the entire story was quite captivating to me, I didn't even want to stop to get a glass of water. Excellent job on all fronts. Way to go folks. The scenery and the sound track was wonderful , very believable for sure. Watched this movie with a friend and she too was very taken with the whole story line. Really makes a person want to believe in humanity and the better treatment of all of God's creatures. I also thought the voice used in the telling of the story of this movie made it very endearing and drew you into the story very much so. This film will definitely be recommended to all of my friends as a good family movie.",
         "I read everything I could as a horse-mad young girl, a wonderful pastime that never waned despite owning (at various times) some truly wonderful horses, one of whom had been taken with his dam as a foal from the high country. I was also lucky enough to visit the NSW/VIC high country several times on horseback before it was banned and having a rich colonial heritage myself made it all the more special. Elyne Mitchell's beautiful books transported me to a magical place high in the Alps with the scent of eucalyptus, horse, leather and dust that even now evokes a gentle nostalgia. You can therefore imagine my excitement when the \"Silver Brumby\" movie was released. It was going to be the culmination of years dreaming what the great Thowra actually looked like, what The Brolga and Arrow looked like and what did \"silver\" mean anyway....... To say I was disappointed with some aspects of the movie would be an understatement. \"Thowra\" turned out to be a palomino (a palomino for Gods sake - the Golden Horse of the American West) MARE. NOT a stallion. Some may say I'm nitpicking but try pulling that one in front of a heap of eagerly waiting pony club kids and see how far you get. One of the most \"awe-inspiring\" scenes was Thowra rearing and challenging The Brolga (but as a mare). The Brolga was also supposed to be ugly. Again, the way only children/young adults who have grown up around horses can appreciate, he was easily the best looking and most useful looking horse there. Surely, whoever was in charge of these things could have been a bit more astute?????? There are anecdotes of silver horses running with the brumby mobs every now and then and I can assure our American friends they're not palominos but rather a true cream and very rare. On the plus side, the cinematography was stunning, Caroline Goodall played her part to perfection and Russell Crowe (who I think is a lout) played a magnificent part. On a lighter note, does anyone know how Elyne's daughter Indi got her name and the significance of it? I do but only because I've been there......",
         "Beautifully done movie. The landscape scenes are breathtaking. The horses are all gorgeous (esp. Thowra) and the music is haunting. The scenes with the mother and daughter sometimes interrupt the flow, but it's mostly horse footage. And yes Russell Crowe is a hunk as always.",
         "King of the Silver Brumbies is the story of Thowra, the Silver Stallion. Born of the wind to powerful parents, this horse prince learns, loves and loses in the wild bush of Australia. Like Hamlet facing madness, Thowra uses intelligence to regain his family but ends up losing much more while the legend lives on. This is the main plot and storyline -- but there is a deeper message. Man's ability to adapt to his environment causes conflict and chaos in nature. His need to conquer, this gift/curse from Pandora of greed and the desire to possess, forces submission upon proud beasts and destroys the nature that should bring him peace. This battle between man and beast plays throughout the story while the message of unity with nature is pressed on. The ability to feel the messages of the trees, the soothing comfort of the wind, the healing rays of the sun is epitomized as the answer to all of man's problems. Through the power of knowledge, love of family and strength of conviction -- and overall else, faith in the world around him -- Thowra conquers his fears and finds his rightful place in the complex network of nature. Unfortunately, as is the point above, man is not a part of nature, and his greedy determination can destroy, but in the end, no one can tame the truly free. A beautifully filmed story, it takes us to the breathtaking highlands of Australia, showing us the raw forces of its landscapes, skies and inhabitants. Also well acted by veterans Caroline Goodall of Shindler's List and a younger, very handsome if somewhat typical Russell Crowe of Gladiator fame. Mr. Crowe seems well in his element, accent and all. One can tell straight-off -- this is his territory. Ms. Goodall does a superb job of immortalizing Thowra's spirit with dignity and respect. Overall a wonderful story for children 8+ (especially girls with a love of horses) and those lucky individuals who happen to be young at heart.",
         "Well being a horse addict, i have always enjoyed movies about them. Being an Australian horse addict i have always known about the Silver Brumby. So i have always looked out for movies about them. I was introduced to the Silver Brumby via The Animated series of it, witch was okay when i was 6, but a bit young for me now, so i found the movie. I bought the movie for the horses, not for the perving on Russel Crowe. If you ask me i found the ending a bit rushed, with the horse chase, then Thowra jumping into the ravine, then the narrator saying whether or not he actually lived. But that is just my opinion. My favorite horse from the movie was undoubtedly Thowra, with his (or really her) beautiful palomino coat. Palomino is my favorite horse colour. I thought the soundtrack and scenery were beautiful, and i actually got to visit it the Victoria Alps earlier this year. But all in all this is a great movie for horse lovers all over the world, not just for the ones here."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Film Victoria",
         "Media World"
      ],
      "summaries": ["A mother tells her daughter a fable about the prince of the brumbies, brumby being a term for the feral horses of Australia, who must find its place among its kind, while one man makes it his mission to capture it and tame it."],
      "budget": 0
   },
   "movielensId": 71276,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-16",
      "dvdReleaseDate": null,
      "directors": ["John Tatoulis"],
      "runtime": 93,
      "movieId": 71276,
      "title": "The Silver Stallion",
      "mpaa": null,
      "actors": [
         "Russell Crowe",
         "Caroline Goodall",
         "Amiel Daemion",
         "Johnny Raaen",
         "Buddy Tyson",
         "Graeme Fullgrabe",
         "Gary Amos",
         "Murray Chesson"
      ],
      "imdbMovieId": "0108137",
      "originalTitle": "The Silver Stallion",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Australian adaptation of Elyne Mitchell's \"The silver Brumby\".",
      "tmdbMovieId": 43757,
      "avgRating": 4,
      "releaseYear": "1993",
      "numRatings": 3,
      "posterPath": "/rkcYteAua7NVH8sRnSMBD4QqixE.jpg"
   }
}