{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0047582",
      "video": false,
      "title": "3 Ring Circus",
      "recommendations": [
         39015,
         42305,
         15787,
         35188
      ],
      "backdrop_path": "/doxIiVSZWQBDHKMgjq9PK7C7yMK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter 'Pete' Nelson",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e09340f",
               "name": "Dean Martin",
               "profile_path": "/jSKT0dtqCaCFccga7bweuwYXQI8.jpg",
               "id": 4299,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jerome F. 'Jerry' Hotchkiss",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093413",
               "name": "Jerry Lewis",
               "profile_path": "/6RmgMdUxRPm2dZnTyRD4r0c6z3M.jpg",
               "id": 3663,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jill Brent",
               "gender": 1,
               "credit_id": "52fe467cc3a368484e093417",
               "name": "Joanne Dru",
               "profile_path": "/f2Zi7xK4mOdQiTkSzIRaAAY7DhS.jpg",
               "id": 30296,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Saadia",
               "gender": 1,
               "credit_id": "52fe467cc3a368484e09341b",
               "name": "Zsa Zsa Gábor",
               "profile_path": "/spsHbBoqF6aeLhqjYvsgvL5EBMp.jpg",
               "id": 44715,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sam Morley",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e09341f",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "The Bearded Lady",
               "gender": 1,
               "credit_id": "582b88bd9251417b180483c5",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Colonel Fritz Schlitz, Lion Tamer",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093423",
               "name": "Sig Ruman",
               "profile_path": "/k6w5OsiP6ijrBDACgVn9CzzMri4.jpg",
               "id": 2497,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Timmy",
               "gender": 2,
               "credit_id": "582b88ae9251417b2104750a",
               "name": "Nick Cravat",
               "profile_path": "/xZ1QfYvzOgZhiEqWryIxT0daQoi.jpg",
               "id": 69934,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Custard Pie Gag Victim",
               "gender": 1,
               "credit_id": "582b88f0c3a368360b04d3a4",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Jimmy the Crow",
               "gender": 0,
               "credit_id": "55b44a68c3a3683002013244",
               "name": "Jimmy the Crow",
               "profile_path": null,
               "id": 1468743,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093429",
               "name": "Joseph Pevney",
               "profile_path": "/shNmqaOUHun2YYju9qyI010uFmB.jpg",
               "id": 15705,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5ac384c192514126be035ea9",
               "name": "Don McGuire",
               "profile_path": "/uCDwCsJDGvpOFFmU9da4ksSMZUn.jpg",
               "id": 58093,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac384ce9251412712035a5d",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac384d7c3a3682d1a033d9a",
               "name": "Walter Scharf",
               "profile_path": null,
               "id": 3375,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5ac384de9251416015072b43",
               "name": "Loyal Griggs",
               "profile_path": null,
               "id": 24793,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ac384efc3a3682d6603c6c9",
               "name": "Warren Low",
               "profile_path": null,
               "id": 18595,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac384f8c3a3682d350364a1",
               "name": "Hal Pereira",
               "profile_path": null,
               "id": 5188,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5ac384ff0e0a264a4e07c38e",
               "name": "Tambi Larsen",
               "profile_path": null,
               "id": 74692,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.967709,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62396,
      "vote_count": 6,
      "budget": 0,
      "overview": "Jerry and Pete are two friends with no money and are looking for a job. They finally find employment working in a circus, but Jerry has different dreams. He wants to become a clown...",
      "similar": [],
      "original_title": "3 Ring Circus",
      "runtime": 103,
      "poster_path": "/cPJjePjts55iwFEKJP1HLopw7HF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1954-12-22",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Tame a lion. Get shot out of a cannon. Wash an elephant. Jerrico will do anything to become a circus clown.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph Pevney"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Don McGuire"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047582/",
      "coverLink": null,
      "actors": ["Stars: Dean Martin, Jerry Lewis, Joanne Dru | See full cast and crew »"],
      "reviews": [
         "There are some strange echoes of the real life bust up between Martin and Lewis in the script. It's saddled with Jerry's sincere but misguided belief that he is a natural clown and screen heir to Emmett Kelly, who's makeup he closely resembles in some scenes, imitation being flattery I guess. The buddies, newly discharged from the army and penniless head for the circus where Jerry, longing to become a clown instead has to apply to be a trainee lion tamer (as if..) the usual water squirting elephants and disgruntled, drunken clown lead us to the quease-inducing finale when Jerry as the clown succeeds in making a sad little girl (in leg irons, yet)smile at his tears. For 1954 audiences I'm sure it was a pleasure break from post war blues but it's well past it's sell by date. TRIVIA: Unless I'm much mistaken the sequence where Dean Martin does acrobatics on some low bars is doubled by Nick Cravat who appears elsewhere in the film and was an acrobatic partner of Burt Lancaster.",
         "This is another Martin & Lewis movie I watched on YouTube. Like one of their previous films-The Stooge-there's some drama mixed in with the by-now familiar comedy associated with the team especially Jerry whenever he gets excited about something. But while I thought it was a mistake in The Stooge to have Lewis seem to still act naive most of the time, here he believably becomes a bit smarter as the narrative goes on. Also, since he does calm down here, he reverts to his natural voice whenever that happens which also contributes to a more natural mix of comedy and drama. It's also refreshing to see Dean be more of a supporter for Jer instead of occasionally treating him like dirt like in The Caddy. Likewise for when that does happen, it doesn't happen for long. He has two leading ladies this time: Zsa Zsa Gabor as the egotistical trapeze artist, and Joanne Dru as the circus owner who he calls \"Boss Lady\". Both are adequate enough in their roles. Then there's Gene Sheldon as the alcoholic star clown who Jerry seems to idolize despite his treatment by him. It's a good enough dramatic performance for him. Like I said, there are some expected outrageously hilarious comical scenes like when Jer has to tame some lions or when he convinces The Bearded Lady (Elsa Lanchester) to let him shave her. But this was also one of the more sentimental of M & L's movies as evidenced by the finale when Lewis in his clown makeup tries to cheer up a sad little girl in the audience. So on that note, I recommend 3 Ring Circus. P.S. Watch for occasional Lewis regular Kathleen Freeman as a victim of a custard.",
         "As some of you may be aware, I’m no longer that much of a fan of Jerry Lewis – though I did acquire the Paramount 10-disc set of his vehicles recently; growing up I watched a number of them (and also a lot of his teamings with Dean Martin) on Italian TV – and, not having checked out the latter in ages, I was wondering how they held up. Since I can easily lay my hands on the films released on DVD, I opted to give another look to one which, for some reason, has yet to appear on the format and which had certainly been among the first I became acquainted with all those years ago. I’ve watched scores of films over the years set inside a circus (and should be getting to one more, THE BIG CIRCUS [1959], presently); many comic stars had tried their hand at this exciting and evocative milieu – so it was natural for Lewis (and Martin) to get in on the act as well. Jerry, of course, wants to be a clown but has to go through the ropes first – therefore, we see him as a lion-tamer(!) and, with Martin in tow, sweeping the tents, washing the elephants and as an ice-cream vendor, etc. – inadvertently, he even does a tightrope routine on a bike(!). Soon enough, his antics are getting more laughs than those of the company’s star clown who, naturally, is jealous of all this attention – thus becoming mean in Jerry’s regard, and is generally so soused that he becomes unfit for work! Another clichéd turn-of-events is the fact that the circus (owned by Joanne Dru) would be impoverished if it weren’t for a star attraction in the form of trapeze artist Zsa Zsa Gabor; for this reason, she acts like a diva and, worse for Dru (who, surprise surprise, is attracted to Martin), holds him under her thumb! Helping Dru out is old-timer Wallace Ford – who purports to give the boys a hard time but, predictably, emerges to have a heart of gold underneath; also on hand are Sig Ruman as the veteran lion-tamer and Elsa Lanchester as The Bearded Lady! Martin (and Lewis) gets to sing a couple of resistible tunes, one of them to a bunch of caged animals!; the soundtrack, then, includes his hit from the previous year “That’s Amore” (first heard in THE CADDY [1953]) and the Paramount standard “Lover” (from the superb Maurice Chevalier/Jeanette MacDonald musical LOVE ME TONIGHT [1932]). Anyway, at the bat of an eyelid, Lewis is awarded the spotlight of star clown (without having really demonstrated any outstanding comedic skills), while Martin – who introduces a spot of gambling to aid the circus – takes over the joint when Dru decides to call it a day. Eventually, Lewis and Martin also quarrel over the circus’ customary show at an orphanage – which Dru returns to compere…but, all’s well that ends well, as Dino has a change of heart and turns up to sing for the finale (following Jerry’s attempts to put a smile on a crippled girl’s face). As can be seen, the formula is typical Martin & Lewis: songs, girls, sentiment and Lewis’ love-it-or-hate-it shtick; if anything, it’s certainly colorful and mildly entertaining along the way – but hardly a classic of screen comedy and, while clearly a popular title in the Lewis canon because he gets to don the clown make-up (the film, in fact, was re-issued in a shortened version entitled JERRICO, THE WONDER CLOWN!), not one of the better outings from the team.",
         "Dean and Jerry are more relaxed in this film than in previous efforts. The comedy is also milder. It is also the first time Jerry indulges in his sentimental clown shtick. Hello, telethon Jerry! Dean has absolutely nothing to do in the film. He plays his usual heel character, but there is absolutely no depth to it. And where are the musical numbers? Only the woefully unfunny \"That's My Boy\" has less in the way of music! Dean and Jerry get to do one new number, \"Puncinello\", and Dean sings the standard \"It's a Big, Wide Wonderful World\" to a bunch of animals! (Hugh Shannon, the wonderful jazz singer-pianist who is most identified with this song, must have had a good laugh from Dean's version.) Dean has no ballads and hardly any screen time with his leading lady, Joanne Dru. It's all about Jerry, not silly, lovable Jerry, but a telethon Jerry, trying to become a clown. Actually, the film is quite amusing and heartwarming, but it's not Martin and Lewis. I do not know if Twenty-first Century youngsters would find this amusing, but I did when I was a kid. It is more endearing than \"That's My Boy\" and most of the solo Lewis films. It may be a bit slow for today's kids.",
         "Jerry Lewis plays Jerome F. 'Jerry' Hotchkiss and Dean Martin is Peter 'Pete' Nelson, two friends who find work at the circus.Jerry's dream is to become a master clown, which he did become in real life.Joseph Pevney's 3 Ring Circus offers something for the Martin and Lewis fans they're asking for.Jerry is as zany and funny as always and Dean is as smooth and wonderful as he ever was.There are also stars like Kathleen Freeman and Zza Zza Gabor in the movie.I saw this movie in 1998 and I would like to see it again, as I would like to see a bunch of other Jerry Lewis films.This is the day when Jerry Lewis turns 80 years old.He still hasn't fully retired.On IMDb it said he's making a cameo in a movie called Horrorween, which comes out next year.He also wrote a book called Dean and Me: A Love Story.You should all read it.I sure would if only I could find it from this country.This grand old man has made so many people laugh over the years that all I can say to him is thank you.Laughter is something we all need these days.",
         "This must have been a tough film for Dean Martin to make. After all, his character is a bit of a jerk and he garners so sympathy or love from the audience in this one. As for Jerry, he is an oddball in this one--not bad at all, but also not exactly funny. Instead, he's amusing and it's nice to see him take on a lot of different jobs at the circus. When the film begins, Pete (Dean) and Jerry (Jerry) are leaving the army. They have no prospects and are mostly just concerned with getting a free meal when they wander into a circus. But Jerry would love to one day be a clown--but en route he tries his hand at lion taming, tightrope walking and even getting fired out of a giant cannon! As for the unlikable Pete, he's a schemer and loves it when the circus' resident prima donna (Zha Zha Gabor) falls for him--as he is allow to loaf about and not get fired because he's her boy- toy. Later, as Pete takes on more and more responsibilities with running the circus, he begins to act like it's his and is a pretty obnoxious guy--so much so that his pal, Jerry, becomes rather disillusioned with him. Does this sound like a comedy? No...well you get the picture. It has some sweet moments and Jerry gets to do quite a bit--but Dean is in a thankless role as the film lumbers along. Certainly not one of their better films since the chemistry that made the team enjoyable is a bit lacking.",
         "3 Ring Circus was not a film Dean Martin cared to remember. Apparently this was a film that Jerry Lewis wanted to make because he got to play a circus clown. Dean had very little to do here, he only got one solo song though it's a good one. Nick Tosches fine biography of Dean Martin says that Jerry ran the film, including picking the director Joseph Pevney. It was the first time that real tension was rather public between the team. Dino and Jerry play a pair of newly discharged veterans who pick up jobs in a circus. Jerry is placed as a lion tamer's assistant and he has a marvelous scene with Sig Ruman as a rather inpatient lion tamer. Trying to teach Jerry the trade would be enough to drive anyone crazy. But Jerry is actually correct in his reasoning that if he just hires on with the circus, sooner or later his talents as a clown will shine through. Though he drives owners Wallace Ford and Joanne Dru wacky with his antics, he becomes a marvelous clown. That's a profession you are born to, either your funny or you're not. My favorite scene with him is Jerry trying to hand the aerial cyclist his unicycle and then getting caught on the high wire with it. On the other hand Dino is caught between Joanne Dru and the star attraction of the show, trapeze artist Zsa Zsa Gabor. Gabor is also jealous when Lewis gets to be the real star of the show. I think you can figure out how all this ends. Dean and Jerry do a song written for the film Hey Punchinello by Paramount contract songwriters Jay Livingston and Ray Evans. But Dean's one and only solo was the interpolated classic, It's A Big Wide Wonderful World. For reasons I don't understand he made no record of this so the only place you'll hear him is in 3 Ring Circus. The song was introduced by Buddy Clark in the Forties and it fits Dean's style perfectly. Other than that song, this film was strictly Jerry's show with Dean only in support. No wonder tension flared."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["Jerry and Pete are two friends with no money, looking for some job. They finally find one as workers in a circus, but Jerry has different dreams. He wants to become a clown."],
      "budget": 0
   },
   "movielensId": 71402,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-12-22",
      "dvdReleaseDate": null,
      "directors": ["Joseph Pevney"],
      "runtime": 103,
      "movieId": 71402,
      "title": "3 Ring Circus",
      "mpaa": "",
      "actors": [
         "Dean Martin",
         "Jerry Lewis",
         "Joanne Dru",
         "Zsa Zsa Gábor",
         "Wallace Ford",
         "Elsa Lanchester",
         "Sig Ruman",
         "Nick Cravat",
         "Kathleen Freeman",
         "Jimmy the Crow"
      ],
      "imdbMovieId": "0047582",
      "originalTitle": "3 Ring Circus",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jerry and Pete are two friends with no money and are looking for a job. They finally find employment working in a circus, but Jerry has different dreams. He wants to become a clown...",
      "tmdbMovieId": 62396,
      "avgRating": 2.5,
      "releaseYear": "1954",
      "numRatings": 5,
      "posterPath": "/cPJjePjts55iwFEKJP1HLopw7HF.jpg"
   }
}