{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "age difference",
            "id": 965
         },
         {
            "name": "ladykiller",
            "id": 2336
         },
         {
            "name": "playwright",
            "id": 10965
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "hamptons",
            "id": 214822
         }
      ],
      "imdb_id": "tt0337741",
      "video": false,
      "title": "Something's Gotta Give",
      "recommendations": [
         2898,
         22897,
         2642,
         4806,
         2755,
         11846,
         858,
         3981,
         9489,
         8874,
         1901,
         1921,
         11860,
         795,
         10678,
         7300,
         11529,
         9506,
         11775,
         2925
      ],
      "backdrop_path": "/lXRDlPVo9A0cy2tay2fy4faFuVC.jpg",
      "revenue": 266728738,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Sanborn",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094fc7",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Erica Barry",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fcb",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julian Mercer",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094fcf",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fd3",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Marin",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fd7",
               "name": "Amanda Peet",
               "profile_path": "/81KzrntoeEztNpfhCYNgfOtI3kU.jpg",
               "id": 2956,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Leo",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094fe7",
               "name": "Jon Favreau",
               "profile_path": "/sJSGJwGa3hjMlJNUCxF7wQwo7fb.jpg",
               "id": 15277,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094feb",
               "name": "Paul Michael Glaser",
               "profile_path": "/yc39Cj9ZmaEnrKZIRnYLPAdDyCK.jpg",
               "id": 12988,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dr. Martinez",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fef",
               "name": "Rachel Ticotin",
               "profile_path": "/kNuwcSAqFHdJACiHqJJgEEfvLko.jpg",
               "id": 10768,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Kristen",
               "gender": 1,
               "credit_id": "55a8e3dac3a36830020032b3",
               "name": "KaDee Strickland",
               "profile_path": "/9E0EFvaAY0vVubogVfFtXH1LAXe.jpg",
               "id": 20388,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Hamptons Nurse",
               "gender": 1,
               "credit_id": "56c110c9c3a36817f400d8d4",
               "name": "Robin Pearson Rose",
               "profile_path": "/uXxSDUE8E54UyB2N6xuutxYl67K.jpg",
               "id": 1228874,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Lady in Market",
               "gender": 1,
               "credit_id": "571a5425925141715d001840",
               "name": "Connie Sawyer",
               "profile_path": "/zQJPnBNNw9nkhdLVcqwR1vB5H7H.jpg",
               "id": 116727,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fdd",
               "name": "Nancy Meyers",
               "profile_path": "/nMPHU06dnvVxEjjcnPCPUQgQ2Mp.jpg",
               "id": 17698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094fe3",
               "name": "Nancy Meyers",
               "profile_path": "/nMPHU06dnvVxEjjcnPCPUQgQ2Mp.jpg",
               "id": 17698,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094ff5",
               "name": "Nancy Meyers",
               "profile_path": "/nMPHU06dnvVxEjjcnPCPUQgQ2Mp.jpg",
               "id": 17698,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094ffb",
               "name": "Bruce A. Block",
               "profile_path": null,
               "id": 17699,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "548200699251416e7800666d",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56bfa1b4c3a36817ef009d32",
               "name": "Adam Levine",
               "profile_path": "/oHNBWCQRBlcEHKuRpID9lRQNMej.jpg",
               "id": 217371,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "594e4c789251413108036bb2",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.07392,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6964,
      "vote_count": 526,
      "budget": 80000000,
      "overview": "Harry Sanborn is an aged music industry exec with a fondness for younger women like Marin, his latest trophy girlfriend. Things get a little awkward when Harry suffers a heart attack at the home of Marin's mother, Erica. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
      "similar": [
         258480,
         112160,
         858,
         141,
         153,
         634,
         437557,
         242224,
         24684,
         43923,
         19265,
         297762,
         2142,
         2196,
         9583,
         27586,
         2771,
         9587,
         80038,
         3134
      ],
      "original_title": "Something's Gotta Give",
      "runtime": 128,
      "poster_path": "/q1DO4rwTGz1VSX2sEqqboPwsXUF.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Waverly Films",
            "id": 735,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2003-12-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Schmucks are people too.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nancy Meyers"],
      "runtime": 128,
      "synopsis": "Harry Sanborn (Jack Nicholson) is a wealthy New York businessman who has had a habit of dating women under 30 for 40 years. When he and his latest conquest, Marin Barry (Amanda Peet), drive to her mother's Hamptons beach house on the coast, his life turns upside down. Expecting to be alone, Harry and Marin are surprised by Marin's mother, successful playwright Erica Barry (Diane Keaton), and her sister Zoe (Frances McDormand). After an awkward dinner, the night turns disastrous when during foreplay with Marin Harry has a heart attack and is rushed to a hospital. The handsome young doctor, Julian Mercer (Keanu Reeves), tells Harry to stay in the area for a few days, and so Harry ends up staying with Erica. Their differing personalities initially make for awkward living arrangements, until the two begin to get to know each other. Soon, the two have fallen in love, they live very different lifestyles Erica's determination to be single and independent, and Harry's constant desire for new women and experiences combined with the fact that Harry is dating Marin and Julian has fallen for Erica, leave the two struggling to deal with their current relationships with others, but also work on their own. Marin soon breaks up with Harry after she suspects that he's in love with her mother. The break up is not out of anger, but rather she wants her mother to be able to have a relationship with him and for her own life to move on. Harry and Erica spend more time together and the relationship they have with each other gets even more serious. Harry's improving health means that he no longer has to stay with Erica, and in a very awkward decision, he heads home. Meanwhile, Marin receives news that her father, Erica's ex-husband who she still allows to direct her plays, is getting remarried. Although Erica is unaffected by the news, Marin is devastated, exhibiting self-centered behavior which implies that she is the only one this concerns. She pressures her mother into going to dinner with Marin to see her ex-husband and his new fiancée. At dinner, Erica is the life of the party until she sees Harry at another table with another woman, and is crushed, because she realizes that she still loves him. Harry spots Erica and tries to convince her that the woman was just a friend and that they weren't in a relationship. In the argument that follows, Harry suffers from what he believes is another heart attack and is rushed to the hospital where he is told that it is only a panic attack but he must rest if he doesn't want to end up in the hospital every week. The female doctor tells him that if he was her 'Dad' she would not want him out alone so soon after a heart attack, clearly emphasizing his age. Harry goes home in an attempt to get some rest. Erica, on the other hand, also goes back home and breaks down into tears. Although she is heartbroken, she figures that the events that are happening in her own life would be great to use in a play, and thus she starts to write a play on the whole experience. While at lunch with a friend, presumably an actress, Harry hears her ramble about a new play that she is auditioning for and starts to summarize it while explaining how funny it is. Harry nearly chokes when he realizes the play is about him and rushes to the stage where it is being rehearsed, and sees Erica. They don't manage to heal the wounds that have been made and Erica tells Harry to get on with life. The story then opens up six months later in Paris where Erica is spending her birthday with her new boyfriend, Julian, whom she met when Harry had his first episode. Harry shows up to the restaurant where she is eating because of an agreement they made earlier, that they'd spend their birthdays (Erica in January, Harry in February) together in Paris. Harry and Erica are extremely happy to see each other and once again realize how much they love each other. Erica's boyfriend interrupts when he enters the restaurant a little late. They never have time to really tell each other their true feelings until hours after the dinner. While Harry is gazing over the Seine in the Paris night, Erica pulls up in a taxi. She gets out and explains to Harry that Julian figured that they both still loved each other. Harry and Erica kiss and it's assumed that they get married. The movie resumes about one year and a half later at another restaurant in New York. Erica and Harry are eating out with Marin and her new husband with their year old daughter.",
      "writers": ["Nancy Meyers"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0337741/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NTExMjk2Nl5BMl5BanBnXkFtZTcwOTQ0NTUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Nicholson, Diane Keaton, Keanu Reeves | See full cast and crew »"],
      "reviews": [
         "Diane Keaton gives the performance of her career in 'Something's Gotta Give,' writer/director Nancy Meyers' smart and savvy take on middle-age romance. Keaton plays Erica Barry, a 50-something playwright living on her own in a swanky beach house in the Hamptons. Although she has achieved enormous success in her career, her personal life leaves much to be desired. Erica, though brilliant and attractive, has pretty much shut herself off from the dating scene since her divorce a number of years ago. Erica's life runs like a well-oiled machine, with each element \u0096 both personal and professional - fitted neatly into place, with no room left over for spontaneity or passion. One fateful day, Erica stumbles upon a strange man rummaging through her refrigerator, a 63 year-old professional bachelor named Harry Sanborn who, Erica discovers to her horror, is dating her 30 year-old daughter, Marin (Harry is, actually, a notorious bachelor, having been profiled as such in a number of tony New York magazines). Even though Erica is disgusted by the situation, she is forced to take care of Harry after he suffers a heart attack while staying at her place. Despite their diametrically opposed outlooks on love and romance, Erica and Harry spend quality time together, discover their ultimate compatibility, and eventually fall in love. Meyers has written a witty, sophisticated screenplay that offers insights into any number of 'battle of the sexes' issues. She has outrageous fun exploring the phenomenon of middle-aged men cavorting with women half their age. Jack Nicholson, known in real life for doing just that, has a great time poking fun at his own public image while, at the same time, providing a richly textured portrait of a man who may not be quite as shallow as his persona would suggest. When he so unexpectedly finds his head turned by a vibrant, attractive and intelligent woman in her 50's, Harry, a middle-aged Lothario who finds he needs Viagra to help him keep pace with his youthful 'conquests,' is forced to re-evaluate what has hitherto been the defining philosophy of his personality and lifestyle. Nicholson is magnificent at showing us the profound confusion his character undergoes as he takes those much belated but faltering steps into adult maturity. Nicholson is, however, only one half of this extraordinary couple. As the other half, Keaton, having been handed what is clearly the role of a lifetime, has never seemed so natural and self-assured on screen. She makes of the character a capable, no-nonsense woman who has allowed her passions to lie dormant far too long. Though, on the surface, she appears confident and in control of her life, Erica is, underneath it all, a woman wounded by past experience and intimidated by a culture that expects women to be put out to pasture the moment they reach middle age. It is this combination of strength and vulnerability that makes Erica such a complex, recognizable individual \u0096 and it is the very quality that Keaton captures so exquisitely in her performance. The chemistry generated between Keaton and Nicholson in this film is so glowing and palpable one wonders why no filmmaker ever saw the potential of this dynamic duo until now. In addition to these two outstanding performers, the film boasts excellent supporting work from Frances McDormand as Erica's pragmatic, clear-headed sister; Amanda Peet as Erica's level-headed daughter; and Keanu Reeves as Harry's handsome young doctor who finds himself smitten by Erica's mature beauty and charm. 'Something's Gotta Give' is that rare romantic comedy that not only acknowledges the romantic inclinations of people over forty, but also recognizes the emotional complexities of their relationships. Because both Erica and Harry have been around the block a few times, they bring a lifetime of baggage to their burgeoning attachment. Thus, unlike in the vast majority of romantic comedies, which are clearly geared to the younger generation, the lovers here have a depth not often encountered when the focus is on two inexperienced neophytes. It takes the experience that comes from living to make a person interesting, after all. Thanks to the quality of the writing and the performances, 'Something's Gotta Give' takes its place among the great romantic comedy/dramas like 'Two For the Road,' 'Annie Hall,' 'When Harry Met Sally' and 'The American President.' That's mighty august company indeed.",
         "Hollywood has never been very kind to aging couples. If you count a ratio of the movies that have been made with actors in their prime and put them side by side with movies where the same actors are reaching 50, 60, or even 70, you'd be hard-pressed to find more than a smattering over a decade's time. And to sell a romantic comedy above all to a youth-obsessed public wanting to see the inevitable tight curves on the female lead's body and the rippled muscles on the male's, where instead there are none, is a gamble that would surely signal a train wreck by default. Surprisingly enough, this one's a winner. While the story may not be the most original of all -- serial dater finds the perfect woman as a headstrong woman close to his age but loses her to his dating habits, then realizes he really does care for her after all -- is really a variation of boy-meets girl, loses girl, regains girl: with the exception that this time around, the boy is Jack Nicholson, the girl is Diane Keaton, and neither are under 55. To do a movie that has these two exceptionally mannered (but no less veteran) actors play parts that could have easily veered off into caricatures is a hard trick to pull off and thankfully the script (and their acting) is always on target to make us never forget these are real people and not their public persona. Nicholson especially has the harder part here -- his role is so close to life he could have sleepwalked through it -- but he brings a genuine humanity to what is initially a sitcom-like old lecher who can't date women older than 25. Keaton also has a difficult role because she's been known to play variations of Annie Hall, but here she lays herself bare (in more ways than one). To see her interact with Nicholson and see them play out their initial dislike, their cautious flirtation which becomes actual attraction, and see what happens to both of them once Nicholson chickens out to go back to philandering is what romantic comedies are made of. It's a great set-up, even when the pay off is a little too pat for comfort at times and seems somewhat manipulative. There were moments when I wondered what kind of a story SOMETHING'S GOTTA GIVE would have been had it decided on bringing Keanu Reeve's character into the front and having him being her choice, but this being a conventional script, it of course decides to have Nicholson win her back in the most traditional of ways with nary a conflict, but this doesn't detract much from the film as much as tell a good chick-flick with an emotional center. Some nice supporting roles here: Reeves plays a character totally different from his MATRIX or CONSTANTINE roles, Rachel Ticotin holds her own as the doctor whom Nicholson keeps bumping into every time his heart goes bonkers, and Amanda Peet continues to prove herself as the rising star she is becoming. Frances McDormand has fun with a small part as Keaton's sister. As a note: for a movie set in the Hampton's, NY, those were some pretty interesting looking palm trees.",
         "I generally dislike Jack Nicholson, although I certainly think he is a very talented and gifted actor... so I watched this movie somewhat reluctantly on the recommendation of a friend. To my surprise, I liked it. I too am a woman \"of a certain age\" and I found myself responding to this movie very much in the context of a woman Diane Keaton's age. I laughed to tears over her creativity surge-- she very accurately portrayed that kind of grief over a relationship lost... amazing! I must say however, that if I were in a position to choose between Keannu Reeves and Jack Nicholson.. well there's no decision to make--the young stud muffin would win in a heartbeat!...(although Jack really was quite charming once he got over being such a putz).. Anyway.. a fun movie that is well done...",
         "Of the many things I like about going to the movies there are two experiences that always stand out more than others. The first is going to see a film that you have so-so expectations for and finding out that it is not only better than expected, but very good indeed. The second is going to see a film you have high expectations for and not being disappointed. Something's Gotta Give falls squarely into the second category. Sometimes when legendary stars are teamed up in a film, the result is often less than passable. Not so with this film, thanks to a sharp-witted script and direction by Nancy Meyers, two great stars in Diane Keaton and Jack Nicholson who click wonderfully together on screen and an excellent supporting cast that includes Keanu Reeves, Amanda Peet and Frances McDormand. This is a romantic comedy that is funny when it's meant to be, insightful when it needs to be, and filled with many sincere and touching moments. Harry Sanborn (Nicholson), the over-age playboy who has spent his entire life avoiding serious commitments, is set to spend the weekend with his flavor of the moment girlfriend, Marin(Amanda Peet), at a beach house owned by Marin's mother. Unfortunately for Harry and Marin, Marin's mother Erica Barry(Diane Keaton), who is a famous playwright, shows up for the weekend also with her sister Zoe(Frances McDormand). Of course Erica doesn't quite know how to deal with the fact that her daughter is dating and possibly sleeping with a man of Harry's reputation and age leading to some very funny dialog between Harry, Erica and Zoe that rings mounds of truth. It's these early scenes in the film that sets the pace, grabs your attention, then never lets you go. Later, when beginning to get it on with Marin, Harry suffers a heart attack. Now I know having a heart attack is not supposed to be particularly funny, but in this case it's some of the many many hilarious scenes that rock throughout Something's Gotta Give. When Harry is taken to the hospital, we meet Dr. Julian Mercer (Keanu Reeves), who happens to be a great admire of Erica's plays and quickly develops a crush on her. Of course, plot manipulations being what they are, Harry ends up recuperating alone in Erica's beach house. Everything that happens from that point on speaks volumes about love, aging, and especially how men and women are viewed differently as they grow older. I can't say enough here about Diane Keaton's performance in this film. For all the dramatic roles she has played, she once again proves how truly versatile she is with this very touching yet truly comedic role. Jack Nicholson as Harry Sanborn, is equally perfect also. He manages to take a character that we should absolutely loathe for his shallow behavior and make him not only likable but gives him depth as well. It is perhaps his best comedic role ever. Keanu Reeves in a less flashy role, shines as the young Doctor. We believe in his sincere admiration for Erica and he manages to pull it off by making us believe this is not just a school boy type crush. For some brief but very funny moments, Frances McDormand deserves our praise also. Nancy Meyers has shown great promise as a director with the OK efforts of The Parent Trap and What Women Want. As a writer she has had some fine moments with Irreconcilable Differences, Baby Boom and Father of the Bride. With Something's Gotta Give, she puts the pieces of the puzzle together for some first class entertainment. You won't be disappointed. My Grade: A+",
         "Romance among the AARP set in a movie is never an easy proposition, pardon the pun. The participants have to be sexy enough that the younger people in the audience don't get all grossed out (\"Gramma and Granpa are KISSING!!! With tongue!!!!\"), but not too sexy. The audience wants to be swept off its feet, but it doesn't want anything that's overly salacious. For the most part, writer-director Nancy Meyers succeeds here. Diane Keaton plays Erica Barry, a neurotic, highly successful playwright. Jack Nicholson plays himself. Okay, technically he plays 63-year-old Harry Sanborn, owner of a hip-hop record label and chronic womanizer. One of the funniest scenes in the movie comes right near the beginning. Harry's with his new squeeze Marin (Amanda Peet), at Marin's mom's house. There's Harry, in his boxers and a t-shirt, putting wine in the 'fridge, when Marin's mom - you guessed it, Erica - unexpectedly comes home. Naturally, she thinks he's an intruder and calls 911. I mean, wouldn't you? It takes some explaining, but soon the misunderstanding is cleared up and our combatants (oops, participants) can get on with the romancin'. The thrust of the story (oops, another pun) is that while fooling around with Marin upstairs, Harry suffers a heart attack. At the hospital, Dr. Mercer (an interestingly cast Keanu Reeves) admonishes the unrepentant Harry for overexerting himself and tells him not to travel for a little while. Yup, you guessed it, that means he has to bunk with Erica. And our romance is thus set up. The good news is that pairing Keaton and Nicholson (who appeared together in 1982's Reds) was a great, great idea. Keaton basically plays a grown-up Annie Hall, and she manages to look sexy and daffy at the same time. Nicholson, for all his bluster and creakiness, still has the panache that has served him so well for the past forty years or so. The trouble is that after their relationship is consummated, the two leads behave like seventh graders. Now, no offense to you seventh graders out there, but you do have a tendency to get melodramatic. Admit it. In this movie, Erica spends - no exaggeration here - a good ten minutes sobbing. And sobbing. And sobbing. Everywhere and anywhere. Yikes and double yikes. For his part, Harry broods like no one's ever brooded before, like he's up for an Olympic medal in the event of Feeling Bummed Out. After a while, you wish these two crazy kids would just get over it. Call her! Call him! Do something! To make matters worse for the relationship, Erica writes a play based on her experiences with Harry, complete with him dancing drunkenly in a hospital gown. Does this lady play hardball, or what? Granted, the storyline is predictable, but the two leads are wonderful, and very well cast. Meyers wrote the script with Keaton and Nicholson in mind specifically, the decision was a wise one. Something's Gotta Give has a funny beginning and a sweet ending, but the middle suffers from an unfortunate lag.",
         "I kept thinking, while watching this movie, \"I wish I could write a screenplay as good as this.\" Jack was Impeccable Jack. Diane was delightful and sexy and a wonderful role model for older women. Keanu showed more range than people give him credit for, and did an excellent job playing the role he was cast as - a supporting character, who is not supposed to outshine the lead roles, but rather enhance them (which he did). I was very pleased with this movie! It did have \"several endings\" which, actually, didn't detract but instead made me think, \"Well, that's closer to the reality of what might happen,\" instead of being annoyed. As Jack's character says, \"Finally, closure,\" and I was happy. It was a good movie and I liked it quite a lot. It'll be on my mind and in my thoughts for a while, which is the sign of an impactful movie.",
         "The teaming of Jack Nicholson and Diane Keaton in Warren Beatty's \"Reds\" back in 1981 was only given a minute glimpse. The glimpse though turned out to be some of the best parts of a very excellent movie. A film with these two living legends was destined for greatness and that prediction comes to reality in writer/director Nancy Meyers' \"Something's Gotta Give\". Nicholson is a brash and sometimes quietly obnoxious success from New York who has made a life out of chasing 20- and 30-something year-old girls. He and his newest girlfriend (Amanda Peet) get along really well. They decide to go out to Peet's mother's (Keaton) beach-house outside of the city to consummate their relationship. Of course just as everything looks perfect, Keaton (a noted playwright) and younger sister Frances McDormand (in another wonderful turn) barge in and spoil the fun. All seem a little uncomfortable and you can cut the tension between Nicholson and Keaton with a knife. Before you know it, Nicholson suffers a heart attack and all hell breaks loose. He is rushed to the doctor in the nick of time, but now Keaton has to nurse him back to health at her home. Nicholson's doctor (a good performance by Keanu Reeves, getting away from his stupid \"Matrix\" films) soon falls in love with Keaton who is totally oblivious to his feelings. And before you know it Keaton's warmth, smile, personality, heart and intelligence eventually wins Nicholson over as well. But you all know about Nicholson's relationships with women (in real life and the movies). Is he ready to fall in love for the first time in his life and make a true commitment? Or will his antics end up making matters worse for all involved (Keaton in particular, who becomes someone you don't want to see get hurt)? \"Something's Gotta Give\" is a film I really liked a lot. The old-time Hollywood style of the 1940s is very prevalent here in a 2000s package. Nicholson and Keaton, what can you say? They are arguably the two finest performers living today and they do end up feeding off each other's astronomical talents throughout. Sometimes something eventually gives in Hollywood these days, but I am happy to say that it never happens with this product. 4.5 out of 5 stars.",
         "This movie took me by surprise, I wasn't sure if I could handle watching old actors getting it on but this movie turned out to be a great romantic comedy. Jack Nicholson and Diane Keaton always give their 100% best in their performances, they did a great job in their roles. It would have been nice to see more input from Frances McDormand and Keanu Reeves, but otherwise I really enjoyed the movie.",
         "Perhaps it's because I'm not over 40, but I did not enjoy \"Something's Gotta Give\". I cannot fathom ever, and I mean EVER actually CHOOSING Jack over Keanu. I mean COME ON!!! So besides this movie's wildly ludicrous ending and setting it is also not a comment on what women think or feel, but what men believe they should think and feel. So I guess with that view it's hardly surprising that a lecherous fat old man who had dated her daughter, messed up her house, and insulted her in her own home was Diane Keaton's pick of the heap. I don't know where writer Nancy Meyers gets these ideas. Wouldn't it be nice to see a movie where the women ends up with a young handsome man who treats her well and adores her? I don't see how laughing over being unable to see the time on a wrist watch without your glasses constitutes finding one's soul mate. Was I on crack or was it Keanu's character who had seen all Diane's plays and loved her work? Clearly Diane's work is almost biographical so isn't it actually Keanu who \"gets\" her? And why is Diane so uncomfortable kissing a man who is 20 years younger than she, but Jack has no problems having sex with a woman 40 years his junior in her mother's home. Anyway, this film is just not what I thought it would be. It had some funny moments sure, but I still left the theater feeling empty. I certainly do not believe it is in any way a good take on romance in old age.",
         "Spoilers herein. I admit, I am a sucker for films like this -- films which rely entirely on the smart reading of snappy dialog. The story -- as most love stories -- is just filler to allow the filmmaker to do something else, usually charm by various shortcuts. Beach, kitchen, bedroom. Here it is filler to allow some very practiced actors to snap and pop to fresh timing. Comedic timing changes over time. Like music, it depends on expectations based on less clever humor. So Jack today has to calibrate himself differently than even five years ago. To get the same breezy wink today, he has to do something quite different to make it seem the same. This is hard to test because when you see one of his older movies, what you see is what you remember -- not what is really there. But he his different here. He uses his neck folds as part of his face, one of the few instances I know where the elements of the instrument have actually increased in number. Watch the way he winks to himself as he talks to Diane on their way back from their first walk. He is talking to her by talking to himself at the same time that he is having another conversation with himself physically. He works harder as he gets older, different than almost any celebrated actor. There are quite a few jarringly false moves here: Diane's yip when his blood pressure registers good; her cries when writing, the obligatory leave-em-smiling ending. But there are enough well managed moments for me to expect to see much of this subconsciously quoted in future comedies -- especially in the timing. Check out the syncopation among different parts of Jack's face and the words he speaks. Each of those dozen parts plays a role, each one setting a beat as if each finger in a chord was playing with its relation to others in coming a tiny bit before or after, differently each time. Facial comedy. Nothing like it in the world. Almost as if to underscore that this is all about faces, there is only one piece of physical humor: when Jack falls off Diane's bed when she returns from her date. ________ I make a special study of folding in films. A simple fold is when a writer writes about a writer, writing about the story you see. The play within overlaps the movie and in this case outside the movie since we know the director wrote it. Three women writers overlap. Ted's Evaluation -- 2 of 3: Has some interesting elements."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Warner Bros.",
         "Waverly Films"
      ],
      "summaries": [
         "Harry Sanborn is an aged music industry exec with a fondness for younger women like Marin, his latest trophy girlfriend. Things get a little awkward when Harry suffers a heart attack at the home of Marin's mother Erica. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
         "Harry Sanborn is a sixty-three year old hip-hop record company executive, who is attracted only to women half his age or younger, and who don't want anything serious beyond sex. Erica Barry is a mid-fiftysomething successful playwright, who has not seriously dated since divorcing her husband of twenty years, Dave Klein, the director of her plays. Her non-dating status is due to the fact that the men she meets of her age are either intimidated by her and/or, like Harry, want a younger plaything. Harry and Erica meet when Erica's daughter, Christie's auctioneer Marin Klein, who has just started dating Harry and who herself has never been in a serious relationship, brings him to her mother's lavish Hamptons beach house for what is going to be their first sexual encounter together, they surprised to see Erica there. Harry believes Erica is uptight and he doesn't understand her at all. Erica believes Harry is misogynistic and chauvinistic, only out for his own carnal wants, which nonetheless needs to be fueled by Viagara. Harry and Erica end up spending time alone together at her Hamptons house out of circumstance after Harry suffers a mild heart attack. The two end up bringing something out of the other each didn't even know existed. At the same time, Erica attracts the attention of Harry's emergency room cardiologist, Dr. Julian Mercer, a man twenty years her junior. Erica is initially oblivious to his advances, she believing that he is attracted to Marin - a woman closer to his own age - but he is eventually able to show his devotion and admiration of her as an attractive, strong, successful woman. Erica has to figure out what to do with both relationships. While Julian is more obvious in terms of wanting something serious with her, which is what she wants with the right man, Harry is a little less certain about what he is feeling for Erica, as romantic love has been a concept foreign in his life, even less so with a woman like Erica.",
         "A young man plays a doctor caring for a man, who suffers a heart attack at the house of his young girlfriend's mother. While there, the elder man falls in love with the mom. The doctor also finds he has an attraction to her, despite their age difference.",
         "Sixty-three year old Harry has a reputation for dating girls a third his age. Taking Marin, his latest belle, back to her beach house for the weekend he is taken aback when her mother Erica unexpectedly turns up. Suffering a heart attack while romancing Marin, Harry finds himself housebound with Erica his nurse and only companion. As they grudgingly get to know each other something starts to stir, though as the hospital doctor who treated him has taken a shine to Erica, Harry could have serious competition.",
         "A swinger on the cusp of being a senior citizen with a taste for young women falls in love with an accomplished woman closer to his age."
      ],
      "budget": 0
   },
   "movielensId": 7149,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "2003-12-12",
      "dvdReleaseDate": "2004-03-30",
      "directors": ["Nancy Meyers"],
      "runtime": 128,
      "movieId": 7149,
      "title": "Something's Gotta Give",
      "mpaa": "PG-13",
      "actors": [
         "Jack Nicholson",
         "Diane Keaton",
         "Keanu Reeves",
         "Frances McDormand",
         "Amanda Peet",
         "Jon Favreau",
         "Paul Michael Glaser",
         "Rachel Ticotin",
         "KaDee Strickland",
         "Robin Pearson Rose",
         "Connie Sawyer"
      ],
      "imdbMovieId": "0337741",
      "originalTitle": "Something's Gotta Give",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["6zVzIaEuXS4"],
      "plotSummary": "Harry Sanborn is an aged music industry exec with a fondness for younger women like Marin, his latest trophy girlfriend. Things get a little awkward when Harry suffers a heart attack at the home of Marin's mother, Erica. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
      "tmdbMovieId": 6964,
      "avgRating": 3.47316,
      "releaseYear": "2003",
      "numRatings": 3838,
      "posterPath": "/q1DO4rwTGz1VSX2sEqqboPwsXUF.jpg"
   }
}