{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0304857",
      "video": false,
      "title": "Two Men Went To War",
      "recommendations": [],
      "backdrop_path": "/6YZuIeDRYqisc0dztIUhC4NKkMY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sgt. Peter King",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec51",
               "name": "Kenneth Cranham",
               "profile_path": "/AbtqNZRiacTCjINwGNxAOKhOOKr.jpg",
               "id": 26258,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Emma Fraser",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec55",
               "name": "Rosanna Lavelle",
               "profile_path": null,
               "id": 139657,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Faith",
               "gender": 1,
               "credit_id": "52fe4750c3a36847f812ec59",
               "name": "Phyllida Law",
               "profile_path": "/iL3UchWZqdk6RabqDZW9HBcJDwQ.jpg",
               "id": 17787,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Col. Hatchard",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec85",
               "name": "Julian Glover",
               "profile_path": "/2sQWrB4of8O2k7DGwJ3OdGJi2Mj.jpg",
               "id": 740,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "SM Dudley",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec8f",
               "name": "Anthony Valentine",
               "profile_path": "/mQGprkjT9Dq9OULmcTRdK7FDlpF.jpg",
               "id": 107336,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Winston Churchill",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec5d",
               "name": "David Ryall",
               "profile_path": "/kthcBrIdXP9QwlKXkVzzRsHwJkq.jpg",
               "id": 27822,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pvt. Horrocks",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec61",
               "name": "Richard Sutton",
               "profile_path": null,
               "id": 139662,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mike (soldier #1)",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec69",
               "name": "Paul Bayfield",
               "profile_path": null,
               "id": 139664,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Soldier #3",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec6d",
               "name": "Jason Round",
               "profile_path": null,
               "id": 139665,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Young sergeant",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec71",
               "name": "Tim 'Nobby' Clarke",
               "profile_path": null,
               "id": 139666,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Sgt. Mowat",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec75",
               "name": "Nick Miles",
               "profile_path": null,
               "id": 139667,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Maj. Bates",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec79",
               "name": "James Fleet",
               "profile_path": "/eS2oKgYBTwgko5cYSvKLIARTZJO.jpg",
               "id": 10726,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Maj. Merton",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec7d",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Pvt. Leslie Cutherbertson",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ec81",
               "name": "Leo Bill",
               "profile_path": "/3OmwzhtvNsHXIKqYrqGrzt4xCKp.jpg",
               "id": 29237,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Chief Armourer",
               "gender": 2,
               "credit_id": "56a3c92492514154f0001905",
               "name": "Anthony O'Donnell",
               "profile_path": "/6QSAbIRfRezk9t1fZMiAdvKIDoI.jpg",
               "id": 47944,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Steward",
               "gender": 2,
               "credit_id": "587a98ebc3a36849ff006b28",
               "name": "Dickon Tolson",
               "profile_path": "/tAXbaZEV8gCrwcXtdzDzWtFRY4q.jpg",
               "id": 203147,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Dr. Oliver Holmes",
               "gender": 2,
               "credit_id": "587a99029251413eec006f5c",
               "name": "Christopher Villiers",
               "profile_path": "/bou20fsIfLFKIDfrEkSKlwZzjOc.jpg",
               "id": 34720,
               "order": 17
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4750c3a36847f812ec8b",
            "name": "John Henderson",
            "profile_path": null,
            "id": 107736,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.487574,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 47952,
      "vote_count": 4,
      "budget": 0,
      "overview": "Comedy drama based on the true story of two British Army dentists who in 1942, eager to see action, go AWOL and invade occupied France on their own.",
      "similar": [],
      "original_title": "Two Men Went To War",
      "runtime": 109,
      "poster_path": "/2RlUlTrRUHATnZjA4NrRsSQpuTP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Little Wing Films",
         "id": 3446,
         "origin_country": ""
      }],
      "release_date": "2002-01-01",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.guerilla-films.com/twomen/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Henderson"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Richard Everett",
         "Raymond Foxall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0304857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTUxMzE4NjM5OF5BMl5BanBnXkFtZTcwNjUxMjUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kenneth Cranham, Leo Bill, Derek Jacobi | See full cast and crew »"],
      "reviews": [
         "Only the English can make a war movie starring desperately patriotic but, in terms of weapons, toothless soldiers: stalwart officers and other ranks of the Army's Dental Corps. And only in England could such a story be true (in the main). 1942: the war isn't going terribly well for Old Blighty. Churchill, played here by David Ryall, is sometimes depressed, always stressed. He needs a victory and he's hanging his spurs on the promise of a new general in the Mideast, a fellow named Monty. But at Aldershot most train to fight and a small number prepare to provide emergency fillings on the battlefield for teeth with cavities. The Dental Corps major has the right elan-\"An Army That Can't Bite, Can't Fight.\" Two of his other ranks, however, desperately want to fight, not make dentures. Sergeant Peter King (Kenneth Cranham) is a survivor of the great World War I battle of Passchendale and he has one recruit, Private Leslie Cuthbertson (Leo Bill), naive but intensely patriotic, who wants action. So they go to war without orders or authorization and that's what \"Two Men Went to War\" is about. This noncom decides to invade France accompanied only by Cuthbertson (both names are real, I told you this is a true story). Mailing a letter with their pay books to Churchill (to establish they weren't deserting), the two steal a boat and head for Occupied France. They make an unopposed landing and establish a beachhead (several critics have commented that it was unlikely two men could just hit the beach like that undetected but this is when Germany was doing very well and the construction of \"Festung Europa\" hadn't started on the Atlantic Coast. And, anyway, that's exactly what these fellows did. Bill and Cranham make an engaging military odd couple, the sergeant brittle, barking peremptory commands and the private taking just so much gruff but not too much from his leader. Armed only with pistols and hand grenades they strike a tertiary target of opportunity, their first two targets being beyond their capability. Exactly how much of this is accurate is hard to say but their adventures were reported at the time. On their unauthorized, bumbling, ill-planned foray they have humorous encounters and harmless adventures. Even the German soldiers don't appear too sinister. Sergeant King may have been truly devoted to his country's cause but his sergeant-major had it right when, asked by a superior officer about the noncom's character, he responds \"Barking mad, sir\" Derek Jacobi is entertaining as Churchill's tired and ever-on-duty intelligence officer, Major Merton. The scenes in Churchill's London bunker appear to have been filmed there-I've visited the site and it looks awfully authentic here. I don't know how well this film was received in England. Tough, snapping sergeants of the British Army have been a movie staple since the talkies began. The exploits of these two soldiers are more weird than impressive. Their adventure seems to be a mixture of \"Dad's Army\" and \"Monty Python.\" Still, the film engrosses because the story is so bizarre and when one enters the theater knowing it's true, \"Two Men Went to War\" becomes attention holding. Both men are now dead, King having died in a New Zealand road accident not that long ago (his military career continued after he was broken to corporal for his invasion of France. He won the Military Cross, one of Great Britain's highest decorations, in subsequent combat). Cuthbertson earned 28 days in jail for being absent without leave. He seems to have had a very nice postwar career, dying of natural causes about eight years ago. An end title states neither ever saw the other again after their court-martial. An oddball film about two definite genuine originals who contributed nothing to victory but who gave the British public something to smile about when the days were dark with the inevitability of victory more a matter of faith than fact. 8/10.",
         "A Brilliant film-this is one of the rare films that you can sit down and watch with all the family. Everett and Villiers have managed to write a fantastic tale of two courageous men- not content with being army dentists, they risk their lives by going to France to fight the war themselves! What makes this film so touching is that it's based on a true story. I experienced almost every emotion whilst watching this film...fear, hope, pride, delight...i came out exhausted and can't wait to see it again!",
         "Richard at the Flicks makes a number of interesting points. However I would like to comment on two of them. The harbour scenes were shot in Charlestown in Cornwall just a few miles from where the two dentists actually sailed. While making the film the elders of the village pointed out that although harbour lights should not be shone at night, their village kept them on during most of the war. There reasoning was that no one had ever bombed them and nobody would. That part of Cornwall was not bombed and was out of way of most German flight paths. Also from a purely technical point of view if there had been no lighting in that scene the audience would not have been able to see anything. When King & Cuthbertson actually landed in France there was no enemy along that particular stretch of the coast. This was well documented in newspapers at the time. For the Germans to patrol every bit of Northern France would have taken hundred's of thousands of men, men who could not be spared. The crossing at Cherbourg was long and few at the time thought this would be an area that soldiers would land. (On their return to their boat they did encounter a German officer, as can be seen on the deleted scenes on the DVD). Also it was 1942. Up to that point the war had not been going well for the British and an invasion of France at that time was not considered feasible both by the Germans and by the British. The Germans were convinced that it was only a matter of time before Britain fell. The British they thought were no threat to the mighty German Army.",
         "What an unexpected delight is this true-ish wartime tale of two army dentists determined to do something for the war effort. A grizzled WW1 Sergeant and callow private go AWOL, heading for Cornwall and then to France armed with a rucksack of grenades, a couple of pistols and the odd dental tool. Possessing a comic lightness of touch rarely seen in Britain since the halcyon days of the Ealing comedies, this wonderful tale of British eccentricity is hilariously funny mainly because it never goes for the obvious laugh. Realisitic enough that the adventure is frequently nerve-wracking, with a splendid plot that constantly wrongfoots your guesses, the mismatched comic pair of Kenneth Cranham and Leo Bill work brilliantly. Filmed in vibrant colours so rarely seen in a British film, the movie succeeds way beyond its modest ambitions. It's the rare sort of film that banishes the blues and puts you in a good mood that lasts for ages afterwards. What more can you ask from a film than that?",
         "What superb movie. The tale of two English dentists, who, before D-day, decide to invade France on their own. The result is one of the most enjoyable war-movies I have ever seen. It starts of quite slow, but the pacing suits the story. There are no big build-ups leading to massive machine-gun fights with lots of dead Germans and gore. Rather, you are kept in suspense to whether their comical blunders will bear any results or whether they will manage not to kill themselves by mistake in the process. It had myself and most of my family laughing within the first couple of minutes, and we never really stopped till the end. Bravo! I hope to see more movies like this.",
         "This film is a solid 6/10. 3 out of 5 Stars etc... First - it is billed as a comedy-drama based on the true story of two men who go AWOL in order to invade France. Anyone who is going to be so upset by lights on in a harbour or no tape on the windows that they would rant about it for weeks probably won't like this film. Second - anyone who can enjoy a film for what it is, in this case a light comedy-drama based on bizarre true happenings, will likely enjoy this film. In true British style, Two Men Went to War, is a story of character development and plot. It is not a Hollywood block buster action flick nor a Japanese sword fest but rather a mature enduring story that is family friendly and a joy to watch. Why only 6/10 then? It could have been a little deeper for my taste and I would have liked to see some of the moral issues of the day addressed. It is definitely more light comedy than drama. A worth-while watch for those who can ignore minor historical inaccuracies like no tape on windows, lights on in a harbour and a modern shipping container that could have easily been covered in canvas.",
         "TWO MEN WENT TO WAR 2002 This World War Two film with a light comic touch is based on a true story. It is 1942 and two soldiers, Kenneth Cranham and Leo Bill are afraid the war will pass them by without getting into the action. Cranham is a WW One veteran now charged with training recruits to march etc. He has just been told he is too old for active service. Leo Bill is a trainee dentist in the Army Dental Corp. He knows he will never get near the actual combat. Cranham decides to prove the Army wrong. He comes up with a scheme to go to France and destroy the German battle cruiser, Scharhornst, in Breast harbour. Private Bill meets Cranham when the two accidentally blow-up an ammunition bunker. The explosion is blamed on a passing German bomber. Cranham's plans change went the Scharnhorst escapes up the channel back to Germany. Cranham grabs up Bill one night as well as several pistols and a rucksack full of grenades. They are going to invade France and do what damage they can. Before they set off, Cranham mails Bill's and his own pay-book to Winston Churchill. He includes a letter explaining what they intend to do. Now they leave camp and head to the coast. Stealing a small fishing boat, they set sail for France. After nearly being ran down by a passing ship in a fog bank, they hit land on France. At first, the pair believe they might have got lost in the fog, and circled back to England. They quickly find out they have reached France and just barely escape a German patrol. The pair now begin their campaign against the Third Reich, by cutting various telephone lines etc. They then accidentally cause the destruction of a German train by fiddling with the levers at a rail switching booth. Next the pair stumble onto a German radar station. They use the rest of their grenades to cause as much damage as possible before escaping on a German motorcycle. Needless to say, our intrepid pair return to their small boat, and set sail for England. They however have the bad luck to run out of fuel and then hit a floating mine. Rescued by a UK Air-Sea rescue launch, they are returned to England. Of course nobody believes their tale and they are soon up on desertion charges. The only thing that saves them, is that the letter finally made it through to Churchill's office. Plus that there had been a Commando raid on the same German Radar station that same night. The whole film is played out with a slight comic tone which works rather well. The film is not a world beater by any means. It could have done with a shorter runtime and a tighter story. It did however kill an evening in front of the television, as well as supply a few laughs.",
         "(Spoilers) Two Men Went To War is an unambitious, entertaining film, if ultimately somewhat slight. Apparently based on a true story, it is a dramatised account of a passed-over sergeant and a somewhat gormless private (from the Royal Army Dental Core, for whom \"an army that can't bite, can't fight!\"), who go to war on their own account in 1942. Absconding from camp, they steal a fishing boat, invade occupied France, and are lucky enough to gain some military honour before facing a court martial upon their return. Those familiar with some British WWII films of the period will quickly recognise the stereotypes: well meaning amateurs undertake derring-do in their own eccentric fashion and, against all the odds, make a success of things. Over familiar too is the national coyness towards adult relationships, as one of the two protagonists blunders in and out of two encounters with women with due virginal surprise. Replace Sergeant Peter King (Kenneth Cranham) with a Tommy Trinder or Arthur Lowe, or Private Leslie Cuthbertson (Leo Hill) with a Claude Hulbert or George Formby, and we are in the territory of The Foreman Went To France (1942) or the hugely popular antics of BBC TV series Dad's Army, which it most easily recalls. As the AWOL duo en route to France to \"take Mohammed to the mountain,\" King and Cuthbertson make an attractive, odd-couple pairing, whose mutual contempt and distrust, turning inevitably to self-reliance and then friendship, makes up much of the film's dramatic interest. The sergeant, nicknamed 'The Kaiser' by his fellows, has a medal from the First World War (gained, it turns out, in less than heroic circumstances) and wants to do more than stay behind during the new conflict. Private Cuthbertson wishes to live up to the memory of his father and prove himself in his own eyes and in those of his family. He daydreams of valour, either being transfixed by the aircraft that overfly the backwater of his training camp or fantasising with a live hand grenade - the incident which first brings the two men together. Much of the film is well shot and the detail of the period is effectively reconstructed. There are niggling inaccuracies however: under threat of invasion place names and signs were removed throughout the UK to confuse likely enemy paratroopers, so it's very unlikely that Plymouth station would be conveniently indicated as here. Equally unbelievable, at a time when the blackout was mandatory, is the well-lit harbour that the two soldiers sail out of when attempting their channel crossing. Least convincing of all is the evident ease in which they arrive and leave the French coast: completely unchallenged, and stepping through light barbed wire - as if mines and fortifications of any sort had not been invented. Composer Jonathan Harvey provides a score that contains both original elements and from such period acts as Flannigan and Allen. This is well done, making the film seem richer than it is - although this viewer at least felt that the heavy handed use of Elgar during the final attack was a step too far, the blaring patriotism threatening a descent into bathos. Parallel to the unorthodox expedition by our two heroes are the preparations back in London for the start of the African campaign by Churchill and his advisors. While the two amateurs are seen as active, ambitious and enthusiastic, the military professionals in the War Rooms are shown perpetually planning and gloomy. The lethargy of those bigwigs in the know is in contrast to the get-up-and-go of those who don't know any better, the one by implication commenting on the other. By the end of the film Churchill, and presumably, via his uplifting, that of the whole war effort, has been saved from a fit of depression by the actions of the two rogue soldiers. The characteristically excellent Derek Jacobi steals the show as Churchill's top intelligence officer while, as the leader himself; David Ryall does a passable impersonation. One suspects that this small scale, likeable film will be better received in other countries than in the UK (where critical response was limited and fairly dismissive) as its gentle eccentricities can be charming. The events it portrays and the gentle irony employed are far from those in the typical Hollywood blockbuster, while its modest proceedings mean that it looks better on the small screen than the large. At the end of the day, it's a plot that needed a greater sense of absurdity and real danger than was the case here, although it remains consistently watchable. At least it's not another dismal British gangster picture...",
         "I have to say, I wasn't very interested in seeing this until the end as it just didn't entertain me at the beginning but I hung in with it and noticed that over the coarse of the film, the relationship between a young, naive private and a grumpy old sergeant, both dentists bored with their perspective lot in the army who decide it's time to contribute to the war effort, began to solidify. If even half of their adventures are true then they were two truly amazing men who pulled off quite a feat. This is one of those films that is more human interest than anything but it holds your attention as it progresses by some of the situations they find themselves in and the wonderful way it's brought to conclusion.",
         "The UK TV premiere of \"Two Men Went to War\" was shown directly after a vintage episode of \"Dad's Army\". This was clearly a BBC progamme scheduler's attempt at mind control. The story of a has-been sergeant's personal invasion of wartime France shares a lot of territory with \"Dad's Army\" but \"Two Men Went to War\" is a pale shadow of the classic TV series. Despite being based on true events, the movie portrays its protagonists as a sort of Laurel and Hardy double act. The real Sergeant Peter King and Private Leslie Cuthbertson were a tough and resourceful duo who managed to survive on their own in enemy territory and commit several acts of sabotage before returning to home soil. Kenneth Cranham portrays his character well, despite the fact that he is in his 60s and the real Peter King was 26 in 1942. Not only this, but saddling the character King with a medal for changing a car wheel under fire in WWI cheapens the efforts of the real King, who won a Military Cross in 1944 and the DSO in Korea. Leo Bill matches Cranham in the acting stakes but plays his character as a Londoner when the real Cuthbertson was from Tyneside. I don't blame Bill for not attempting a geordie accent but it's another jangling note of inaccuracy in a story that's supposed to be \"Mostly True\". Cuthbertson is portrayed mainly as boyish and inept, but in reality he served as a soldier in the Durham Light Infantry after his adventures in France. I doubt that either King or Cuthbertson would have been very happy with this movie if either were still alive. While its premise is comic, too many liberties have been taken. In the movie, the 2 men are saved from being branded as deserters by an intelligence officer who credits them with the destruction of a Freya radar array. By coincidence they manage to wreck it in parallel with a British commando raid on nearby Wurzburg radar dishes. Trying to tie King and Cuthbertson's ad-hoc sabotage operation in with a bowdlerised version of the Operation Biting raid on Bruneval is simply too much. \"Two Men Went to War\" may be based on fact but pitching it as a \"Dad's Army\" - style comedy was a mistake. Surely the true story of 2 army dentists who invaded German-occupied France in 1942 was worthy of a more embellishment-free screenplay?"
      ],
      "genres": [
         "Comedy",
         "War",
         "Drama"
      ],
      "productionCompanies": [
         "Ira Trattner Productions",
         "Little Wing Films"
      ],
      "summaries": [
         "Based on a true story, Sergeant Peter King of the Army Dental Corps, too old to fight, and Private Leslie Cuthbertson, a trainee dental mechanic in the Corps, are thrown together by their passionate desire to see active service. Armed with just two revolvers and a dozen grenades, King persuades Cuthbertson to join him on a mission to occupied France. In a letter to Winston Churchill, King explains their intention to invade France and fight the Germans. After a number of failed attempts, they finally arrive by boat and stumble across a German radar station. They succeed in blowing up what they believe to be the main Operations Room, but are soon forced to make their escape as the entire compound unexpectedly erupts with gunfire and explosions. After narrow escapes from the Germans and a stray mine in the Channel, the two men are picked up at sea and interrogated as spies. Identified as deserters, they are returned to their barracks to be court-martialed. At the eleventh hour King and Cuthbertson are saved by the arrival of Major Merton, Churchill's Chief Intelligence Advisor. Their letter has been received in Whitehall and Merton corroborates their heroic story. Exonerated of lying, King and Cuthbertson are nevertheless reprimanded by the Court for their behavior, but receive an invitation to tea with the Prime Minister should they ever be in Whitehall.",
         "Comedy drama based on the true story of two British Army dentists who in 1942, eager to see action, go AWOL and invade occupied France on their own."
      ],
      "budget": 0
   },
   "movielensId": 7159,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": "2006-06-01",
      "directors": ["John Henderson"],
      "runtime": 109,
      "movieId": 7159,
      "title": "Two Men Went To War",
      "mpaa": "PG",
      "actors": [
         "Kenneth Cranham",
         "Rosanna Lavelle",
         "Phyllida Law",
         "Julian Glover",
         "Anthony Valentine",
         "David Ryall",
         "Richard Sutton",
         "Paul Bayfield",
         "Jason Round",
         "Tim 'Nobby' Clarke",
         "Nick Miles",
         "James Fleet",
         "Derek Jacobi",
         "Leo Bill",
         "Anthony O'Donnell",
         "Dickon Tolson",
         "Christopher Villiers"
      ],
      "imdbMovieId": "0304857",
      "originalTitle": "Two Men Went To War",
      "genres": [
         "Comedy",
         "Drama",
         "Foreign",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Comedy drama based on the true story of two British Army dentists who in 1942, eager to see action, go AWOL and invade occupied France on their own.",
      "tmdbMovieId": 47952,
      "avgRating": 3.275,
      "releaseYear": "2002",
      "numRatings": 20,
      "posterPath": "/2RlUlTrRUHATnZjA4NrRsSQpuTP.jpg"
   }
}