{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0081746",
      "video": false,
      "title": "Werner Herzog Eats His Shoe",
      "recommendations": [
         46595,
         85016,
         48227,
         117594,
         19006,
         45802,
         104275,
         117592,
         289994,
         183728,
         59363,
         47476,
         146815,
         49461,
         324025,
         5900,
         186946,
         123094,
         91515,
         96590
      ],
      "backdrop_path": "/tJu3sxqOGsz8GMc18qIcJBkAiOS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 2,
            "credit_id": "52fe4a299251416c750dfc99",
            "name": "Werner Herzog",
            "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
            "id": 6818,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a299251416c750dfc95",
               "name": "Les Blank",
               "profile_path": "/44VL7nyzDMTuqZztDf6KBsutqBu.jpg",
               "id": 142594,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56febf84c3a36821a40030fd",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.758079,
      "production_countries": [],
      "id": 99189,
      "vote_count": 20,
      "budget": 0,
      "overview": "Having lost a bet with documentarian Errol Morris, Werner Herzog eats his shoe.",
      "similar": [],
      "original_title": "Werner Herzog Eats His Shoe",
      "runtime": 20,
      "poster_path": "/qho0icCvvb98w7McFmghMnbpZL.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1980-12-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Les Blank"],
      "runtime": 20,
      "synopsis": null,
      "writers": ["Werner Herzog"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081746/",
      "coverLink": null,
      "actors": ["Stars: Werner Herzog, Tom Luddy, Michael Goodwin | See full cast and crew »"],
      "reviews": [
         "Werner Herzog has put his mark on the world of movies, even though you may not know the name right away- he made \"Fitzcarraldo\" the movie about the opera fan who halls a boat over a mountain. This documentary is shot by Les Blank and details a bet Herzog made to a friend that he would eat his shoe if his friend completed a film. Well, Herzog does have to eat his shoe. And it's very weird, but Herzog is a bit of an odd guy himself. It's a short enough documentary and fun to watch. This documentary is one of two about Herzog- the other is an award winning \"Burden of Dreams\" about the filming of Fitzcarraldo. I highly suggest checking it out if you enjoy this.",
         "This is a little documentary prepared by Les Blank about Werner Herzog's sort of bet to Errol Morris that he should make a movie, but if he did with the luck that he would need as a first time director, he would literally eat a shoe. Herzog adamantly says in the documentary that he's only doing it in support of Morris and his film (which at the time this doc was released didn't yet have distribution despite its great acclaim at festivals), though there's something sublimely absurd about it all, even through Herzog's deadpan/serious talks to the camera. He talks a bit about Morris and his film too, and his praise for it is all well and good. But it's even more interesting to see a) Herzog's views on commercialism and film-making and the lack of \"adequate images\", and b) director Les Blank's inventive cross-cutting between the on-stage eating of the show, footage of Charlie Chaplin doing the act in a silent, and Herzog talking to the camera. It's funny once or twice, perhaps unintentionally from Herzog's words (i.e. \"it's not self-destructive to throw yourself into a pile of cactus\"). But for the most part it's meant as a very serious act of foolishness not just for Morris but for filmmakers everywhere. If you can find it- and it's now available on free sites like you-tube- it's worth a look, especially if you're a fan of Herzog. And for Morris fans too there's a quick treat in an outtake from Gates of Heaven spliced in at one point. That song, by the way, of which I quote in the one-line summary, is awesome.",
         "There may be better directors than German New Wave auteur Werner Herzog, but if viewed entirely in terms of how interesting they are personally, Herzog stands above all. His tales of working with deranged German actor Klaus Kinski are the stuff of legend: from filming deep in the jungle using real natives to pushing a ship over a waterfall for Fitzcarraldo to apparently earnestly plotting to kill his star. Or, more recently he saved Joaquin Phoenix from a car crash and then disappeared before he could be thanked. His personality even transfers over remarkably in this short film directed by Les Blank. We learn that Herzog apparently was friends with Errol Morris. While Morris was still a struggling young filmmaker, Herzog had made a bet with him that if he ever got his film made, the former would eat his shoe. Well, in 1979 he finally does make a film, Gates of Heaven, and Herzog comes to live up to his promise. The film chronicles Herzog as he garnishes, cooks, and eats one of the shoes with some salt and garlic on stage during the film's premiere. This all happens and Herzog still has time to say things like how we must declare holy war on what we see every day on television, talk shows and Bonanza; and how it requires some self-degradation in order to be a director, all in 17 minutes. So for a short film it works quite well at capturing his essence. It's also up on YouTube to watch for free and in its entirety. This is a good thing, as it is not even available on Netflix. So if you have 20 minutes to spare, it's well worth watching.",
         "Werner Herzog is a great example of someone to be trusted. Really trusted. Not only he encourages aspiring filmmakers to make their movies in any possible ways, inciting them to engage in passionate act as if it were a revolution to be made (\"Steal a camera, steal raw stock! Break into a lab and do it!\") but also he's a man who keeps his promises. Once he makes them (usually crazy ones), he's definitely gonna fulfill it. At one time he jumped on a cactus while filming \"Even Dwarfs Started Small\" just to entertain the dwarfs who survived the filming of his movie after many troubled incidents. He said he would jump on it if they managed to make the whole film and he did, carrying some scars from such act. And years later he would eat a shoe after making another absurd bet, this one more challenging to more people and more poetic in a way. He lost again and it was time to show and tell. Here's the living proof filmed by Les Blank in 1980. The proposition was: Herzog convinced film student Errol Morris to make his first film, and if he succeed in doing so he would eat his shoes. Literally. Morris went on to make \"Gates of Heaven\", a documentary about a pet cemetery and its owners, which was acclaimed by critics and public starting a promising career of a future Oscar winner and a great documentarist. When the movie premiered in NY Herzog traveled all the way to pay his debts, set up a whole meal to go with his shoes - one to be eaten in front of an audience, the other one only if Morris film get a distributor. A brave yet foolish gesture, very noble of Werner and whose purpose was exactly what he intended to do: to push Morris forward and go after his dreams. He truly believes in this human's search and conquest for their dreams, speaking of this with plenty of passion in \"Burden of Dreams\", also directed by Blank, where we follow Herzog's troupe while making the epic \"Fitzcarraldo\" and his almost impossible task of making a steam-ship crossing over a mountain among other difficulties. \"Without dreams we would be like cows in the field\" he says there. Combining both documentaries you have a full image of the director, a truly inspiring one, and if like he says that films can't cause revolutions but can cause some personal change, then his thoughts and acts in both films can cause a real revolution inside each viewer. \"Werner Herzog Eats His Shoe\" isn't just the title, it's also about the man exposing his views on culture, television, holy war against Bonanza and commercials, and the lack of an adequate language in the media. Everything he said was truth back then and it's truer even now, more than 30 years later. Very insightful opinions. But of course, seeing the director of \"Aguirre\" eating the same shoes he used when he made the bet is priceless, adding garlic and tempers to make it tasteful, the audience watching him cook, laughing all the time, it's a humorous view intercut with Chaplin eating his shoes in \"The Gold's Rush\". I think the one thing that was missed in here was an interview with Errol Morris, he's nowhere to be found in the film, and his comments on Werner would be interesting here. There's only one person who I can believe we'll keep his promises and that's Herzog. Many people can say many times that things will get better (when life doesn't go our way) but if Werner says that it will, then I have to believe. Why? Because he promised. And this film is just an example of someone who respect his promises, even the weirder ones. 10/10",
         "Watch as Werner Herzog prepares, cooks, and eats his shoe while discussing the importance of film-making and film. Honestly you couldn't ask for a more entertaining filmic equivalent of ars poetica, and if you happen to be the type of person interested in becoming a filmmaker yourself, this film is pretty inspiring in the way Herzog constantly codgels you by saying, \"Just go out and do it, it isn't about money, just go out and do it, you have to do it.\" It's an interesting event, but talking about it any longer shall not really help you as it's pretty straightforward in design. Just go see it. You can find it on the Criterion Collection release of Burden of Dreams, which is another movie anyone interested in Herzog should watch. --PolarisDiB",
         "A short little film, where Herzog eats his shoe, although in reality he just eats the leather part of his old shoe after boiling it in water. But still the principle of the whole thing is humorous, Herzog promised to do this if a filmmaker would actually just make the film they were always dreaming of making. Errol Morris accomplishes this and so Herzog submits to it. Les Blank also did this documentary on Herzog \"Burden of Dreams\" so I think if I recall some footage of that is intertwined into this story. Herzog should constantly have a camera on him, he strikes me as very interesting, I don't always love his films but he is always worth hearing from.",
         "Werner Herzog Eats His Shoe (1980) *** (out of 4) Funny short has director Werner Herzog eating his shoe after losing a bet to a friend. The documentary does a nice job building up tension and there's some nice side talk about the importance of film. Burden of Dreams (1982) **** (out of 4) Incredible documentary from director Les Blank about the making of Werner Herzog's Fitzcarraldo. The Herzog film is one of the most amazing films I've seen and it's rather shocking, due to that film's troubled history, that a documentary was being filmed on it. In the Herzog film you realize that the main character played by Klaus Kinski was crazy because of what he was trying to do. In this documentary, you realize that Herzog was crazy for even trying to make this film.",
         "Entertaining, funny, and oddly thought provoking 20 minute short, in which, quite literally, director Werner Herzog eats his shoe. He does it in response to a bet he made with then budding, but procrastinating film-maker Errol Morris. He told Morris that if he ever finally got a feature finished, he'd eat his shoe. And so he does, after cooking it, in front of a live audience before the local premiere of Morris' great first feature 'Gates of Heaven'. As enjoyably silly as it all is, Herzog also makes some real points about needing to be willing to do foolish things to encourage art and artists, and that only by risking being absurd can we have the hope of transcending.",
         "A short documentary in which directors Werner Herzog and Errol Morris make a bet which results in Herzog being forced to eat his own shoe. Filmed in April 1979, the film features Herzog cooking his shoes (the ones he claims to have been wearing when he made the bet) at the Berkeley, California restaurant Chez Panisse, with the help of chef Alice Waters. (The shoes were boiled with garlic, herbs, and stock for five hours.) He is later shown eating one of the shoes before an audience at the premiere of \"Gates of Heaven\" at the nearby UC Theater. This film is great because it connects three of the finest filmmakers of the era. Werner Herzog is a great documentarian and director, while Morris (just starting out) has gone on to become possibly the best documentary filmmaker in the business. And who should be filming this? Les Blank, the chronicler of America culture... quite possibly the best before Morris came along. All three being linked like this is a rare moment.",
         "By now, everybody should have come to see the light that Werner Herzog is pretty much the coolest person alive. In this 20-minute short film, a bearded Herzog ends up eating a shoe after having lost a bet to a colleague. The whole thing is a promo-gag to help another filmmaker and friend of Herzog find a distributor for his film. He cooked the shoe for five hours, added some Kentucky Fried Chicken to it and finally has to eat it now. As we see the action at the event, the film keeps cutting to several different sequences, like Chaplin eating a shoe as well in one of his movies, or scenes from \"Auch Zwerge haben klein angefangen\" and a lot more. Herzog tells anecdotes about his work, like a cactus tale about the aforementioned film, how the profession of a cook would have been the only real alternative for him had he not become a director (scary thought, I know!), how he picked exactly those shoes that he wore during the bet as he could have taken more easily digestible ones, but doesn't like cowards or how he's glad that he does not have to do such events for his own movies as he's lucky enough to get distributors. It's not a must-watch by any means, but an insightful little fun movies and there's not many ways you could spend a better 20 minutes because as Herzog says that \"once in a while we should be foolish enough to do things like that\". Shame that he still has not won an Oscar. Funnily enough, the film-maker who is supported by Herzog here already won one by now. Anyway, it's a good watch and I recommend it. Herzog is always a joy to watch and listen to."
      ],
      "genres": [
         "Documentary",
         "Short"
      ],
      "productionCompanies": [],
      "summaries": [
         "A passionate cook, acclaimed filmmaker Werner Herzog stuffs some culinary aromatics into his shoe and uses the laces to truss it like a chicken, before he sticks it into a pot with water and duck fat to stew it. It is so that he can bring the stewed shoe to one of the first screenings of Errol Morris' debut film Gates of Heaven (1978) to eat it. This act will fulfill his loss of a bet to Morris, who he met as a student filmmaker, that he would never be able to make a movie. The bet was not Herzog's attempt of a jab against Morris, but rather to support a struggling but gifted Morris in his quest to do whatever was required to finance a movie project. In the process of eating the shoe, Herzog wants to encourage other aspiring filmmakers, and to set an agenda of increasing what he calls adequate images as a true reflection of the world.",
         "A film exactly described by its title. German film director Herzog had made a bet with fledgling director Errol Morris that, if Morris made a film, Herzog would eat his shoe. Morris went on to film 'Gates of Heaven', so Herzog kept his promise. While eating the boiled shoe, Herzog carries on a dialogue with the film premier audience on film, art, and life.",
         "A short documentary in which directors Werner Herzog and Erol Morris make a bet which results in Herzog being forced to eat his own shoe."
      ],
      "budget": 0
   },
   "movielensId": 71650,
   "movielens": {
      "languages": [""],
      "releaseDate": "1980-12-01",
      "dvdReleaseDate": null,
      "directors": ["Les Blank"],
      "runtime": 20,
      "movieId": 71650,
      "title": "Werner Herzog Eats His Shoe",
      "mpaa": "",
      "actors": ["Werner Herzog"],
      "imdbMovieId": "0081746",
      "originalTitle": "Werner Herzog Eats His Shoe",
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Having lost a bet with documentarian Errol Morris, Werner Herzog eats his shoe.",
      "tmdbMovieId": 99189,
      "avgRating": 3.39706,
      "releaseYear": "1980",
      "numRatings": 34,
      "posterPath": "/qho0icCvvb98w7McFmghMnbpZL.jpg"
   }
}