{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "water",
            "id": 4237
         },
         {
            "name": "drought",
            "id": 180999
         },
         {
            "name": "farming",
            "id": 182281
         }
      ],
      "imdb_id": "tt0025610",
      "video": false,
      "title": "Our Daily Bread",
      "recommendations": [84097],
      "backdrop_path": "/eLGpTXNJv4qytzyR0OlJw93za6O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mary Sims",
               "gender": 1,
               "credit_id": "52fe4ad8c3a368484e16a0d7",
               "name": "Karen Morley",
               "profile_path": "/t8WUPEuD1hhEx3O7GLUrfYO41aM.jpg",
               "id": 13354,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "John Sims",
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a0db",
               "name": "Tom Keene",
               "profile_path": "/kCzELnYTY6j3edahwonspDke0P9.jpg",
               "id": 65500,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sally",
               "gender": 0,
               "credit_id": "52fe4ad8c3a368484e16a0df",
               "name": "Barbara Pepper",
               "profile_path": "/ppdWwEO9ltZHtXFCznxkQB1CZr2.jpg",
               "id": 95301,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Louie Fuente",
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a0e3",
               "name": "Addison Richards",
               "profile_path": "/ztihdDQTNfW1ASDKkMUBGDlRonc.jpg",
               "id": 97007,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Chris Larsen",
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a0e7",
               "name": "John Qualen",
               "profile_path": "/nbXFHZo4TUpNnFGnADXfPwQIvEn.jpg",
               "id": 4119,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Uncle Anthony",
               "gender": 2,
               "credit_id": "589770e7c3a3686222016c16",
               "name": "Lloyd Ingraham",
               "profile_path": "/kTD4cHNTKODSggq58s6xKGOWkza.jpg",
               "id": 121247,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Rent Collector",
               "gender": 0,
               "credit_id": "589770f292514129c8016f90",
               "name": "Sidney Bracey",
               "profile_path": "/o72gF6HWbCBrm4wBZWgWiP6RYAK.jpg",
               "id": 80546,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Frank - the Carpenter",
               "gender": 2,
               "credit_id": "589770ff9251412e1901b32e",
               "name": "Henry Hall",
               "profile_path": "/33PT2gRSHVComiySnGkamJlyJIO.jpg",
               "id": 100806,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mrs. Cohen (as Nellie Nichols)",
               "gender": 0,
               "credit_id": "5897710cc3a36822e001689f",
               "name": "Nellie V. Nichols",
               "profile_path": null,
               "id": 1312993,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Plumber",
               "gender": 0,
               "credit_id": "589771179251412e1601c204",
               "name": "Frank Minor",
               "profile_path": null,
               "id": 1751317,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Stonemason",
               "gender": 2,
               "credit_id": "58977123c3a368089f01b1f7",
               "name": "Bud Rae",
               "profile_path": null,
               "id": 1361162,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Little Man",
               "gender": 0,
               "credit_id": "58977131c3a3686222016c47",
               "name": "Harry Brown",
               "profile_path": "/j194xrxKwc0jlY79q5Kvye1LRZx.jpg",
               "id": 1211248,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a0c7",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a0cd",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ad8c3a368484e16a0d3",
               "name": "Elizabeth Hill",
               "profile_path": null,
               "id": 164730,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "5aa3c802925141278700a72f",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.992809,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 126136,
      "vote_count": 4,
      "budget": 0,
      "overview": "John and Mary sims are city-dwellers hit hard by the financial fist of The Depression. Driven by bravery (and sheer desperation) they flee to the country and, with the help of other workers, set up a farming community - a socialist mini-society based upon the teachings of Edward Gallafent. The newborn community suffers many hardships - drought, vicious raccoons and the long arm of the law - but ultimately pull together to reach a bread-based Utopia.",
      "similar": [
         27022,
         2675,
         86834,
         841,
         928,
         55341,
         22076,
         110420,
         228165,
         48340,
         215379,
         10196,
         11836,
         9804,
         11323,
         19666,
         1049,
         152747,
         14168,
         18148
      ],
      "original_title": "Our Daily Bread",
      "runtime": 80,
      "poster_path": "/uCpEXQo4fXIIiccuc3jj548zN6G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Viking Productions",
         "id": 40774,
         "origin_country": ""
      }],
      "release_date": "1934-10-02",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "We live! We love! We fight! We hate! What don't we do for - OUR DAILY BREAD",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["King Vidor"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "King Vidor",
         "Elizabeth Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025610/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA1MjYxMjA1MzFeQTJeQWpwZ15BbWU3MDU2NjA3NDU@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Karen Morley, Tom Keene, John Qualen | See full cast and crew »"],
      "reviews": [
         "Boy, is this film interpreted differently, depending on which critic is discussing it. Overall, however, most of them - including me - like this movie and find it interesting. Today's critics like to use this film as a boost for socialistic or Commununstic causes, but that's baloney. One could easily do the opposite and use this film as an analogy to the early Christians, too - people who banded together pooling their talents and possessions for the good of the whole group. This was a simply of story of America during the Great Depression with a bunch of people out of work, so they try to make a living by turning themselves into farmers and making a go of it together. Tom Keane and Karen Morley star in here, playing husband-and-wife. Morely played a very upbeat, sweet lady who was joy to watch. Keane's acting was strange. At times it bordered on raw amateurism. He also looked, with the wild expressions, as if he were back doing a silent film. The rest of the cast was solid, from the Swedish farmer to the tough guy who turned himself in to the police to help the rest of the group. Overall, a good film and worth watching, whatever your politics.",
         "OUR DAILY BREAD (United Artists, 1934), directed by King Vidor, is a follow-up/sequel to Vidor's own 1928 silent drama, THE CROWD (MGM, 1928) starring James Murray and Eleanor Boardman as the typical American couple, John and Mary Sims. In this sound go-round production, Tom Keene and Karen Morley, who somewhat resemble the original portrayers, step in as John and Mary Sims. This time the setting takes place during the hard times of the Great Depression. John and Mary live in an apartment (possibly New York City) struggling to survive their daily existence. John searches high and low for any kind of job while Mary manages to talk the landlord into giving them a little more time to come up with the rent money. Hoping that their visiting Uncle Anthony (Lloyd Ingraham) can submit them a loan until John can obtain work, it is learned after a dinner that Uncle Anthony hasn't the funds to help them nor himself. The Stock Market had gotten to him, too. However, he offers the couple an old farm in the country that he doesn't want. Although John and Mary know nothing about farming, they accept his offer. It's only after John comes upon Chris (John Qualen), a destitute Swedish farmer whose truck has broken down, that John hires him as his farmhand. John then comes up with a great idea starting a commune for other depression victims to lend a helping hand, ranging from carpenters to blacksmiths. The farming community, with John as their leader, becomes a thriving success. Of the residents in the community, Louie (Addison Richards), helpful as a tractor driver, is very mysterious, especially when keeping only to himself. After the arrival of Sally (Barbara Pepper), a blonde floozy, she not only plays her radio music loud enough to hear in the next town, but arouses enough attention from John to go away with her. Situations arise when farm animals and crops of corn are dying due to a serious drought. OUR DAILY BREAD is an interesting look of an American people of the Depression era striving together, uniting as one, with a positive outlook in life regardless of how dark things become. A forerunner to the now famous John Steinbeck novel, THE GRAPES OF WRATH (which later became a classic 1940 motion picture starring Henry Fonda, with John Qualen playing a strong supporting role, minus his Swedish accent), in a story about farmers losing their land and driving cross-country to fight unemployment. Steinbeck's book and movie adaptation goes more into darker detail than Vidor's production. There's drama, but plays on the lighter side, with moments of comedy \"relief\" usually by the supporting players of farmers. There's a memorable scene where farmers gather together for prayer, kneeling on the earth of soil, accompanied by a choir sounding music soundtrack. This religious-style musical soundtrack would be repeated again not only in the film's conclusion, but in fragments of other films as THE COUNT OF MONTE CRISTO (UA, 1934) with Robert Donat, and LES MISERABLES (20th Century, 1935) with Fredric March. While OUR DAILY BREAD is essentially an American film, there are times it has the outlook of an European production. Karen Morley, formerly of MGM (1931 to 1934), stands out as a self-sacrificing and devoted housewife in one of her rare leading roles. Her confrontation with Sally (Barbara Pepper) doesn't comes off as strong as it should have been. Tom Keene, who found brief stardom in \"B\" westerns at RKO Radio (1931-1933), does what he can as the central character. He simply fails to live up James Murray's powerful performance in THE CROWD. Since the movie consists of a majority of unknown actors, from the leading actors down to the co-stars, including Nellie V. Nichols as Martha, Chris's wife; Henry Hall as The Carpenter; Bud Rae as the Stone Mason; and Bob Reaves as George Washington Hannibal, OUR DAILY BREAD could obtain an audience today only by word of mouth. Clips regarding the history and background of this production were profiled in the King Vidor segment from \"The Men Who Made the Movies\" (produced for PBS in 1973). As in \"The Crowd,\" \"Our Daily Bread,\" is highlighted by a memorable and compelling conclusion that makes up for some of the weaknesses found in both the plot and acting. Broadcast history for OUR DAILY BREAD consisted mostly those on public television, first on the May 13, 1972, showing of the weekly series, \"Film Odyssey\" (WNET, Channel 13, New York), decades before turning up on classic cinema late show presentations during the after midnight hours, and finally on Turner Classic Movies cable channel where it premiered January 7, 2007. Since it's a public domain title, video distributions consist of various editions, including a slightly shorter print with inferior picture quality and/or sound reproduction, with the opening credit distribution by Astor Pictures (from 1940s reissue) rather than the original United Artists/ Viking Productions. The best video/DVD copies to obtain are the ones from either KINO Video or by locating an old 1980s copy by Embassy Home Video, that features a 10 minute segment that precedes the movie on how OUR DAILY BREAD came to be, narrated by the director himself, King Vidor. It's interesting to note that Vidor struggled to get a movie studio interested in distributing this project. He found one in United Artists, but had to mortgage his home or sell whatever he owned to finance the film. Vidor also mentions that he can be seen as one of the crowd of extras playing a laborer in the ditch digging segment near the end of the movie. Reportedly a commercial flop when initially released in theaters, it has grown to become a minor film classic that was, as subtitled during the opening credits, \"inspired by headlines of today.\" (***)",
         "Desperate people set in desperate Great Depression times try to eke out a living on an abandoned farm. Rousing for its \"back to the land\" pioneering spirit of people from all walks of life forced to help each other start a new life (or starve). The film preaches self-reliance (away from expecting government assistance), yet encourages people to help each other (in a somewhat Socialistic sense), so there are mixed messages here. There seems to be an undercurrent not to trust the various forms of government either. Parts of this film are greater than the whole, with uneven performances and some hackneyed \"girl tries to steal husband\" scenes that make you want to fast-forward... Director King Vidor managed to get \"OK\" performances out of some of the lesser (amateur?) performers (some of which never made another film). I've seen this film dozens of times for its most interesting scenes, tops of which include the famous ditch digging scene at the films end. Unlike Grapes of Wrath, Our Daily Bread is overall optimistic that the individual can rise above dire straits to triumph through \"work, work without stopping.\" Unfortunately, this film has enough flaws in story and acting to keep it from anywhere near the masterpiece status Grapes of Wrath has achieved.",
         "Ponderous, though well-meaning, socialist propaganda piece. Features lots of \"let's all get together and form a collective!\" speechifying, creaky romantic complications, and wooden characterizations by non-professionals acting very self-consciously (the \"pros\" aren't any better). However, in the final section of the film (the digging of the irrigation canal), things spring gloriously to life, and the joy and drama of collective effort, that the movie has been preaching to us for over an hour, is simply SHOWN (to great dramatic effect). Would have made a terrific short. 5/10",
         "The film, though socialistic in many ways, represents the drive to get back to nature as stressed by FDR. It represents the optimism believed by people that the current system had gotten too complex and that people were mere cogs. By creating a co-op, the characters essentially created a system focused on barter. This form of commerce could not become corrupted to an extent as a monetary based market did. Had the film been a propaganda film biased towards a socialist state, the emphasis of the importance of money would not have been as pivotal as it became partway through the movie. This film served not as propaganda, but as a solution to a common shared problem of a bleak time in American history. Because of this, this movie should not be viewed with the same biases of the 21st century.",
         "At the time of this film's release, it was a pure novelty. Hollywood had paid little attention to the people in rural areas who had to deal with the Depression. The fact that this movie was made at all is somewhat miraculous since most people didn't want to see films about human struggle -even if they did have happy endings. They just wanted glamour and thrills (amazing how some things never change!). But the most miraculous thing was that Hollywood even allowed a film with a blatantly obvious socialist theme to be made. But then that's what most Americans called Franklin Roosevelt's policies anyway, despite that his 'New Deal' plan lifted the country up out of the mire of hopelessness. This film is hardly a documentary-like look at the effects of the New Deal (which in this scenario was basically co-op living and farming). Nor does it try to be propagandist, preachy or artistic, like Vidor's contemporaries in the Soviet Union. It was able to be made simply because it accepted the form of Hollywood populist cinema, which was basically: keep it melodramatic, cute, and non-threatening. It's sort of like 'Capra goes country', or like the Judy Garland-Mickey Rooney movies, only instead of everyone saying \"hey, let's put on a show!\", they build a farming community, and carry shovels instead of batons. It's a fascinating look at how people saw this country back then and how Hollywood approached The New Deal. If you can, try to rent this on DVD because the DVD comes with four fascinating documentary shorts containing different viewpoints of The New Deal.",
         "King Vidor's \"The Crowd\" (1928) ended hopefully: James Murray and Eleanor Boardman (then playing John and Mary Sims) conquered the industrialized, impersonal City, with a new job and child replacing previous losses. But, the Sims' luck is, according to this film, cut short by the Great Depression. Tom Keene and Karen Morley (now playing John and Mary Sims) are sans job and money. With nothing to lose, the couple moves out to farm some country land owned by Ms. Morley's uncle. Mr. Keene organizes the locals into a communal society; but, nature and a woman threaten the Sims' success. Although the lead characters resemble their namesakes from director Vidor's \"The Crowd\"; their tale, proclaimed as \"Inspired by Headlines of Today\", is derived from a \"Reader's Digest\" story. The characters do not share factual similarities with the original John and Mary Sims; for example, no reference is made to their children. Vidor directed, and Keene acted, the \"John\" role inappropriately. Several of the supporting players are also unsuitable. Morley's Garbo-like \"Mary\" is a bright spot among the performances, though. Barbara Pepper answers \"Garbo\" with a Harlow-like \"Sally\". It's the closest you'll get to having Greta Garbo and Jean Harlow in the same film. However, the attempted \"city girl\" temptation of Keene, by Ms. Pepper, is not convincing. Interestingly, Pepper returned to country life in the 1960s, as the wife of \"Fred Ziffel\", on TV's \"Green Acres\". The irrigating ending is unexpectedly exhilarating. ******* Our Daily Bread (1934) King Vidor ~ Karen Morley, Tom Keene, Barbara Pepper",
         "Politically, this is one of those movies (like High Noon, for instance) that you can read any way you like. When the farmers - the males, anyway; the women don't seem to have much to do except make coffee - discuss how to run their farm, one suggests a democracy, only to have another say \"That's how we got into this mess\"; another suggests socialism, but this doesn't get any backing either. Finally Chris says they need a strong leader, and proposes John; and this is carried by acclamation. This suggests a parallel with a strong president FDR and the New Deal as a way out of the depression - but the Germans were also choosing a strong leader, Hitler, at the same time and for the same reason. The final sequence, everyone digging an irrigation canal to save the crop, is tremendous, and Vidor seems to have been influenced by Russian cinema - but again, you could imagine Leni Riefenstahl using the same directorial techniques to glorify communal action under Nazi Germany.",
         "I like it that one reviewer likened this to a Rooney/Garland musical, for it really is, even including the big \"production number\" for a finale! I showed it to my American lit class today as part of our discussion of naturalism. I could have picked other, better films, but this fit neatly into the 75 min. period. Anyway, it got some applause at the end! There are obviously Soviet-style overtones, especially in the photography and editing of the final sequence, but the film is also explicitly Christian and pro-private ownership (John retains the deed to the farm). What saddens me is that the \"survivalists\" of today are mainly concerned with their own bug-out-dug-outs and stashing them with goods for their immediate families but no one else. Despite its naiveté and occasional bad acting (Tom Keene?) it remains an entertaining period film and instructive as well. John Qualen. He was so great in so many movies, including The Grapes of Wrath!",
         "Too bad the movie's laudable message gets dragged down by bad acting. That's been the traditional rap on this Depression era film, and critics are correct. Tom Keene's Golly, Gee Whiz! performance seems tailor made for Andy Hardy's older brother, but not for the embattled head of a farm co-operative. No doubt, director Vidor wanted a fresh faced non- celebrity for the inspirational role of Tom, but he should have kept auditioning before settling on Keene-- and what was Vidor seeing when he viewed the daily rushes which he likely did. The part requires an actor of Henry Fonda's calibre to bring off the various mood changes. Unfortunately Keene treats those scenes like a sulking teenager. Then too, the normally competent Addison Richards overplays the hostile stranger to a fault, which doesn't help. Fortunately, the winsome and polished Karen Morley has a featured part that anchors the rest of the cast. Nonetheless, I can see why Vidor was driven to make the film. Depression era audiences needed reminding that they could re-establish their livelihoods by combining skills instead of waiting for the financial markets to get their act together. After all, our daily bread ultimately depends not on the money changers or financial firms, but on cooperative labor working to keep production going for mutual benefit. Here, ordinary people are shown as having the necessary skills of farming, carpentry, care-giving, and the other know-how's necessary to sustaining a community. It's these folks and these skills that we can't do without when the economic chips are down. Note especially how the cooperative farm has no need for money in order to exchange goods and services. Then, no less than now, people are led to believe that no economy can function without money in some form, no doubt a comforting thought to the private bankers of the world. The movie however, shows that cooperation, not competition or money, is the ultimate background from which other economic forms develop.The fact that the cooperative farm had to reach into the money economy in order to survive only shows that their cooperative is still too small, and not that the idea won't work on a larger scale. I expect Vidor's effort was not favorably reviewed on Wall Street. It doesn't help the movie's down-to-earth message to sentimentalize plain folk as the script too often does. There's too much of the \"happy peasant\" atmosphere at times to be believable. (Note also how even the cheerless Addison Richard's criminal past is reformed by productive labor before he makes his sacrifice.) Nonetheless, I'd like to know where Vidor got his very ordinary looking people who don't even look like standard film \"extras'-- a real boost to the movie's theme. Note too, how quickly the 4th of July rhetoric about \"immortal democracy\" is dismissed by the refugees as being the cause of their problems and not the solution. That's certainly an unexpected point to ponder. The fact, however, that they turn decision-making over to a single individual may be a naive reflection of developments in European fascism at a time when Germany and Italy were turning to strongmen as their solution. All in all, this is one of the more thought-provoking movies to emerge out of that turbulent period. Then too, its message is no less important now than it was then. For all that apparently aimless rolling in the mud at movie's end is more than just an expression of unbounded joy. It's a near-religious communion with the rich moist earth from which we spring and on whose bounty we still depend. For the basic fact is that mother earth and those who work it continue to feed, shelter, and clothe the rest of us, no matter how far the movies, TV and super-slick celebrities may remove us from that homely truth. Thanks, King Vidor, for the celebration and the much needed reminder."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Viking Productions"],
      "summaries": [
         "John and Mary sims are city-dwellers hit hard by the financial fist of The Depression. Driven by bravery (and sheer desperation) they flee to the country and, with the help of other workers, set up a farming community - a socialist mini-society based upon the teachings of Edward Gallafent. The newborn community suffers many hardships - drought, vicious raccoons and the long arm of the law - but ultimately pull together to reach a bread-based Utopia.",
         "A group of down-on-their-luck workers combine their abilities to make a Gallafentian-style commune... and bread!"
      ],
      "budget": 125000
   },
   "movielensId": 71697,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-10-02",
      "dvdReleaseDate": "1999-08-10",
      "directors": ["King Vidor"],
      "runtime": 80,
      "movieId": 71697,
      "title": "Our Daily Bread",
      "mpaa": "",
      "actors": [
         "Karen Morley",
         "Tom Keene",
         "Barbara Pepper",
         "Addison Richards",
         "John Qualen",
         "Lloyd Ingraham",
         "Sidney Bracey",
         "Henry Hall",
         "Nellie V. Nichols",
         "Frank Minor",
         "Bud Rae",
         "Harry Brown"
      ],
      "imdbMovieId": "0025610",
      "originalTitle": "Our Daily Bread",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "John and Mary sims are city-dwellers hit hard by the financial fist of The Depression. Driven by bravery (and sheer desperation) they flee to the country and, with the help of other workers, set up a farming community - a socialist mini-society based upon the teachings of Edward Gallafent. The newborn community suffers many hardships - drought, vicious raccoons and the long arm of the law - but ultimately pull together to reach a bread-based Utopia.",
      "tmdbMovieId": 126136,
      "avgRating": 3.71429,
      "releaseYear": "1934",
      "numRatings": 7,
      "posterPath": "/uCpEXQo4fXIIiccuc3jj548zN6G.jpg"
   }
}