{
   "tmdb": {
      "original_language": "pl",
      "keywords": [],
      "imdb_id": "tt0099949",
      "video": false,
      "title": "Korczak",
      "recommendations": [
         67535,
         4443,
         24588,
         46210,
         70090
      ],
      "backdrop_path": "/uOdVaUmgyh9A4bNLK9EGN2wiU7G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Henryk Goldszmit vel Janusz Korczak",
               "gender": 0,
               "credit_id": "52fe4733c3a36847f812893b",
               "name": "Wojciech Pszoniak",
               "profile_path": "/bE7dvJ55cEqnVOrQFzMqohmyyQi.jpg",
               "id": 7108,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Stefania 'Stefa' Wilczynska",
               "gender": 1,
               "credit_id": "575707eac3a36859bd0002a8",
               "name": "Ewa Dalkowska",
               "profile_path": null,
               "id": 583448,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Maryna Rogowska-Falska",
               "gender": 0,
               "credit_id": "592518de9251413b8a009dad",
               "name": "Teresa Budzisz-Krzyżanowska",
               "profile_path": "/vrlk6N8VlFEQtlcbjswOt13CkjN.jpg",
               "id": 1138176,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Estera",
               "gender": 0,
               "credit_id": "592518e7c3a36878700098f8",
               "name": "Marzena Trybała",
               "profile_path": "/vfqD6niBrllSeXPxfz2Pfv1lINF.jpg",
               "id": 1408,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Heniek",
               "gender": 0,
               "credit_id": "592518efc3a36877bc00ae08",
               "name": "Piotr Kozlowski",
               "profile_path": null,
               "id": 56529,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Ichak Szulc",
               "gender": 2,
               "credit_id": "592518f89251413b8a009e32",
               "name": "Zbigniew Zamachowski",
               "profile_path": "/rfE2QqqCSRU3EY8cDdQBpULu6os.jpg",
               "id": 1145,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Max Bauer",
               "gender": 2,
               "credit_id": "592519029251413b4100a1b6",
               "name": "Jan Peszek",
               "profile_path": "/lS0frOAKzbV1Qv4repdos9bO3v3.jpg",
               "id": 41047,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Adam Czerniaków",
               "gender": 2,
               "credit_id": "5925190b9251413b8a009ebd",
               "name": "Aleksander Bardini",
               "profile_path": "/eKA1CdsPcekZzlYB9vzZAxDgRPm.jpg",
               "id": 1149,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Czerniaków's wife",
               "gender": 1,
               "credit_id": "592519159251413b54009cb2",
               "name": "Maria Chwalibóg",
               "profile_path": "/9YwysWQ4sNhOsBy7naF0eSsTM4V.jpg",
               "id": 136734,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Dyrektor w Polskim Radiu",
               "gender": 0,
               "credit_id": "5925191f9251413b4100a245",
               "name": "Andrzej Kopiczyński",
               "profile_path": "/8fIjxKR1c7WZ8VTvFjMZ83QDYBU.jpg",
               "id": 107869,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Szloma's mother",
               "gender": 0,
               "credit_id": "59251929c3a36877df00aa24",
               "name": "Krystyna Zachwatowicz",
               "profile_path": null,
               "id": 2817,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4733c3a36847f8128937",
               "name": "Andrzej Wajda",
               "profile_path": "/5qXVjs0C7EUye57zBFV5lZVN73w.jpg",
               "id": 2801,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "592518ae9251413b4100a001",
               "name": "Allan Starski",
               "profile_path": null,
               "id": 3563,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "592518a89251413ba0009705",
               "name": "Ewa Smal",
               "profile_path": null,
               "id": 66454,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56a9c40892514154750020c2",
               "name": "Agnieszka Holland",
               "profile_path": "/t7OOYOMIre88LLiWYepg8XnF9FD.jpg",
               "id": 1128,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "592518b79251413b5b00a411",
               "name": "Ewa Skoczkowska",
               "profile_path": null,
               "id": 960737,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "592518bd9251413b8a009d03",
               "name": "Magdalena Dipont",
               "profile_path": null,
               "id": 66453,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "592518c4c3a368782d0098e2",
               "name": "Anna Kowarska",
               "profile_path": null,
               "id": 1706997,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59251899c3a36877df00a777",
               "name": "Wojciech Kilar",
               "profile_path": "/cYhKap8Z8WAo4eXJozBpsZBzxrL.jpg",
               "id": 1400,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "592518a0c3a368780a00975b",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "592518cbc3a36877fd008e09",
               "name": "Wieslawa Starska",
               "profile_path": null,
               "id": 23616,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.199197,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 47430,
      "vote_count": 3,
      "budget": 0,
      "overview": "The story of Polish pedagogue Janusz Korczak and his dedication to protecting Jewish orphans during the war.",
      "similar": [],
      "original_title": "Korczak",
      "runtime": 115,
      "poster_path": "/vP0UUZ7AUP711WRSkj3uGM3r2hp.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Erato Films",
            "id": 2239,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Erbograph Co.",
            "id": 2240,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Regina Ziegler Filmproduktion",
            "id": 12994,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Telmar Films Intl.",
            "id": 90732,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zespol Filmowy \"Perspektywa\"",
            "id": 46568,
            "origin_country": ""
         }
      ],
      "release_date": "1990-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Agnieszka Holland"],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0099949/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzOTc2NTY2MF5BMl5BanBnXkFtZTgwMjk1MzEyMTE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Wojciech Pszoniak, Ewa Dalkowska, Teresa Budzisz-Krzyzanowska | See full cast and crew »"],
      "reviews": [
         "Moving, exciting, amazing. Perfect script, wonderful direction. Simply perfect. I have no idea why it's not much seen (maybe because it's in Polish). An amazing story about an amazing person, which makes you want to read more about him. I haven't read any of his books yet, but I sensed references to them in the movie. Both in black-and-white and take place during the holocaust, I don't like the comparison but Korczak is so much better than Schindler's List in so many ways. First- the story. This one is interesting. It's touching, it doesn't soften anything. I mention this because Schindler (the movie) was hugely successful and highly appreciated. This is a real must see.",
         "In Warsaw, Doctor Henryk Goldszmit a.k.a. Janusz Korczak (Wojciech Pszoniak) runs an orphanage with a great dedication and love for the orphans. After the invasion of Poland by the German army, his orphanage moves to the Warsaw ghetto with two hundred children. Dr. Korczak asks for food and money from the wealthy Jews and tells that his dignity is the two hundred children he needs to feed. When the ghetto is displaced to Treblinka by train, Dr. Korczak refuses a Swiss passport and embarks in the train with his beloved children. \"Korczak\" is a touching and heartbreaking film about a man that dedicated his life to raise a group of Jewish orphans in the invaded Poland. The biography of this man is impressive, and his self-sacrifice to stay with the children in their final journey is amazing. Andrzej Wajda uses black and white to disclose this dark moment of mankind history and his style seems to have inspired Steven Spielberg in his \"Schindler's List' three years later. The sad fate of Dr. Korczak and his 200 children is symbolic and very beautiful. This film was released on VHS in Brazil by FJ Lucas Distributor. My vote is eight. Title (Brazil): \"As 200 Crianças do Dr. Korczak\" (\"The 200 Children of the Dr. Korczak\")",
         "Once again Wajda returns to the war. Here, the Nazi-era ghetto is shown as a place of greater variety of experience than typically depicted. As Nazis film the street scenes we've grown accustomed to seeing, the hero of this film is able to run an orphanage with some semblance of normality, others are poor but not starving, and some Jews even live high on the hog trading with the guards. In fact, the studio-recreated scenes of ghetto death and poverty in the streets seemed cleaner, more airbrushed, than the ordinary town streets in Wajda's 35-year earlier A GENERATION (which was on the same bill when I saw this). But this is not a major criticism. Scriptwriter Agnieszka Holland's purpose isn't merely to retell Nazi horrors; her subject is how a moral force meets and responds to the holocaust. In his ghetto orphanage the director walls his children in to shield them. While he does business with the devil outside to keep them fed, inside the children care for each other, keep discipline with their own court of justice tempered with mercy, and put on classic plays (one dealing with death so the children will understand and not fear it). Wealthy, well-meaning gentiles outside the ghetto try to save the doctor, but he won't consider it. Finally, inevitably, the children are put in a railway car to the ovens. The whole point and power of the film is that this man's will has kept his children's humanity intact. When the end comes we feel their death in a personal way that few films on the subject have. Pszoniak plays Korczak (who is based on a real person) with great strength. Korczak's insistence on not accepting the Nazi status quo sometimes works, often doesn't even achieve short term ends, but is the only moral stand to be taken. The end, a fantasy shot of the children and the doctor running from the cattle car into a field of light, is somewhat controversial. It would, in another film, seem a poetic cop-out. Here, it works because even as the image plays out on the screen, your mind sees their real end that the rest of the film has prepared you for. One can't help but feel that Spielberg was influenced by this film when he made SCHINDLER'S LIST, a film that's perhaps visually more flashy than KORCZAK, but which doesn't have KORCZAK's clear moral purpose at its core. Wajda is given \"special thanks\" in the screen credits of the Spielberg film.",
         "This was Wajda's first movie after the election defeat of the Communists in Poland and deals with many aspects of human relationships in repressive times: kissing up to authority to make things better for others, resistance versus principled non-violence, blackmarketeering, trying to pass a member of an elite group, benefiting from others' bad luck, sacrificing friends for self-interest. The film is almost too burdened by looking at so much. In spite of this, it really remains focused on how Korczak can provide precious childhood to his orphans in the Jewish Ghetto. He is fiercely protective and uncompromisingly humane in giving his children space to grow and find comfort. Unlike \"Life is Beautiful\" he acknowledges his children will have to face death (at least of those close to them) and prepares them with the emotional tools to deal with it. He demands a children's hospice ward so that no Ghetto child would die without dignity alone on the street. Any hand-holding in bright light can only be metaphor for the spiritual leadership. Indeed the bedtime tucking rituals, and the occasional giving up his bed to his most troubled charges is the strongest symbol of the childhood comforts he tries to give them. Wojciech Pszoniak (Korczak) reminds me of Robin Williams as Oliver Sacks in Awakenings. He is so serious about those in his care, while at the same time able to provide them with good humor as needed. He is also a bit of a social misfit. Like Szpilman, Korczak is so well loved and respected by all Poles (and even some Germans), he seems to have been chosen by them to survive. Korczak's fate mirrors the Pianist in the sense that Szpilman is aloof and his existence becomes more and more isolated as people help him survive. But because Korczak is so engaged, and so devoted to his children, his fate becomes more and more wedded to theirs. Polanski is definitely more cinematic, but I think Wajda is more humanistic, especially from a script by Holland. In any event, the Poles cinematic treatment Holocaust is for me the most relevant, honest, and moving.",
         "A great, tragically truthful and sincere film. It is the work of art that leaves you with a heavy heart and with very sad, low mood. Mr. Wajda did a marvelous job depicting the tragedy of Dr. Janusz Korczak, a famous Polish Jew who was a writer, a doctor and who loved children with all his big heart. This black and white movie is very slow, tragic and merciless. The war is shown as it was - bloody, ruthless, cold-blooded and unbearable. The scene when the Nazi film crew makes a film in the ghetto is simply unutterably dark, especially when real documentaries creep in and you can see dying and dead people, skinny kids, sad faces and horrible ruins of Warsaw houses. The central story is excellent, as Dr. Korczak does his best in the horror of the ghetto trying to allow his 200 kids to live well as if there is no war outside. The final scene when the train carries them all to the death camp Treblinka makes your heart stop and when Wajda adds a symbolic final when all the children and their Doctor leave the train and go to the foggy morning, happy and kidding, made me cry. I was not able to stop my tears, my heart still aches now, when I recollect the scene of the happy children walking with the Jewish flag held high, and when you know that in fact they all suffocated in a gas chamber, while Korczak was telling them fairy tales just to make their deaths a bit sweeter if that was ever possible... A great, grand, moving work, and if there are people who did not cry after watching it, they have no heart. Thank you, Mr. Wajda. People like you will make us never forget that cruel war...",
         "SPOILER ALERT-ending is discussed. I saw this film a number of years ago with a Polish friend. She said that the version she saw in Poland had a different ending. The English version shows the boxcar fading into a cloud and then Korczak and the orphans emerging and fading up into the sky. I forget what ending she said the Polish version had, but it was more stark. I'm wondering whether anyone knows about this, and whether the director was involved in offering different final scenes. I think an interesting parallel are the endings of the 1975 East German and 1999 US remake of Jakob the Liar. Andrzej Munk's last film (he died in a crash during filming and it was finished by his student) The Passenger (1963) is another Holocaust-themed film that involves multiple possibilities and perspectives on what happened.",
         "Before Steven Spielberg's \"Schindler's List\" (1993) was Andrzej Wajda's \"Korczak\" (1990). Shot in melancholic blacks and whites, the film stars Wojciech Pszoniak as Doctor Korczak, a Polish-Jewish paediatrician who oversees an orphanage in war-torn Warsaw. As WW2 rages, and the Holocaust blossoms, Korczak does his best to shelter his band of two hundred or so Jewish children. Spielberg would consult and hire some of Wajda's crew whilst making \"List\", and would later include a \"thank you\" message to Wajda at the end of his film's final credit sequence. Unfortunately, like most \"holocaust cinema\", \"Korczak\" is a trite, sentimental film which reveals little about the historical and psycho-social forces at work behind the events depicted. We watch as Nazis brutalise Jews, as the saintly Korczak steps in, and of course the inevitable final act march toward gas chambers. It's \"Schindler's List\" without the murder-porn. Still, the overall thrust of Wajda's film is touching. Wajda's Korczak isn't a conventional saviour, but a man who resolves to join Jews on their journey toward certain death. He refuses to abandon them, refuses to make a dire situation worse, a seemingly useless act which nevertheless epitomises the height of courage, humanity and decency. \"Korczak\" has been compared to Louis Malle's Holocaust themed \"Goodbye, children\", but Wajda's climax is much more grim. Here we watch as Korczak's orphans are shipped to Treblinka, one of three \"Operation Reinhard camps\" (named after Reinhard Heydrich, chairman of the 1942 Wannsee Conference). Wajda's final title card then informs us that Korczak and his kids were gassed at Treblinka, but it's equally likely that the kids and adults were processed and separated here and then shipped further eastward for either gassing, internment or slave labour. \"You do not know how evil this film is,\" Claude Lanzmann would say to the wife of the French Prime Minister when Wajda's film was screened for a special audience in 1990. Some argued that the film absolved Poles of their role in the Holocaust, of their complicity, a fact which Wajda actually does touch upon; we see Korczak being betrayed by a number of prominent Polish figureheads throughout the film. Another complaint is that Wajda's final fantasy sequence, in which Korczak and his kids appear to be set free, is \"insulting\". A simplistic coda, maybe, but insulting? Throughout the film Wajda contrasts the idyllic innocence of the kids - an innocence which Korczak desires to preserve - with encroaching barbarism. The film's fantastical final sequence is in keeping with this theme. \"A pessimistic ending would have said to me that all these endeavours of Dr. Korczak were in vain,\" Wajda would say of his climax, \"that pedagogy in the face of force has no sense; that no efforts of man can reverse the fact that he is dying so accidentally. This would be an awful, existentialist point of view. There would have been nothing easier than showing the death of the children in a gas chamber. It would have been a very moving scene. Everyone would have been crying. But do we have the right, does art have the right to show this? Is art for this? Art has to stop short of certain facts, has to look for other possibilities.\" In short, Wajda does not believe that the futility of Korczak's actions negate the righteousness of his deeds. It's the old saying: better to die for a good idea than live for nothing, and no good deed can ever be tainted by its ultimate ineffectuality. It's a sentiment common in Holocaust films. 7/10 � For more interesting Holocaust films, see Costa Gavras' \"Amen\", Wertmuller's \"Seven Beauties\", Vittorio de Sica's \"The Garden of the Finzi-Continis\", Pontecorvo's \"Burn\", Marcel Ophuls' \"Hotel Terminus\", 1972's \"Winter Soldier\", Visconti's \"The Damned\" and Menno Mejes' \"Max\".",
         "Andrzej Wajda's Korczak (1990) is a film that I just had to quit half way through. I just couldn't make it to the end. 1) This film is just another episode in the NEVER ending sob story about the Holocaust. Frankly, I'm just sick of seeing and hearing about how six million Jews died at the hands of the Nazi's in WWII. Blah! Blah! Blah! Blah! Blah! Are they just going to keep making films, and TV shows, and documentaries about the Holocaust until the story of every single Jewish person who died in the Holocaust is recounted? OK!! I Get It!!! A lot of HORRIBLE things happened to the Jewish people at the hands of the Nazi's!!! Can We Just Get On To Other Things Now??? And every single one of these Jewish Holocaust stories is just another variation of the same tear jerking, depressing, despairing sob story. I Just Can't Take It Anymore!!! 2) This retelling of the story of Korczak in this film is just unreal. Even given that this film accurately covers all the historical facts, NO ONE could be as good, and saintly, and kind, and generous, and self sacrificing, and uplifting 24/7 like this film makes out this guy to be. I mean the Catholic Church should have beatified this guy and made him the first Jewish saint in Catholic Church history, if you believe this film. This film tried to make a saint out of a regular human being and it just didn't fly for me. Had this film made Korczak look more like a real human being, with some flaws and defects, it would've been much more closer to the historical person of Korczak, and I probably would've viewed the film to its conclusion.",
         "[CAUTION: SPOILERS] Although the film itself is admirable, I fear that the final scene is heavyhanded and out of place. In a film that does not provide any hints of highfalutin metaphor (it is, after all, a very plain film, with very little (if any) technical creativity or innovation), an ending such as the one presented is startling and out of place. Perhaps ending one scene earlier, with the train rolling along, fading to black, would have saved a great deal. The clear quote of \"Close Encounters of the Third Kind\" is also troubling and out of place (when Janus leads his children to the train, with his arms outstretched, it is a near-perfect parody of Richard Dreyfuss' character in the final scene of Close Encounters [spoiler] walking towards the alien spacecraft. (and then, the whiteness, the overexposure common to both end sequences.) There are plenty of other issues with the film, especially in its portrayal of the Polish residents of Warsaw as innocent bystanders, and in its use of Nazi footage and images from the Nazi propaganda machines in its depiction of Ghetto Jews. But that is for a different review.",
         "The Doctor strikes one as a solid man - man of courage, unbreakable. Yet to the entreaty of the resistance movement, he says \"I have no dignity. I have 200 children.\" What are we to think of his ultimate actions in walking his children into the death trains? Wajda seems to give these final actions an air of honor, and a dreamlike finale scene, but we must reflect what these children would suffer upon their peaceful entrance to those cars. What is needful, above all else is to remain living. But living as human beings, not slaves, victims of sexual and sadistic perverts, cattle. Where do we see the dignity of the human spirit in this film? We see it in the doctor and in the resistance fighters, perhaps in some of the kids. All others are broken spirits, hollow remnants of humans. Anything is worthwhile if it will maintain man's humanity in such times. They should have sang, danced, created, or fought, killed, destroyed. In the resistance fighters that rush upon the scene so briefly, we see the sparkling eyes of men not bound by fear, free men. Korczak also remains free spiritually, refusing the armband, but we see that in his personal resistance he can only expect to be broken or killed by one of the many Germans that he'll encounter. He can expect to see his children hideously killed, and himself comforting them to no avail. Anything is good if it maintains the spirit. Perhaps training the children to fight would have been appropriate. Certainly no non-violent means of resistance are affective against the Nazi's. As Gandhi says, non-violent resistance does not work on machines and beasts. The Nazi's were machines. It is tempting to condemn Korczak for his ultimate actions - thought it shows a pathetic tendency in him which runs throughout the film. He wants to give people a dignified death, to save children without sending the non-Jewish-looking one's to hide with Poles. Has he not shut himself to the truth - that truth which the escaped man yelled out on the streets before his death? \"They are sending you to your death!\" Korczak, the lover of children, leads them proudly to their cart. Had the resistance shot him as a conspirator and taken the children to be trained to fight, or disperse them to seek their own survival - would not this have been somehow better than aiding the Germans in a neat efficient murder of Jewish children? **** 2010 Update **** Rereading this after so many years - I see the foolish strictness of my college years. No one can know, growing up in a peaceful luxurious time, the feelings of a man responsible for the lives of all those children. I give all respect and honor to Korczak, blessings on his name and memory for the torments endured and the good he did in his life."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Erato Films",
         "Erbograph Co."
      ],
      "summaries": [
         "Account of the last days of life of the legendary Polish pedagogue Janusz Korczak and his heroic dedication to protecting Jewish orphans during the war. Jewish doctor Henryk Goldszmit, known also as Janusz Korczak, is a man of high principles. He is unafraid of shouting at German officers and frequently has to be persuaded to save his own life. His orphanage, set up in a cramped school in the Warsaw ghetto, provides shelter to 200 homeless kids. Putting his experimental educational methods into practice, he installs a kind of children's self-government, whose justice is in a big contrast to what is happening in the outside world. Right in front of the school, dozens of kids are dying or being killed everyday and their naked bodies lie on the street unattended. Ghetto's mayor assures Korczak that the orphanages will be saved. Korczak raises food and money for the orphanage from the rich Jews. In the final roundup he refuses to accept a Swiss passport and boards the train to Treblinka with his orphans.",
         "In Warsaw, Doctor Henryk Goldszmit a.k.a. Janusz Korczak runs an orphanage with a great dedication and love for the orphans. After the invasion of Poland by the German army, his orphanage moves to the Warsaw ghetto with two hundred children. Dr. Korczak asks for food and money from the wealthy Jews. When the ghetto is displaced to Treblinka by train, Dr. Korczak refuses a Swiss passport and embarks in the train with his beloved children."
      ],
      "budget": 0
   },
   "movielensId": 72027,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "1990-01-01",
      "dvdReleaseDate": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 115,
      "movieId": 72027,
      "title": "Korczak",
      "mpaa": "",
      "actors": [
         "Wojciech Pszoniak",
         "Ewa Dalkowska",
         "Teresa Budzisz-Krzyżanowska",
         "Marzena Trybała",
         "Piotr Kozlowski",
         "Zbigniew Zamachowski",
         "Jan Peszek",
         "Aleksander Bardini",
         "Maria Chwalibóg",
         "Andrzej Kopiczyński",
         "Krystyna Zachwatowicz"
      ],
      "imdbMovieId": "0099949",
      "originalTitle": "Korczak",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of Polish pedagogue Janusz Korczak and his dedication to protecting Jewish orphans during the war.",
      "tmdbMovieId": 47430,
      "avgRating": 3.75,
      "releaseYear": "1990",
      "numRatings": 6,
      "posterPath": "/vP0UUZ7AUP711WRSkj3uGM3r2hp.jpg"
   }
}