{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "drowning",
            "id": 793
         },
         {
            "name": "bullying",
            "id": 6733
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "dead body",
            "id": 10877
         },
         {
            "name": "severed head",
            "id": 11581
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "vengeful ghost",
            "id": 41411
         },
         {
            "name": "dead woman with eyes open",
            "id": 155434
         },
         {
            "name": "happy slapping",
            "id": 166865
         },
         {
            "name": "asthma inhaler",
            "id": 166867
         },
         {
            "name": "return from dead",
            "id": 166869
         }
      ],
      "imdb_id": "tt1100053",
      "video": false,
      "title": "Tormented",
      "recommendations": [
         55045,
         14848,
         225285,
         60086,
         26587,
         257093,
         159937,
         16167,
         19237,
         21927,
         74008,
         48015,
         55890,
         267457,
         40127,
         21562,
         13094,
         27588,
         10790,
         30685
      ],
      "backdrop_path": "/s8skHxQ4uuefR6Fsi10N1OY0vp2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bradley White",
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc19",
               "name": "Alex Pettyfer",
               "profile_path": "/vvjtt3bfbmd8FCaY6ZolRldYbNV.jpg",
               "id": 61363,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Natasha 'Tasha' Cummings",
               "gender": 1,
               "credit_id": "52fe4461c3a368484e01fc1d",
               "name": "April Pearson",
               "profile_path": "/9Yg5oa0ogCTE6usLO4fAA75dwzS.jpg",
               "id": 89820,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alexis",
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc21",
               "name": "Dimitri Leonidas",
               "profile_path": "/xPc3gIgpENKs5i6Yah55xvW6xoV.jpg",
               "id": 89821,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Darren Mullet",
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc25",
               "name": "Calvin Dean",
               "profile_path": "/lcuilklGa5nTnaFXa4gPNTM9UUd.jpg",
               "id": 74503,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Justine Fielding",
               "gender": 1,
               "credit_id": "52fe4461c3a368484e01fc29",
               "name": "Tuppence Middleton",
               "profile_path": "/aWKuVJnvySt2A9oFMo2hfB5AoM3.jpg",
               "id": 89822,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe4461c3a368484e01fc2d",
               "name": "Georgia King",
               "profile_path": "/o8OrqKT5o2AH8eakjonqWWj5xzL.jpg",
               "id": 73462,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Helena",
               "gender": 1,
               "credit_id": "52fe4461c3a368484e01fc31",
               "name": "Mary Nighy",
               "profile_path": "/2TDl4tezp4db9P6mY9aqsY6idrE.jpg",
               "id": 19774,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jason Banks",
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc35",
               "name": "Olly Alexander",
               "profile_path": "/obedd1o6D10bF5kNQCVeb1fbnJw.jpg",
               "id": 89823,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Jez",
               "gender": 2,
               "credit_id": "57d60a09c3a3684f2d0030e4",
               "name": "Ben Lloyd-Hughes",
               "profile_path": "/gHPfcEavyuBE9nN7H0zeV1kWpFR.jpg",
               "id": 1173230,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Nasser",
               "gender": 2,
               "credit_id": "57d60a309251416f62002f9f",
               "name": "James Floyd",
               "profile_path": "/dOObo1xKAeDxtR5mYdufAepCwh9.jpg",
               "id": 559622,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mei Lei",
               "gender": 0,
               "credit_id": "57d60a3a9251416f5e00322a",
               "name": "Sophie Wu",
               "profile_path": "/AtwCdj7Dk8qe3otYLAjARxlaD7.jpg",
               "id": 116883,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Tim",
               "gender": 0,
               "credit_id": "57d60a449251416f590031d7",
               "name": "Hugh Mitchell",
               "profile_path": "/wGYTO8bgMXFddLCXZZ5Gtz1aHoT.jpg",
               "id": 1364032,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Khalillah",
               "gender": 1,
               "credit_id": "57d60a549251416f590031e3",
               "name": "Larissa Wilson",
               "profile_path": "/iLVixGFSDf8dQSpCfLN7LBW659A.jpg",
               "id": 1221071,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Emily",
               "gender": 1,
               "credit_id": "57d60a77c3a3684f2b002fac",
               "name": "Ruby Bentall",
               "profile_path": "/uH5unnFpkR3S5DUH2c4b28Xe6Al.jpg",
               "id": 226083,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Marcus",
               "gender": 0,
               "credit_id": "57d60a809251416f50003128",
               "name": "Tom Hopper",
               "profile_path": "/yQRzlfR9ZNMvwCblJbdJdaW41nQ.jpg",
               "id": 1017294,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc3b",
               "name": "Jon Wright",
               "profile_path": null,
               "id": 89824,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4461c3a368484e01fc41",
               "name": "Stephen Prentice",
               "profile_path": null,
               "id": 89825,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.868316,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 23173,
      "vote_count": 54,
      "budget": 0,
      "overview": "The film centers on Darren Mullet, a bullied asthmatic, driven to suicide by his tormented life - ignored by his parents, ridiculed by his teachers and bullied at school. He returns from the dead to pay his teenage tormentors a final visit.",
      "similar": [
         4488,
         3597,
         3600,
         357096,
         281957,
         77949,
         13310,
         269149,
         238636,
         452507,
         10585,
         24124,
         16288,
         82507,
         7341,
         168098,
         277685,
         2048,
         9654,
         1948
      ],
      "original_title": "Tormented",
      "runtime": 91,
      "poster_path": "/ApONFA4846wfc5ONmYjYmmeRiVG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Slingshot Productions",
            "id": 64890,
            "origin_country": ""
         },
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Screen West Midlands",
            "id": 2310,
            "origin_country": ""
         },
         {
            "logo_path": "/cv1vihTOJIIN4NPNYLcf5SxUS9Y.png",
            "name": "Pathé",
            "id": 7981,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Forward Films",
            "id": 17748,
            "origin_country": ""
         }
      ],
      "release_date": "2009-05-22",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Jon Wright"],
      "runtime": 91,
      "synopsis": "The film opens with Justine Fielding ( Tuppence Middleton) being escorted out of school by the police, as other pupils look on. It then has a flashback to 5 days earlier, where Justine is reading at the funeral of Darren Mullett ( Calvin Dean). She starts to talk about him, when Jason Banks ( Olly Alexander) stands up in church and calls her a hypocrite because she didn't really know him. He is then thrown out of church by the sadistic PE teacher. Later on, Justine is talking to her friend Helena ( Mary Nighy) about staying in and watching a Keira Knightley DVD, when Alexis ( Dimitri Leonidas) decides to invite her to a party his friends Bradley ( Alex Pettyfer), Tasha ( April Pearson), Kally ( Larissa Wilson), Sophie ( Georgia King), and Marcus ( Tom Hopper) are having. She decides to go to the party, rather than staying in with Helena. At the party, Justine arrives and Tasha tells Jez, the DJ to say something about her appearance. He begins to rap about her, when Alexis tells him to stop, and he is thrown out of the party by Bradley. Later, Alexis and Justine go somewhere quiet, and he tells her they are on a date, at which point they kiss. Bradley, Tasha, Kally, Marcus and Sophie all receive horrible text messages from Mullett's number. During this, someone puts on a clown costume and grabs a chainsaw, before heading up to the room where they are kissing. The figure is revealed to be Bradley, who is playing a prank on them. Jez goes to the cemetery to celebrate Mullett's death, and urinates on his grave, but is killed by an unseen figure, who stabs him with a cross. Later, the group have a toast to Mullett's life, and Justine reveals that she can't even remember who he is. The next day, they arrive at school, and the headmaster mentions that Jez never came home the night before. Bradley threatens another pupil about removing a website he had put up about him. Justine is persuaded to hang around with the cool gang, and tells Helena that she won't be able to make it to her Keira Knightley DVD evening. She finds a teddy bear (stolen from Mullett's grave) in her locker and assumes it is from Alexis. He asks her on another date after this, which she agrees to. She goes to see Jason and he tells her that Mullett was in love with her, and hands her his suicide note. While she is reading the note, a teacher tells her that she will make a great pupil at Oxford university. The pupil threatened by Bradley is then attacked, and sees Mullett's ghost, but is listening to music through headphones, and the loud music sends him deaf. Over the course of the day, the gang get more messages, and Bradley believes Jason is sending them. Jason, meanwhile is in art class, and the teacher tells everyone that the guillotine is faulty and they shouldn't touch it. A boy sent by Bradley fetches him out of class, and then Bradley and Marcus chase him into the gym, where they give him a wedgie, but are interrupted by another message, meaning Jason cannot have sent it. The sadistic PE teacher then arrives and gives Jason detention. The girls decide that Helena has been sending the messages and attack her. Sophie tells Justine that she should sleep with Alexis that night, but goes back into the swimming pool, where she is attacked by Mullett's ghost and drowns. Later that night, Justine and Alexis sleep together, but are seen by Mullett, who tears the badge from her uniform, and re-arranges her fridge magnets, calling her a slut. She returns to school and shows Alexis the suicide note, but his friends tell her she cannot hand it into the police, because she would implicate herself in his death. Marcus is then in PE class, where he sees Mullett's ghost, and the teacher tells him to go and have a shower, just as the art teacher arrives and tells the head that they have found Sophie's body. In the shower, he is whipped with a towel by the ghost of Mullett. He manages to fight him off and heads outside, running into Helena, who accuses him of trying to rape her because he is semi naked. He manages to get outside, and is impaled upon a fence by the ghost. Later on, the gang are at Bradley's house, and they have an argument, where Tasha and Justine get into a fight, and Justine is thrown into the swimming pool. Bradley decides to go and dig Mullett's body up at the cemetery. While he is there, Tasha gets drunk in his car, and invites him to have sex with her. During the act, Mullett appears and pulls him out of the car, and kills him. Tasha runs away, but falls into an open grave, where she lies to Mullett that she fancied him, causing him to decapitate her with a shovel. Justine goes home, and demands that Alexis shows her the site, where it is revealed that he is one of the bullies, and that she was rude to Mullett because he interrupted a conversation about her going to Oxford. She tells Alexis that he is deceitful and a liar, and that their relationship is over. The next day, she arrives at the art class, where Jason painted Munch's \"The Scream\" painting, and tells him that she was responsible for Mullett's death. He tells her that it has been his fault, because he was scared of being bullied, so he told Bradley that Mullett fancied her. She leaves the room, and Mullett appears, and kills him by jamming two pencils up his nose and slamming his head against the table. Justine approaches Helena and tells her that she is sorry, that her friends, including Alexis were all horrible. Kally runs over and asks her where Tasha is, but Justine tells her she doesn't care. Kally then gets a text message from Tasha telling her to meet her in the art room. Before Justine can follow, she is confronted by Alexis, who tells her he is going to kill Mullett for what he has done to everyone. Justine tells him that Kally is in danger. Kally gets to the art room, and sees \"The Scream\" with her name on it, at which point Mullett puts a bag over her head, before using the guillotine to slice her hands off. She tries to call the headteacher, but he is too busy with the police, who tell him that Justine's badge has been found near the bodies of Bradley and Tasha. They get to the art room, and find Jason's and Kally's bodies, but are attacked by Mullett. They break free, by stabbing him in the stomach with a screwdriver and head to the common room, where Mullett follows them. Alexis tries to stop him, but is stabbed in the hand with the screwdriver. Justine gets him to stop, but he begins to choke her to death. She grabs his inhaler and throws it across the room, telling Alexis to smash it. He does, and the ghost begins to die. Justine tells Alexis to leave, but he punches Mullett, knocking a sofa over, and finding Mullett's other inhaler, which Mullett then uses. Mullett then stabs Alexis in the throat with the screwdriver. As Justine cradles his body, she looks up at Mullett, disgusted and says \"You know what, they were right, you do look like fucking Shrek!\", just as the police arrive. Justine is then led out and into the police car seen earlier, having been arrested for the murders. She sees Mullett's ghost but then it disappears. During the credits, there is a sequence where the PE teacher is telling students off, and Mullett is shown getting ready for revenge on him.",
      "writers": ["Stephen Prentice"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1100053/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3NDgwNzE4OF5BMl5BanBnXkFtZTcwNTk0MjA2Mg@@._V1_SY317_CR104,0,214,317_AL_.jpg",
      "actors": ["Stars: Alex Pettyfer, April Pearson, Dimitri Leonidas | See full cast and crew »"],
      "reviews": [
         "The head girl Justine (Tuppence Middleton) gives a speech on the funeral of the teenage schoolmate Darren Mullet (Calvin Dean) that has just committed suicide but she does not recall who he was. Then she is invited by Alexis (Dimitri Leonidas) to date him in the celebration party in the house of his friend Bradley (Alex Pettyfer). Sooner Justine discovers that Darren had a crush on her and was bullied by Bradley and his friends including Alexis. When each one of Bradley's friends is found dead, they discover that Darren has returned from beyond to revenge the humiliations he was submitted. \"Tormented\" is a funny and entertaining teen horror movie. The screenplay is not original, with the usual nerds, bullies and bitches, and will not be nominated to the Oscar, but there are unfair reviews in IMDb. This movie is not amateurish; the young cast is pleasant; the girls are very beautiful and sexy; and the ghost is really weird and creepy. There are sarcastic lines and situations and the deaths are generally violent and gore. Give a chance to this film and you may have a nice surprise. My vote is six. Title (Brazil): \"Distúrbio\" (\"Havoc\")",
         "I saw it last night at a special preview. I will admit I only wanted to see it because of Alex P, but I was pleasantly surprised. I hate Horror films, but this was much more of a slasher film, and very funny in parts, which allowed you to relax and enjoy it. The deaths are rather imaginative and only one was quite obvious what was good was that for most you could laugh through each death . The acting is good on a whole, but a couple of the main characters do need some acting lessons, the whole cast is quite young but they have been able to develop each character well. This film will not be for everyone. It is very 'Skins' (teenager) orientated,as it uses a lot of slang and such. The plot is rather unrealistic but thats what makes it fun, anything could happen, and most things do. I would recommend this to someone who isn't too bothered about what they are watching, who is up for a good laugh, but doesn't mind a bit of blood and guts.",
         "Tormented is directed by Jon Wright and written by Stephen Prentice. It stars Alex Pettyfer, Sophie Wu, April Pearson, Calvin Dean, Dimitri Leonidas and Tuppence Middleton. Music is by Paul Hartnoll and cinematography by Trevor Forrest. A bullied teenager at Fairview High School takes his own life but appears to have come back from the dead to take revenge on his classmates. Gruesome, fun and flavoured by pinches of satire, Tormented is a far better film than the internet ratings suggest. The serious subject of bullying makes its point, particularly late in the proceedings, but the makers are more interested in capturing the spirit of the techno teen times while focusing on the antagonists in their natural habitat. They are a dislikable bunch, not only in how they treat those they view as inferior to themselves, but also to each other. Even the central \"couple\" at the core of the plotting, the closest the film has to someone for us to side with as they strive to survive, come with bile baggage that reveals itself as we hurtle towards a deliciously spiky finale. There is much self-absorption and crudeness, sexulisation and ignorance, it's a bit of a kicker is this, but we are firmly on the side of the recently departed Darren Mullet (Calvin Dean). The cast performances are a mixed bunch, but this hardly hurts the picture, while serious gore hounds will lament the lack of close ups for the \"killer\" scenes. But this is more than a generic slasher, it has psychological smarts and nifty observations on modern technology's usage for cruel intimidation. It also knows how to have a good time, and you should too. 7/10",
         "An entirely predictable high school horror in which a bullied student commits suicide and then comes back from the dead as a malevolent zombie, taking revenge on everyone who wronged him. The only difference with this production is that it's British-flavoured, but in every other respect it's the kind of movie you've seen a hundred times before. The first thing that struck me as I watched this was the distinct lack of sympathetic characters. The high school students are a group of vicious and narcissistic bullies who you'll be waiting to get bumped off � even Alex Pettyfer, playing against type as a bad guy for once. Tuppence Middleton is, I suppose, the protagonist and somebody you're supposed to root for, but I found her as irritating as the rest. Vaguely interesting characters, like James Floyd's Nasser, are kept to the sidelines. The antagonist isn't very pleasant either. Watching this becomes a bit of a depressing experience, one in which you're just waiting for the next gore scene. And gory it is. The film-makers adopt the approach of making every death as inventive as possible, and there are some truly nasty moments played out for their absurd, comedic value as well as the bloodshed. The bit involving a guillotine is particularly outrageous and really works, and it's moments like this that stop TORMENTED from being a dog in the same way that non-starting hoodie horror F was a dog. In fact, it's fairly well made throughout, with well-shot direction and a perfectly-timed pacing. Perhaps not a film you'd ever want to watch again, but it does the business for a one-time viewing.",
         "Prior to watching this film I was looking forward to it, also I was curious because of the title. Tormented is your typical teen horror film, with a twist. It begins with the funeral of a bullied overweight school kid, Darren Mullet who committed suicide and soon turns into a situation that nobody would expect. He comes to life again to torment his tormentors. His only mission was revenge and payback. Interestingly everybody can relate with a person that they know who your typical overweight kid looks like Darren Mullet. He becomes a serial killer with the violent hunger for the taste of revenge. The victims are a bunch of your popular, athletic and preppy teens. They meet their fate in the ways only you imagine in your head. We have all thought of having been dropped from a distance onto metal fencing. The imaginative deaths give the film a comedy look as well as being horror. This is a big plus to the film as it makes your cringe and smile at the same time which is pretty rare. The acting I was impressed with, a quick fact I found was that the suffocation of Kalila was not CGI it was done in real and wasn't edited. This shows the commitment into the film. The negatives are the fact that the film is very stereotypical. Schools in Britain are not like the film. This is coming from a 16 year old who attends an academy school which ranges from the ages of 11-19. The stereotypes bring the film down. All together it is a decent film, but unfortunately not a \"must watch\".",
         "Let's face it; growing up through the ever encumbering teenage years can be tough. What with the numerous social pressures from peers, the raging hormones, dead serial killer bully victims and the fact that your every move pretty much defines your life from then on�it's quite possibly the hardest time of your life. But hold on just a minute, what's this about homicidal, vengeful ghosts of overweight asthma kids taking out their angst on other high school clichés from the chavs to the goths and emos? Well, yeah, it happens�not a lot, but Tormented goes on the record to prove just how much more inconvenient this little chink in the chain of teenage life can be. Think you have a headache from exam stress? Try having pencils shoved through your nose into your cranium, or perhaps something more traditional like a screwdriver through the throat; now, that's tough. Like all brilliantly devised horror stories however, we must start at the beginning�the humble innocence of a time when ghosts and bloody murder seemed neighbourhoods away in some dingy alleyway somewhere, or perhaps confined to DVD collections of your average ditsy teenage girl. Here our story begins at the funeral of Darren Mullet, a guy with such a terribly obvious-to-pick-on name and stature that if it wasn't for the fact that he was the one being buried, he probably wouldn't have been invited. The same goes for his bombastic wake party hosted by his school peers who only ever knew him by his nickname (Shrek) and use the outing as another social ritual of alcohol-fuelled bedroom disappointments. All is going pretty well for the hypocrites and social pundits of Wherever High, that is, until big buzz-kill Darren decides to crash everyone's party and start bringing the thunder through various, very elaborate and poignantly ironic means of murder (it's pretty obvious he was horror buff)�well, when he's not gasping for air and taking a puff of his inhaler. Good news is though, that you can still get a reception in the afterlife because Darren even finds the time to send some rude, antagonising messages to his victims before slaughtering them; classy. Sound comical? Well, it is, but not entirely in a good way. You see, while Tormented is being touted as being a \"comedy horror\", you could just about tag that onto most horror movies without causing much of a ruckus. The fact of the matter is, Jon Wright's movie can be fun (as fun as a movie that essentially strives to take the subject of teenage suicide and depression and look at the� ahem, funny side can be), sure, but it's also a bit of a drag at times. On the one hand you have this ridiculous plot which never seems to take itself too seriously, which makes for some entertaining watching at the very least�but then on the other you have this very fine cast ensemble who lend the movie a sense of Skins-esquire realism that distinctly puts the otherwise campy and self-depreciating narrative on a bit of a backburner, despite the fact that most play broadly written caricatures. The resulting feature is fragmented and somewhat perplexing; not quite dissimilar from your average teenager then, I guess. Tormented can be genuinely funny, a little spooky, and even somewhat moving in a couple of scenes, but too often it's the case that the viewer will be left laughing at the movie rather than with it (a primary example being one of the best ads for safe-sex I've seen in a while). Sure, it offers a horror experience that, because of its levity, doesn't numb the cortex, but neither does it really make that much of an impression. Instead, the entirety of the movie can be written off as being a mildly amusing, but mostly insignificant distraction. Horror buffs will probably enjoy all the farcical horror shenanigans a lot more than your average cinephile of course, because despite the fact that Tormented really isn't a great movie per se, it's at least got all the staples and defining traits of your average back row snog-fest to fill up the awkward silences with guffaws of \"Oh my God, look at that guys chest bleed! Awesome!\". However, if you do decide to�or if you have already taken it upon yourself to�see Tormented, take a moment with me now to reflect on the life of poor Darren Mullet that was taken when he hung himself instead of just, you know, not using his inhaler anymore.",
         "By-the-book genre pictures shouldn't be as fun or as artfully made as \"Tormented\" --- it will spoil horror fans and raise our expectations to a level where we can't enjoy by-the-book genre pictures that are simply average. These films are supposed to be of-a-moment in both dialog, style, and campy humor, which it delivers consistently cunningly throughout. The characters, while conventional slasher \"types,\" talk their trash effectively and with a certain dose of gritty realism that makes you buy into their callous cruelty. \"What did that poor boy ever do to you?\" the Polyanna-ish Tuppence Middleton (the Oxford-aiming \"good\" girl of the piece) asks the excellently snotty April Pearson. \"Oh, I don't know. We were bored. He was a spaz. You do the math,\" she retorts. The dialog is also ACTUALLY funny...perhaps the only time I can remember laughing genuinely at a slasher since \"Heathers\" --- and that wasn't technically in this genre (but in a genre by itself). In particular, the non-sequiters spouted by the Greek chorus of punks and straight girls is potently hilarious. You realize, amazingly, that British wit suits this type of outing quite well, more than obvious stateside humor. The kills are fairly inventive, executed with sharp, quick brutality and appropriate sadism...they look like they would *really* hurt, on more than a physical level. The movie is also unique in that you see the killer quite clearly for most of the picture---it's not a big head game. And even though it's fairly standard, all in all, I found it flew by....I was never bored. Recommended highly for fans of the genre. Everyone else will find it a mixed bag.",
         "This kid kills himself and we immediately follow up afterward, the funeral as one of this guy, Darren's friends calls out everyone of the high school students in attendance as hypocrites. It seems the one who committed suicide was one of the ridiculed, Darren Mullet(Calvin Dean) was called fat and ugly by the popular snobs of the school. Justine(Tuppence Middleton)stood and talked at Darren's funeral despite not even knowing him. Justine chooses to dump her nerdy friends for the popular kids and their toxic personalities. Jason(Olly Alexander) is Darren's only friend, another kid looked down upon by his peers. Justine is smart and pretty, accepted to Oxford for a law scholarship, and takes a shine to Alexis(Dimitri Leonidas). Brad(Alex Pettyfer) is the jock leader of his \"snotty twats\" and enforces his will on all the nerds and undesirables of the school. There's this scene that rightfully infuriates me..Justine bypasses her usual desk next to her smart friends and sits with the popular girls. This movie features bullying, a topic that permeates with me intensely. I passionately loathe bullies who use their size and aggression to torment those smaller than they are. Jason is a constant target of Brad and his bigger pal Marcus(Tom Hopper) who are always a nuisance to the weaker students. We get a scene specifically designed to draw an angered response..Jason is chased down, given a wedgie, and punched in the face(not to mention, kicked on the ground), with Brad and Marcus' soccer coach letting them go without a hitch while criticizing the victim. Justine is in over her head as the pack of hyenas she now associates herself with(in this case the bitches)Sophie(, Khalilla(Larissa Wilson), and Natascha(April Pearson), for they eventually run her life. A series of text messages are sent to the repulsive bullies warning of their deaths to come from Darren Mullet's cell phone(their nickname for him was \"Shrek\"). They think the messages were sent from the nerds, and pick on them because of it..they'll soon realize he's very real, and dead serious(emphasis on dead) about getting even. Mixture of slasher and zombie movie, TORMENTED is ultimately an indictment on bullying. The \"death texts\" have become a familiar mechanism to use in horror movies these days going back to One Missed Call, forewarning future victims of a fate most unkind. I won't lie watching movies where bullies get their asses handed to them is pretty gratifying, better fiction on the screen than in real life. Hands taken off with a paper cutter, head lopped off with a shovel, paddle across the face forcing an eye to bulge(not to mention the victim gets his own wedgie, before his neck is impaled on a sharp gate), screwdriver through the hand and neck, silver crucifix from a grave penetrating through the torso, & a drowning(Darren sits on this victim underwater in a pool!)are ways Darren gets his revenge. There's a twist in the end questioning Justine's psyche. Clever joke after the credits roll temporarily regarding the cruel soccer coach as well. I wish the filmmakers would've went further with the lesbian tension between Tasha and Justine, but alas, this would never be.",
         "The best thing about Tormented is the opening and closing credits, which were original and interesting. The opening 10 minutes weren't bad, but from then on things go downhill and rarely pick up. The main problem with this film was the poor storyline and script. Direction and acting were okay, and quite stylish at points, but the storyline itself wasn't sufficient to tread a path between horror and comedy. The bullying is over-the-top and unbelievable, certainly for the age of people involved; characters were kept paper-thin; and the script riddled with clichés. You simply didn't believe what was happening, nor that, when events turn nasty, the protagonists greet them with such an indifferent attitude. Logic is out of the window - a school with 3 recent deaths, an unexplained accident, and a disappearance - yet no sign of the police, and the school still open ... hmmmmmmm. The bottom line is, this is another film that seems incapable of representing British school students as they really are, and opts for cliché which doesn't go far enough for parody. The result leaves the viewer too detached to show much interest in the events, and there aren't enough laughs to retain interest on a purely comedic level (the only laugh coming from the discovery of the 'full condom', and we have to wait an hour for that). Of interest to those who might like Skins, if only to see something much worse. A shame.",
         "After watching this film, I'm still not sure if the title, Tormented, refers to the students of the featured High School, or the audience that had to sit through this film. Tormented is one of these films that has a deeper meaning, but it takes it's message to such extremes, that it becomes completely obsolete. Tormented is actually an anti-bullying film, that features an obese teenager, that has committed suicide after years of abuse. Instead of focusing on the ones left behind, the story instead focuses on the popular kids, who continue to \"torment\" the kid after he's gone, that is until his ghost shows up looking for revenge. The story isn't the worst idea I've ever heard of, but the film was so fake and over the top that it just ruined all it's credibility. Tormented features a fully functional ghost, with emotions, who gruesomely kills people. The special effects that show him as a ghost and the ridiculous amounts of kool-aid blood, were just some of the worst I've ever seen. Magic Mike's Alex Pettyfer stars as the bully and much like the rest of the cast, is far too old to be playing a high school student. Films like this are low budget, and I understand they need a person of name in order to be recognized, but I've always felt that they should cast real teenagers, and give them a chance at breaking into the business, rather than have the roles played by actors that are pushing thirty! Tormented is exactly how you'll feel as this film plays to the lowest common denominator, assuming that only ignorant people are going to watch it. They'll do things like call the victim, Shrek and show goth kids who think it's cool that he killed himself. Tormented is not funny, scary, or anything but a complete waste of time."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "BBC Films",
         "Screen West Midlands",
         "Slingshot Productions"
      ],
      "summaries": [
         "The head girl Justine gives a speech on the funeral of the teenage schoolmate Darren Mullet that has just committed suicide but she does not recall who he was. Then she is invited by Alexis to date him in the celebration party in the house of his friend Bradley. Sooner Justine discovers that Darren had a crush on her and was bullied by Bradley and his friends including Alexis. When each one of Bradley's friends is found dead, they discover that Darren has returned from beyond to revenge the humiliations he was submitted.",
         "A bullied teenager comes back from the dead to take revenge on his classmates."
      ],
      "budget": 700000
   },
   "movielensId": 72041,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-05-22",
      "dvdReleaseDate": null,
      "directors": ["Jon Wright"],
      "runtime": 91,
      "movieId": 72041,
      "title": "Tormented",
      "mpaa": "",
      "actors": [
         "Alex Pettyfer",
         "April Pearson",
         "Dimitri Leonidas",
         "Calvin Dean",
         "Tuppence Middleton",
         "Georgia King",
         "Mary Nighy",
         "Olly Alexander",
         "Ben Lloyd-Hughes",
         "James Floyd",
         "Sophie Wu",
         "Hugh Mitchell",
         "Larissa Wilson",
         "Ruby Bentall",
         "Tom Hopper"
      ],
      "imdbMovieId": "1100053",
      "originalTitle": "Tormented",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["deDMdV6YWtc"],
      "plotSummary": "The film centers on Darren Mullet, a bullied asthmatic, driven to suicide by his tormented life - ignored by his parents, ridiculed by his teachers and bullied at school. He returns from the dead to pay his teenage tormentors a final visit.",
      "tmdbMovieId": 23173,
      "avgRating": 2.80208,
      "releaseYear": "2009",
      "numRatings": 48,
      "posterPath": "/ApONFA4846wfc5ONmYjYmmeRiVG.jpg"
   }
}