{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "blindness",
            "id": 164092
         }
      ],
      "imdb_id": "tt0048919",
      "video": false,
      "title": "23 Paces to Baker Street",
      "recommendations": [
         83015,
         40687,
         37604,
         253307,
         29416,
         34665,
         48989,
         33765,
         160660,
         43256,
         28784,
         58902,
         65501,
         86236,
         60481,
         74397,
         84109,
         89160,
         80320,
         77368
      ],
      "backdrop_path": "/fS7oPk9p1pYDgWgkvYBYjltWC9B.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Phillip Hannon",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb93b",
               "name": "Van Johnson",
               "profile_path": "/6sWt0ilIFgggXr2wtUia3iv8dYa.jpg",
               "id": 37446,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jean Lennox",
               "gender": 1,
               "credit_id": "52fe4827c3a368484e0eb93f",
               "name": "Vera Miles",
               "profile_path": "/qWP9L969DOSFgBhRV2Ik2ve8Z4r.jpg",
               "id": 7303,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bob Matthews",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb943",
               "name": "Cecil Parker",
               "profile_path": "/62aOulE64RjUEDWAVqJeWMS9JM3.jpg",
               "id": 14300,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Inspector Grovening",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb947",
               "name": "Maurice Denham",
               "profile_path": "/ydLx73MkFrl498jrgfo6nD2DrdT.jpg",
               "id": 39952,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lady Syrett",
               "gender": 0,
               "credit_id": "52fe4827c3a368484e0eb94b",
               "name": "Isobel Elsom",
               "profile_path": "/ccoA79FB3Buw1rooFBkCSqVnrpt.jpg",
               "id": 95263,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Barmaid",
               "gender": 1,
               "credit_id": "52fe4827c3a368484e0eb94f",
               "name": "Estelle Winwood",
               "profile_path": "/xtmdaPh7ksaUqx56yCRmIryrGiS.jpg",
               "id": 47504,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr Murch",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb953",
               "name": "Liam Redmond",
               "profile_path": "/9HsE0np29N40U7s25rYsM7oJBew.jpg",
               "id": 83827,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Pillings",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb957",
               "name": "Martin Benson",
               "profile_path": "/eEMTkgRLGJWxBjYsFwpel83zsBy.jpg",
               "id": 9912,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Janet Murch",
               "gender": 1,
               "credit_id": "52fe4827c3a368484e0eb95b",
               "name": "Natalie Norwick",
               "profile_path": "/ddMZiiEyj5MrVZg0oDDlqZNX5dN.jpg",
               "id": 153430,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Sergeant Luce",
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb95f",
               "name": "Terence de Marney",
               "profile_path": "/9SyHhcDhcUBDdfnCA2yteea8UtE.jpg",
               "id": 100790,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4827c3a368484e0eb937",
               "name": "Henry Hathaway",
               "profile_path": "/aHXD9EFWbtftnaBzPYfO2dkLLKd.jpg",
               "id": 37360,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4827c3a368484e0eb965",
               "name": "Henry Ephron",
               "profile_path": "/hfbd1CeAICXyesMBDqY3c2ahR0d.jpg",
               "id": 122964,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb96b",
               "name": "Philip MacDonald",
               "profile_path": null,
               "id": 3354,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb971",
               "name": "Nigel Balchin",
               "profile_path": "/wer8Aj7cIyqhN0dbA0FvhGGvKcV.jpg",
               "id": 137973,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb977",
               "name": "Leigh Harline",
               "profile_path": "/cE6Wt8ZoGfDfXjVcUgsi4TRb8ls.jpg",
               "id": 5467,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb97d",
               "name": "James B. Clark",
               "profile_path": null,
               "id": 38250,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a368484e0eb983",
               "name": "Milton Krasner",
               "profile_path": "/mcCWfNEjNZc7tLd4QXN6epluwfG.jpg",
               "id": 10602,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ab9cb0cc3a36871ce00e8ec",
               "name": "Maurice Ransford",
               "profile_path": null,
               "id": 132251,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5ab9cb190e0a26364b00e2a5",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5ab9cb20c3a36871dd00ca48",
               "name": "Fay Babcock",
               "profile_path": null,
               "id": 34362,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5ab9cb26c3a36871cc00c808",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5ab9cb2f9251414d2b00d695",
               "name": "Travilla",
               "profile_path": "/9PSAdjsMLjnNgo6tV5meAtkRPWN.jpg",
               "id": 11445,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5ab9cb399251414d2800d13b",
               "name": "Edmond F. Bernoudy",
               "profile_path": null,
               "id": 1351504,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.19046,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 71171,
      "vote_count": 17,
      "budget": 1375000,
      "overview": "Philip Hannon, a blind playwright living in London, overhears part of a conversation , that leads him into a desperate race, to find a kidnapped child. When he gets no help from the police, he along with his butler, and his ex fiancée, attempt to track down the crooks.",
      "similar": [
         646,
         657,
         667,
         708,
         668,
         682,
         699,
         253,
         691,
         707,
         714,
         627,
         658,
         954,
         170,
         177677,
         146216,
         379149,
         297761,
         259693
      ],
      "original_title": "23 Paces to Baker Street",
      "runtime": 103,
      "poster_path": "/5mhrIL0R8a41xeCGif2VMObLC6d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1956-05-18",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "STEP-BY-STEP...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Hathaway"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Nigel Balchin",
         "Philip MacDonald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048919/",
      "coverLink": null,
      "actors": ["Stars: Van Johnson, Vera Miles, Cecil Parker | See full cast and crew »"],
      "reviews": [
         "If you have worn out all your Hitchcock videos and need a good way to fill in a few hours on a rainy afternoon, this is the movie for you. A blind play-write over hears a fiendish conversation and is determined to intervene. Armed with his trusty man-servant and beautiful American female companion, this flick delivers on many levels, right up to the twist at the end. They don't seem to make movies like this one anymore. Mores the pity. A must see for all suspense fans, plus a lovely glimpse into 50's London. Scored it as 8/10.",
         "I just caught this movie on cable and I was drawn into it. This is a very Hitchockian type of thriller. Blind mystery writer overhears kidnapping plot, but of course no one wants to believe him except his 2 good friends, one who wants to marry him. It had a a few chuckles along with suspense. Particulary when playwriters friend/aid is sent on a epic chase through London following a suspect. Playwriter of course nearly gets himself killed trying to figure out the pending kidnapping himself. A few colorful characters a good mystery plot, a lovelorn but smart girlfriend, a bitter playwriter who no one takes seriously and a very clever twist makes a very good movie. I wish for more nice quiet mysteries like this.",
         "I saw this film a number of years ago, with someone very special, and just before the cineplex facilities effected closing the majority of the conventional, free-standing movie theaters in large cities and small. Just saw it again, after a number of years. We sat in the balcony, and, having always enjoyed Van Johnson's work, I enjoyed this clever, interesting story even more than if the lead had been someone else. With all of the elements and twists one finds with Hitchcock, the fact of the principal character's blindness is effective and adds a dimension to the mystery/thriller aspects of the film. (Of course, this handicap is necessary, since a sighted person would have seen what he overhears in the pub, setting-off the drama changing the story's essence. And, it adds to the quality of the story that this factor is not exaggerated or \"hokey,\" and everything surrounding it is logical and believable.) There are the two primary co-stars with Johnson, and absent are the greater number of characters surrounding the leads which one would normally expect to find - and the movie is better for this. Van Johnson, who is now 90, in my opinion is underrated as a talent. He had boyish, casual good looks, and came into film as a leading man during a period when as handsome as they were, most leading men always seemed to have a pint of Wildroot or Brilliantine in their hair (e.g. Tyrone Power, Flynn, Robert Taylor). He played light comedy, serio-comedy love stories, and serious roles with talented, versatile performances. Like Alan Ladd, although not regarded in this capacity, he'd had experience as a male chorus member/dancer in earlier career - during the era when more of the nightclub/review type of entertainment was present. This film is interesting, with a neat, tight story, engaging characters and performances - and now that it is 50 years since its release, it also provides a nostalgic look at a film from the mid-1950's, with that period's \"noir\" characteristics.",
         "Hathaway was a brilliant director.He did never,until the very end (\"the last safari\")produce anything truly mediocre:from \"the witching hour\" to \"True Grit \"and \"Nevada Smith,his work encompasses such classics as \"lives of a Bengal lancer\" \"Peter Ibbetson\" \"House on 92 th street\" \"kiss of death\" \"niagara\" \"Legend of the lost\",sorry if I cannot mention them all. Influenced by Hitchcock's \"rear window\" (Vera Miles was a Hitchcockesque actress although she had yet to work with him in 1956 ),\"23 paces to Baker street\" ,on the other hand ,had on strong influence on Frederick Knott whose \"wait until dark\" was transferred to the screen by Terence Young with Audrey Hepburn in 1967: the scene of the \"broken lights\" was stolen from Philip McDonald.(\"Now we are equal;not afraid of the dark,are you?\") \"23 paces to Baker Street\" should appeal to people who enjoyed the two movies I mention above;it takes place in a foggy London,with plenty of suspense and a plot which is sometimes a bit complicated and far-fetched but it does not matter:you watch it just like you read Agatha Christie's books.",
         "This I assert is a minor masterpiece of film-making, which has long been underestimated by critics but never by fans. Its images, I suggest, burn themselves into the mind where other cinematic tales soon pale and are forgotten. To mention just a few scenes, the film presents a blind playwright describing the view of the Thames to the fiancé he left behind, a lovely nanny who isn't quite what she seems playing another nanny or perhaps not, a sightless man guiding a lost man through a fog, the same man discovering that a building's front isn't there and a battle in the darkness between a murderer and victim. The script, adapted from a tense Philip MacDonald novel by Nigel Balchin, was made into what I say is an expensive-looking and relentlessly beautiful film by veteran director Henry Hathway. Henry Ephron produced, and every element was realized seemingly by flawless skill, from understated music by Leigh Harline to the cinematography by Milton R. Krasne, to the art direction by Lyle Wheeler and Maurice Ransford, to the outstanding set decorations by Walter M. Scott and Fay Babock and costumes by Travilla. Add famed Ben Nye as makeup artist and the great Helen Turpin as hair stylist and it would be hard for this film to have gone anything but very right. The cast is headed by lovely young Vera Miles as the love interest and Van Johnson coming near something very fine as the blind playwright, Philip Hannon. Maurice Denham plays a befuddled police Inspector, and Cecil Parker tries hard as Hannon's assistant. Patricia Laffan has her best role since Quo Vadis as the mysterious Miss MacDonald, stealing every scene she is in. Other actors showing to advantage include within this strongly-made and taut fictional noir mystery Liam Redmond, Isobel Elsom, lively Estelle Winwood, Martin Benson, Natalie Norwick, and Terence de Marney. On the grounds of pace, intelligence of dialog and sheer memorability alone, this is a Top Hundred film, and the father to many stories starring blind protagonists from TV's \"Longstreet\" to \"Wait Until Dark\". There had been films about a blind central character before; but this Technicolor, attractive and exciting film was the project that brought the idea of such films to the minds of producers and viewers alike as none before had done. The mystery I believe is an interesting one, the characters believable from first to last, and the extraordinary work by Patricia Laffan and Vera Miles raise the film far above its competitors' best. It is clearly much better than \"in the Heat of the Night\", the obsessive \"Vertigo\" or even \"Key Largo\". And its makers accomplish its power without striving consciously to achieve it. Were it not for \"Rear Window\", the film might be considered the best 50's noir of all. I recommend it unreservedly.",
         "This is one of those films that work very well indeed. It is (in it's way) similar to Hitchcock's REAR WINDOW, except that film gets Jimmy Stewart, Grace Kelly, and Thelma Ritter involved with more than just Raymond Burr's crime - it gets them involved with the lives of all their neighbors in that courtyard in Manhattan. Here the film pares down the involvement of Van Johnson, Vera Miles, and Cecil Parker into the solution of who is the target of a kidnapping plot, and where will it be pulled off. But the film is as full of twists as Hitchcock's best films, and has a neat twist in the final confrontation that beats out Raymond Burr's confrontation with Jimmy Stewart and Stewart's flash bulbs.",
         "Philip Hannon is a blind playwright residing in London, during one of his R&R moments at the local public house, he overhears part of a conversation that suggests the vile kidnapping of a child. Getting the police force to take him seriously proves hard to achieve, so with the help of his trusty butler and his ex fiancée, Jean Lennox, he hopes to avert a dastardly crime. Well well well, sometimes you can tune into a film not expecting much more than a B movie rush, yet just occasionally you get submarined and get a mysterious treat that deserves far better support than it actually gets. I have been delighted to log on to this films page and see that others have been entertained by this picture as much as myself. This is not ground breaking or even remotely original, in fact it does play out as some sort of cheap knock off idea that Hitchcock turned down in his sleep, but you know what? Sometimes a film can be great just for having an honest will to entertain the viewers with suspense and mystery being its main fortitudes. Henry Hathaway directs and it's just another film to prove that as up and down as his career was, he was never afraid to tackle different genres, here, with the London location totally interesting, he manages to knit it all together with impressive results. Van Johnson has his critics, and it would be foolish of me to not concur that at times he has been wooden, but here as the blind Phillip Hannon, he shows that if given good enough roles he was more than able to rise to the challenge. Not one to revisit often for sure, but seriously recommended to those who like the genre and are stuck for a good film to watch. 7/10",
         "Now I will go to great trouble to avoid entering a spoiler like an earlier commenter. I give this film such a high rating because of the cleverness of toe concept: a blind man overhearing a conversation which indicates a crime is afoot. A tip of toe hat to the commentator who noticed the similarity between this movie and Argento's Cat O' Nine Tails ... a similarity that immediately crossed my mind the first time I saw the Argento flick. Anyway, 23 Paces to Baker Street could easily be an Argento giallo with the clever plot twists, but it lacks the gore most Argento fans want. I enjoyed 23P in 1956 when it was new and I was my voice had not changed. The plot twists and surprises have remained vividly in my memory for 50 years. Oddly I didn't notice a resemblance to Rear Window but I was very young then. I heartily recommend 23P to Baker Street. It's most suspenseful!",
         "On a visit to London, an apparently recently blinded American playwrite over-hears a highly suspicious conversation which may or may not mean a kidnapping... together with his manservant and former secretary he begins to try and put the pieces together. For 1956 this is a surprisingly twisted piece, involving both highly unconventional villain and target/victim. Delicious shots of mid-50's London (check out Barker's of Kensington), a serviceable performance by Johnson, Miles decorative but wasted (except in one scene), the glorious Parker, and Winwood hamming it up to the hilt, all add up to an enjoyable sub-Hitchcockian romp. Yes it owes a debt to 'Rear Window', but then 'Wait Until Dark' owes a debt to this!",
         "I have watched this particular movie several times; of course, I most likely do that with a lot of movies that are my favorites : ) The basic story is of a somewhat embittered, well-to-do man who had lost his sight fairly recently becoming reinvigorated about life again when he thinks that he overhears parts of a discussion in a bar that may suggest that there is a murder being planned. The acting, writing and direction are superb! As the plot begins to unravel, you are truly pulled along more and more into the story; it is VERY entertaining, especially for those who like good mysteries a la Sherlock Holmes. If I may throw in a bit of a sort-of non sequitur here, (at least as far as any huge similarities in the two movies,) but, it's interesting, at least to me, to note the similarity of character between Van Johnson's blind detective here, and Karl malden's character in Dario Argento's \"Cat O' Nine Tails\" where he also plays a blind 'detective'. Just a thought, nothing serious, (however, that is also a very good mystery, just a little heavier content due to being more recent and from Argento, of course : ) That's about it; have fun watching it.... You will : )"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Famed American playwright Phillip Hannon is in London making revisions to his play currently running in the West End. He is doing this mundane work rather than write a new play since he has retreated from life following the recent and permanent loss of his sight. That retreat from life includes breaking off his engagement to his former secretary, Jean Lennox, who still loves him. One evening at his local pub, he overhears a conversation between a man and a woman that he knows involves criminal activity, what he surmises to be the kidnapping plot of a child in exactly one week's time. The local police patronizingly dismiss his report as the overactive imagination of a blind writer. With Jean and his faithful manservant Bob Matthews by his side - the former with some reluctance on Phil's part - Phil goes on a search to uncover the plot using what little pieces of information he has at hand, which includes the man's name being Evans, the woman, who is involved under duress, working as a nanny for a family whose head is formally a lady, that lady having attended a concert that evening, the family living along a certain bus route, and the nanny herself wearing an expensive perfume well beyond her means. His physical disability is an obvious disadvantage. But what may be working to Phil's advantage is his keen sense of dialogue and its subtext in deciphering the conversation, using his other senses which people with sight take for granted, and people, including the criminals, underestimating him because he's blind.",
         "Philip Hannon, a blind playwright living in London, overhears part of a conversation , that leads him into a desperate race, to find a kidnapped child. When he gets no help from the police, he along with his butler, and his ex fiancée, attempt to track down the crooks."
      ],
      "budget": 0
   },
   "movielensId": 72092,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-05-18",
      "dvdReleaseDate": null,
      "directors": ["Henry Hathaway"],
      "runtime": 103,
      "movieId": 72092,
      "title": "23 Paces to Baker Street",
      "mpaa": "",
      "actors": [
         "Van Johnson",
         "Vera Miles",
         "Cecil Parker",
         "Maurice Denham",
         "Isobel Elsom",
         "Estelle Winwood",
         "Liam Redmond",
         "Martin Benson",
         "Natalie Norwick",
         "Terence De Marney"
      ],
      "imdbMovieId": "0048919",
      "originalTitle": "23 Paces to Baker Street",
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Philip Hannon, a blind playwright living in London, overhears part of a conversation , that leads him into a desperate race, to find a kidnapped child. When he gets no help from the police, he along with his butler, and his ex fiancée, attempt to track down the crooks.",
      "tmdbMovieId": 71171,
      "avgRating": 3,
      "releaseYear": "1956",
      "numRatings": 15,
      "posterPath": "/5mhrIL0R8a41xeCGif2VMObLC6d.jpg"
   }
}