{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "romantic comedy",
         "id": 9799
      }],
      "imdb_id": "tt0043915",
      "video": false,
      "title": "People Will Talk",
      "recommendations": [
         33030,
         22657,
         69557,
         51571,
         43007,
         82101,
         113534,
         43779,
         174773,
         43485,
         115384,
         172535,
         97821,
         114083,
         129084,
         80595,
         146660,
         63912,
         241024,
         33841
      ],
      "backdrop_path": "/2dXCdHT3yroa4fKIOxKDea5f66e.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Dr. Noah Praetorius",
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f871",
               "name": "Cary Grant",
               "profile_path": "/psdytm6BKzKd4vEd5TLUdm3rOmc.jpg",
               "id": 2638,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Deborah Higgins",
               "gender": 1,
               "credit_id": "52fe4460c3a368484e01f841",
               "name": "Jeanne Crain",
               "profile_path": "/x3knqqNAV3dYUwp1w3oaNzi5sng.jpg",
               "id": 82170,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Shunderson",
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f845",
               "name": "Finlay Currie",
               "profile_path": "/4ezZVGhlabVRIeavptVayV1VJGC.jpg",
               "id": 10027,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Prof. Rodney Elwell",
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f849",
               "name": "Hume Cronyn",
               "profile_path": "/zcEvBQlYHT8QzfTe7YIGHsjz0oY.jpg",
               "id": 7668,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Prof. Barker",
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f84d",
               "name": "Walter Slezak",
               "profile_path": "/1XOOkCtIMjsYGF2lJsIcZMw7UTx.jpg",
               "id": 37884,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Arthur Higgins",
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f851",
               "name": "Sidney Blackmer",
               "profile_path": "/ijI8tIlurlyyVTZYgZvoiifrMi3.jpg",
               "id": 12022,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Miss James",
               "gender": 1,
               "credit_id": "52fe4460c3a368484e01f855",
               "name": "Katherine Locke",
               "profile_path": null,
               "id": 89810,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Miss Sarah Pickett - Housekeeper (uncredited)",
               "gender": 1,
               "credit_id": "545b9ab10e0a261fad00217f",
               "name": "Margaret Hamilton",
               "profile_path": "/vZhqGZoHnj3HoVDg1HFGVf3c197.jpg",
               "id": 9072,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Student (uncredited)",
               "gender": 2,
               "credit_id": "545b9ae00e0a261fb3002049",
               "name": "Jack Kelly",
               "profile_path": "/qdXr1rTYuHJ2Gcds762Hyqq3A4O.jpg",
               "id": 12311,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Dean Lyman Brockwell",
               "gender": 2,
               "credit_id": "59a00851c3a36847d400f53d",
               "name": "Basil Ruysdael",
               "profile_path": "/ptpgz4Rgql6FKVJNwjAcFo1kWbV.jpg",
               "id": 100919,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f85b",
               "name": "Joseph L. Mankiewicz",
               "profile_path": "/4nXrV7vGy3V6hgMVw7nTiVJhZpY.jpg",
               "id": 10601,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f861",
               "name": "Joseph L. Mankiewicz",
               "profile_path": "/4nXrV7vGy3V6hgMVw7nTiVJhZpY.jpg",
               "id": 10601,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f867",
               "name": "Curt Goetz",
               "profile_path": "/boTfAIDlmBICYaXkMsvg0W4gkxE.jpg",
               "id": 89811,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4460c3a368484e01f86d",
               "name": "Darryl F. Zanuck",
               "profile_path": "/pfl8oR2otTYihADFtjLkrtKoFrM.jpg",
               "id": 8502,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "545b9a07c3a36853500015d1",
               "name": "Milton Krasner",
               "profile_path": "/mcCWfNEjNZc7tLd4QXN6epluwfG.jpg",
               "id": 10602,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "545b9a1b0e0a261fb9001f63",
               "name": "Barbara McLean",
               "profile_path": "/18NdkfiYOB1aSCaWLZZFc2zofub.jpg",
               "id": 10603,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "545b9a2ec3a3685362001746",
               "name": "George W. Davis",
               "profile_path": null,
               "id": 10604,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "545b9a3f0e0a261fad002171",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "545b9a51c3a368535d001892",
               "name": "Thomas Little",
               "profile_path": null,
               "id": 8508,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "545b9a64c3a36853650015c8",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "545b9a7b0e0a26042c001a7f",
               "name": "Ben Nye",
               "profile_path": null,
               "id": 26175,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.620201,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23152,
      "vote_count": 23,
      "budget": 0,
      "overview": "Successful and well-liked, Dr. Noah Praetorius becomes the victim of a witchhunt at the hands of Professor Elwell, who disdains Praetorius's unorthodox medical views and also questions his relationship with the mysterious, ever-present Mr. Shunderson.",
      "similar": [
         20943,
         5966,
         13969,
         14844,
         6877,
         4951,
         9029,
         1581,
         1824,
         4348,
         2642,
         8488,
         544,
         284,
         947,
         9522,
         193893,
         252838,
         390043,
         277547
      ],
      "original_title": "People Will Talk",
      "runtime": 110,
      "poster_path": "/fBFQWiNfVbsg5sPLMQq8m6NGU9W.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1951-08-29",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Joseph L. Mankiewicz"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Joseph L. Mankiewicz",
         "Curt Goetz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043915/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NjE3NTA0Ml5BMl5BanBnXkFtZTcwMTY2OTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Cary Grant, Jeanne Crain, Finlay Currie | See full cast and crew »"],
      "reviews": [
         "This gem just isn't given enough play. Actually, given the power of the forces it takes to task, it is a small miracle it even got made. In tackling the project, Mank riddled the medical profession, with a not too subtle sidetrip to take on McCarthyism. Cary Grant is more smooth and relaxed than usual, and actually seems to be enjoying the role. Jeanne Crain tackles a difficult (and not too well written, alas) part, and Walter Slezak does a nice turn as a collegue and crony of Grant's. Hume Cronyn is despicable as the jealous and zealous pracitioner, prosecutor and persecutor. This film didn't do well initially, but is now developing a cult following. It is one of those rare movies that gets better with each viewing.",
         "I have watched this film tens of times over the years without ever getting bored and was delighted to recently find it on DVD in the United States. The film contains all the ingredients for the viewer's pleasure ....... romance humour suspense strangeness ......... I was especially taken aback by the Shundersson mystery. I also found that the film although over 50 years old as I write doesn't really seem dated in the attitudes and ideas it expresses. Clothes and cars may hark back to the beginning of the 50's but the dialogues are quite simply timeless. I don't wish to dwell on the story by let's say they are lots of twists and turns and a plentiful supply of humour. Of course I have always loved Cary Grant but I find that in this film he turns in a particularly interesting performance, a little above the usual level of the character he plays. It's also very intersting to watch Grant's reaction in embarassing situations and notably the \"interrogation\" carried out before the concert at the end. As for Jeanne Crain, his \"wife\" I find her every time stunningly beautiful. Professor Elwell's character must be one of the most obnoxious in the entire history of cinema ......... !!",
         "How many movies had a score by Brahms? 'People Will Talk' features his Academic Festival Overture, which is the only example of cheerful grandeur I can think of in serious music. Mankewicz knew what he was doing, because this is a cheerfully grand movie. While his 'Letter to three wives' and 'All About Eve' are more famous, this one is my favorite. For one thing, Cary Grant has never been more attractive, for Dr. Praetorious is a good and humane doctor. \"I don't cure illness, I make sick people well.\" If the notion that a woman bearing a child out of wedlock is a disgrace has gone, the theme of the mediocre witch-hunting the brilliant is timeless. The phrase 'beloved character actor' could have been invented for Finlay Currie, but you've got to be able to use it for Walter Slezak - at least in this movie. (See \"Lifeboat\") If you spend two hours with these people, you'll hear some very splendid talk, and you'll feel both warmed and civilized. How many of today's movies do that?",
         "This is very unique film. Superlatively written, it offers amusing dialog, social insight and enlightened views of science, women's issues, social mores, the nature of success, materialism and the urge to destroy what we cannot understand. It is not boring, yet its main characters are doctors/composers, and professors. Though its setting is an elite clinic and a university, it is concerned with real people and their needs. Cary Grant is at his warm, compassionate and wryly witty best. His sidekick, so to speak, is the rumpled and likeable Walter Slezak. Hume Cronyn is superb as the little weasel who sets out to \"investigate\" i.e. slander and destroy the Cary Grant character. Sound familiar? \"People Will Talk\" may be considered a comedy of manners of the 1950's and a companion piece to another, similarly-titled Cary Grant film, the lesser-known Frank Capra masterpiece \"Talk of the Town.\" Both are intelligent, thought-provoking, and thoroughly entertaining Hollywood gems. Don't forgot to check out the \"typical farm family...\" You'll recognize the narrow-minded, cliche-ridden, hypocritical patriarch of the clan...",
         "When you get one of Hollywood's most powerful producers, Darryl F. Zanuck, working with a screenwriter/director, Joseph L. Mankiewicz, then you know you're in for a film that's a cut above the average. In this story, Cary Grant is a hugely successful doctor (as Dr Noah Praetorious) with unusual healing practices; Jeanne Crain (as Deborah Higgins) is an aspiring medical student who falls in love with him; the almost legendary Finlay Currie is a mysterious assistant (as Shunderson) to the doctor; another great character actor, Hume Cronyn, plays the devious and deceitful Prof. Elwell; and there is Walter Slezak as Prof. Barker, who provides (with Grant) much of the comedy and witty lines. This is an unusual story because it mixes genres: it's a comedy, it's a love story, it's a (double) mystery, and it's a drama. The first genre is provided largely by Cary Grant and Walter Slezak who bounce off each other with some of the best scenes and wittiest lines. The second, of course, is between Cary Grant and Jeanne Crain. The third is provided by Cary Grant and Finlay Currie, Grant being the doctor whose methods are suspect and his past under scrutiny by Prof. Elwell, while Currie is Grant's constant companion \u0096 aloof, quiet and almost robotic in his demeanour. But, who really is Shunderson? And the fourth is the drama between Dr Praetorious and Prof. Elwell, as the latter seeks to have the doctor expelled from the clinic and university for malpractice. Weaving those four elements together into a cohesive plot is no mean feat, but Mankiewicz succeeds brilliantly. The acting is superb, and even Jeanne Crain \u0096 not one of my favorites at all \u0096 manages to almost overshadow Hume Cronyn in a key scene where there is a battle of wills and words. The real surprise, however, is Finlay Currie who usually appears in biblical and/or historical dramas and who usually is given a lot to say in any of his film appearances. But, not in this one: in fact, he says hardly a word until almost the end, but simply maintains a deceptive and mysterious quietude at the side of Cary Grant. The resolution to that mystery is a tour de force \u0096 and with a twist. Even though I'm not a big comedy fan \u0096 it's the most difficult to portray on film \u0096 I'm very partial to Mankiewicz and his films. On that basis alone I'd recommend this film for you to see as another in the great tradition of Classic Hollywood Cinema. But, for anybody who likes the debonair Cary Grant, well, what are you waiting for\u0085?",
         "This film, far ahead of its time, presents a thoughtful, intelligent commentary on the issues the time, eerily relevant not only to the conservative 50's, but to just about any subsequent era. Noah Praetorious, played with the suave appeal with which Cary Grant always seemed to shine, shows us just how admirable and sympathetic a successful physician can actually be. His decision to court and marry Deborah Higgins, to his devoted friendship with Mr. Shunderson, sets a fine example for all of us about loyalty, friendship and love. And considering the political climate which existed at the time this film was made makes it all the more noteworthy. Dr. Praetorious's conviction to stand up to his accuser, portrayed by a well cast Hume Cronyn, says much for \"doing the right thing\". This film holds up well after close to 50 years, and the sensitivity written into the main character should be required study for any student about to embark upon a career as a physician.",
         "This is indeed a very well hidden film which should be up there with North By Northwest, Citizen Kane, and the like. For its time, People Will Talk took on the most controversial topics of the day (even of TODAY) including: abortion, unintended pregnancy, HUAC and McCarthy-style witch hunting, taxpayer-subsidized farming not to grow food ... and the list goes on. Perhaps most up front is the defending of American individualism that was then (and is perhaps more than ever now) under attack. All of this was presented very cleverly, often with wholesome comedy. A great film with top actors, writing and direction. Only the very ending is a bit soppy ... not the least of which is the dopey expression on Carey Grant's face of imbecilic ecstasy while conducting his university's orchestra. Otherwise, it was a nearly perfect film.",
         "After winning two successive Oscars for A Letter To Three Wives and All About Eve, director Joseph Mankiewicz was on one big creative roll. His next film was this charming comedy/drama about a medical doctor with some interesting ideas and one of his patients, a girl with a bundle of joy on the way and a dead father, courtesy of the Korean War. Those roles are played by Cary Grant and Jeanne Crain. Grant's a strange kind of doctor who believes that surgery and pills are only a last resort. Today he might be operating a very successful wellness center. Grant would still be getting the a lot of criticism from jealous colleagues like Hume Cronyn. In fact that's how the film opens up with Cronyn getting a report from Margaret Hamilton who was from a place where Grant practiced his trade called Goose Creek. It was a report about Grant affected a lot of 'miracle' cures down in Goose Creek. Our boy Cronyn is looking for dirt with which he can discredit Cary. Playing a most mysterious role in the proceedings is Finlay Currie who lives with Grant and is hardly ever not around him. At the faculty hearing that Cronyn has called to discuss the charges Cronyn has made because of his investigation, Currie's story is finally told and it is quite the tale indeed. Cronyn has one of two roles that could be described as villainous. He's a nasty little Grinch like creature who thinks he can rise to the top by discrediting others. You find those in every profession, in every walk of life. You also find people like Will Wright who is Jeanne Crain's uncle. She and her father, Sidney Blackmer, live on Wright's farm totally as his dependents. Blackmer is a cultured, cultivated man who unfortunately was never able to make a go of the various professions he tried, teacher, reporter, etc. Now with bad health he's come back to the family farm to live with Crain at the sufferance of Wright who proudly claims them as his dependents. In defense of Wright he's no doubt a hard working individual, but he's as prosperous as he is because of government agricultural subsidies. In a scene very similar to one Elizabeth Taylor had in Giant, Grant rather firmly puts Wright down saying how unfortunate it is that brains and talent can't similarly be subsidized. Wright is such a philistine, the remark goes totally over him. It's my favorite scene in the film. Besides those I've mentioned, look for a nice performance from Walter Slezak as Grant's friend and chief defender and Basil Ruysdael as the dean of the college conducting a hearing. People Will Talk is a wonderful film about mostly some very nice people and the small contributions they make to make our planet a happy one. The only fault I have with it is I can't imagine Cary Grant coming from a place called Goose Creek.",
         "My all time favorite Cary Grant film is \"People Will Talk\"(1951) co-starring Jeanne Crain, with Finlay Currie and Hume Cronyn. This movie is a little more quiet in it's content then most of Grant's comedies; lots of humor but not madcap. Grant is Doctor Noah Praetorious, medical professor, doctor and head of a teaching medical clinic. Noah is very popular. With the students because they enjoy the way he presents learning. With his patients because he puts them first, instead of the @*$&% schedules. Most of his colleagues because he truly enjoys his profession and them. Then there's his best friend, Professor Barker (Walter Slezak), who knows Noah well, but doesn't know Noah at all. Noah meets student, Deborah Higgins (Jeanne Crain), in class. She is seated in front of a med student (unkown Jack Kelly of TV's \"Maverick\") who comes to her aid when she faints. She goes to Noah's clinic and learns that she is a 'mother-to-be' who doesn't 'want-to-be'. So, she tries to kill herself. (The 1950's...not a good time for a girl to be pregnant out of wedlock.) Noah keeps her in the clinic overnight. Late that night she disappears. The good doctor and his friend, Mr. Shunderson (Finlay Currie), track her down to nasty Uncle John's where she and her father, Arthur (Sidney Blackmer), are prisoners to his financial abilities to care for them. John (Will Wright) considers his brother a never-do-well and both of them burdens, unless what they do is tax deductible. That day, while Uncle John naps, Noah and \"the Higgins family (including the dog)\" elope, and they become his family. Mr. Shunderson and the dog have become good friends. Next, we have jealous Professor Rodney Elwell (Hume Cronyn). His desire is to destroy Dr. Praetorious by using Noah's 'evil' past against him. Did you know Elwell even brings in Miss Sarah Piggett (Margaret Hamilton of Oz) and other McCarthy-style investigations to bring Noah down...will it work? Not if Professor Barker and, especially, Mr. Shunderson have their way! What will be the outcome for Noah, Deborah and their forth-coming baby? Will Noah ever get to the school concert and get it started for guests, students, families and faculty? And, to add action to this film, we have a wonderful train wreck. A definite 10!!!",
         "People Will Talk (1951) Joseph L. Mankiewicz is always an impressive director, though this is surely one of his lesser films. That doesn't keep it from being interesting throughout, and the comic scenes are really hilarious. Of course, it doesn't hurt to use Cary Grant as the lead, with three oddball men backing him up (the father-in-law, the atomic scientist, and his old, silent friend). Across from him is the charming, somewhat demur Jeanne Crain, who does sometimes perk things up a bit, but she is generally fairly stately. I say this because the movie itself resembles Jeanne Crain: pretty, effective, restrained, and with a short nose. That is, it never quite takes off, and even the lively Grant as an unorthodox doctor seems buttoned up, much like his role in The Bishop's Wife, rather than his funnier side (most of his films, including Monkey Business the following year) or more dapper side (especially later one, but even in Only Angels Have Wings.) Since Grant anchors the film, this all matters. At times, his tone becomes more than professorial, and he sounds like a politician, but a respectable one, and People Will Talk is partly an anti-McCarthy, anti-witch hunt film from the Red Scare days. The speeches are meant to be taken quite seriously, no matter how absurd the comedy. Without this context, a lot of it will seem lofty and wordy. In fact, it still does, a flaw that time will only make worse. No matter what our era remembers of Joe McCarthy, the movie demands little of most of the characters, and more makes fun of highbrow men, and of institutions in general, from the university to marriage itself, all as allegory to an establishment of rules above principles, which the movie makers and Grant's character clearly abhor. What matters more is the human heart, in medicine and in love, and Grant, with dignity, shows the way. People Will Talk is both breezy and weighty--a solid farce, if that isn't contradictory. Some of the secondary actors are terrific, especially Walter Slezak (who appears in a similar, happy role in Born to Kill). As usual, Mankiewicz surrounds himself with talent behind the scenes at Fox, with Milton Krasner behind the camera (in high key style) and Alfred Newman in charge of music (some of which is diagetic)."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Successful and well-liked, Dr. Noah Praetorius becomes the victim of a witch hunt at the hands of Professor Elwell, who disdains Praetorius's unorthodox medical views and also questions his relationship with the mysterious, ever-present Mr. Shunderson. Fuel is added to the fire when Praetorius befriends young Deborah Higgins, who has become suicidal at the prospect of having a baby by her ex boyfriend, a military reservist who was called up for service in the Korean War and killed in action.",
         "Dr. Noah Praetorius is a practicing gynecologist, he with his own medical clinic, and a university professor. He is a bit of a Renaissance man, conducting the university's student and faculty orchestra. He is also a controversial figure in the world of medicine. His controversial belief, subscribed to by some and vehemently denounced by others, is that medicine is not merely a technical science, but an emotional one, where the well being of patients is in large part dependent upon their mental state. For example, at his medical clinic, patients are not to be awaken by staff at some prescribed meal time. One of his latest patients is Deborah Higgins, who seems to be suffering under some personal issues. Dr. Praetorius feels that he has to get to the bottom of these issues if he is to help Deborah fully from her medical issues. But he may not be able to help Deborah or any other patient if Rodney Elwell, one of Dr. Praetorius' fellow university professors and one of his detractors, has his way. Elwell plans on mounting a case against Dr. Praetorius to a university disciplinary board. Part of Elwell's case is trying to find information about Mr. Shunderson, Praetorius' constant and mysterious elderly companion.",
         "Dr. Noah Praetorius falls in love with Debra, a student who finds out that she is pregnant by her old boyfriend."
      ],
      "budget": 0
   },
   "movielensId": 7211,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1951-08-29",
      "dvdReleaseDate": "2004-01-06",
      "directors": ["Joseph L. Mankiewicz"],
      "runtime": 110,
      "movieId": 7211,
      "title": "People Will Talk",
      "mpaa": "",
      "actors": [
         "Cary Grant",
         "Jeanne Crain",
         "Finlay Currie",
         "Hume Cronyn",
         "Walter Slezak",
         "Sidney Blackmer",
         "Katherine Locke",
         "Margaret Hamilton",
         "Jack Kelly",
         "Basil Ruysdael"
      ],
      "imdbMovieId": "0043915",
      "originalTitle": "People Will Talk",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["TvLNaV-ja4E"],
      "plotSummary": "Successful and well-liked, Dr. Noah Praetorius becomes the victim of a witchhunt at the hands of Professor Elwell, who disdains Praetorius's unorthodox medical views and also questions his relationship with the mysterious, ever-present Mr. Shunderson.",
      "tmdbMovieId": 23152,
      "avgRating": 3.69205,
      "releaseYear": "1951",
      "numRatings": 151,
      "posterPath": "/fBFQWiNfVbsg5sPLMQq8m6NGU9W.jpg"
   }
}