{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120393",
      "video": false,
      "title": "Twilight of the Ice Nymphs",
      "recommendations": [
         162495,
         67430,
         122445,
         44502,
         27072,
         5844,
         63435,
         2777,
         24663,
         34614
      ],
      "backdrop_path": "/b9zubyt1btFXnopKi2KzLzkf4v6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Juliana Kossel",
               "gender": 0,
               "credit_id": "5441303a0e0a26291a0019f2",
               "name": "Pascale Bussières",
               "profile_path": "/vbfCShcj8n0eUOoKRCAGNh1auFY.jpg",
               "id": 54818,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Amelia Glahn",
               "gender": 0,
               "credit_id": "544130560e0a26291a0019fb",
               "name": "Shelley Duvall",
               "profile_path": "/iXBGoVOGCzBkz9klj7YJ83pkstf.jpg",
               "id": 10409,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cain Ball",
               "gender": 2,
               "credit_id": "54413065c3a3686172001ab7",
               "name": "Frank Gorshin",
               "profile_path": "/1hfi3gAMouvfXzrnrbJLHqYHHVP.jpg",
               "id": 291,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Zephyr Eccles",
               "gender": 1,
               "credit_id": "54413075c3a36860e1001af4",
               "name": "Alice Krige",
               "profile_path": "/kUuVEsfZNxXdlK2JQdTEGcfkoY3.jpg",
               "id": 2506,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Issac Solti",
               "gender": 2,
               "credit_id": "583295af92514162d8032fb2",
               "name": "R.H. Thomson",
               "profile_path": "/5yhs3nGAntOE1Vwd0QUSdFYkpni.jpg",
               "id": 1277585,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Matthew Eccles / Voice of Peter Glahn",
               "gender": 2,
               "credit_id": "583295d092514162c6036165",
               "name": "Ross McMillan",
               "profile_path": null,
               "id": 75812,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49639251416c750c65e3",
               "name": "Guy Maddin",
               "profile_path": "/foMrtxtTnBCDZz5fs2QbU5TUt6l.jpg",
               "id": 97579,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54413024c3a3686078001a8e",
               "name": "George Toles",
               "profile_path": null,
               "id": 145600,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.794742,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 94653,
      "vote_count": 8,
      "budget": 0,
      "overview": "Peter Glahn is released after years of incarceration as a political prisoner and is now returning to his homeland, the mythical Mandragora where the sun never sets. On board the ship home, he meets the mysterious Juliana Kossel who vanishes after stealing his heart. Once he arrives on the island, he goes to the family ostrich farm run by his sister Amelia. He finds Amelia living with a farmhand named Cain Ball who fears that Peter's return will endanger the agreement he made with Amelia that will see him inherit the farm. Amelia has since fallen for the vain Dr. Isaac Solti who controls the island and has a hold on both Zephyr Eccles, the widow of a local fisherman, and Juliana, Peter's dream girl from the ship. Solti's true obsession is a recently discovered statue of Venus that possesses strange powers. All the characters meet at Solti's lab where the sexual tensions erupt.",
      "similar": [],
      "original_title": "Twilight of the Ice Nymphs",
      "runtime": 91,
      "poster_path": "/7YcsmtfxLMd6cc23zOKEoXtDCXE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-09-09",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Guy Maddin"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["George Toles"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk0NTQwMDIzMl5BMl5BanBnXkFtZTYwNjMyNDY5._V1._CR0,31,259,413_SX214_AL_.jpg",
      "actors": ["Stars: Pascale Bussières, Shelley Duvall, Frank Gorshin | See full cast and crew »"],
      "reviews": [
         "I have a real soft spot for this strange little gem. It is garish, lush, stilted and artificial, with moments of heartbreaking beauty. It hearkens back to the grandeur of Hollywood of old, and yet is alive with a sort of mischevious irony, and a perverse love of the heavy handed gesture. All the actors do serviceable work, but my particular favourite is Alice Kreig's Zephyr. That woman is just remarkably charismatic, and her voice....my stars. This is fairly typical of Guy Maddin's bizzarre and wonderful work. Same sense of humour, same painstakingly textured(and hopelessly unnatural) sound editing, and same passionate love affair with the cinematic conventions of yesteryear. If you like this, Careful, Archangel, and Tales of the Gimli Hospital might be to your taste as well. Easily the finest movie I've ever seen about mesmerism and ostrich farming. 9/10.",
         "Spoilers perhaps. This is a wonderful movie that plays like a poem. The color is strong and overbearing. The situations are odd and dreamy. The characters are Fellini-esque and lovely. The DVD commentary on this film is very information and heck, I just like to hear Guy Maddin talk. His idea of metaphor like when the shovels are hovering by the girl's head in one scene is both sick and funny. If you like interesting directors like Lynch, The Brothers Quay, Cocteau or Hitchcock, Maddin is the guy for you. I have a goal to watch all his films, both long and short. I am so addicted to his work, I am so surprised to find only a few comments here about this film. Maddin should be more known! I love his use of older technique and Victorian/silent movie values with a modern twist.",
         "I've became addicted to Guy Maddin films lately. I'd heard many negative things about \"Twilight of the Ice Nymphs\", how it had nearly destroyed his career as a filmmaker, but I decided to give it a go anyways, if only because it was available on a DVD with both \"The Heart of the World\" and \"Archangel\". I'd love to say this film is underrated, but to be honest I can see why it attracted all the bad hype. Its uncompromising to be sure and often looks terrific, but is overall really boring. Mainly, Maddin's typically droll sense of humor seems to be present, but it doesn't work at all. Where the offbeat lines in \"Careful\" and \"The Saddest Music in the World\" were hilarious in how left-field they were, the dialog here is merely off putting. Also, the film's plot is completely impossible to keep track of. Maddin's other films, as bizarre as they are, usually have some kind of linear story. I had no idea what was going on in this one. To add insult to injury, the acting here is pretty dire. Nigel Whitmey (uncredited due to disputes with Maddin) is really wooden in the lead role and doesn't know how to approach the tongue-in-cheek material at all. R.H. Thomson is far too bombastic and over-the-top in his part as well, while Pascale Bussieres and Alice Krige are completely forgettable. The only saving spot of the film is the feud between Shelly Duvall and Frank Gorshin. Their sequences are generally really entertaining and prevented this film from being a complete loss. Even so, its easily the weakest Maddin film I've seen yet. (4/10)",
         "This movie is really odd. I saw this movie when it previewed in Dallas Texas at the AMC movie theaters, Shelly Duvall was there in person. . A very nice lady. After the movie ran, she walked to the front of the theater to talk about the film. The host or interviewer said 'I have a question, Shelly? What was that?\" She looked very embarrassed and said \" Well, i guess this is the kind of movie you do for experience.' Yeah. as if this seasoned actress needs the experience. anyway I felt sorry for her as she was being told what the audience had experienced was a very strange film that was not all that great. All i have to say is there is a lot of beauty in the film, though it is kind of odd. i didn't really like or dislike the film. It was sort of a fairy tale gone to mars or something.-Thanks.-",
         "Here it goes: These reviews have to be the hardest to write. The kind that are done for a favorite director, but not really from their best of work. Guy Maddin has impressed me, beyond belief, this year. Everything he makes is so original/unique and in his very own style/theme. One thing is for sure though, he can always make me laugh regardless of how the story turns out. In this story, the sun never sets in the land of Mandragora, which is Peter Glahn's (our hero) homeland. One day on the boat ride back HOME, his heart is stolen by a woman, Juliana Kossel, who plays dirty mind games with him. Sucking him into a world of confusion and angst. ~~ Honestly, this film was a real let down for me, but I only say that \"at this moment.\" - It really is one of those movies that you would have to be in a certain mood to enjoy. That is not the best a traits, but I got through it. I have to mention that the picture/color and the set designs/costumes were extremely phenomenal. Very bright; vibrant and pleasure-filled colours throughout the entire movie. Sort of like a Georges Méliès film in that sense, but if it were to be shot in a modern-day color- camera and if it was remastered. Another element this film carries is dubbing. The dialogue throughout this whole story is dubbed in. This may be annoying to some people, but I find it very fun and as long as you know it is Shelly Duvall's voice speaking for herself, it is all good. **You cannot help but smile while viewing this movie. My favorite line is in the middle when Peter tosses Juliana's shoe out in the lake while they're on a boat. She subtly kneels down and lets free her other shoe saying: \"The shoe belongs to the lake now. I have no use for it. Perhaps little men will now row you back to shore.\" Ha! What a line. Sounds like something from the mind of Guy Maddin, but it's not. In fact, I don't believe he written this fairytale script. I am sure he had some say in it, but the screenwriter for the project was a Mr. George Toles. What a surreal mind; my kinda guy. He usually co-writes on Maddin's stuff, but this one he probably had his first shot. Uh-oh. I give this Guy Maddin film a depressing 3.5 out of 5 stars. I may change it later, when I am in a better place to watch it. As for now, I was hoping better from the Canadian wizard. I will give it a Sexy Orange Heart, though.",
         "This surreal fairytale setting and the campy dialogue doesn't sustain for a full 90 minutes. You are swept away during the first half on heavy soft filtered images with exploding colors but soon come to shore as the movie winds down, getting us all ready for bed.",
         "There's a blood vessel that pumps between the selves we drive through the day and the incubus we nourish, a creative self (perhaps cocreated by a love), relatively unconstrained, who we promise ourselves we will birth some day. The most sublime art is what we imagine that young, more unfettered mind imagines. Its why we live, a large part of it, I think. This is the domain Maddin has decided to explore. Its a sort of Joycean commitment, a raw commitment to dreams less shaped than usual by borrowed items and fed by distilled urges in blood. Small surprise that these don't fully resonate; its supposed to be strange, strange in disturbing ways. I like the fact that this goes on too long. It has to go on long enough to plainly state that you are not a tourist, instead you've unknowingly entered something you can never really leave. In its general shape, it is \"The Tempest\" meets the \"Sarrogossa Manuscript\" visually flavored by Max Parrish. It has dreams within dreams and as they shift different controlling or dreaming minds move to the foreground, even a statue (us). There are sexual enchantments, shifting from honesty and deceit, knowing and manipulated. There's a Prospero and a Miranda, a Bloom/hunter who dreamhunts. I think if you are serious about self, then you will be about film and that will lead you to Maddin and eventually to this. It isn't his most virile vision, but you can sure see what's going on. And that's worth something. Ted's Evaluation -- 3 of 3: Worth watching."
      ],
      "genres": [
         "Fantasy",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Marble Island Pictures",
         "Twilight Pictures Inc."
      ],
      "summaries": ["Peter Glahn is released after years of incarceration as a political prisoner and is now returning to his homeland, the mythical Mandragora where the sun never sets. On board the ship home, he meets the mysterious Juliana Kossel who vanishes after stealing his heart. Once he arrives on the island, he goes to the family ostrich farm run by his sister Amelia. He finds Amelia living with a farmhand named Cain Ball who fears that Peter's return will endanger the agreement he made with Amelia that will see him inherit the farm. Amelia has since fallen for the vain Dr. Isaac Solti who controls the island and has a hold on both Zephyr Eccles, the widow of a local fisherman, and Juliana, Peter's dream girl from the ship. Solti's true obsession is a recently discovered statue of Venus that possesses strange powers. All the characters meet at Solti's lab where the sexual tensions erupt."],
      "budget": 0
   },
   "movielensId": 72156,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-09",
      "dvdReleaseDate": "2002-03-26",
      "directors": ["Guy Maddin"],
      "runtime": 91,
      "movieId": 72156,
      "title": "Twilight of the Ice Nymphs",
      "mpaa": "",
      "actors": [
         "Pascale Bussières",
         "Shelley Duvall",
         "Frank Gorshin",
         "Alice Krige",
         "R.H. Thomson",
         "Ross McMillan"
      ],
      "imdbMovieId": "0120393",
      "originalTitle": "Twilight of the Ice Nymphs",
      "genres": [
         "Fantasy",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Peter Glahn is released after years of incarceration as a political prisoner and is now returning to his homeland, the mythical Mandragora where the sun never sets. On board the ship home, he meets the mysterious Juliana Kossel who vanishes after stealing his heart. Once he arrives on the island, he goes to the family ostrich farm run by his sister Amelia. He finds Amelia living with a farmhand named Cain Ball who fears that Peter's return will endanger the agreement he made with Amelia that will see him inherit the farm. Amelia has since fallen for the vain Dr. Isaac Solti who controls the island and has a hold on both Zephyr Eccles, the widow of a local fisherman, and Juliana, Peter's dream girl from the ship. Solti's true obsession is a recently discovered statue of Venus that possesses strange powers. All the characters meet at Solti's lab where the sexual tensions erupt.",
      "tmdbMovieId": 94653,
      "avgRating": 2.32353,
      "releaseYear": "1997",
      "numRatings": 17,
      "posterPath": "/7YcsmtfxLMd6cc23zOKEoXtDCXE.jpg"
   }
}