{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "unrequited love",
            "id": 10048
         }
      ],
      "imdb_id": "tt0022268",
      "video": false,
      "title": "Platinum Blonde",
      "recommendations": [118134],
      "backdrop_path": "/ws3s5vdOgMWsPw3TwIUxZmOry05.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anne Schuyler",
               "gender": 1,
               "credit_id": "52fe451ec3a368484e049ab1",
               "name": "Jean Harlow",
               "profile_path": "/rXHRhOuu94dMwBx2Wt6Inj9NNnE.jpg",
               "id": 82315,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Stewart \"Stew\" Smith",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049ab5",
               "name": "Robert Williams",
               "profile_path": null,
               "id": 96534,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gallagher",
               "gender": 1,
               "credit_id": "52fe451ec3a368484e049ab9",
               "name": "Loretta Young",
               "profile_path": "/g5IlFLATSLpINVlaoV8Ncce2RCA.jpg",
               "id": 85848,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Smythe",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049abd",
               "name": "Halliwell Hobbes",
               "profile_path": "/nLubN58cxw9GgYnzY5IXFWqmnRz.jpg",
               "id": 29601,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dexter Grayson",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049ac1",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mrs. Schuyler",
               "gender": 1,
               "credit_id": "52fe451ec3a368484e049ac5",
               "name": "Louise Closser Hale",
               "profile_path": "/bVpUj1sQe754pJCmGAAD6iyOjHX.jpg",
               "id": 13344,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Michael Schuyler",
               "gender": 0,
               "credit_id": "52fe451fc3a368484e049b09",
               "name": "Don Dillaway",
               "profile_path": "/kTO2uWBlcGn1XjRttA4WYYD4XJF.jpg",
               "id": 131448,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Conroy",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049ac9",
               "name": "Edmund Breese",
               "profile_path": "/nAx5VxJ1BqcZXEFnyN138F5pwbE.jpg",
               "id": 30016,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Bingy Baker",
               "gender": 2,
               "credit_id": "55001516925141282f000b95",
               "name": "Walter Catlett",
               "profile_path": "/Y5kIRVTNaKuMy8DyrFDP1kwOub.jpg",
               "id": 13819,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Dawson - the Valet",
               "gender": 0,
               "credit_id": "550015269251413da500112d",
               "name": "Claud Allister",
               "profile_path": "/fvhvzZcoxuZcKGCzRSSxuyc2j98.jpg",
               "id": 117697,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049aad",
               "name": "Frank Capra",
               "profile_path": "/hvPrtfKnJs9arck1zKGnG8uRkBC.jpg",
               "id": 2662,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe451ec3a368484e049acf",
               "name": "Harry Chandlee",
               "profile_path": null,
               "id": 107778,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe451ec3a368484e049ad5",
               "name": "Douglas W. Churchill",
               "profile_path": null,
               "id": 1125828,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049adb",
               "name": "Robert Riskin",
               "profile_path": null,
               "id": 19019,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe451ec3a368484e049ae1",
               "name": "Jo Swerling",
               "profile_path": null,
               "id": 82172,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049ae7",
               "name": "Frank Capra",
               "profile_path": "/hvPrtfKnJs9arck1zKGnG8uRkBC.jpg",
               "id": 2662,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049aed",
               "name": "Harry Cohn",
               "profile_path": null,
               "id": 29341,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049af3",
               "name": "David Broekman",
               "profile_path": null,
               "id": 2085,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451fc3a368484e049af9",
               "name": "Joseph Walker",
               "profile_path": null,
               "id": 17761,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe451fc3a368484e049aff",
               "name": "Gene Milford",
               "profile_path": null,
               "id": 9852,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe451fc3a368484e049b05",
               "name": "Stephen Goosson",
               "profile_path": null,
               "id": 29345,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.545113,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26884,
      "vote_count": 9,
      "budget": 0,
      "overview": "In this witty romp, Jean Harlow plays an upper-crust socialite who bullies her reporter husband (Robert Williams) into conforming to her highfalutin ways. The husband chafes at the confinement of high society, though, and yearns for a creative outlet. He decides to write a play and collaborates with a fellow reporter (Loretta Young); the results are unexpectedly hilarious, especially when Young shows up at the mansion with a gaggle of boozehound reporters in tow. With snappy, ribald dialogue (allowable in those pre-Hays Code days), Capra keeps the gags flying fast and furious, taking special delight in having Williams's journalist pals rib him endlessly over his kept-man status. Platinum Blonde was a great success at the time of its release during the class-conscious Depression; for better or worse, its star Harlow was identified with the tag \"platinum blonde\" until her untimely death. --Jerry Renshaw",
      "similar": [
         1903,
         713,
         339397,
         862,
         1278,
         38,
         116,
         194,
         2758,
         28468,
         42888,
         19913,
         2270,
         167073,
         55721,
         544,
         289,
         222936,
         433310,
         329103
      ],
      "original_title": "Platinum Blonde",
      "runtime": 90,
      "poster_path": "/19VBUTCGYcDyQa7FUv42VoBmLpm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1931-10-31",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "£",
      "directors": ["Frank Capra"],
      "runtime": 89,
      "synopsis": "Reporter is platonic friends with a colleague girl reporter who secretly loves him. Covering a breach of promise story, he meets the young and wealthy socialite Ann Schuyler, who is rather wild in contrast to her conservative family. Despite/ because he covers the story despite her family's attempted bribery and her pleas and because he obtains and returns the love letters she sent to her ex-beau without payment, they fall in love and secretly marry. He is insistent that he won't be a kept husband but, despite his colleagues' jeers, his wife increasingly sucks him into her leisured lifestyle. In reality, he can't fit into her social set and she can't fit into his. It all blows up when he denounces her friends' worthless lives and refuses to go to a party with her. In her absence, her invites some friends round, who turn the mansion into a free for all. On her return, she protests 'It's my house', he walks out and, refusing alimony, marries his lovelorn reporter colleague, who has been around all along.",
      "writers": [
         "Harry Chandlee",
         "Douglas W. Churchill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0022268/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIxODU1NDk4NV5BMl5BanBnXkFtZTgwNzIzMDMyMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jean Harlow, Loretta Young, Robert Williams | See full cast and crew »"],
      "reviews": [
         "Robert Williams doesn't even get any billing n the DVD cover or on other promotions of this film, but he IS the star of the film....and he is outstanding. Williams could have been a major star, a very well-known actor, had he not died four days after this picture was released with a ruptured appendix. The man simply puts on an acting clinic here. I wonder if young aspiring actors are ever shown this film and told to study Williams? If is wasn't for this film, I assume nobody would ever know about this guy. Anyway, the movie is really dated but its interesting thanks to some great dialog, mainly, once again, by Williams. Jean Harlow gets the billing but a young Loretta Young has the real beauty and charm here. Too bad her role was so minor and bland. She looked absolutely gorgeous. The storyline is one of Hollywood's favorite themes: the average Joe beating up on the snobby rich people. Harlow's \"mother\" in here (Louise Closser Hale) plays that snob role perfectly. Even though I just gave it six stars, there are lots of laughs in this film and it was a lot better than I thought it would be. Watching Williams' acting performance is worth the price of the disc, and then some.",
         "Frank Capra created universes and cast actors capable to inhabit them with total, natural ease. Robert Williams in \"Platinum Blond\" personifies that theory. His performance is as close to perfection as any I have ever seen. Let's remember this is 1931. Great acting was considered the Paul Muni, George Arliss kind of acting. Now, they seem stilted and highly theatrical. Robert Williams's performance seems ahead of its time even today in 2004. \"Platinum Blond\" offers very many pleasures, but Robert Williams is at it's center, keeping the joy of the movie very much alive.",
         "Platinum Blonde launched so many careers - the most infamous being Frank Capra and Jean Harlow. It is not a perfect film by any stretch of the imagination. The sound is bad, Harlow is terribly miscast, and poor Loretta Young struggles valiantly to bring depth to a part that is the filmic equivalent of wallpaper. As many have said before me, she and Harlow would have done well to reverse roles. But the greatest on screen portrayal of fresh, modern, naturalistic acting (a style that later would be attributed to James Dean) is from the wonderful, refreshingly brilliant young Robert Williams in 1931!!!!! I would never mark this film as a masterpiece, yet I would encourage all struggling male actors to study this man's work as a prime example of how to dominate a scene without any artifice or aggression. Every time he enters a room, the whole film lights up, and every time he leaves, all the other actors seem to lose their purpose and energy. I have never seen such simple perfection, and I am saddened to no end to learn of his untimely death at thirty-four, just as he was starting to get roles worthy of his genius. I could not get enough of this man's work, and regret having so little of it to view. An absolute must see for Robert Williams alone!",
         "Stew Smith is a salt of the earth, street smart, cynical wisecracking reporter who's proud of his $75 a week salary. While tracking a story about a rich kid involved in a breach of promise suit, he gets involved with the Schuylers. This group of nitwits is a super-rich family trying desperately to avoid bad publicity. Stew catches the eye of the gorgeous Ann Schuyler, and the two fall madly in love to the absolute horror of Anne's snooty mother (who unfortunately is afflicted with gastritis). Indeed, Stew and Ann actually get married--with predictably catastrophic results. How will the filmmakers deliver Stew out of Ann's arms and into the arms of Gallagher--the equally gorgeous reporter who's madly in love with Stew? This wonderful Frank Capra comedy must have appealed greatly to the sentiments of the 1931 audience at the very depths of the Depression. The Schuylers (and their idiot lawyer Dexter Grayson) were everything that people loved to hate--snooty, superior, stupid, wholly undeserving of their vast riches. They are mocked ruthlessly, while Stew Smith and Gallagher, as worthy representatives of the working class, are portrayed with understanding and compassion. Stew briefly embraces the idle life of the super-rich (even to wearing garters), but, of course, this doesn't last long. This is more than just a film for Frank Capra fans--it's a glorious spoof of the old-time newspaper business and a tasty bit of social history.",
         "PLATINUM BLONDE marks the start of three careers- First, Frank Capra. He has a natural style of handling actors. There is scene where lovebirds Jean Harlow and Robert Williams mock sing-song to each other. It feels improvised, very natural, unlike the stage learned dialog that infested early talkies. He's experimental with camera angles, and playing with sound (One scene is filmed by a crackling fountain) and he keeps the pace and dialog delivery going at rocket pace. Then you have Jean Harlow. Wow, do you have Jean Harlow! Not only is she stunningly beautiful (even when photographed from behind) but she has a cool, likable wit (She suppose to be a society dame, but she makes the character so likable, you just want to hang around). Thirdly, you have Robert Williams, who was just starting to make a name for himself with this 1931 film. Sadly, this bristling talent died later that year of appendicitis. He's wonderfully energetic, quirky and full of speed (He's so wonderfully jumpy when he feels enclosed in a stuffy mansion you'd think he has Starbucks running through his viens.) PLATINUM BLONDE seems to be dress rehersal for the film Capra would make five years later- MR. DEEDS GOES TO TOWN (My favorite Capra film) Williams (Like Gary Cooper) is labeled \"Cinderella Man\", he loves yodelling and getting the servants to yodel in his newfound mansion home. Catch this film if you can.",
         "There is a scene with Robert Williams and Jean Harlow singing a ditty to each other. There was such natural wit and affection that their infatuation and joy in each others company was perfectly expressed. This was love, this was sensuality, without a hint of the physicality that modern movies are forced to graphicly depict. Seeing a movie like this, made in low fidelity black and white seventy years ago shows what we have lost.",
         "Robert Williams plays the kind of role Spencer Tracy did time and again at Fox and MGM--the brash, likeable working man--and, in fact, the picture suggests a dry run of Tracy's \"Libeled Lady.\" There's a breach-of-promise suit, a roomful of reporters cracking wise, a rich-rich Long Island clan existing to be mocked, and the kind of farcical complications that made the newspaper comedy one of the '30s' most endearing genres. Unfortunately, the dialogue isn't as snappy as it thinks it is, and Jean Harlow is as miscast as a society dame as Loretta Young is as a world-weary reporter -- the whole thing might have made more sense if they switched roles. The compensations, though, are many: Capra giving his actors brilliant bits of business (the \"puttering\" scene is an unsung classic), a roster of swell character actors, and some pre-Production Code naughtiness, including two very sexy love scenes between Williams and Harlow. Capra's pace is slower than usual, and his later works had cleverer plot twists. His handling of actors, though, is as beautiful to behold as ever. And in Williams' irresistible performance, we have a glimpse of a star that might have been.",
         "The most notable thing about this movie is Robert Williams unusual performance. I've seen performances like it but none of them were in 1931 and I was surprised I'd never heard of him. Turns out he *died* in 1931, and it's worth watching the movie just to see someone who could have been a star. The movie itself is quite enjoyable, although Harlow makes little impression as a society dame and it's difficult to believe the enticing Loretta Young could be any one's idea of \"one of the boys.\"",
         "This a a very funny Harlow comedy. Jean Harlow is fantastic in it as the spoiled heiress. More than anything, what impressed me about this film is actor Robert Williams. He is so natural and likable that the film really belongs to him. I was sorry to learn that he died not long after this film was released. I'm sure if he had lived he would have been a huge star. Watch this film, if for no other reason, than to see his excellent performance.",
         "In The Films Of Frank Capra Citadel Film Series and in his memoirs, Frank Capra described Platinum Blonde as a film that Columbia did strictly as a moneymaker, no messages of social significance that would be found in his later classic work, just a nice girl-boy-girl comedy. Still and probably because Robert Riskin did some of the dialog I found plenty of things that would be instantly recognizable in Capra's more well known films. The Platinum Blonde is of course Jean Harlow and this film title gave her the title she would have the rest of her short life. She's a society girl who sweeps reporter Robert Williams off his feet and into marriage much to the chagrin of her formidable dowager mother Louise Closser Hale. Someone else is chagrined as well, Loretta Young who was only 18 when she made this film. Loretta and her sisters added a few years onto their ages in order to work back then. Loretta plays one of Williams fellow reporters who is known only by her last name of Gallagher. Just like Jean Arthur was known as Saunders in Mr. Smith Goes To Washington. Lots of similarities between the two though Arthur's character was far more sophisticated than Young. Still Platinum Blonde more closely resembles Mr. Deeds Goes To Town. Williams is like Gary Cooper trapped in that big mansion. Only it was Cooper's own mansion that he inherited. Robert Williams is in on a pass and on a kind of probation so to speak, to see if he can adjust to life among the idle rich. In 1931 lots of people would have liked to have been given the opportunity. The only one in the household he strikes up some kind of friendship with is butler Halliwell Hobbes. Note the echo business with them, it would be repeated in Mr. Deeds. The week Platinum Blonde was released with reviews acclaiming Williams as a new star, he died of peritonitis. What an incredible loss, he was an actor with a breezy insouciance just like Robert Montgomery or William Haines over at MGM. He probably could also have done parts at Columbia that James Cagney was doing at Warner Brothers. Williams could have been Harry Cohn's first major star of the sound era. Anyway his comic timing was perfect and he steals the film from those two movie legends who were his leading ladies. You'll also like Reginald Owen's portrayal as Harlow's family attorney and general busybody. Williams also deals with him in the way Gary Cooper ultimately dealt with his shyster. Platinum Blonde is one of Frank Capra's best early films and watching it will make you sad though when you see Robert Williams and you will agree that he had a brilliant career ahead of him."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Reporter Gallagher loves reporter Smith who marries Anne. He's soon bored being married to a socialite and asks Gallagher to help him write a play. She arrives with a bunch of reporters and the mansion turns into a party. Anne arrives and orders them out and Smith goes with them.",
         "Reporter 'Stew' Smith meets beautiful Ann Schuyler, a rich socialite, while covering the story of a scandal involving Ann's family. Ann takes a liking to the wisecracking Smith and the couple eventually elope. Stew's roots as a street smart reporter don't prepare him well for mixing with Ann's high society friends and he starts spending more time with his 'pal', female reporter Gallagher. Everything comes to a head when Ann and her family return home to their mansion one evening and find that Stew has invited all his 'pals' over for an impromptu drinking party.",
         "Anything that the wealthy Schuyler family does is considered newsworthy. So when a possible scandal erupts within the family, sarcastic reporter Stew Smith is among those clamoring to break the story. But against the odds, Stew and the Schuyler's daughter, Anne, fall in love, and get married. But once married, will Stew be able to fit within the stuffy Schuyler lifestyle, including being part of the newsworthy family? And will Anne be freewheeling enough to hang out with Stew's friends? Most of Anne's family don't like the fact of Stew, and most of Stew's colleagues think Stew is now a kept man. But the one person who keeps her thoughts to herself is Stew's best reporter pal, Gallagher, who secretly loves her colleague.",
         "A young woman from a very rich family impulsively marries a reporter, but each assumes the other is the one whose lifestyle must change."
      ],
      "budget": 600000
   },
   "movielensId": 7221,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-10-31",
      "dvdReleaseDate": "2003-11-04",
      "directors": ["Frank Capra"],
      "runtime": 90,
      "movieId": 7221,
      "title": "Platinum Blonde",
      "mpaa": "",
      "actors": [
         "Jean Harlow",
         "Robert Williams",
         "Loretta Young",
         "Halliwell Hobbes",
         "Reginald Owen",
         "Louise Closser Hale",
         "Don Dillaway",
         "Edmund Breese",
         "Walter Catlett",
         "Claud Allister"
      ],
      "imdbMovieId": "0022268",
      "originalTitle": "Platinum Blonde",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In this witty romp, Jean Harlow plays an upper-crust socialite who bullies her reporter husband (Robert Williams) into conforming to her highfalutin ways. The husband chafes at the confinement of high society, though, and yearns for a creative outlet. He decides to write a play and collaborates with a fellow reporter (Loretta Young); the results are unexpectedly hilarious, especially when Young shows up at the mansion with a gaggle of boozehound reporters in tow. With snappy, ribald dialogue (allowable in those pre-Hays Code days), Capra keeps the gags flying fast and furious, taking special delight in having Williams's journalist pals rib him endlessly over his kept-man status. Platinum Blonde was a great success at the time of its release during the class-conscious Depression; for better or worse, its star Harlow was identified with the tag \"platinum blonde\" until her untimely death. --Jerry Renshaw",
      "tmdbMovieId": 26884,
      "avgRating": 3.46479,
      "releaseYear": "1931",
      "numRatings": 71,
      "posterPath": "/19VBUTCGYcDyQa7FUv42VoBmLpm.jpg"
   }
}