{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "catholic",
            "id": 18396
         },
         {
            "name": "mother superior",
            "id": 34124
         }
      ],
      "imdb_id": "tt0063800",
      "video": false,
      "title": "Where Angels Go, Trouble Follows",
      "recommendations": [],
      "backdrop_path": "/9k2BTxDaL0WNeKCNi1OAVYLJYpQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mother Simplicia",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebcd1",
               "name": "Rosalind Russell",
               "profile_path": "/zXDvAzoz2hX9XW7i2AHHeIidOex.jpg",
               "id": 30233,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sister George",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebcd5",
               "name": "Stella Stevens",
               "profile_path": "/hsNwoHrAe6ZWaBl4f62YiP2iJqo.jpg",
               "id": 7631,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sister Celestine",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebcd9",
               "name": "Binnie Barnes",
               "profile_path": "/xdiLC7ICCk6LgzKuHQbQ2FpHuBk.jpg",
               "id": 80237,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Sister Clarissa",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebcdd",
               "name": "Mary Wickes",
               "profile_path": "/eVNN8YtXFYGGO7uzaA7SqlVFe63.jpg",
               "id": 20624,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sister Rose Marie",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebce1",
               "name": "Dolores Sutton",
               "profile_path": null,
               "id": 170996,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "The Movie Director: The 'In' Group",
               "gender": 2,
               "credit_id": "52fe4828c3a368484e0ebce5",
               "name": "Milton Berle",
               "profile_path": "/kVcyz4eVl1Z8jZYciuybdMqUPvo.jpg",
               "id": 69951,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "The Bishop: The 'In' Group",
               "gender": 2,
               "credit_id": "52fe4828c3a368484e0ebce9",
               "name": "Arthur Godfrey",
               "profile_path": "/mR9UMl7U5XVm6sj7dIzZr4lKb0i.jpg",
               "id": 111191,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Father Chase: The 'In' Group",
               "gender": 2,
               "credit_id": "52fe4828c3a368484e0ebced",
               "name": "Van Johnson",
               "profile_path": "/6sWt0ilIFgggXr2wtUia3iv8dYa.jpg",
               "id": 37446,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Farriday: The 'In' Group",
               "gender": 2,
               "credit_id": "52fe4828c3a368484e0ebcf1",
               "name": "Robert Taylor",
               "profile_path": "/wrtbJwt7K9i3mzfH2TVAea9WGEY.jpg",
               "id": 82216,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Rosabelle",
               "gender": 1,
               "credit_id": "52fe4828c3a368484e0ebcf5",
               "name": "Susan Saint James",
               "profile_path": "/6LDmRwFP2wB5YGn9XOUHUX3JksA.jpg",
               "id": 83974,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Motorcycle Leader",
               "gender": 2,
               "credit_id": "5aad0a2dc3a36846ea010d3d",
               "name": "Michael Christian",
               "profile_path": null,
               "id": 200240,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4828c3a368484e0ebcc1",
               "name": "James Neilson",
               "profile_path": null,
               "id": 116641,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4828c3a368484e0ebcc7",
               "name": "Blanche Hanalis",
               "profile_path": "/quvndSbxEaCLiUWYKRnUAbtd3BC.jpg",
               "id": 166244,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4828c3a368484e0ebccd",
               "name": "Jane Trahey",
               "profile_path": null,
               "id": 224112,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.495229,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 71189,
      "vote_count": 5,
      "budget": 0,
      "overview": "Where Angels Go, Trouble Follows (1968) is a movie comedy starring Rosalind Russell and Stella Stevens. The film is a sequel to The Trouble with Angels (1966) and was written by Blanche Hanalis from a story by Jane Trahey, and directed by James Neilson. The story depicts the rivalry between the conservative Mother Superior (Russell) and the glamorous, progressive young Sister George (Stevens) as they shepherd a busload of Catholic high school girls across America to an interfaith youth rally being held in Santa Barbara, California. As they debate expressions of faith and role of the Church in the tumultuous America of the sixties, they must also contend with the antics of two rebellious, trouble-prone students, Rosabelle (Susan Saint James) and Marvel Anne (Barbara Hunter).",
      "similar": [
         314365,
         4967,
         45054,
         525,
         13223,
         15121,
         9552,
         8836,
         591,
         18,
         104,
         21208,
         154400,
         13448,
         670,
         755,
         10072,
         10320,
         27579,
         8643
      ],
      "original_title": "Where Angels Go, Trouble Follows",
      "runtime": 93,
      "poster_path": "/jM8IIPgVpuObT1C9V2WeuBTpY0x.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "William Frye Productions",
            "id": 69236,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1968-04-10",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "...and so do the boys!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Neilson"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Blanche Hanalis",
         "Jane Trahey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063800/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MDY3NDgwNV5BMl5BanBnXkFtZTcwMjk4MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rosalind Russell, Stella Stevens, Binnie Barnes | See full cast and crew »"],
      "reviews": [
         "My family and I always loved this movie. Since I am a Catholic school survivor I can relate to it. I was 7 years old when I first saw it at the drive in (remember drive ins?) and it always brings back good memories. A clean wholesome movie and funny too! Whatever happened to clean and wholesome movies? Parts of this movie were filmed in Ambler Pennsylvania and the Castle in the movie is still there and it hasn't changed at all. The plot of the movie was reflective of the times and the times represented change and the acceptance of change. This change was interwoven throughout the movie in the interactions and conflicting views between the modern sister George (Stella Stevens) and the old fashioned and reserved mother superior (Rosalind Russell). The moral of the story is: \"A cloister can be a place but it can also be a state of mind.\" Boyce and Hart (who wrote many hit songs for the Monkees) supplied the musical score which provided the groovy beat of the movie. I loved Susan St James in this movie. She was such a bright young actress at the time. I loved the scene where she was caught riding on top of the bus. That scene was shot on a farm near my hometown. I also appreciated the views of the Philadelphia art museum as well as city hall along with the center of the Ambler Pennsylvania town. Those views have changed over the years. Those who were sent through the Catholic School system (voluntarily or not)will get a kick out of this movie. You can buy the movie on Ebay and I think that a DVD version has been released.",
         "This was the sequel to \"The Trouble with Angels\", which was an excellent mid-'60s teen movie. To some, \"Where Angels Go, Trouble Follows\" was a disappointing follow-up. To me, I have always liked both very much, but I always preferred this one a little more out of the two. The reason being, it reflects the late '60s so much, it's so dated and borderline campy. This is what is appealing about the movie. The plotline is basic: a cross country trek to a religious convention, and all of the trials and tribulations the girls go through while they are on route. What 'makes' this movie is Stella Stevens as the hip & groovy liberated Nun that pickets against \"the man\", stands up to bikers, and later finds out what role she plays is in her students life. If you go in expecting this movie to be like the original, then you are setting yourself up for a big disappointment. If you liked other late '60s movies like \"How Sweet It Is\", \"Impossible Years\",\"Divorce, American Style\", \"Yours, Mine, and Ours\" and \"The Love God?\", then you will definitely enjoy this late '60s groovy movie.",
         "I was pleasantly surprised that this movie still holds charm after all these years. I originally saw it when I was much younger, and the only things I remembered were the railroad tracks and the song that is played throughout the film. After watching it with a more mature film-viewing mind, it's still worthwhile. Extremely campy. Clearly dated, but very illuminating. The subject matter is probably more relevant if you have religious leanings, although they aren't required. And oddly, I felt like the song was very Monkees-esquire, but never knew that it had a direct connection. Search it out for a trippy, lovey time in 1968. I wonder if the dance sequence was an inspiration for Austin Powers?",
         "Where Angels Go, Trouble Follows, the sequel to The Trouble with Angels, is in sad need of a skilled director like Ida Lupino at the helm. This is a seriously weird movie. It looked as if halfway through the making of the sequel, someone decided the film needed \"relevant\" elements. \"Relevant\" always turns out to look hopelessly dated a generation later. It begins with hip Sister George (I wonder if this was an in joke about The Killing of Sister George, a contemporary play about lesbians) picketing a large institution. You never get to see what she opposes, only that she is for Peace and Involvement. Nowadays, she'd be blocking abortion clinics, but in the 1960's nuns were hip and anti-war. Think Mary Tyler Moore and Sister Sourire. Anyway, George really is a pain, constantly complaining about anything and everything that doesn't pass her standards for Contemporary Meaning. Clothes are a big problem. The sisters wear antiquated habits, while the girls' gym outfits are designed for use in the 1940's, which means they have to be tossed into the dustbin of history. By the end of the film, the girls are frugging in miniskirts, and the nuns are wearing knee length midis that enable them to stride about with a sense of purpose. A moment of high camp is achieved on a desert highway similar to the one Captain America and Billy were to roar up and down the following year. The bus breaks down, and the first passersby turn out to be Hell's Angels. They seem to have been on every Interstate between California and the Mississippi in those days. One of the bikers insults Sister George by calling her a penguin, then threatens her with a switchblade. Later, the leader of the pack asks if she was frightened. \"Let's just say I never feared for my immortal soul.\" To which the biker replies, \"Crazy,\" and moved by her spiritual depth, fixes the bus for her. Presumably we are all seeking the same higher truths, only some do it on Harleys. When asked how she pulled the bikers over to her side, George smirks, \"We communicated.\" The strangest part is that the object of the nuns' cross-country trip, a \"youth rally\" in Santa Barbara, is never actually shown. The girls do turn on in a psychedelically lit gymnasium at an all boys' school, and perform this weird tribal dance with the boys that looked group frottage. The producers may have worried that the rally would require too many extras, but the zillions of Indians in the Milton Berle sequence could have easily been converted to Catholic hippies. Anyway, the film ends with the bus roaring down the highway, and a cut to the sisters' \"Change of Habit,\" those knee length skirts which they show off crossing a campus that now looks like The Harrad Experiment. What a disappointment.",
         "Dismal follow-up to \"The Trouble With Angels\" from 1966 has mod colors and pseudo-hip chatter, but plays like bottom-drawer Disney. Rosalind Russell returns to her role as the uptight Mother Superior at an all-girls religious boarding school, faced with newly-radicalized students and a rebellious nun (played by Stella Stevens, treading water). Family-oriented nonsense wants to be commercial, a 'today' picture for all ages, yet features some unbelievable sequences (a crowded school-bus stalling on the railroad tracks, Sister Stevens facing down a menacing group of Hell's Angels, etc.). Russell manages to give this scenario some class. Directed by Disney mainstay James Neilson, who might have benefited from a snappier sense of pacing. * from ****",
         "After a series of misadventures on the road with a broken down bus and screaming girl students, ROSALIND RUSSELL toward the end of the film states: \"It proved to be a wonderful experience.\" That she says it with so much conviction is a testament to her acting skill--because it's another matter for the audience. This is one of those strained comedies where a series of seemingly disconnected incidents on the road are supposed to be hilarious, but are more likely to provide just a few chuckles. Most enjoyable of all is the scene where two of the more rebellious girls are asked to wash the bus and instead, send it through the car-washer apparatus with disastrous results. Most of the other attempts at humor are less successful and even more improbable, especially the sequence involving an Indian chase with a cameo by Milton Berle as a film director wearing an eye patch (a la Raoul Walsh). STELLA STEVENS is the modern nun who has a run-in with some knife wielding bikers and is able to keep her cool and seem impervious to their threats. The dialog in this scene has to be heard to be believed. Let's just say it is about as far removed from reality as the script gets, and that's pretty far. ROSALIND RUSSELL is stern and amusing as the head nun, ready with a quip whenever circumstances demand it. STELLA STEVENS, BINNIE BARNES and MARY WICKES are capable as the other sisters, but SUSAN ST. JAMES and a few of the other girls in the cast have irritating roles. One of the best features: Lalo Schifrin's bouncy background score, but the whole film reflects the '60s to such an extent that it appears dated in the extreme. It's the sort of film that must have seemed dated even in '68. Summing up: The only surprises were nice cameos by Van Johnson and Robert Taylor, both giving amiable performances.",
         "In the first film of this series The Trouble With Angels the main focus of the film was on the students in particular Hayley Mills and the trouble she got into, always vexing Mother Superior Rosalind Russell. In Where Angels Go Trouble Follows the accent is on the nuns and in particular the generational dispute between Rosalind Russell and new nun on the faculty, Stella Stevens. It's the same kind of fun that the previous film was. The girls at the Catholic Academy are all revved up by Stella Stevens to attend an interfaith youth rally cross country in California. She together with Bishop Arthur Godfrey persuade Rosalind Russell to take 3000 mile cross country bus trip with a picked group of the girls. One of them, Barbara Hunter gets to go via her dad William Lundigan donating the bus for the trip. In fact Hunter and Susan Saint James are the troublesome pair of girls who take Hayley Mills's place in vexing Russell. Funniest scene is when after being ordered to wash the bus bumper to bumper by Russell, the two of them take the bus into a car wash they break into and try to use. Of course the two geniuses forget to close the bus windows before putting it through the wash. Russell got to work with two of her former fellow contract players at MGM in this film. Robert Taylor plays the owner of a boys summer camp ranch and Van Johnson is a priest and head of a Catholic Boys School. Johnson and she never worked together at MGM and she and Taylor whom she said started the exact same day for Louis B. Mayer were both supporting players in a film West Point Of The Air and did not work together again until Where Angels Go Trouble Follows. Dolores Sutton, Mary Wickes, and Binnie Barnes were all members of the convent in the previous film and repeat their roles here. Milton Berle is on hand as a movie director of a western on to whose set the bus stumbles on during an 'Indian' attack. With that eyepatch for affect and Berle makes you know it's for affect, it either suggests a spoof of John Ford or Raoul Walsh. I liked the film because without condescension it shows the generational conflict between the two protagonists, Russell and Stevens. Neither is made to be a fool, both had very good points on their side. Though it's set in the culture of the Sixties, the humor and wisdom in Where Angels Go Trouble Follows is timeless and will still be funny generations from now.",
         "I much enjoyed \"The Trouble With Angels,\" however, I found the sequel to be quite disappointing. For one thing, the movie was composed of two main elements: 1) serious conversations between Sister George and Mother Superior that were very boring and 2) silly and stupid episodes of the girls' pranks and misadventures. While similar episodes were quite fun and humorous in \"The Trouble With Angels,\" none of the scenes in this movie are nearly as entertaining, and none of the actresses are as good as the original two. One example is when \"Indians\" from a movie shoot start attacking their bus, and the girls and sisters throw bags at them and fight them off. Another problem is that the song, \"Where Angels Go, Trouble Follows\" is played not only at the beginning and end of the movie, but also is the only song played throughout the entire score and the only song the band plays at a dance the St. Francis girls attend. The main problem, however, is that the entire movie revolves around a road trip that Mother Superior, the Sisters, and select St. Francis girls take, to get to a youth rally. Nearly all the conversation in the movie is about the rally, however, we never see them actually get to the rally. The movie ends with a voice-over saying \"Yes, we made it to the rally, and it was quite the beneficial experience for all of us,\" or something along those lines. All in all, Trouble With Angels fans may get a few smiles from this sequel, but do not expect a family classic!",
         "hay everyone! I've seen this movie and it's pretty good for a 1960 movie.Also my dad was in the movie.In The part where everyone is dancing to the band at the dance,My dad is the bass player wearing the red sweater( I think it was red)Well anyway,it's a cool movie.",
         "If we are talking about the plot and story development this movie merits a 3 on a ten scale. On the other hand, I enjoyed seeing a slice of life from 1968. I was born in 1969 shortly after this movie was released. I loved watching the bus travel the roads in 1968 and have a good feel for the times. I also enjoyed seeing some great Hollywood actors such as Rosalind Russell and Robert Taylor in his last film appearance. He died just two days after I was born. There are several other actors I liked in this movie. One thing I did not enjoy was the progressive ideas of Sister George. Today if this movie was made the sisters would probably toss the habit entirely and then leave the convent. I prefer the original habits to the new stylish ones worn at the end of the movie. Rosalind Russell helps hold this movie together and keeps it from failing completely. I enjoyed her performance and love hearing her voice. She was a wonderful actress."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "William Frye Productions"
      ],
      "summaries": [
         "In this follow-up to \"The Trouble with Angels\", the wry but wise Mother Superior of St. Francis Academy For Girls accompanies a group of nuns including modern, progressive Sister George, with their high-spirited students on a bus trip across America to a California peace rally. Along the way, they encounter a series of adventures that include multiple bus problems, an overnight stay at a Catholic school for boys run by Father Chase, a Western dude ranch owned by millionaire Mr. Farriday, a flamboyant movie director shooting a Western on location, and a bunch of menacing biker toughs.",
         "Mother Superior Simplicia has been head of St. Francis Academy for twenty years, she who has fairly traditional views and attitudes. Relatively new to the academy is young Sister George, a progressive nun who more closely matches the personalities of their teenaged female students than the other sisters. Sister George most closely identifies with Rosabelle, a bright but rather undisciplined girl who is always getting into trouble along with her best friend, Marvel Ann, who is the follower between the two. Mother Superior and Sister George generally do not see eye to eye on any subject, the latest being a multi-faith co-ed rally in Santa Barbara, California - 3,000 miles away - to which she wants to expose the students. Much to Mother Superior's chagrin, the Bishop, wanting the academy to move into the new and ever changing world of the late 1960s, approves the trip for a select group of students and their sister chaperons. Although neither Rosabelle or Marvel Ann meet the criteria to go on the trip, they both manage to finagle their way along. Along the 3,000 mile bus ride, Mother Superior, the sisters and the students get into one misadventure after another. By the end, Mother Superior and Sister George will either be at each other's throats or will come to a better understanding of the other and what the academy needs to do to be relevant in this changing world.",
         "An old-line Mother Superior is challenged by a modern young nun when they take the girls of St. Francis Academy on a bus trip across the U.S.A."
      ],
      "budget": 0
   },
   "movielensId": 7231,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-04-10",
      "dvdReleaseDate": "2003-11-11",
      "directors": ["James Neilson"],
      "runtime": 93,
      "movieId": 7231,
      "title": "Where Angels Go, Trouble Follows",
      "mpaa": "",
      "actors": [
         "Rosalind Russell",
         "Stella Stevens",
         "Binnie Barnes",
         "Mary Wickes",
         "Dolores Sutton",
         "Milton Berle",
         "Arthur Godfrey",
         "Van Johnson",
         "Robert Taylor",
         "Susan Saint James"
      ],
      "imdbMovieId": "0063800",
      "originalTitle": "Where Angels Go, Trouble Follows",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["1u63CxLMnjk"],
      "plotSummary": "Where Angels Go, Trouble Follows (1968) is a movie comedy starring Rosalind Russell and Stella Stevens. The film is a sequel to The Trouble with Angels (1966) and was written by Blanche Hanalis from a story by Jane Trahey, and directed by James Neilson. The story depicts the rivalry between the conservative Mother Superior (Russell) and the glamorous, progressive young Sister George (Stevens) as they shepherd a busload of Catholic high school girls across America to an interfaith youth rally being held in Santa Barbara, California. As they debate expressions of faith and role of the Church in the tumultuous America of the sixties, they must also contend with the antics of two rebellious, trouble-prone students, Rosabelle (Susan Saint James) and Marvel Anne (Barbara Hunter).",
      "tmdbMovieId": 71189,
      "avgRating": 2.98485,
      "releaseYear": "1968",
      "numRatings": 33,
      "posterPath": "/jM8IIPgVpuObT1C9V2WeuBTpY0x.jpg"
   }
}