{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0834941",
      "video": false,
      "title": "A Plumm Summer",
      "recommendations": [],
      "backdrop_path": "/vnY2qqca6IaKZhMjwDfHp1W66sg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe489dc3a368484e10214b",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Happy Herb",
               "gender": 2,
               "credit_id": "52fe489dc3a368484e10214f",
               "name": "Henry Winkler",
               "profile_path": "/bwRNFbcotcEeZcKzlbUia4juF6N.jpg",
               "id": 31903,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Roxie Plumm",
               "gender": 1,
               "credit_id": "52fe489dc3a368484e102153",
               "name": "Lisa Guerrero",
               "profile_path": "/lboItIjckueMCL6SfQK5qbmSwIJ.jpg",
               "id": 191883,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elliott Plumm",
               "gender": 2,
               "credit_id": "52fe489dc3a368484e102157",
               "name": "Chris Massoglia",
               "profile_path": "/2AwADDLC3RJgjFS5vOChInj5Rwr.jpg",
               "id": 109441,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rocky Plumm",
               "gender": 0,
               "credit_id": "52fe489dc3a368484e10215b",
               "name": "Owen Pearce",
               "profile_path": null,
               "id": 430152,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Micky Plumm",
               "gender": 2,
               "credit_id": "52fe489dc3a368484e10215f",
               "name": "William Baldwin",
               "profile_path": "/1G9Y076nnZaobTAtzRefZd8rFNN.jpg",
               "id": 13021,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Marsha",
               "gender": 1,
               "credit_id": "56dab1f2c3a3684ca80017bb",
               "name": "Fuschia Sumner",
               "profile_path": "/lxNpfnst8TxiAEpte3mzJJ7U4aB.jpg",
               "id": 1585263,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Haley Dubois",
               "gender": 0,
               "credit_id": "598abf3e9251414bdd0296c5",
               "name": "Morgan Flynn",
               "profile_path": "/cJqIaWZ0dCoQxUQ1OrSlez6vtjj.jpg",
               "id": 19496,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Viv",
               "gender": 1,
               "credit_id": "598abf4d925141329e024c66",
               "name": "Brenda Strong",
               "profile_path": "/gjmYWKrfqST0HJ42bjO52NE4E4A.jpg",
               "id": 101396,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Wayne Dubois",
               "gender": 2,
               "credit_id": "598abfa5c3a3681f6e02c772",
               "name": "Tim Quill",
               "profile_path": null,
               "id": 155921,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Agent Hardigan",
               "gender": 2,
               "credit_id": "598abfbf9251414bdd029753",
               "name": "Peter Scolari",
               "profile_path": "/tLSgD0c7i2rpIS5kNfTysy6Sz0P.jpg",
               "id": 42363,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Agent Brinkman",
               "gender": 2,
               "credit_id": "598abfcec3a3681f6e02c7a1",
               "name": "Rick Overton",
               "profile_path": "/584g2eLl6ZmZ71ikvGw5tyqEv1p.jpg",
               "id": 1539,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Art Bublin",
               "gender": 2,
               "credit_id": "598abfddc3a3681f6e02c7bc",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Binky the Clown",
               "gender": 2,
               "credit_id": "598abfec9251414bfa028df9",
               "name": "Clint Howard",
               "profile_path": "/d9QW5feIgNwDRdkKK1j7gmmOQXT.jpg",
               "id": 15661,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Wally",
               "gender": 0,
               "credit_id": "598abff99251414bb402acdd",
               "name": "Gavin Black",
               "profile_path": null,
               "id": 1866591,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Orin",
               "gender": 0,
               "credit_id": "598ac007c3a368755f02c412",
               "name": "Ben Trotter",
               "profile_path": null,
               "id": 1866592,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56028c2192514104a20013ed",
               "name": "Caroline Zelder",
               "profile_path": null,
               "id": 1513832,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56028c3292514122c0001831",
               "name": "T.J. Lynch",
               "profile_path": null,
               "id": 1513833,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 0.488709,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 73501,
      "vote_count": 4,
      "budget": 4200000,
      "overview": "Based on a true-story - A Plumm Summer tells the remarkable tale of two young brothers, Elliott and Rocky Plumm, who go head-to-head with the FBI in order to crack the \"frog-napping\" case and get their beloved TV puppet, Froggy Doo back on the air, all the while become local heroes and best friends.",
      "similar": [],
      "original_title": "A Plumm Summer",
      "runtime": 99,
      "poster_path": "/cgytoqWLj62xASqLTQWZXipYTD3.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fairplay Pictures",
            "id": 63967,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Home Team Productions",
            "id": 63968,
            "origin_country": ""
         }
      ],
      "release_date": "2007-01-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Caroline Zelder"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "T.J. Lynch",
         "Frank Antonelli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0834941/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDczNDI0MjAyN15BMl5BanBnXkFtZTcwNzQ5NjU1Mg@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Daniels, William Baldwin, Henry Winkler | See full cast and crew »"],
      "reviews": [
         "The Santa Barbara International Film Festival had a first today. The Applebox section, consisting of family-oriented fare, had never before featured a film which was so popular that people had to be turned away at the door. It happened this morning with \"A Plumm Summer.\" First-time director and screenwriter Caroline Zelder's gem of a film recounts a true incident in 1968 when Froggy Doo, a popular children's character on local Montana television, went missing. The show's host, Happy Herb (Happy Days' Henry Winkler), fears that his beloved puppet has been kidnapped. Amateur detectives Eliott Plumm (14-year-old Chris Kelly, scene-stealer #1) and his little brother Rocky (Owen Pearce, scene-stealer #2) are determined to find Froggy Doo before the F.B.I. bungles the case (watch for Peter Scolari as a hapless agent). William Baldwin is frighteningly real as the down-on-his-luck father, and Jeff Daniels' voice-over as the present-day Elliott was a treat. Brenda Strong and Lisa Guerrero are other actors of note who jumped at the chance to participate in this little indie after reading Zelder's sweet script. Much of the cast and crew were present for a Q&A, which was as fun and delightful as the film itself. Far too few films like this are being made, and \"A Plumm Summer\" is a reminder of just how good they can be.",
         "Viewed as a 'European Premiere' at the Belfast Cinemagic Children's Film Festival, this light-hearted family adventure film must surely win over all but the most hard-bitten cynics. Based on a real incident from the late 60s and set in deepest Montana, it centres on the theft of a children's TV star marionette named 'Froggy Doo' whose antics thrilled the under-8s in the area. In particular, he was the idol of young Rocky Plumm, younger son of failed boxer Mick Plumm, and younger brother of teenager Elliott. This is a film that could have been monumentally awful, but in the first half wins by the charm and audacity of its somewhat naive plot, and the way that its actors fit so seamlessly into the initially predictable characters. But, like many fine films, as it progresses, it undermines the assumptions that we have made about it. The idyllic family life is not so idyllic, the teenage love story gets muzzed by hormonal outbursts, and the love of cinema of the filmmakers shines through in endearing references to great films of the era in which it is set (plus or minus a decade). So, it's a comic family drama; it's a thriller; it's a reflection on the relationship between father and son, and it's a kookie, almost unclassifiable folk tale. It's not perfect, and there are a few cringe-making scenes where the elements of pastiche fall flat on their face, but it enjoyably reminds me of another massively under-valued film - Spaced Invaders. True cinephiles will also see elements of masterpieces of the era as diverse as 'El Dorado' and 'Blow-up'. And the real reason it is so good (of its type) is that it wears the filmmakers' love of cinema on its sleeve. And as a first film by director Caroline Zelder, it is full of great promise... Go and see this and give yourself a treat!",
         "I just watched this on DVD, and here's my question: why can't there be more movies like this? I take my kids to Blockbuster every weekend to find something to watch. First off, there isn't really anything in the 'kids' section. It's either pre-school or teen. Hardly any in the middle. Why is that? My boys are 7 and 9. Where are the movies for those kids? There are some, yes, and we've watched them all. Many times. But it's such a small selection. So i was happy to see something new on the shelf. My son Tommy said, \"Look dad, there's one we haven't seen!\" like he'd just seen a flying saucer. So we took it home and watched two times over the weekend. My wife and I ended up watching it with them and loved it. Great, fun, life lessons, adventurous. It had everything. It inspired the boys the way the Hardy Boys inspired me as a kid. So I'm taking the time out of my day to make this comment. I think it's worth it to get the word out, because I know there are a lot more parents like us. And kudos to Henry Winkler and William Baldwin for raising the bar.",
         "A sweet story beautifully shot in Montana. This film is well cast and it's fun to watch the great comedic timing between two of the 'comedy group' trained actors. They were a highlight! A Plumm Summer is \"Family Friendly\" and promises to appeal to both the kids and parents alike. No reason to cover little eyes or plug little ears. A great message without any holy roller aspects. With all that's going on in today's world A Plumm Summer was a refreshing respite and time well spent. Make plans to go see this movie this weekend. I know you'll enjoy it, bring the kids, if you don't have kids...bring the neighbor's kids. You'll be glad you did.",
         "A Plumm Summer is a sweet little indie film pulled off perfectly. There are some big names in the supporting cast who are all note-perfect, most notably Peter Scolari and Henry Winkler. Billy Baldwin also puts in a very good turn for the first time in quite a while. Newcomers Chris Massoglia and Owen Pearce couldn't be any cuter and more adorable as the brothers/stars of the film. Massoglia (credited as \"Chris J. Kelly\") is particularly outstanding considering it's his first jump from TV to film - you really like him and feel for his character. To me, A Plumm Summer hearkens back to 6:00 on Sunday when the family would gather around the TV with dinners in hand to watch the Wonderful World of Disney's weekly fare. This is like that... but better quality than most of what Walt served up. There's some real heart to this effort thanks to genuine drama that hits a message without becoming overwrought with itself. The mystery element to the story is none too deep or complex, but it doesn't need to be; it's just the vehicle that introduces some very likable characters and lets us get to know them. There's a laugh or two along the way and everything is generally light-hearted and fun. It's a good family film that entertains as well as confronts a serious note or two along the way. It won't change the landscape of movie-making, but it's awfully nice to see that somebody will still make a sweet, innocent film like this. Kudos to the folks responsible for doing that. A very endearing, charming, family film worth anyone's time.",
         "Elliott Plumm (Chris Masoglia) and his younger brother, Rocky (Owen Pearce) live in knock-out gorgeous Montana in the early sixties. Their father, Mick (William Baldwin) drinks too much and never seems to have time for Elliott, seeming to prefer kindergartner Rocky. Mother Roxie (Laura Guerrero) is an attentive mother but she is getting fed up with Mick and his antics. More importantly, Elliott is shy and resents having to share a room with his little brother, even going so far as to dividing their room with a marker on the floor. Only Rocky is carefree, for he is young and enamored with the local television star-magician (Henry Winkler) and his darling frog marionette Froggy-Do. Changes occur. First, the Plumms get new neighbors, a single father and his daughter, who casts her eye on Elliott. Then, someone actually frog-naps Froggy-Do and the show can't go on, as the magic man won't go solo without his beloved sidekick. Can Elliott find Froggy-Do for the town and his brother Rocky? This film, set in knockout gorgeous Montana, has a light-hearted cover and a cute, cute puppet. But, beneath the story are serious issues, like divorce, alcoholism, and mental instability. So, in my view, not for every family. That said, the cast, costumes, script, direction, and all other amenities are quite fine. If you are searching for a family flick that might get the loved ones into an actual conversation, this would be one to try. But, if you are seeking a film that is sweetness and light, look for Beethoven's Big Break or, truly, any of the Beethoven movies.",
         "We were very glad to have dvr'ed this movie and watched it with the kids! It was fun to look up more details about the real story and investigate where in Montana it was filmed! The videography was gorgeous, showing some of the very best of Montana and very much why we live here! I hope someone picks this up in the future and produces the planned sequels (keeping them set and produced in Montana where the story belongs!). I've ordered a copy for our local library circulation, just because it's a clean family movie with a Montana theme and location. I'll be glad to recommend it to people looking for a good family night movie.",
         "My, oh my, never am I so pleasantly surprised to watch this movie! The title is unassuming, and because there is lack of publicity about this movie in my country (it wasn't shown in the local cinemas), I thought this is one of those straight to DVDs which usually meant that the movie is not good. My, oh my, this movie rocks! Based on true story, the Elliot brothers helped the FBI to capture the person who did the frognapping. Funny moments ensued as the brothers, and the inefficient FBIs worked their way to nab the suspect. Both the Elliot brothers, and the girl who plays as the new girl in town are very real. They have the chemistry that one might think that they are already in the industry for a long time. The performance of Elliot and her small brother are wonderful, they quarrel and made remarks with each other, but when others disturbed one of them, the other stand up and defended. This movie is for everyone, young and old. It has tonnes of moral values and it is has that feel-good factor that many films churned out of Hollywood seems to lack. In a nutshell, I recommend this movie anytime. Just sit back, relax, and have some chips with it.",
         "First off, I was there in Montana in the 60s when the real Froggy Doo did it. Yes, he was 'kidnapped' but that's about all there is in this story that's true. There was no FBI involvement. But I will hold off on pushing my facts onto the screenwriter's fantasies; I am not the target audience for this film. I'll judge it on its own merits. My biggest problem is that most of the characters in this film are repulsive. The adults of the family are whiny, self-indulgent adolescents. Pop starts out by driving up on a chopped hog. In the 1960s? Why? Because he needs to be cool? The beautiful-child teenagers 'rebel' even though they have no reason to do so, other than that their parents are soulless automatons. Happy Herb is a simpering wuss. But worst of all is Froggy Doo. Here he's a vulgar, farting, annoying pest, a clone of Ren and Stimpy instead of Howdy Doody. Why would anyone, including a 6-year-old, think that was funny? Why would any parent let their child watch this stuff? Junk like this makes our heavenly father Captain Kangaroo (peace be upon him) weep."
      ],
      "genres": [
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Fairplay Pictures",
         "Home Team Productions"
      ],
      "summaries": ["Based on a true-story - A Plumm Summer tells the remarkable tale of two young brothers, Elliott and Rocky Plumm, who go head-to-head with the FBI in order to crack the \"frog-napping\" case and get their beloved TV puppet, Froggy Doo back on the air, all the while become local heroes and best friends."],
      "budget": 4200000
   },
   "movielensId": 72516,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": "2009-05-05",
      "directors": ["Caroline Zelder"],
      "runtime": 99,
      "movieId": 72516,
      "title": "A Plumm Summer",
      "mpaa": "PG",
      "actors": [
         "Jeff Daniels",
         "Henry Winkler",
         "Lisa Guerrero",
         "Chris Massoglia",
         "Owen Pearce",
         "William Baldwin",
         "Fuschia Sumner",
         "Morgan Flynn",
         "Brenda Strong",
         "Tim Quill",
         "Peter Scolari",
         "Rick Overton",
         "Richard Riehle",
         "Clint Howard",
         "Gavin Black",
         "Ben Trotter"
      ],
      "imdbMovieId": "0834941",
      "originalTitle": "A Plumm Summer",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["PRsRYy7MHQo"],
      "plotSummary": "Based on a true-story - A Plumm Summer tells the remarkable tale of two young brothers, Elliott and Rocky Plumm, who go head-to-head with the FBI in order to crack the \"frog-napping\" case and get their beloved TV puppet, Froggy Doo back on the air, all the while become local heroes and best friends.",
      "tmdbMovieId": 73501,
      "avgRating": 2.125,
      "releaseYear": "2007",
      "numRatings": 4,
      "posterPath": "/cgytoqWLj62xASqLTQWZXipYTD3.jpg"
   }
}