{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tattoo",
            "id": 331
         },
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "golf club",
            "id": 162461
         }
      ],
      "imdb_id": "tt0116827",
      "video": false,
      "title": "Last Dance",
      "recommendations": [
         83489,
         73249,
         32872,
         25697,
         27224,
         38295,
         35247,
         48753,
         122796,
         18856,
         32911,
         7269,
         18495,
         42217,
         39472,
         19723,
         389630,
         36778,
         15581,
         39411
      ],
      "backdrop_path": "/Agp0tSvi5rgqRJ2ehzgoI0tDRct.jpg",
      "revenue": 5,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Cindy Liggett",
               "gender": 1,
               "credit_id": "52fe46e2c3a36847f8117b31",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Rick Hayes",
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b35",
               "name": "Rob Morrow",
               "profile_path": "/pddqfHQ7AV5I2EUIzz32GFp5m5Q.jpg",
               "id": 52602,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sam Burns",
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b39",
               "name": "Randy Quaid",
               "profile_path": "/7rywy6gbSTG60xQWepRktD0feek.jpg",
               "id": 1811,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "John Hayes",
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b3d",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "The Governor",
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b41",
               "name": "Jack Thompson",
               "profile_path": "/l2NNfs9bd6qxqzIOahcz2hErrq8.jpg",
               "id": 12536,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jill",
               "gender": 1,
               "credit_id": "56b6840fc3a36806f1009dcb",
               "name": "Jayne Brook",
               "profile_path": "/adrS4ZwaRgXpnJpV2U7uiFU9Cmd.jpg",
               "id": 11627,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Linda, Legal Aid Attorney",
               "gender": 0,
               "credit_id": "56b684229251414a3a004908",
               "name": "Pamala Tyson",
               "profile_path": "/gCWBzMwtKZ20YY2h7h3mLkdIlI0.jpg",
               "id": 128203,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Billy, Cindy's Brother",
               "gender": 2,
               "credit_id": "56b68438c3a36806f1009dd8",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Doug",
               "gender": 2,
               "credit_id": "56b6844b9251414a3a00490b",
               "name": "Don Harvey",
               "profile_path": "/8MOYT034RV1XULZ4RI5AHnStVJF.jpg",
               "id": 1280,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Inmate Reggie",
               "gender": 0,
               "credit_id": "56b6845fc3a368481600479e",
               "name": "Diane Sellers",
               "profile_path": "/e36XzaDy5pU8iE8XIrLSb7Fh2Em.jpg",
               "id": 128205,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Guard Frances",
               "gender": 1,
               "credit_id": "56b684ab92514131e3000086",
               "name": "Patricia French",
               "profile_path": "/gr8JifkoddGbSanIPVbBjHWUbrD.jpg",
               "id": 128207,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "D.A. Rusk",
               "gender": 2,
               "credit_id": "56b684c0c3a36806ee00a904",
               "name": "Jeffrey Buckner Ford",
               "profile_path": "/z5Qp4D8DwFS4bzSTFUPYu2KgIXw.jpg",
               "id": 128208,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Detective Vollo",
               "gender": 2,
               "credit_id": "56b684d4c3a36806ec00b96a",
               "name": "Dave Hager",
               "profile_path": "/9uS3VcUpnsTyvCy4IGB92juwaSx.jpg",
               "id": 128209,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Louise",
               "gender": 1,
               "credit_id": "56b684e89251413c01003581",
               "name": "Christine Cattell",
               "profile_path": "/Vc98PXsRVmQxMzeGA6OcTpRj2L.jpg",
               "id": 170162,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b21",
               "name": "Bruce Beresford",
               "profile_path": "/2BM92YfwzMpFkk5IlNZfZqPmODy.jpg",
               "id": 5696,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b27",
               "name": "Steven Haft",
               "profile_path": null,
               "id": 2706,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b2d",
               "name": "Ron Koslow",
               "profile_path": null,
               "id": 41184,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e2c3a36847f8117b47",
               "name": "John Bloom",
               "profile_path": null,
               "id": 6491,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.021597,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46063,
      "vote_count": 15,
      "budget": 0,
      "overview": "Upon taking a new job, young lawyer Rick Hayes is assigned to the clemency case of Cindy Liggett, a woman convicted of first degree murder and sentenced to death. As Hayes investigates the background for her case, the two begin to form a deep friendship, while all the while the date for her execution draws nearer.",
      "similar": [
         2749,
         445954,
         357096,
         10651,
         15069,
         4771,
         238636,
         984,
         17494,
         111083,
         1598,
         123109,
         18587,
         26390,
         8090,
         12150,
         1586,
         1949,
         2832,
         979
      ],
      "original_title": "Last Dance",
      "runtime": 103,
      "poster_path": "/2yatMz23t6BpRcc7J47UhnFOPFI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1996-05-02",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Sometimes justice is a crime",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Bruce Beresford"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Steven Haft",
         "Ron Koslow"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116827/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNDMyNjEwOF5BMl5BanBnXkFtZTcwNjQ1MjAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sharon Stone, Rob Morrow, Randy Quaid | See full cast and crew »"],
      "reviews": [
         "Movie starts of with Rick Hayes (Rob Morrow) a young lawyer who gets a new job and is assigned a clemency case on Cindy Liggett (Sharon Stone) who has been on death row for 12 years for double murder. Rick Hayes tries to save Liggett from execution. At first she refuses to give Rick information. But later on gets along with him and they get closer. Everyone gives up on her and Rick is the only one trying to help her and is very driven to save her. Some people might say it is a slow and boring movie and that the plot is not good but i liked it, it was a very touching movie and Sharon Stone did a great job. I recamend it to those that like touching movies like me. .",
         "I have yet to see DMW- starring Sean Penn and Susan Sarandon, but given it was such a popular movie, it was difficult for this one to step out of its shadow. It is about a woman up against death row. An attorney steps in and tries to save her life by proving her innocence in a murder trial. I have always been intrigued with prison movies for their grittiness, and drama, and Last Dance has some real moments of tension. However the grittiness is somewhat lacking, until the end (and even there its not as strong). What saves the movie is strong acting, specifically from Stone (who is somewhat Hollywood's female version of Sean Penn in that they exceed in the lowlife \"bad guy\" roles like no other). 7/10.",
         "she stars as a middle-aged woman on death row for a crime she committed as a teenager who was high on drugs and alcohol. It's really sad because back then, even she was a victim herself, of abuse by her boyfriend as well as people in her immediate family background. But two wrongs don't make a right. Her drunken and drug high resulted in the death of innocent people for which she has gotten stuck serving time while her crazy boyfriend at the time goes score free. The majority of the film is in her lawyer's point of view as he tries desperately to save her from death by lethal injection and in the process falls in love with her. It is stunningly shot though slow paced (and as well it should be, it's a film about the supposed last days of somebody's life Hello!) and brilliantly acted. The best scene is the end scene but I don't want to give too much away. Hint: it has to do with one of the most beautiful wonders of India.",
         "Susan Hayward set her standards so high as far as this kind of performance is concerned that every actress who tries her hand at the death row will fatally be compared to her.Robert Wise 's \"I want to live\" remains vivid in memory .But Sharon Stone walks out with honors.She's a genuine thespian here,giving up glamour,seduction and sophistication ,but not necessarily her basic instincts which led her to the death sentence.She displays restraint in her gestures and her words,her relationship with other inmates rings true,particularly with the black woman.Her interest in art drawing is credible. Sadly,she's supported neither by the rest of the cast,nor by the plot.Her attentive escort is a rather bland actor,who seems more to go touring round the jail than care for his unfortunate protégée.And what a man!We learn that he is a young man of means whose fortune fluctuates as the years pass by.That's the main flaw:the movie would like to be realistic,it is melodramatic to the core.Outside the lawyer's story,we deal with a black convict,who redeemed himself in jail,who wrote a book,which became a best-seller,and he passed a law degree ,you name it...Alas poor Sharon/Cindy killed a wealthy man's son (and his girlfriend),but she was never given a chance ,being born on the wrong side of town.A glance into her aunt's \"house\" tells it all.That's too much. There is a successful short scene.Morrow asks the female victim's mother to sign a petition;and although she's an adept of \"thou shalt not kill\",she refuses.Hardly one minute,but these few words say a lot more than the preachy chatter of the rest of the plot.But the \"false \" ending -and there's also a ridiculous Indian epilogue- gives the coup de grâce to the movie.",
         "For people who believe in second chances. \"Last Dance\" belongs to my top 10 lawyer movies of all time below \"A Few Good Men,\" \"Class Action\" and \"The Verdict.\" I've seen this movie a dozen of times and as a law student I must say that it is better than your average John Grisham legal drama maybe except for \"The Rainmaker.\" This film takes on the professional and ethical dilemma of a young clemency attorney Rick Hayes played by Rob Morrow who befriends a death row inmate convicted of double murder Cindy Liggett played by Sharon Stone. She is about to be executed. He moves heaven and earth to save her from death by lethal injection. The rest of the cast are excellent from Peter Gallagher and Jack Thompson. Randy Quaid gives a very good performance as a sarcastic veteran clemency attorney Sam Burns.",
         "I just saw this recently, and found it interesting that the details of the case in it follow quite closely those of the controversial execution of Karla Faye Tucker Brown. Karla committed a double murder much like that portrayed in the film, and, like the film's Cindy Liggett, reformed her life in prison. Also like Liggett, she was a fairly attractive, articulate woman who argued eloquently, though futilely, for clemency. Unlike Liggett, however, Karla became a born-again Christian, and her clemency plea was supported by several prominent pastors including Jerry Falwell and Pat Robertson. It is thus notable that the governor who signed her death warrant was none other than our current, allegedly born-again President, George W. Bush. It is possible that nothing in Bush's checkered career reveals his true character more clearly than his callous, smirking mockery of Karla's dignified plea for her life during an interview with Talk Magazine the year after her execution. Incidentally, Karla Faye Tucker Brown was killed by the state of Texas in 1998, two years after this film came out. That suggests that the filmmakers might have been trying to to make an argument for clemency, as Errol Morris did for Randall Adams with his documentary \"The Thin Blue Line.\" If so, it failed miserably.",
         "In case you're wondering, yes, \"Last Dance\" is clearly a film against capital punishment. But what makes it interesting is how it does not dwell on the morality of whether it's right or wrong to execute convicted criminals, but rather it focuses on the corruption of human government which uses lives for political manipulation. Whether you're in favor of capital punishment or not, we can all agree that we shouldn't send people to their deaths just so someone can win an election, right? That's the core theme of this film. One prisoner may be pardoned--why?--not because he's worthy but simply because the public likes him and will vote for any politician who will pardon him. Another prisoner may not be so politically valuable, so he ends up behind the 8 ball. With this approach in mind, \"Last Dance\" leads us through a nightmarish labyrinth of human justice where innocence and guilt have nothing to do with punishment. Sharon Stone plays \"Cindy\" a condemned killer who brutally murdered two people 12 years prior. What follows is not an issue of whether she deserves to live or die, but it's an issue of whether her fate should be determined by a small handful of powerful people with only their own interests in mind. There's a great line from the movie where one character shirks his responsibility with: \"It's just the system\" and another character responds \"we ARE the system.\" Without devolving into a cartoonish conspiracy thriller, this film takes a broad and disturbing look at the ongoing failure of human justice. It's reminiscent of Orson Welles' masterpiece \"The Trial\" in the way that it doesn't accuse any individual culprit but rather the entire collective \"system\" which seems to perpetuate itself simply by people refusing to take a stand. While there's not a lot of action, it's definitely a roller-coaster as our hero Ricky (Rob Morrow) struggles to set things right. Don't expect a fast paced flick with car chases and evil villains on his tail. No, this is the real world, and the only villains are his bosses, colleagues and politicians who thwart his progress by simply doing what they do every day. Excellent acting by Sharon Stone makes you connect with her even though you remain fully aware that she is a killer. There's one fantastic scene in particular where you feel her exasperation come to a boil. It expresses the exasperation of American citizens who are so sick of corruption that they're ready to give up. Meanwhile \"Ricky\" symbolizes the spirit of the individual who is ready to fight it to the end. Directed by Bruce Beresford, known for the sentimental \"Driving Miss Daisy\", this film definitely knows how to tug at your emotions. But at the same time it doesn't lose itself in sappy melodrama. If movies like this interest you, I highly recommend \"Monster\" and the accompanying documentary \"Aileen Wurnos: Life and Death of a Serial Killer\". If you like films that explore the failure of the court system and why it fails, definitely check out the grandfather of such films \"12 Angry Men\", a slow yet riveting film set entirely within 1 room as jurors expose their own prejudices & selfish interests while deciding the fate of a young boy on trial. Films like these are practically historical documents as well as highly powerful cinema.",
         "This movie though it is based on a tragic event and very hard to watch in parts, it shows something about the human heart which is invaluable. That is, that human beings are capable of immense compassion for other humans beings, which stems from the knowledge that we all share common bonds and deserve such compassion regardless of our life circumstances. A very touching movie to see this lawyer connect with this woman in such a way. This movie has a message well worth seeing. In addition the acting in this movie was very good and Sharon Stone did a superb job as well as Rob Marrow. I would recommend this movie for the above reasons, but be prepared for some shocking material.",
         "Some criminals in death row get a dose of their own medicine while they await execution, which seems to be the case with Cindy Liggett, a woman that killed two young people a few years before. Cindy, it appears, is resigned to die. She doesn't want the idea of getting false hopes, which is what happens when a young idealistic lawyer tries to have her execution stopped because he finds flaws in her case. Unfortunately, his pleas in favor of his client go into deaf ears. Rich Hayes, a young lawyer, returns home to a job his brother John, a lawyer working in the legal system, has been able to get for him. He is assigned to the clemency department, reviewing old cases that have been tried already. The Cindy Liggett murder conviction gets his attention. It's clear, from the start, her reaction is negative. She feels she is better off dead, rather than serve life in jail. At first, Cindy clashes with Rich, but his earnestness win her over, as she begins to see some hope. Rich, for his part, steps into many toes. Worst of all, he makes a blunder by accosting the state Governor at the wrong place, at the wrong time. The Governor believes in the death sentence and is against showing clemency for a murderess like Ms. Liggett, who, as far as he is concerned, has shown no remorse in the horrible way she killed. The last moments of the film involve Cindy's preparation to die by lethal injection for the crimes she committed. It is a tense time as Rich tries to do everything possible to spare the convict of the impending death. There is a tender moment when Cindy discovers a dress Rich has bought for her to wear at her execution. Bruce Heresford has had some successes in his long film career, both in his native Australia and in America. This film will always be compared to \"Dead Man Walking\", a more intense, and better film. The screen play by Ron Koslow doesn't quite make us care too much for a woman who has, apparently, not an ounce of redeeming qualities. We don't believe for one moment that the young lawyer, who also hasn't done anything worth while in his life will take the convict's case to heart like he does in the film. The best thing in \"Last Dance\" is Sharon Stone. She obviously wanted to be taken seriously when she agreed to do this movie. Her Cindy Liggett shows a hardened soul who awakens to realize the consequences of her actions and must pay for them. Rob Morrow, who plays Rich Hays throws away the film in the way he plays the character. We don't believe him for a moment he is this man who tries so hard to have Cindy's conviction changed to life. Randy Quaid, Peter Gallagher, Jack Thompson, and Skeet Ulrich are seen in the film. The main reason to watch \"Last Dance\" is Sharon Stone who shows she has the potential to do better things in her movie career.",
         "What did the makers of this film expect? It comes out after a great film like \"Dead Man Walking\" and the comparisons that were thrown at it were inevitable. Story starts out with a young lawyer named Rick Hayes (Rob Morrow) who with the help of his successful brother John (Peter Gallagher) gets a state appointed job and is given the case of a female death row inmate who is only days away from her execution after 12 years. Hayes goes to the prison to meet Cindy Liggett (Sharon Stone) and what he finds is a very angry and cold person who would rather be executed than get life in prison. Hayes thinks he can make a case with evidence that was not used in her trial but getting Cindy to cooperate is tough. One of the reasons for Hayes working so hard on this case is to prove to his brother that he's a good lawyer and wants to come out of Johns shadow. The film is directed by the terrific Bruce Beresford and technically its a well made film and their is some good use of lighting in certain shots that remind us that some real talent is involved in the making of this picture. But the story just fails and one of the reasons would be of course that it comes out after \"Dead Man Walking\" is still very fresh in everyones mind. Also, I'm not one of those persons that think that Stone is a bad actress. I think she's very good but can she carry a film all by herself? For the most part, no!. Especially when the film is at a disadvantage like this one when it desperately needed a major box office draw to save it. Stone is very effective when she's not the center of the story. More than just a character actress, but not by much. The character that Stone portrays in this film is also one that is hard to feel anything for. You don't hate her and you don't root for her either. So the viewer is left with a very hollow film and when its over you can't think of one memorable scene. In a film about the death penalty you would think that their would be plenty of very emotional scenes. But when its over, its hard to think of one. The makers of this film really needed to think hard about what they were getting involved with instead of rushing a product into the theaters to try and capitalize on the success of another film. One thing did stand out for me as I watched this. How short is Rob Morrow? Everyone in the film towers over him, including Stone who is no giant. Wasted effort."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Touchstone Pictures"],
      "summaries": ["Upon taking a new job, young lawyer Rick Hayes is assigned to the clemency case of Cindy Liggett, a woman convicted of first degree murder and sentenced to death. As Hayes investigates the background for her case, the two begin to form a deep friendship, while all the while the date for her execution draws nearer."],
      "budget": 0
   },
   "movielensId": 726,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-02",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["Bruce Beresford"],
      "runtime": 103,
      "movieId": 726,
      "title": "Last Dance",
      "mpaa": "R",
      "actors": [
         "Sharon Stone",
         "Rob Morrow",
         "Randy Quaid",
         "Peter Gallagher",
         "Jack Thompson",
         "Jayne Brook",
         "Pamala Tyson",
         "Skeet Ulrich",
         "Don Harvey",
         "Diane Sellers",
         "Patricia French",
         "Jeffrey Buckner Ford",
         "Dave Hager",
         "Christine Cattell"
      ],
      "imdbMovieId": "0116827",
      "originalTitle": "Last Dance",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["fnoD2p4aj9k"],
      "plotSummary": "Upon taking a new job, young lawyer Rick Hayes is assigned to the clemency case of Cindy Liggett, a woman convicted of first degree murder and sentenced to death. As Hayes investigates the background for her case, the two begin to form a deep friendship, while all the while the date for her execution draws nearer.",
      "tmdbMovieId": 46063,
      "avgRating": 3.1294,
      "releaseYear": "1996",
      "numRatings": 568,
      "posterPath": "/2yatMz23t6BpRcc7J47UhnFOPFI.jpg"
   }
}