{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0100065",
      "video": false,
      "title": "Love at Large",
      "recommendations": [
         39140,
         42176,
         4968,
         24073,
         16560,
         161460,
         67307,
         34322,
         38560,
         41971,
         118991,
         39233,
         31922,
         41944,
         94176,
         31696,
         59820,
         27224,
         39074,
         46270
      ],
      "backdrop_path": "/cCao3OhnSwso3NjVKqkwsL1ZTXq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harry Dobbs",
               "gender": 2,
               "credit_id": "52fe44b39251416c91019c97",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Stella Wynkowski",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019c9b",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Miss Dolan",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019c9f",
               "name": "Anne Archer",
               "profile_path": "/1dEu7fqOSogHivUjnXRFnnaOJNR.jpg",
               "id": 10427,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Ellen McGraw",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019ca3",
               "name": "Kate Capshaw",
               "profile_path": "/fR9ZNjuM67noFAXtZP4Ov5FzRPV.jpg",
               "id": 689,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. King",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019ca7",
               "name": "Annette O'Toole",
               "profile_path": "/vUsmxRy3CeyYEDNi8fgfAAzsmgH.jpg",
               "id": 1734,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Frederick King / James McGraw",
               "gender": 2,
               "credit_id": "52fe44b39251416c91019cab",
               "name": "Ted Levine",
               "profile_path": "/7O3vgqgicfNeGr3leC0qB074fjX.jpg",
               "id": 15854,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Doris",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019caf",
               "name": "Ann Magnuson",
               "profile_path": "/ry9H1u1GFbwXiWWolYA63pjBctp.jpg",
               "id": 37042,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Art the Farmhand",
               "gender": 2,
               "credit_id": "52fe44b39251416c91019cb3",
               "name": "Kevin J. O'Connor",
               "profile_path": "/1yeYRXpTbDYLMKUNT4hNQJTJsUX.jpg",
               "id": 18916,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Corrine Dart",
               "gender": 1,
               "credit_id": "52fe44b39251416c91019cb7",
               "name": "Ruby Dee",
               "profile_path": "/hadVr5kdeqlorRmjaMhHAutTbAm.jpg",
               "id": 15532,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b39251416c91019c93",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5863e7869251412b8d00e80a",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.834799,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32035,
      "vote_count": 11,
      "budget": 0,
      "overview": "Vampish miss Dolan hires hardboiled P.I. Harry Dobbs to tail her shady boyfriend. Harry realizes that the man leads a double life but then his client disappears. Harry teams up with his own tail, P.I. Stella Wynkowski, to clear things up.",
      "similar": [
         1586,
         36630,
         4507,
         963,
         521,
         27066,
         28468,
         2252,
         1903,
         116,
         1939,
         8834,
         283227,
         1213,
         64682,
         244772,
         279,
         281,
         949,
         1427
      ],
      "original_title": "Love at Large",
      "runtime": 97,
      "poster_path": "/mpaPlSukaeCGQoXYz2i3NEuQlYH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
         "name": "Orion Pictures",
         "id": 41,
         "origin_country": ""
      }],
      "release_date": "1990-03-09",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Love is the only lead worth following.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Rudolph"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Alan Rudolph"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100065/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyODU2MzgwMV5BMl5BanBnXkFtZTcwMzA0NzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tom Berenger, Elizabeth Perkins, Anne Archer | See full cast and crew »"],
      "reviews": [
         "If you're a fan of film noir, you should like this 1990 takeoff of those 1940s films with Anne Archer as an exaggerated femme-fatale in distress and private detective Tom Berenger paid to spy on her husband. It turns out to be a comedy, however, as Berenger tails the wrong guy but finds things interesting as they are. Then Berenger's girlfriend gets nervous and hires a female detective (Elizabeth Perkins) to spy on him, so everyone is watching everyone! Although there isn't a lot of action, the film never drags and is a good combination of suspense, humor and drama/action. Also nice is the soundtrack, a \"Midnight Run\" sound with good blues guitar and trumpet plus a Leonard Cohen song to start the film. Good colors add to everything. On the negative side, I didn't care for the ending regarding Archer, nor understand why she did what she did. Also, everyone in the film is a bit too sleazy. The other fault likes not in the movie but in the DVD which had a very weak transfer. Overall, fun for a couple of looks.",
         "After reading the reviews, I expected \"Love at Large\" to be an almost surreal experiment in film noir, heavy on atmosphere and short on plot. It's true that the cars and some of the costumes don't seem to fit the early 1990s setting--Doris's green, full-skirted dress, complete with eight inches of yellow crinoline, is straight out of the 1950s, and the Blue Danube nightclub seems to belong to an even earlier era (pre-World War II). The vampy Miss Dolan exudes a 1940s glamour and mystery, the kind of woman who never existed outside of male fantasies. But much of the action (or conversation) takes place in realistic settings--upper-middle-class suburban houses, airplanes, airports, a ranch in what appears to be Wyoming or Montana. More to the point, the subplot surrounding the bigamist Frederick King/James McGraw (Ted Levine) is not merely \"thrown in,\" as some critics have suggested. Mistaken identity is a classic comedic device going back at least 2000 years to the New Comedy of Menander in ancient Greece, and it still works. It also adds suspense; both Harry (Tom Berenger) and Stella (Elizabeth Perkins) believe McGraw/King to be Miss Dolan's \"charming but dangerous\" lover, Rick, and are consequently oblivious to whatever danger the real Rick may present. The Levine subplot also provides opportunities for variations on the love theme so blatantly emphasized by Stella's omnipresent \"Love Manual.\" Compared with most movies of the 1980s and 90s, this one has relatively little sex but lots of kissing. (Ted Levine gets to kiss two women, unusual for him, but this film predates \"Silence of the Lambs,\" in which his powerful performance as Jame Gumb stereotyped him as a murderer.) There are some genuinely tender moments and a lot of surprises, some of them comic and most of them in some way related either to love or mistaken identity. The casting is excellent. Both Berenger (despite his gravelly voice) and Perkins are likeable and believable, and Levine is marvelous as a man with two lives and two personalities. (No, he's not schizophrenic; he just likes to go out on a limb because, as he tells Stella, \"that's where the fruit is\"). To say more would be to spoil the film. Find it and watch it. It will be well worth the trouble of hunting it down.",
         "This is a love story in the format of a comedy. Or, more appropriately, a love quest story. Like the Detective saga it parodies, the characters are on a search for absolution. But in Rudolph's screwball world where, for instance, every car is at least 20 years old and carries the model name \"classic\", all of this light madness works toward one, central theme: love is almost impossible to find, but, oh, so much fun to search for. All the characters that are in long-term relationships are either breaking up, cheating on each other, or completely self-deluded. The other characters are in perpetual seek mode, from Miss Dolan who flirts and swoons wherever her whimsical heart takes her, to Stella, who studies \"The Love Manual\" and bitterly says things like, \"the one who is in love always waits. It's the lover's signature.\" Ultimately, this makes for light, entertaining fare. There aren't many bellylaughs, but there is a continual glow and a delightful, endearing glee about the film. Director Rudolph's cinematic sense is so keen that everything seems larger than it is, and more meaningful.",
         "I saw this film referred to as a comedy, but I hadn't remembered it as such when I first saw it some years ago. I suppose that it is, but it is funny in a wry sort of way, never a laugh out loud way. I don't know where Tom Berenger got that gravelly voice for this movie, but it seems to fit the part okay. Elizabeth Perkins was lovely and good as an angst-filled gal trying to be a private I. It was interesting to see Neil Young in a small acting role. He did OK. It makes me wonder how hard acting really is. Anne Archer was so totally gorgeous, I almost didn't realize how ridiculous her character was. This ended up being a pretty enjoyable film, if you don't go into it with unrealistic expectations. Grade: B",
         "I was one of the (very) few people who saw this in a movie theatre back in 1990. It was a small audience but everybody enjoyed it and I thought this would be a big hit. For some reason though this faded quickly. Detective Harry Dobbs (Tom Berenger) takes on a case for Miss Dolan (Anne Archer) to track her boyfriend. What Dobbs doesn't know is that he himself is being tracked by female detective Stella Wyntowski (Elizabeth Perkins). They end up meeting and set out to solve a mystery. Sounds strange...and it is but it's lots of fun too. The movie is always switching tone from romance to comedy to drama yet it always manages to stay coherent and entertaining. There's director Rudolph's excellent use of color and music and a script which goes whipping every which way. The cast is up to it. Berenger (purposefully?) adopts a gravelly voice and dresses like he just stepped out of a film noir. He perfectly plays the drama and comedy nicely. Perkins has a very difficult role but she grabs it and runs with it. Only Archer is a disappointment--REALLY overplaying her part. Kate Capshaw and Annette O'Toole shine in minor roles. This is not a easy movie to categorize or explain--you've just got to watch it. It's sort of like a film noir with comedy, style and color...but it's also a romance with a mystery thrown in...OR a comedy with some dramatic moments. It goes all over the map. Beautifully done and well worth seeing.",
         "Enjoyable movie. It is a tongue in cheek detective story. Berenger uses a phony, gravelly voice and is a mess as a detective: He trails the wrong man for the entire movie. When he stands up at the nightclub he hits his head on the lamp hanging over the table--twice. He does ridiculous things in his supposed detective work, one after another. This is a good natured film and an obvious spoof. The funny things is--it works. It is entertaining and funny in its silliness. I have seen many far worse movies. I would not have known that Berenger had this level of talent for comedy.",
         "First off, let me say I love this film. It might seem odd for a normal man of 30, when this film came out. But then, I like musicals, as well. From reading the comments here and elsewhere, people seemed nonplussed as to how to categorized this film. What clued me in was the confusion it caused everybody. This movie really is a mystery. But the mystery isn't in the plot. It doesn't keep you guessing. Or the characters; they're played pretty straightforward. It's the genre. Every time you get comfortable with how it's being played, Rudolph switches it up. Is it a film noir? Is it a comedy? Is it a love story? Uh, yes. But that's the beauty of this film. It keeps you guessing as to what it is. And Rudolph would have been having a laugh for the past quarter century if more people could see this film for the brilliance it is. Actually, if more people had seen it. But now, he's waited so long for people to get it, that well . . .",
         "Alan Rudolph's soft-boiled, shaggy-dog detective parody stars Tom Berenger as a dim-witted private eye hired by torch singer Anne Archer to follow her boyfriend. He begins by tailing the wrong man, and soon finds himself pursued (again, by accident) by amateur gumshoe Elizabeth Perkins. The escalating complications lead nowhere in particular, but if quirkiness were a virtue Rudolph would be a saint, and his story takes some interesting detours on its way to a dead end conclusion. All the romantic whimsy and offbeat characters can't hide the brick wall Rudolph hits when trying to define the Meaning of Love, but on a strictly superficial level the film can be enjoyed as an elegant, empty caricature, with odd touches of retro-noir detail (Annette O'Toole, for example, dolled up as a Veronica Lake facsimile). Look for Gary Larson of The Far Side comic fame, playing guitar in the nightclub band.",
         "Love at large is a typical 90s comedy with two great leading actors: Tom Berenger and Elizabeth Perkins. I really enjoyed watching this film especially Elizabeth Perkins is hilarious as the young woman who becomes a detective because she can`t find another job. Worth watching 7/10"
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["A down and out private detective (Berenger) is asked by a beautiful woman (Archer) to follow her lover (Young) because she thinks he may be planning to kill her. Due to her poor description she's in danger. He ends up following the wrong man, but discovers the wrong man has some sleazy secrets himself. Meanwhile another detective (Perkins) has been hired to follow Berenger, and they eventually decide to work together to find out what is really going on."],
      "budget": 0
   },
   "movielensId": 7268,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-03-09",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Alan Rudolph"],
      "runtime": 97,
      "movieId": 7268,
      "title": "Love at Large",
      "mpaa": "R",
      "actors": [
         "Tom Berenger",
         "Elizabeth Perkins",
         "Anne Archer",
         "Kate Capshaw",
         "Annette O'Toole",
         "Ted Levine",
         "Ann Magnuson",
         "Kevin J. O'Connor",
         "Ruby Dee"
      ],
      "imdbMovieId": "0100065",
      "originalTitle": "Love at Large",
      "genres": [
         "Comedy",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["fDVdaC1X6Ck"],
      "plotSummary": "Vampish miss Dolan hires hardboiled P.I. Harry Dobbs to tail her shady boyfriend. Harry realizes that the man leads a double life but then his client disappears. Harry teams up with his own tail, P.I. Stella Wynkowski, to clear things up.",
      "tmdbMovieId": 32035,
      "avgRating": 2.95652,
      "releaseYear": "1990",
      "numRatings": 23,
      "posterPath": "/mpaPlSukaeCGQoXYz2i3NEuQlYH.jpg"
   }
}