{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0166158",
      "video": false,
      "title": "Daddy and Them",
      "recommendations": [
         33175,
         24811,
         40818,
         85529,
         122796,
         31955,
         72031,
         73952
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ruby Montgomery",
               "gender": 1,
               "credit_id": "52fe45229251416c91028aa9",
               "name": "Laura Dern",
               "profile_path": "/hoijifqwuyIXO6Lsp8QpO3MhIXv.jpg",
               "id": 4784,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Claude Montgomery",
               "gender": 2,
               "credit_id": "52fe45229251416c91028aad",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jewel",
               "gender": 1,
               "credit_id": "52fe45239251416c91028ab1",
               "name": "Diane Ladd",
               "profile_path": "/slgKANTJWP5vStwKimuEGwpMr4S.jpg",
               "id": 6587,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rose",
               "gender": 1,
               "credit_id": "52fe45239251416c91028ab5",
               "name": "Kelly Preston",
               "profile_path": "/kxTQVsfZkI3DdzBqutw4zZapRB.jpg",
               "id": 11164,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "O.T. Montgomery",
               "gender": 2,
               "credit_id": "52fe45239251416c91028ab9",
               "name": "Andy Griffith",
               "profile_path": "/xEZDw1WtK08jXa8DloaDmQK8bKi.jpg",
               "id": 65562,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Elbe Montgomery",
               "gender": 1,
               "credit_id": "52fe45239251416c91028abd",
               "name": "Sandra Seacat",
               "profile_path": "/u1c21S63Gqt0YtDKyfctzPIvS3E.jpg",
               "id": 110877,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Alvin Montgomery",
               "gender": 2,
               "credit_id": "52fe45239251416c91028ac1",
               "name": "John Prine",
               "profile_path": null,
               "id": 110878,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Hazel Montgomery",
               "gender": 2,
               "credit_id": "52fe45239251416c91028ac5",
               "name": "Jim Varney",
               "profile_path": "/eIo2jVVXYgjDtaHoF19Ll9vtW7h.jpg",
               "id": 12899,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Lawrence Bowen",
               "gender": 2,
               "credit_id": "56cc338ec3a36865e1002205",
               "name": "Ben Affleck",
               "profile_path": "/lowyjtC3tZcNEGrxCGoEwjqgdvk.jpg",
               "id": 880,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45229251416c91028a9f",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45229251416c91028aa5",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "584ef939c3a3682a8a00139e",
               "name": "Sally Menke",
               "profile_path": "/8cUdiGU7KhBgd8UNnoUYNCMZYgQ.jpg",
               "id": 156,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a884be8c3a368637c050dd4",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.393199,
      "production_countries": [],
      "id": 33557,
      "vote_count": 6,
      "budget": 0,
      "overview": "When an uncle is charged with murder, the event reverberates throughout a poor Arkansas family, including a struggling musician and his wife, her mother, her sister, and his father.",
      "similar": [],
      "original_title": "Daddy and Them",
      "runtime": 101,
      "poster_path": "/m9d9h2V4EozwT6TqkjdTpPWhpkT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2001-10-26",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Billy Bob Thornton"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Billy Bob Thornton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0166158/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MjM5ODkxMl5BMl5BanBnXkFtZTcwODk2NDQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Laura Dern, Diane Ladd | See full cast and crew »"],
      "reviews": [
         "I suspect that your ability to enjoy this movie may hinge on 2 things. Can you take a joke and have you ever lived in the South? If you enjoy SIX FEET UNDER that will help. At times you think you have things figured out only to realize that you are watching a character's dream or fantasy. If you have lived in the South you have met ALL these people. From Billy Bob who's wife, Laura Dern constantly reminds him of all the studs she bedded before him to her mother (in the film and in real life) Dianne Ladd constantly trying start an argument between them to the her sister (Kelly Preston) who has never really gotten Billy Bob's character out of her system to the \"Out of towners\", usually from UP NORTH who think they are SO much superior to the local folk. From the matriarch who is slowly slipping into senility and the patriarch who is Not dealing with that or anything else too well, to the \"stud\" brother who drinks too much (Jeff Baily) and goes through a lot of cars. For those NOT raised in the South I can assure you these are REAL PEOPLE. I have known them all in one form or fashion. ALL the acting is good. A very nice turn by a former Cowboys Cheerleader, Tamara Glynn, in the role of the paramedic, refered to in the move as the \"ambulance driver\". Also a Little Rock local (last seen advertising A/C and a Jr. College) does an admirable job as the brother who is said to be \"screwing everything\". ANDY GRIFFITH- Outstanding character and you have not likely ever seen him like this. TAKE NOTE of the scenery when Laura Dern and BBT are having the picnic. That is atop Petite Jean Mountain west of Little Rock and is some of the greatest scenery around. I was still laughing after multiple viewings. IF you take this as a farce you can enjoy it. If you are looking for the deeper meaning as in SLINGBLADE you will be bored and disappointed. FWIW I did not have anything to do with this movie and don't know any of the folks involved.",
         "It looks like the lack of marketing for this film has really caused the filmgoing public to be deprived. I understand there was some turmoil surrounding the films release, which is why it was so delayed, and had things worked out better, it may have reached the audience it was designed for. The endearing part of this movie, with it's wandering plot, and it's archetypal characters, is that it is an accurate reflection of daily life among many of the lower middle class that lives in the middle of this country. I know these characters. Every one of them could be a neighbor to me. Although this film was based in Arkansas, it easily could have been made in Clay City, KY, right down to the phrase \"daddy and them's\" to refer to the patriarchal home-place. In short, this movie is about life, and not everyone's life, but hopefully about the life of someone everyone knows. When you add in the stellar cast, including hillbilly hero John Prine, this movie can simply not go unwatched.",
         "From the first time I caught a portion of this film on Showtime until I finally found a copy on DVD, I asked myself, \"Why wasn't this released in the theaters?\" I have rationalized that it was too real for the average Southern audience and conversely bizarre to a Northern group. Add the fact that Jim Varney was unable to complete the film, which I'm sure, created some last minute re-writes and the botch job the editors did in the cutting room and the answer becomes more obvious. The movie had a superior cast and each thespian was spot on in the portrayal of their respective roles. From the obvious stars Billy Bob Thornton's portrayal of an alcoholic, troglodytic, narcissistic redneck and Andy Griffith's character whose nightmare plagued view of life was truly delightful to watch, to the unsung Walter Goggins spot-on Southern Homosexual; Tommy Christianson (Jim Varney's alleged victim) and the tandem of Jaimie Lee's and Affleck's portrayals of fish out of water Yankees, all the actors were well above Hollywood's standards. The writing was as close as one can get to true to life redneck/white trash dialog. I use the terms redneck/white trash with personal pride having spent a good number of my life's years living in a trailer in Alabama. I have been surrounded by and endured these types with much fascination for quite some time and this movie was completely a slice of life. Well worth watching and should be a part of every Southerner's DVD collection. Through all the madness that ensues in the film, the finale leaves one feeling warm and fuzzy, if you work for it. You can see the potential for change and growth in all walks of humanity. The poor struggle with the past but live in the now. They walk in the shadows of the educated but are far from being imbeciles. Obscene behavior shows ignorance not stupidity. Anyone that sees this film and cannot get past all the verbose behavior in the film will not grasp the underlying love that is being purveyed. The Character's total dysfunction disables them from rational thoughts and actions, however, they do care for one another honestly and carry exceptionally strong family bonds. Now, for the most troubling aspect; the fatal flaw was the editing. The movie at first glance has some gaps and unexplainable situations that are baffling and distracting. Upon viewing the deleted scenes portion of the DVD the movie's intent and flow are re-established. This is still a very good film. Sadly, it could have been a great one.",
         "First off, let me say that I am a southerner. I'm also a fan of Billy Bob Thornton, but I can't say that all of his movies are works of genius. When he's good, he's very, very good...etc. I watched \"Daddy and Them\" and thought I had really stumbled onto a gem! Also written and directed by Billy Bob, it portrays two of the most dysfunctional families ever. They are his immediate family, plus his wife's (Laura Dern), who've gotten together because Uncle Hazel (Jim Varney, in a very small, thankfully non-Ernest role) has been arrested for attempted murder. To top it off, these people are the epitome of Arkansas rednecks! Diane Ladd is in it, as is Andy Griffith. Since it's a Billy Bob-er, the language is kinda raw, and it's a real hoot to see and especially hear old Sheriff Andy get down and dirty! He plays BB's elderly, semi-senile father. Very humorous, with more than a few belly laughs... up until 1:10, or thereabouts, then the whole thing just collapsed! It went into a final half-hour or so of boring, self-absorbed pseudo-psychological angst and apologia claptrap. What a come-down! I guess it was intended to make the film \"relevant,\" or something, but what it really did was to make it a semi-disaster. I'd recommend looking at the first 2/3rds, then, when BB starts to become a self-analyzing motormouth, turn it off and play Scrabble, or something.",
         "I won't rehash what everyone else has said but make an interesting observation. The characters in \"Daddy & Them\" pretty well represent every individual in this world - in all our glorious dysfunction. Every once in a while, someone comes along that gives our idiosyncrasies a voice- brings us together even if just for a little while. The kind of things that we all know in our hearts but never hear anyone put accurately into words. In real life, one of these rare individuals is songwriter John Prine. I wonder if Billy Bob thought about this when he cast JP in the role of Alvin - an enigmatic oddity who ultimately nails the situation and brings everyone together, even if just for a little while?",
         "I will be the first to admit that I was skeptical about Thorton writing and directing this movie. And since I was (still am) going through a complicated divorce when I saw the movie, it made me cringe a few times in the first half of the movie. Up until Julia had her outburst - after that, things started to converge. Without giving away too much, I'll say that I can easily compare this movie to a symphony that is unconventional in the sense that it doesn't have a climax where a naive audience expects it to be. However, the first half being full of dissonance and stark tones, that almost magically become resolved into a harmony. Seeing as though the IMDb patrons gave this movie only barely more than a 5 score, what I am going to say now will be controversial: I think Thorton is a freaking genius, and I am glad I watched this movie. For me, this is a solid 8 stars.",
         "I saw a rough edit of this film in December of 1998 and thoroughly enjoyed it. I can only wonder at what has caused the release of this movie to be delayed. Feel free to e-mail me if you can shed any light on this. The movie is set in suburban and rural Arkansas. The plot follows Billy Bob Thornton's character and his girlfriend played by Laura Dern. They belong to one of the most dysfunctional (and funny) families ever portrayed on screen. Most of the family members have serious problems with communication and alcohol. The family dynamic is further complicated when one of them (Jim Varney - rest his soul) is thrown in jail. Varney turns in an astounding performance and it's a true shame he isn't alive to see how the critics are going to react. The cast is full of quirky, interesting characters that are easy to connect with emotionally. John Prine steals the movie as the focal point of what is probably the most important (and hilarious) scene in the film...which I won't give away here. I highly recommend that you see this movie. Now the question is - When will the studio let you see it?",
         "Filmed in Little Rock, Arkansas, this film is a languid telling of a Southern family's domestic travails. All the characters appear to be enjoying themselves most of the time, except Ben Affleck and Jamie Lee Curtis. And John Prine, who seems to be enjoying himself all the time. Prine's gravelly voice is a treat. Wait for the credits to roll and you will finally get to hear him sing (\"In Spite of Ourselves\"\u0097just right for this film). The soundtrack is stunning, especially the acoustic \"Dixie,\" soft and reflective, strummed while Billy Bob reflects on himself. Don't miss the director's commentary. Billy Bob Thornton adds quite a bit of insight and detail to each scene. Pour a glass of wine, build a fire, and enjoy.",
         "I have seen this movie 2 1/2 times now and it gets funnier and funnier. The subtle humor builds with each viewing. It's too bad movies like this don't get the attention like the crap that's out there now. A must see! A few times :)",
         "I'm from the south and though I'm sure people are like these people in the film, I don't know of any. The reason for the 8/10 was because of Jim Varney's performance. It was refreshing seeing him in a different light even though I grew up on 'Ernest P. Worrell', who is still my favorite. I understood what BBT was going for but I don't think he got there. There was too much bickering between Ruby and Claude, with jealousy as the constant instigator, and too much bad language for my tastes. And this may not be fair, but I took off a star because of the foul words Varney had said. I just can't wrap my head around the fact that he said them. I wanted more scenes with Varney but I'm guessing that because of the cancer and him needing surgery changed all that. BBT did the right thing in adding Varney to the cast. The courtroom scene is one of my favorites in the whole film. I wish Varney was still alive. He had a lot more in him and he was a tremendous talent. \"The good ones die first\". I can see from the others on IMDb that the reviews are mixed. It wasn't a bad movie but BBT did better as 'Sling Blade'."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Free Hazel Films",
         "Industry Entertainment",
         "Miramax"
      ],
      "summaries": [
         "When an uncle is charged with murder, the event reverberates throughout a poor Arkansas family, including a struggling musician and his wife, her mother, her sister, and his father.",
         "Ruby and Claude Montgomery are a very insecure jealous couple, because of their past sentimental life: Claude has had an affair with Ruby's older sister Rose when Ruby was a young girl; and Ruby has had many muscled boy-friends in the past. When Claude's uncle Hazel is arrested for attempting of murder a local, Ruby and Claude travel with Rose and Jewel to Arkansas to give their sympathy to the Montgomery family. While traveling, Jewel recalls all the time many events between Claude and Jewel, irritating Ruby. Finally they arrive in their destiny in the breast of the Montgomery, a low middle class family with total lack of communication.",
         "Dark comedy where a married couple comes to the aid of a jailed uncle."
      ],
      "budget": 4000000
   },
   "movielensId": 7278,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-10-26",
      "dvdReleaseDate": "2004-01-13",
      "directors": ["Billy Bob Thornton"],
      "runtime": 101,
      "movieId": 7278,
      "title": "Daddy and Them",
      "mpaa": "R",
      "actors": [
         "Laura Dern",
         "Billy Bob Thornton",
         "Diane Ladd",
         "Kelly Preston",
         "Andy Griffith",
         "Sandra Seacat",
         "John Prine",
         "Jim Varney",
         "Ben Affleck"
      ],
      "imdbMovieId": "0166158",
      "originalTitle": "Daddy and Them",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["LR6JtnlgV-o"],
      "plotSummary": "When an uncle is charged with murder, the event reverberates throughout a poor Arkansas family, including a struggling musician and his wife, her mother, her sister, and his father.",
      "tmdbMovieId": 33557,
      "avgRating": 2.82895,
      "releaseYear": "2001",
      "numRatings": 38,
      "posterPath": "/m9d9h2V4EozwT6TqkjdTpPWhpkT.jpg"
   }
}