{
   "tmdb": {
      "original_language": "rw",
      "keywords": [{
         "name": "rwanda",
         "id": 971
      }],
      "imdb_id": "tt1031947",
      "video": false,
      "title": "Munyurangabo",
      "recommendations": [],
      "backdrop_path": "/705nvtUCKM7YqTDEsZUuLMIwRaC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Munyurangabo",
               "gender": 0,
               "credit_id": "590dbfb0c3a368651900d14b",
               "name": "Jeff Rutagengwa",
               "profile_path": null,
               "id": 1811546,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sangwa",
               "gender": 0,
               "credit_id": "590dbfbbc3a36864c600e01e",
               "name": "Eric Ndorunkundiye",
               "profile_path": null,
               "id": 1811547,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Papa Sangwa",
               "gender": 0,
               "credit_id": "590dbfc69251414edb00e564",
               "name": "Jean Marie Vianney Nkurikiyinka",
               "profile_path": null,
               "id": 1811548,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gwiza",
               "gender": 0,
               "credit_id": "590dbfd19251414e8000e794",
               "name": "Jean Pierre Harerimana",
               "profile_path": null,
               "id": 1811549,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mama Sangwa",
               "gender": 0,
               "credit_id": "590dbfdc9251414e8d00df94",
               "name": "Narcicia Nyirabucyeye",
               "profile_path": null,
               "id": 1811550,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Poet",
               "gender": 0,
               "credit_id": "590dbfe69251414e8000e7a1",
               "name": "Edouard B. Uwayo",
               "profile_path": null,
               "id": 1811551,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Killer",
               "gender": 0,
               "credit_id": "590dbff4c3a36864a700de16",
               "name": "Pierre Claver Kayitsinga",
               "profile_path": null,
               "id": 1811552,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Father of Munyurangabo",
               "gender": 0,
               "credit_id": "590dc0009251414eca00de18",
               "name": "Etienne Rugazora",
               "profile_path": null,
               "id": 1811553,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe493ec3a36847f81905ad",
               "name": "Lee Isaac Chung",
               "profile_path": null,
               "id": 931952,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "590dbf8dc3a36864ec00d4a7",
               "name": "Samuel Gray Anderson",
               "profile_path": null,
               "id": 931951,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "590dbf94c3a36864ec00d4ac",
               "name": "Lee Isaac Chung",
               "profile_path": null,
               "id": 931952,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.288967,
      "production_countries": [
         {
            "iso_3166_1": "RW",
            "name": "Rwanda"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 57654,
      "vote_count": 5,
      "budget": 0,
      "overview": "An orphan of the Rwandan genocide travels from Kigali to the countryside on a quest for justice.",
      "similar": [
         205,
         465240,
         81215,
         49846,
         600,
         553,
         1372,
         429,
         126889,
         924,
         339964,
         250538,
         72710,
         625,
         1985,
         468207,
         10130,
         399031,
         25237,
         450806
      ],
      "original_title": "Munyurangabo",
      "runtime": 97,
      "poster_path": "/pBx66CPVZeZkzshAen3GR4ytLHq.jpg",
      "spoken_languages": [{
         "name": "Kinyarwanda",
         "iso_639_1": "rw"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Almond Tree Films",
         "id": 89970,
         "origin_country": ""
      }],
      "release_date": "2007-01-01",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Rwanda",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lee Isaac Chung"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Samuel Gray Anderson",
         "Lee Isaac Chung"
      ],
      "originalLanguage": "Kinyarwanda",
      "imdbLink": "http://www.imdb.com/title/tt1031947/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2NDA2NzkyN15BMl5BanBnXkFtZTcwOTA3OTA1Mg@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Rutagengwa, Eric Ndorunkundiye, Jean Marie Vianney Nkurikiyinka | See full cast and crew »"],
      "reviews": [
         "When viewing the primal landscape of the beautiful country of Rwanda, it is hard to imagine that only a short time ago the land was awash with the blood of 800,000 people. No film more fully captures the residual pain resulting from the 1994 genocide than Munyurangabo, an intimate and deeply moving first feature from American director Lee Isaac Chung, the first film ever made in the Kinyarwanda language. Shot in only 11 days using local actors who were orphans of the genocide, Munyurangabo centers on the friendship between two teenage boys, Sangwa (Eric Dorunkundiye) a Hutu and Ngabo (Jeff Rutagengwa) a Tutsi named after the great ancient Rwandan warrior Munyurangabo, subtly weaving the story of their relationship with a plea for reconciliation in Rwanda. Chung, a 28-year-old Korean-American also shot, edited, and co-wrote the film with Samuel Gray Anderson, though much of the dialogue is improvised. The film opens with two close friends walking down a rural road with their arms around each other, ostensibly on a journey to visit Sangwa's parents whom he has not seen in three years. It is only later that we discover the real purpose of the trip, but we have some idea from the stolen machete that Ngabo is carrying. Telling them that he is on the road looking for work, the boys visit Sangwa's parents in their rural village and it is a loving reunion, especially with Sangwa's mother (Narcicia Nyirabucyeye) but there is conflict with his father (Jean Marie Vianney Nkurikiyinka), a recovered alcoholic, who becomes angry about his son's desertion of the family. The family is poor and there is little food but they accept their circumstances without complaint, drawing water from a hillside stream, manually tilling the soil, and living in a house made of mud bricks. The visit becomes even more strained when Sangwa's father complains about his son's friendship with Ngabo who is a Tutsi. Ngabo acts more as an observer than a participant and spends most of his time with Gwiza (Jean Pierre Harerimana) an old friend of Sangwa who tells fanciful stories. His feeling of isolation becomes exacerbated when Sangwa's father, after Gwiza becomes sick, tells Ngabo that he has brought nothing but trouble to their house. Feeling guilt and shame, Sangwa works in the fields and helps repair a brick wall on their home which is in danger of collapse to get back in his family's good graces, but it is not to be. The short visit becomes an extended stay but the boys cannot escape the terrible memories of the ethnic discord of the past. Their friendship is torn apart when Sangwa decides to remain at home and not follow Ngabo on his now revealed mission to enact revenge on the man who killed his father, and their breakup is described by Film Comment's Robin Wood as, \"among the most moving in my experience of cinema\". In a scene of overwhelming pathos, Sangwa's father learns of their plans and banishes his son from his house forever. One of the most powerful scenes is when Ngabo, now alone on his mission, encounters Rwandan poet Edouard B. Uwayo at a roadside café when he enters the town to find the man who killed his father. Uwayo reads his poem \"Liberation is a Journey\", a passionate lament for his country's troubled past and an expression of hope for a new Rwanda free of ethnic conflict and with equality for all. His poem leads Ngabo to question his vengeful aims, though he still harbors hatred for his father's killer and decries the fact that he can no longer remember his father's face because his mother, who died shortly afterwards, destroyed all of his photographs. Munyurangabo has a strong point of view but, under Chung's sure direction, it is a deeply human odyssey that never becomes preachy or didactic. Like Sin Nombre, a film about Mexican immigrants directed by another young American, Cary Fukanaga, Munyurangabo always feels authentic, moving seamlessly from a story of estrangement to one of spiritual redemption and ending in a fevered dream. It is a remarkable achievement that deserves to be widely seen.",
         "A friend and I managed to catch 'Munyurangabo' at the Febiofest (film festival in Prague). I am very impressed that Lee Isaac Chung, an American filmmaker, dared to tell the story of two Rwandan teenagers (played by debutants) in Rwanda, by casting non-American and not-English-speaking actors and without a big studio backup. 'Munyurangabo' is a heartfelt, moving, gritty and authentic piece of cinema. When one hears of Rwanda today, they think of the genocide. While this is an important theme of the movie, there is no violence or bloodshed. The film starts of slowly but allows the viewer to settle down as it gradually picks up. Background score is used minimally. While this makes the sequences more real, it almost gives a documentary like feel. We are given a glimpse of the Rwandan culture and how things may have changed since the genocide which happened more than a decade ago but still significantly influences the life of its inhabitants. The tension between the Tutsis and Hutus is still there. The film is about the two friends Munyurangabo (an orphan of the Rwandan genocide) and Sangwa who set out on a journey to avenge Munyurangabo's father's death. One is a Tutsi and the other is a Hutu. The tension between the two friends is evident in the very beginning and it gets stronger as the film proceeds. On the way, they stop at Sangwa's parents house to spend the night but they end up staying several days. We see Munyurangabo longing for his own family and to belong somewhere as he watches Sangwa's interaction with his family (who are reluctant about his stay) and as a result, his motivation for revenge grows stronger. This sooner brings him into an ambivalent state where, while in a way he feels more vengeful of his own father's death, later on this motivation is brought to doubt especially after listening to a strangers astonishing recital of a powerful poem. This poem is indeed very beautiful. It is very long thus one should be prepared to pay close attention because each and every one of the words have a profound impact. This poem symbolizes the hopeful future of the country and eventually leads to the film's conclusion. The performances are very genuine. In the beginning, the actors look a little uncomfortable (they're all first timers) but the viewer manage to overlook that and the acting gets better as the reel proceeds. Both the young leads, Jeff Rutagengwa and Eric Ndorunkundiye, show promise as actors. In a nutshell, 'Munyurangabo' is a small but strong little film. It has a heart, a relevant message for all, some light moments to evoke a few smiles and a great story to tell.",
         "According to the director, the film is the product of a movie making course he taught in Rwanda. The result is a fine, unpretentious and heartfelt movie that has a feel of authenticity. Almost anything Rwanda is today seen through the stain of the 1994 genocide. The memory of that awful event is a core component of the narrative, though it insinuates itself into the plot slowly. A particularly memorable moment near the end is a declamation of a poem. Because it is long, you should prepare yourself for concentrated attention. Don't miss a word and at the same time hear the rhythmic musicality of the lines. It's an encapsulation of Rwanda and its hope for the future. Powerful and moving. Kudos to the director for including it. Apparently it is the author of the poem himself that faces us. Not surprisingly he knows the poem by heart and gives it to us fast and furious while his face alternates smiles with melancholic looks, an apt expression to go with what the poem is saying. The title of the film is explained at the end but a perceptive viewer may pick up the connection early on. Think nickname. Separating Tutsis from Hutus is not crucial, but those who followed the events of the genocide in the press and acquired a feel for the racial differences between the two groups may sense the underlying tensions between the characters earlier. One of the blurbs I read before watching the film mentioned both principals playing exiles that return to Rwanda. I don't think this is correct. One of them does come back from exile, the second is befriended by the first in Kigali from where their journey begins.",
         "The opening scene of \"Munyurangabo\" passes very quickly, yet sets up the emotional conflict among its characters and within its central protagonist, Ngabo (not until the end is the relationship between the title of the film and this name revealed). I had to return a couple of times to understand the connection. It opens with Ngabo seeing a machete in the marketplace and observing two men fighting. Next we see Ngabo, machete in his lap, seated on a cement wall. He looks at the machete its tip covered in blood, and then again, and it is clean. Did he imagine the blood? Did the men in the market use it on each other? Ngabo and his friend, Sangwa, set off on a trip. They begin with a physical and emotional closeness that very gradually disintegrates. Sangwa has spent their money on a new shirt, so they must hitchhike. Their goal is to kill a man, but will visit Sangwa's family (whom he has not seen in three years) along the way. As this visit is prolonged, the friends drift apart. The dialog is very spare, but each word and gesture is significant in driving the friends apart. Must Hutus and Tutsis inevitably remain enemies? When Ngabo continues his journey alone, his meeting with the Rwandan poet-laureate at a roadside shop provides the film's turning point. The Rwandan genocide has long passed from the news media, but this film does much to reveal something about its effect on the generation that have grown up in it aftermath.",
         "A very good movie about the violence in Rwanda presented without any violence.The movie made me want to see more of movies from the African subcontinent but I could not find any in the library today.The documentary feel is beautifully present in the movie all through out. Very real and down-to-earth people.The children acted very well.There was a striking piece of poetry in the movie too.There were many memorable scenes in the movie - the father scolding the son for being away from home for 3 years or so and not fulfilling his responsibilities , the mother saving the food for the son saying \"There is no food but there is food for you\". Seemingly a very slow movie, but offers a lot of content - very close to life. Two boys drink together and the first one tells the other one that he can take his cow. When the father learns of the son's plan to murder his friend's father's killer , the father gets angry and beats him black and blue. That scene has been taken with so much originality that you might think it is from a news footage. The movie has encouraged me to explore on the subject of violence in Rwanda.",
         "This film seems to meet with some success, but a first time film about Africa made by a New Yorker who was born in Korea, lived in rural Arkansas, and dropped his plans for Yale medical school appears an ambitious challenge. As it is, Lee Isaac Chung does a remarkable job with two inexperienced actors, who are also in their first feature film. It seems, however, that films should be a combination of structure and theme. The theme relating to long term emotional damage resulting from genocide is froth with emotion and confusion, not unusual for civil strife of such magnitude. One is left feeling that the struggle between the Hutus and Tutsis is far from over and that Rwanda is someday due for more of the same. Yet, it seems that once one accepts the emotional aspects, the film offers little. As a debut, the film appears passable and should stand on its own merits. The Left Elbow Index considers seven aspects of film--acting, plot, character development, artistry, film continuity, production sets, and dialogue--on a scale of 10 for very good, 5 for average, and 1 for needs help. The acting appears uneven at best, with some bright moments. The plot seems uneven probably caused by a lack of focus as to what the purpose of the visit might be. Walking in and out of scenes seems to provide little basis for this. There appears to be little character development, and the role of the poet seems a misfit. The artistry is average with good use of color and camera angles. Film continuity appears challenged by the seeming lack of a coherent plot. The production sets and the dialogue look to be average, with mostly outdoor scenes and local language. The Left Elbow Index average for this film is 2.1, raised to a 4.0 when equated to the IMDb rating system. The film is worth seeing since it does attempt to put a human face on the Rwandan genocide, and it gives an alternative to international media reports. I believe that Lee Chung has great potential for future films, films with professional actors, tighter structures, and clearer themes. I recommend this film, keeping in mind that it is a debut."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Almond Tree Films"],
      "summaries": ["From opposing ethnicities, Ngabo and Sangwa are tested when old-timers warn, \"Hutus and Tutsis should not be friends.\" An intense and inspiring portrait of youth in Rwanda, 'Munyurangabo' features Poet Laureate Edouard Uwayo delivering a moving poem about his healing country. Rwanda. Kinyarwanda with English subtitles."],
      "budget": 0
   },
   "movielensId": 72822,
   "movielens": {
      "languages": ["Kinyarwanda"],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": null,
      "directors": ["Lee Isaac Chung"],
      "runtime": 97,
      "movieId": 72822,
      "title": "Munyurangabo",
      "mpaa": null,
      "actors": [
         "Jeff Rutagengwa",
         "Eric Ndorunkundiye",
         "Jean Marie Vianney Nkurikiyinka",
         "Jean Pierre Harerimana",
         "Narcicia Nyirabucyeye",
         "Edouard B. Uwayo",
         "Pierre Claver Kayitsinga",
         "Etienne Rugazora"
      ],
      "imdbMovieId": "1031947",
      "originalTitle": "Munyurangabo",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "An orphan of the Rwandan genocide travels from Kigali to the countryside on a quest for justice.",
      "tmdbMovieId": 57654,
      "avgRating": 2.95833,
      "releaseYear": "2007",
      "numRatings": 12,
      "posterPath": "/pBx66CPVZeZkzshAen3GR4ytLHq.jpg"
   }
}