{
   "tmdb": {
      "original_language": "th",
      "keywords": [{
         "name": "unsimulated sex",
         "id": 12420
      }],
      "imdb_id": "tt0317171",
      "video": false,
      "title": "Blissfully Yours",
      "recommendations": [
         86282,
         12130,
         155006,
         29972,
         96712,
         80243,
         117646,
         126529,
         45814,
         91067,
         93553,
         41292,
         36895,
         214775,
         24166,
         126187,
         124609,
         54421,
         176651,
         150707
      ],
      "backdrop_path": "/qEWmvT1pbN16VUZbfFJ3YTWUdjB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "570414189251415bbe00067a",
               "name": "Kanokporn Tongaram",
               "profile_path": null,
               "id": 1498161,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe471cc3a36847f8123d71",
               "name": "Min Oo",
               "profile_path": null,
               "id": 1271298,
               "order": 1
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 0,
               "credit_id": "57041490c3a3686972000743",
               "name": "Jenjira Pongpas",
               "profile_path": "/znx7ubfK1chXU8d1cP7zJM67vvA.jpg",
               "id": 120258,
               "order": 2
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "5704142c9251415bbe00067f",
               "name": "Sa-gnad Chaiyapan",
               "profile_path": null,
               "id": 1601527,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 0,
               "credit_id": "57041434c3a36869820006c3",
               "name": "Kanitpat Premkij",
               "profile_path": null,
               "id": 1601528,
               "order": 4
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "5704143d9251415bc20006b6",
               "name": "Jaruwan Techasatiern",
               "profile_path": null,
               "id": 1601529,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 0,
               "credit_id": "5704145b9251415bb60006b9",
               "name": "Duangjai Hiransri",
               "profile_path": null,
               "id": 1601503,
               "order": 6
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "57041463c3a3686989000672",
               "name": "Mee Maadman",
               "profile_path": null,
               "id": 1601530,
               "order": 7
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 0,
               "credit_id": "5704146dc3a3686985000688",
               "name": "Suchada Sirithanawuddhi",
               "profile_path": null,
               "id": 1601474,
               "order": 8
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 0,
               "credit_id": "57041475c3a368698500068c",
               "name": "Wibool Boonrak",
               "profile_path": null,
               "id": 1601531,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe471cc3a36847f8123d69",
               "name": "Apichatpong Weerasethakul",
               "profile_path": "/tNMxsbYBMH2RChJCSjwMvMyrLTW.jpg",
               "id": 69759,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe471cc3a36847f8123d81",
               "name": "Lee Chatametikool",
               "profile_path": null,
               "id": 1271299,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe471cc3a36847f8123d87",
               "name": "Eric Chan",
               "profile_path": null,
               "id": 948963,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe471cc3a36847f8123d8d",
               "name": "Charles de Meaux",
               "profile_path": null,
               "id": 69761,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570413149251415bbb000638",
               "name": "Sirithorn Teerakulchanyut",
               "profile_path": null,
               "id": 1601520,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5704131f9251415bb00006a1",
               "name": "Suchada Sirithanawuddhi",
               "profile_path": null,
               "id": 1601474,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5704132bc3a368697700071d",
               "name": "Manita Niyomprasit",
               "profile_path": null,
               "id": 1601518,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57041337c3a368698200069c",
               "name": "Santipap Ingon-gnam",
               "profile_path": null,
               "id": 1601521,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5704133ec3a36869740006ca",
               "name": "Santipap Ingon-gnam",
               "profile_path": null,
               "id": 1601522,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57041349c3a36869720006f8",
               "name": "Akekarat Homlaor",
               "profile_path": null,
               "id": 1279565,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570413559251415bb00006a9",
               "name": "Arthit Mahasri",
               "profile_path": null,
               "id": 1601523,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570413b29251415bb9000639",
               "name": "Lee Chatametikool",
               "profile_path": null,
               "id": 1271299,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "570413be9251415bbb000650",
               "name": "Teeekadet Vucharadhanin",
               "profile_path": null,
               "id": 1601524,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "570413d0c3a3686972000716",
               "name": "Zentrady",
               "profile_path": null,
               "id": 1601525,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "570413dd9251415bb60006a1",
               "name": "Nadia",
               "profile_path": null,
               "id": 1601526,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "570413f8c3a368696f000639",
               "name": "Sayombhu Mukdeeprom",
               "profile_path": "/dTF7itfmKyYPNdNiMHvH3APB07k.jpg",
               "id": 470995,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "570414079251415bb20006d5",
               "name": "Apichatpong Weerasethakul",
               "profile_path": "/tNMxsbYBMH2RChJCSjwMvMyrLTW.jpg",
               "id": 69759,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.587508,
      "production_countries": [{
         "iso_3166_1": "TH",
         "name": "Thailand"
      }],
      "id": 47046,
      "vote_count": 19,
      "budget": 0,
      "overview": "The story of a love affair that begins during a picnic on the Thai-Burmese border.",
      "similar": [
         3134,
         1631,
         35712,
         34647,
         1378,
         1567,
         2003,
         26338,
         345,
         452,
         979,
         418827,
         11845,
         10068,
         9453,
         64124,
         402,
         755,
         2057,
         12627
      ],
      "original_title": "สุดเสน่หา",
      "runtime": 126,
      "poster_path": "/wnIZmhLLaAIDRg3DQaX8TOBVIyn.jpg",
      "spoken_languages": [{
         "name": "ภาษาไทย",
         "iso_639_1": "th"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Anna Sanders Films",
            "id": 61201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kick the Machine",
            "id": 61202,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Laong Dao Co., Ltd.",
            "id": 75135,
            "origin_country": ""
         }
      ],
      "release_date": "2002-10-08",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Thailand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Apichatpong Weerasethakul"],
      "runtime": 125,
      "synopsis": null,
      "writers": ["Apichatpong Weerasethakul"],
      "originalLanguage": "Thai",
      "imdbLink": "http://www.imdb.com/title/tt0317171/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczODcxMDE3OF5BMl5BanBnXkFtZTcwOTQ0NjczMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kanokporn Tongaram, Min Oo, Jenjira Pongpas | See full cast and crew »"],
      "reviews": [
         "This second feature of Apichatpong Weerasethakul is more an experience than a story-dependent film. Something strange happens to your feeling for time while watching this two-hour long film: time seems suspended, absent. When 45 minutes into the film the opening credits suddenly appear, they come as a bit of a shock, because by then you are irresistibly drawn into the non-story. The way this film treats time is reminiscent of several films by Taiwanese director Tsai Ming-Liang: long, drawn-out scenes, in real-time or almost, and with little or no dialogue. Also the relationship between the main characters brings to mind Tsai's films, more in particular 'Aiqing Wansui' with its triangular relationship. 'Blissfully Yours' is an impressionist rendering of a lazy afternoon in the mountainous border region between Thailand and Myanmar. Min is an illegal immigrant from Myanmar, who takes his girlfriend Roong for a pick-nick. They are joined later by Orn, an older woman employed by Roong to take care of Min. One of the main ingredients in impressionism is the sun, and the sun plays an important though discrete role in this film also. It is present everywhere in the second part of the film, softly filtered through the canopy of the jungle, but also as a threat to Min who has a skin disease and was told to stay out of the sun. What also filters through in the film is the political issue of Myanmarese immigrants in northern Thailand. The first half hour shows the three main characters consulting a doctor about Min's skin condition. Min, who has no papers, doesn't speak - perhaps because the doctor would refuse to treat him if she knew her patient was an illegal alien and not a Thai. And the doctor's refusal to give Min a 'fit-to-work' certificate unless he can produce official papers is typical of the administrative vicious circle so many illegal immigrants are caught in all around the world. This makes for a stark contrast between the first and second part of the film, between grim reality and a dreamy, lazy afternoon that is bathed in light. American audiences may feel uneasy seeing sex scenes that are neither censored, clinical, beautified or violent. Not recommended for viewers who require car chases and shoot-outs, or for those who don't like ants.",
         "Blissfully Yours as the film is being called in the U.S. is not a perfect film. That said, my initial reaction fades as I re-examine the film in my mind's eye. It has an ethereal quality, especially the second two-thirds of the film (after the credits finally roll). The film plays with the whole idea of what is film. When does a film begin? Initially you feel as if you have just walked in on the personal lives of the characters. You are quietly viewing their life, or maybe you're just along for the ride. This is especially driven home while in the car with two of the main characters, Roong and Min, as they drive around. At times you are viewing them from the outside, at others inside the car watching them, and at still others, just looking behind at where they have come from. In a way it is in these sequences that the director gives you clues about how to view the overall film. The first third, prior to the credits, is showing you as a viewer where these three characters come from. Once the credits roll we only see one other person (ok, we do see the back of another person on a scooter) besides the three main characters. At this point it becomes their film. Their afternoon in the sun. In the jungle, away from all of life's troubles, it is a moment of bliss. It allows Min to forget for a moment his skin problem, and his life left behind in Burma. It allows Roong to forget for a moment her regimented life as a factory girl, laboriously painting the same mass produced items, over, and over again. And it allows Orn the opportunity to finally let go and relax; to come to terms with her own past; wherein, she may have had a child that drowned, and has been unable to forgive herself. The film is deliberately slow paced, and yet I never once felt bored, or disinterested in what I was watching. It is not filled with action, but with feeling. It is a film about release. The letting go of our worldly cares for a blissful moment in the sun. I recommend you take a lazy afternoon and see Blissfully Yours. Let it help you escape into the jungle of your own mind.",
         "I am amazed at how riveting I found so slow-moving a film in which almost nothing happens. The relaxation and fun and peace that the charcaters find on a sunny afternoon in a dense forest points up their isolation from each other and from everyone else in their world. In the final shots, even Min's genitals are isolated -- by the girlfriend playing with them and by himself. What we feel for \"bitch/mental case\" Orn as she weeps while Roong plays with Min's isolated manhood is moving at the deepest level. The gradual drifting to isolated sleep by everyone at the close perhaps pushes the dramatic and filmic possibilities beyond the usable limit and inclines the viewer to call, \"Okay, film student, enough!\" But overall, the director seems to have achieved exactly what he wanted -- and making you wait is one of the main things he wanted. The film hangs wonderfully together: The long opening squence in which Min refuses to speak with the doctor is followed by the doctor's session with a father and daughter who speak all to much and never communicate because of the father's hearing aid problems. Don't miss this; and do watch it not expecting Thais and Burmese to be westerners and not expecting a Thai film to be cued to car chases.",
         "An unknown author once said that \"love is a symbol of eternity. It wipes out all sense of time, destroying all memory of a beginning and all fear of an end.\" Blissfully Yours, the second feature from Thai director Apitchatpong Weerasethakul, is a film about ecstasy that happens outside of time. It is roughly divided into two parts - one ordinary, the other transcendent and is without a typical plot or character development. Rather, it speaks directly to the human spirit, to its capacity to transcend the \"stuff\" of life and reach for the eternal. Blissfully Yours begins in the small Thai city of Khon Kaen as Min (Min Oo), an apparently mute young man with a skin condition visits a doctor together with his girlfriend Roong (Kanokporn Tongaram) and Orn (Jenjira Jansuda), an older woman who has lost a child by drowning. Shot in the offices of the director's doctor parents, we soon learn that Min is a Burmese immigrant who is in Thailand illegally and is seeking a work permit from the doctor in order to remain in the country and that Orn has been hired to look after him. Without proper ID, however, the doctor refuses to cooperate. The film then moves to the souvenir factory where Roong works on an assembly line worker hand painting Disney figurines, and then to Orn who prepares a skin cream for Min by chopping vegetables. There is also a glimpse of the office where Orn's husband works. About forty five minutes into Blissfully Yours, credits suddenly appear on the screen, we hear a Thai popular song in the background, and we know that we are in unfamiliar territory. Taking time off from work because of an illusory illness, Roong and Min drive to the countryside for an afternoon picnic recorded in long, uninterrupted takes and the film never looks back. Stress fades away as scenes of nature replace the familiar images of city life. Roong and Min walk through dense jungle to reach an opening in the woods with a clear view of mountains and streams. Not much is said as the camera lingers on Roong and Min as they eat berries, splash in the cool waters, and engage in erotic activities that seem to be initiated by Roong alone as she caresses Min's sexual organ in full camera view. There is much attention given to bodies and their sensitivity to touch especially when we learn that Min's rash is both physical and political. Through a voice over and doodling shown on the screen, we find out that he has been hiding from the Burmese police for an undisclosed reason, has a son in Rangoon, and may have picked up his skin rash while hiding in a septic tank. It is also hinted that Roong is a member of the Karen ethnic group, a hill tribe that have fought for independence from Burma since 1949. Weerasethakul pushes viewer patience to the limit as shots of Roong snuggling up to the passive Min take several minutes to unfold and one is reminded of Werner Erhard's assertion that boredom is a \"high space\" to be in. Orn, who is also enjoying sex with a male companion, has her tryst interrupted when her lover's bike is stolen and she makes her way through the forest to join Min and Roong. As Roong and Min lie on their backs looking up to the sky sharing moments of peace and spiritual awareness, Orn lies alone and begins to cry. It is a moment of quiet isolation filled with mystery and magic as this visionary, sexually explicit, and sensual work of art becomes blissfully ours forever.",
         "Apichatpong Weerasethakul is exemplary in pointing to new ways of telling cinematic stories. Here he presents us with a beautiful canvas of cultural impressionism and profound poetic daubings. Certainly not boring. Certainly not pretentious. And if you find it slow, then you need to readjust your perception of what 'narrative' can do. Slow is a relative term. The inference from some commentators is that slow equals languid and thus dull. But this is anything but languid or dull. It is a beautiful rumination, a poem of pace and intrigue and voluptuous sensitivity. Sit back, relax and don't rush (where is everyone rushing too, anyway?). Be with the moment and enjoy the art of a magnificent filmmaker.",
         "That's not a regular film but rather an unique example of art film. It's more an impression of the director then a drama or romance or anything else. The way how Weerasethakul makes movies one can love or hate. The main character is a Burmese refugee, Min, who seems to be in love with a Thai young woman,Roong. While she's at work an older woman, Orn, takes care about Min. Once Min and Roong go for a picnic into the forest, where they meet Orn. The background of the movie is a nationwide crackdown on illegal Burmese immigrants in Thailand. Slow shots, beautiful landscapes, strange plot construction, mysterious details, and somehow erotic and unclear relationship with two women and young man creates a great but very specific kind of cinema.It's a beautiful impression of human relationships.",
         "Please do not feel sorry for anyone associated with trying to make something beautiful. A film does not need to have a beginning or an ending, or an elaborate story, it can simply contain moments in time, it can be a visual sensation, this art form, like all, needs not be strictly defined. If you found Blissfully Yours boring, fair game. But this magnificent film put a smile on my face for much of the second half, because I felt what it meant for me to feel, this film is 1000% feeling, so it's great for those who can feel. When we step into nature we can truly suspend time. \"Roong, what time is it?\", \"Wait, I'm still having fun.\"",
         "I always love reading IMDb comments as they really help find the right meaning of a film. Take user federovsky, who is being praised by User Cliff Solane, in the comment I read this 2009 right after watching the film. One reads: \"Nothing is revealed by the film, no deep or hidden meanings - possibly no meaning at all except to show a few odd people having a rather odd sort of afternoon in the forest. Happy for some, sad for others. Nothing to make us think, except try to figure out what was the point of it all.\" Well, very nice - except for there to find something to make us think, you have to believe first, that there is some point to it all. This film does not really give answers (besides what smth memorable or b l i s s actually is), it just opens questions. Shouldn't the question about the nature of reality and the nature of happiness be always the highest objective of a film? If you think not, forget this boring film.",
         "This film is banded in Thailand I haven't seen it yet . Almost people don't know this film even it got some awards nothing in Television news May be this 2003 may some chance in cinema but R version .This film got NC-17 because of naked scenes . It about Love story that some I don't understand I think all of you should see this film if you have a chance .",
         "This is a film-school level concept with film-school level execution. Some of the scenes are so long and static I half expected a screensaver would kick in. Some people in this website have been trying to make sense of some of the scenes in this film, but I think those conclusions are illusory or wishful thinking, as is much modern art criticism. The real fact is, the film is objectively very poor. Yes, this is certainly an art film, that is, it's meant to make us think about life rather than simply to entertain. The problem is, it is way too self-consciously an art film, the story is drearily paced (as if trying to be the most artsy film ever made by dint of its sheer slowness) and the execution is quite undistinguished (as if to say it is so artsy that it doesn't even have to try). Nothing is revealed by the film, no deep or hidden meanings - possibly no meaning at all except to show a few odd people having a rather odd sort of afternoon in the forest. Happy for some, sad for others. Nothing to make us think, except try to figure out what was the point of it all. OK it's art, but let's be straight about this: it's extremely poor art. All of the characters are unendearing, and as we must assume that the director is not trying to disengage us from the movie completely, it must only be because the most basic elements of film-making are being eschewed (this may be done consciously, but for the most part I fear not). The acting is wooden (witness - oh deary me - the factory manager, who may well be a real factory manager, but who has obviously never been in front of a camera in his life), the dialogue is mumbled, and almost every scene is amazingly dislikeable. There is a voice-over at times from the Burmese character that adds nothing but confusion as to who (or what), the film is about. I felt nothing at all for the characters, but very sorry at times for the actors. The whole thing finally grinds to a virtual standstill in horribly overlong scenes towards the end in which the characters emotions are summed up. The intention here seems to be to impress the images upon us by burning them physically onto our retinas, but basically, artlessness does not make good art, and these scenes just unimpress and leave us cold, as does the whole thing. I live in Thailand and watched this film with my Thai girlfriend and she can confirm that the movie did not provide any insights into the Thai character or Thai way of life. It is just a stick thrown into the air. This cannot be what the director intended. No offense to him for having a go, but we can all do just as well with a camcorder and a few friends. The real laughing stocks are the film festival organisers who, like the modern art collectors who pay a fortune for bits of trash, were duped into thinking that this, being a slow film from an exotic country, was absolutely just the thing for us to sit and ponder over at their film festival."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Anna Sanders Films",
         "Kick the Machine",
         "La-ong Dao"
      ],
      "summaries": ["The story of a love affair that begins during a picnic on the Thai-Burmese border."],
      "budget": 0
   },
   "movielensId": 72899,
   "movielens": {
      "languages": ["ภาษาไทย"],
      "releaseDate": "2002-10-08",
      "dvdReleaseDate": "2006-05-01",
      "directors": ["Apichatpong Weerasethakul"],
      "runtime": 126,
      "movieId": 72899,
      "title": "Blissfully Yours",
      "mpaa": null,
      "actors": [
         "Kanokporn Tongaram",
         "Min Oo",
         "Jenjira Pongpas",
         "Sa-gnad Chaiyapan",
         "Kanitpat Premkij",
         "Jaruwan Techasatiern",
         "Duangjai Hiransri",
         "Mee Maadman",
         "Suchada Sirithanawuddhi",
         "Wibool Boonrak"
      ],
      "imdbMovieId": "0317171",
      "originalTitle": "สุดเสน่หา",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["g_yxhGCUOd0"],
      "plotSummary": "The story of a love affair that begins during a picnic on the Thai-Burmese border.",
      "tmdbMovieId": 47046,
      "avgRating": 3.65789,
      "releaseYear": "2002",
      "numRatings": 19,
      "posterPath": "/wnIZmhLLaAIDRg3DQaX8TOBVIyn.jpg"
   }
}