{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "gay relationship",
            "id": 10198
         },
         {
            "name": "lgbt teen",
            "id": 163037
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt1305714",
      "video": false,
      "title": "Make the Yuletide Gay",
      "recommendations": [
         26630,
         26731,
         14681,
         27440,
         55177,
         23423,
         32633,
         14205,
         19375,
         85348,
         4369,
         105885,
         105789,
         12839,
         17021,
         64631,
         19369,
         113460,
         26823,
         1812
      ],
      "backdrop_path": "/8Wfv5QPvCGZot5T5VokohzHMguw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nathan Stanford",
               "gender": 2,
               "credit_id": "52fe44ebc3a368484e03e665",
               "name": "Adamo Ruggiero",
               "profile_path": "/hbC3bviuntgAYaZyciZJjTVEhfE.jpg",
               "id": 94604,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Olaf 'Gunn' Gunnunderson",
               "gender": 2,
               "credit_id": "52fe44ebc3a368484e03e669",
               "name": "Keith Jordan",
               "profile_path": null,
               "id": 94605,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Abby Mancuso",
               "gender": 1,
               "credit_id": "52fe44ebc3a368484e03e66d",
               "name": "Hallee Hirsh",
               "profile_path": "/6uwREt8OqKig4afvAFPuochl94P.jpg",
               "id": 43894,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anya Gunnunderson",
               "gender": 0,
               "credit_id": "52fe44ebc3a368484e03e671",
               "name": "Kelly Keaton",
               "profile_path": "/gObgzgDD59WvWdtwFbNxDPyPZxL.jpg",
               "id": 95691,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sven Gunnunderson",
               "gender": 1,
               "credit_id": "52fe44ebc3a368484e03e675",
               "name": "Derek Long",
               "profile_path": null,
               "id": 84563,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Heather Mancuso",
               "gender": 0,
               "credit_id": "58c9a45a9251410caf0007f6",
               "name": "Alison Arngrim",
               "profile_path": "/14YE9FH9YeZimvFf4662yPl35IS.jpg",
               "id": 1227127,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Peter Stanford",
               "gender": 2,
               "credit_id": "58c9a482c3a3685c7f0007e4",
               "name": "Ian Buchanan",
               "profile_path": "/aCUAEzY79h3hDTyqT7WwVTbqqxm.jpg",
               "id": 15865,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Martha Stanford",
               "gender": 1,
               "credit_id": "58c9a496c3a3685ca300077a",
               "name": "Gates McFadden",
               "profile_path": "/zPx8IwxNwgCZOhpGad5h0mrLV2q.jpg",
               "id": 2392,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Diego",
               "gender": 0,
               "credit_id": "58c9a4c89251410cb70007c1",
               "name": "Massimo Quagliano",
               "profile_path": null,
               "id": 1777156,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ebc3a368484e03e67b",
               "name": "Rob Williams",
               "profile_path": null,
               "id": 84568,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ebc3a368484e03e681",
               "name": "Rob Williams",
               "profile_path": null,
               "id": 84568,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.590171,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26032,
      "vote_count": 32,
      "budget": 0,
      "overview": "The holidays get overly festive as Olaf \"Gunn\" Gunnunderson, an out-and-proud gay college student, crawls back into the closet to survive the holidays with his parents. But when his boyfriend, Nathan, shows up at their doorstep unannounced, Gunn must put on a charade to keep the relationship a secret. With pressure mounting from all sides, will Gunn come out before the truth does?",
      "similar": [
         449176,
         26280,
         184352,
         26933,
         383526,
         338189,
         26371,
         376867,
         17483,
         258480,
         428493,
         413666,
         340684,
         380874,
         51052,
         10938,
         222918,
         377154,
         9479,
         11000
      ],
      "original_title": "Make the Yuletide Gay",
      "runtime": 89,
      "poster_path": "/qk4xagnFAuGQPQpKJ9gr1pC7uH1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TLA Releasing",
            "id": 328,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Great House Films",
            "id": 4453,
            "origin_country": ""
         }
      ],
      "release_date": "2009-11-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rob Williams"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Rob Williams"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1305714/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzc5MTM5Mjc0Nl5BMl5BanBnXkFtZTcwNzI0MTcxMw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Keith Jordan, Wyatt Fenner, Steve Callahan | See full cast and crew »"],
      "reviews": [
         "Make the Yuletide Gay is not a great piece of art. This is not a film that will open on a ton of screens worldwide and earn millions of box office dollars. This is a small budget gay themed holiday film. If you go into it expecting anything more than a bunch of corny jokes and a formulaic plot, you'll be disappointed. College student Gustav \"Gun\" Gunderson (Keith Jordan) is out and proud at school but is secretly not out to his eccentric Midwestern parents (Derek Long and Kelly Keaton). During the Christmas holidays he struggles to find the right time to finally tell his parents the truth. When his boyfriend Nathan's holiday plans fall through, Nathan (Adamo Ruggiero) surprises Gustav by showing up on the Gunderson home to spend the holidays. Comedy ensues. This film explores familiar territory but it's a fun ride. Some of the jokes you see coming, but generally the script is quite clever. There are a few awkward transitions and the editing could have been a lot tighter. The camera particularly overplays Keaton as mom Anya Gunderson, lingering on her a few moments too long after each punch line. Often removing a few beats here and there would have made a lot of difference. Keith Jordan does a fantastic job. Despite the fact this is a comedy and everything will probably turn out for the best, Jordan manages to make the \"what if\" fears seem real. Degrassi-The Next Generation's Adamo Ruggiero seemed oddly uncomfortable in front of the camera during the early scenes. Initially I had trouble believing he and costar Jordan were in a long-term relationship. Ruggiero's acting steadily improves as the film progresses and eventually delivers a good performance, but he was obviously chosen to draw in an audience. Make the Yuletide Gay is fun and light-hearted with a few good laughs. It won't become a mandatory Holiday viewing, but it is perfect for what it is. In other words, you get what you pay for.",
         "Make the Yuletide Gay is a movie about Olaf, a proud gay-on-the-campus, who is afraid to come out to his eccentric family due to hearing many stories about good family relationships failing after a member came out of the closet. However, it appears that this Christmas, when his boyfriend Nathan joins Olaf's family festivity and his parents want desperately to pair him up with the pretty neighbour Abby, the truth will have to be told. I did not have high expectations for this movie, as the production appears fairly low and, at first sight, the acting seems b-class. I could not be more wrong, and once again it shows how so often great works are overlooked just because they are not made on high budget or weren't promoted or stars do not play in them. The script is cool, everyone of the main cast is really strong - actors have great chemistry among each other as well as with their own character - and you can feel their enjoyment of acting in this movie through the screen. The jokes are funny and I haven't laughed like this at a movie for a long time. Definitely worth seeing and more than once!",
         "Being gay, I'm subjected to a lot of bad gay movies. It's solidarity; we know they're bad, but we watch them anyway, out of loyalty more than anything else. This is why I'm glad to report that Make the Yuletide Gay is, well, not bad. It's not great, but when I was going in expecting another cringe-worthy gay romantic \"comedy\", I got a pretty decent... gay romantic comedy. The writer needs a few lessons in subtlety, given the vast number of over-the-top stereotypes and often wince-inducing double entendre in the film, but the actors take the material and make it work pretty well. As a long-time fan of Degrassi: The Next Generation, I primarily was interested in Adamo Ruggiero's movie debut, and he acquits himself nicely. His character starts off as vain and somewhat obnoxious but becomes sympathetic as the film progresses, and when Ruggiero smiles that beautiful smile of his, I can't help but love him all the more. It's a fun little film, and if you can get past some of the writing, it's worth a watch.",
         "This falls right into line with every cheesy, over the top, Christmas romance I have ever seen- and I loved it. It was lighthearted and fun and I giggled snorted through most of it. Gunn is absolutely adorkable, and Nathan is just SO snarktastic. All kidding aside, there is a tremendous amount of love and affection in this movie, between the boys obviously, but also those around them. The cast of supporting players was interesting as well, lots of familiar faces. This wasn't made to be any sort of serious social commentary, folks, it's holiday fluff and if you take it as such you'll giggle too, and enjoy it.",
         "Gunn has a holiday surprise for his folks and boy is it a big one!! A sweet and goofy film that has a fine message of acceptance but doesn't hit the viewer over the head with it. The male leads are endearing and attractive but this is stolen by Kelly Keaton as the mom who gets a natural high from the joy of Christmas and life in general. She and Derek Long have fun as the long married couple who accept each other as they are, she a motor mouthed dervish and he a semi clueless stoner. Hallee Hirsh is sprightly as the girl next door who is wilder than she appears and hey look its Nellie Olsen as her Mom! Speaking of Alison Arngrim she is having a ball as the randy next door neighbor who engages in veiled verbal jousting with Gunn's mom to the audience's delight.",
         "I knew upon viewing the film's trailer it would be a worthwhile watch. Fortunately, the film stayed true to my expectations and even exceeded them. It's a straightforward story in some respects as a young gay couple struggles to come to terms with one partner not yet out to family. But that aside, it's a story well told and with plenty of humor along the way. The lead characters are strong and well-rounded and the script flows nicely too. Gunn's mother is a scene stealer on many occasions. Her wicked laugh and affection makes for plenty of interesting scenes. Make the Yuletide Gay is not pretending to be some deep exploration of any particular issue, but instead a funny examination of the struggles some couples must face when coming out to family. It's humorous yet delicate and touching when needed. The jokes are mostly sharp and effective. A few of the gay jokes feel a little forced at times, almost obligatory, but this is picking for holes and easily forgiven. This film is a celebration. A celebration of Christmas and being with family while a celebration of love and being true to yourself. The film is frothy and fluffy but that is what gives it charm and makes for a fun journey.",
         "Due to my own not-so-good experiences with my coming-out (thanks, mum and dad!!), I'm a real sucker for feel-good coming-out movies - they never fail to bring me to some heartfelt tears of shared happiness. So with these kind of movies I'm not that critical as to whether the script, the direction or the acting is really above par. That's a good thing with this movie, for it's rather balancing on the verge. Although I enjoyed it and it served it's purpose, there are many flaws. For starters: there seem to have been made some strange and awkward choices in the editing. At many, many points the movie comes to a stand-still, when the camera lingers far too long on the face of a person after he or she has said or done something. When you want to stress some Deap Meaning this can be quite functional, but in a comedy, or at least at moments when comedy is intended, it's killing: it not only effects the pace but it sucks the punch out-off every punch-line! This brings me to my next reservation: there are way too many double entendres in the script, it dangerously tilts the movie to the point of below-the-belt cheapness. Sure, I laughed at some of them (even at the beaver-joke), but it annoyed me too, this movie didn't need all that, since it's a situational comedy the fun should come out of the situation itself and the opposite characters. Another reservation concerns the side-characters (and thus again the script). When you have so few characters in the story (in fact there are only four important ones, apart from the girl next door), and two of them (both parents) are personified and pictured in such an extreme and surreal way, then in my opinion it becomes totally top-heavy and negatively affects the balance of the story. One lunatic parent, with maybe one or two lunatic neighbors would had been quite enough. A last negative remark to the script: although it's a comedy, there ought to be maintained - especially in this kind of situational comedy - some sort of basic feeling of reality. Here this was put to the test way too often. Can a renowned professor walk around for a whole professional career being perpetually stoned out of his wits? Are these parents (obviously from the 60's love-generation) blind as bats, not to see that their son's room-mate Nathan is gayer than gay?! Is the switch of the neighbor-girl from love-sick goody two-shoes to an almost professional foul-mouthing fag-hag not a tiny bit too abrupt and weird?? And is the almost utopian coolness of both parents at the eventual outing of their son not a tiny bit out-of sync with the beforehand constant hammering of at least mama with her son on the theme of girls, marriage, family etc.? Wouldn't such cool and unorthodox parents (who make out with each other almost publicly, have such loud sex that their son has to put a pillow over his head, and with a father who walks around the house with his morning-gown hanging open and in that state even opens the front door when a stranger calls) - wouldn't such cool and care-free parents have already brought up the topic of sex with their only son a long time ago?? Well, anyway, now for the good things. This is without any doubt a very sympathetic, warm and sincere movie. There is, thank god, not so much a Big Message that has to be drilled-in, it just keeps close to the real-life fears of a gay adolescent when being on the brink of revealing his true self to his family: will they accept me in this new light? will I disappoint them? will things change between us? The script doesn't provide a big plot - like in so many other comparable coming-of-age movies - with complicated misunderstandings, plot-shifts and all kinds of side-stories; no, it just sort of strolls along on it's basic theme and in this way gets a nice and quiet development. The comedy-elements are, as said, not of the most subtle kind, but in spite of the serious theme the lighthearted tone of the movie succeeds in making you smile all the time, and that is not a bad thing. The characters of the parents are unrealistic and over-the-top, so it must have been hard for the actors to make something out of it, but I have to give credit to Kelly Keaton who gives, within the limits and pitfalls of the script, a very good, enthusiastic and affectionate performance. The main characters are of course Olav and Nathan, both are given a fine and convincing portrayal by Keith Jordan resp. Adamo Ruggiero. I didn't know Ruggiero, I never saw \"Degrassi\", he's certainly beautiful and very cute and I thought that he grew in his role; he was supposed to be the gayish extrovert of the two boyfriends, but he proved that within that stereotype he could actually find his own nuances - for instance when father Gunnunderson finds him all alone on a sidewalk terrace, Ruggiero really succeeds in moving you. But I especially liked Keith Jordan, he had this subdued, under-cooled (as we say in Holland) way of acting that only enhanced the feeling of reality, and he is so cute and endearing in his seriousness, that it made me want to put his head on my shoulder and tell him that eventually everything would be okay! All in all the good things far outweighed the bad, and I vote it a heartfelt 8 out of 10!",
         "I've been a fan of Adamo Ruggiero since his earliest Degrassi days and I really wanted to like this film. Unfortunately it was so poorly made that I can never recommend it to any of my friends. The film just couldn't seem to get out of it's own way. The parents and the neighbors were more caricatures than characters. In fact they would have had to have been toned down considerably to have been reasonable caricatures. The dialogue was good in spots but then seemed to immediately slip off the rails. The dialogue jokes were forced at best and often groan-worthy. If half of them had been removed, the story might have been able to carry them but as it was they were just too much. Just as there always seemed too be one syllable too much in the name Gununderson, the lines always seemed to go a bit too far. Actually, the main characters Olaf and Nathan were OK and both actors were adorable and able to make me care about their characters. However, the mother's character was just too far over the top and the father was beyond \"beyond.\" (I've seen Derek Long in one of this director's earlier works and he was MUCH better in that) I'm not saying that the actors didn't do a great job with what they were given but this film could have really used at least one more script revision before it was shot. I've often railed about the lack of perspective that occurs when the writer is also the director and this film is just another example of that problem. Just one example should suffice but this does contain a spoiler so be forewarned: When Nathan returns to the Gununderson's house after claiming that he's going to fly home. The audience is concerned with what Olaf will think and do. Will he welcome Nathan back? Will he finally be honest with his parents? Instead we're given a meaningless joke about headless gingerbread men. The joke was entirely unnecessary, and then it isn't even executed correctly as Nathan lifts a normal gingerbread man from a plate that has just been shown to contain only headless ones. Overall I really wanted to like this movie and it wasn't as painful as a few gay films that I've been unable to sit through but it was clearly pushing that limit.",
         "I enjoyed this movie. . . I was not perfect, but it was fun. . . It didn't preach hard about coming out. . . It seemed that the problems were that there was no communication from any of them. . . It had touches from old screw ball movies of the 1940's. . . Misunderstandings. . . Confused identities . . Anya the mother could have played off of the Three Stooges or the Marx Brothers. . . I would love to see these characters in another movie. . . Perhaps, the lives of the two young lovers as a couple.",
         "Make The Yuletide Gay is a wonderful film that I would recommend to far more than LGBTQ audiences. It is to be fondly hoped that more and more gay youth experience what the leads Keith Jordan and Adam Ruggiero at Christmas time. Jordan plays an out and proud college student and Ruggiero is his boyfriend. Except for one thing, neither has come out to parents. Their concerns are quite real. In my own life I've met too many gay people who were disowned by families and had some terrible life experiences stemming from that. Jordan is heading home to his Wisconsin family and Ruggiero was going to go home, but his parents Ian Buchanan and Gates McFadden are busy in their social world and have just won a cruise for two. So left on his own devices Ruggiero comes to Jordan's and the two have to figure out where their relationship is going. Jordan's parents are an interesting pair. Derek Long was a Grateful Dead fanatic in his youth, now he seems like someone who's just retreated from life. Kelly Keaton is in her own world and appears totally clueless about all around her. Without going into too much detail let's say it's Merry Christmas to all. For a gay themed movie this thing is practically G-rated. Sad to say that the sight of two attractive young men showing passionate care for each other is still likely to earn a restricted rating. Really there's nothing here,even the youngest audiences could see it and not be 'damaged' for life. But just the subject of same gender sex is enough to get the Puritan in some going. I would recommend this as a model film for PFLAG to show how some parents really do care for their children first no matter what their sexual orientation may be."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Guest House Films"],
      "summaries": ["Olaf \"Gunn\" Gunnunderson, an out-and-proud gay college student, crawls back into the closet to survive the holidays with his family. He keeps his cool as his quirky Midwestern-hearted parents try to set him up with his high school sweetheart, Abby. But when his boyfriend, Nathan, shows up at their doorstep unannounced, Gunn must put on a charade to keep the relationship a secret. With pressure mounting from all sides, will Gunn come out before the truth does?"],
      "budget": 0
   },
   "movielensId": 72947,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-11-01",
      "dvdReleaseDate": "2009-11-10",
      "directors": ["Rob Williams"],
      "runtime": 89,
      "movieId": 72947,
      "title": "Make the Yuletide Gay",
      "mpaa": "",
      "actors": [
         "Adamo Ruggiero",
         "Keith Jordan",
         "Hallee Hirsh",
         "Kelly Keaton",
         "Derek Long",
         "Alison Arngrim",
         "Ian Buchanan",
         "Gates McFadden",
         "Massimo Quagliano"
      ],
      "imdbMovieId": "1305714",
      "originalTitle": "Make the Yuletide Gay",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The holidays get overly festive as Olaf \"Gunn\" Gunnunderson, an out-and-proud gay college student, crawls back into the closet to survive the holidays with his parents. But when his boyfriend, Nathan, shows up at their doorstep unannounced, Gunn must put on a charade to keep the relationship a secret. With pressure mounting from all sides, will Gunn come out before the truth does?",
      "tmdbMovieId": 26032,
      "avgRating": 3.59756,
      "releaseYear": "2009",
      "numRatings": 41,
      "posterPath": "/qk4xagnFAuGQPQpKJ9gr1pC7uH1.jpg"
   }
}