{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0016004",
      "video": false,
      "title": "Lady Windermere's Fan",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lord Darlington",
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e150633",
               "name": "Ronald Colman",
               "profile_path": "/eYzmXamTV6CpqwxZqTEJSBRNlb0.jpg",
               "id": 29522,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lady Windermere",
               "gender": 1,
               "credit_id": "52fe4a63c3a368484e150637",
               "name": "May McAvoy",
               "profile_path": "/fTLFRSJF5lAEDWyriVojVjg8AmC.jpg",
               "id": 14287,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lord Windermere",
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e15063b",
               "name": "Bert Lytell",
               "profile_path": "/v8ck9jy8NG5lJOEcGK4zDMuVf7h.jpg",
               "id": 183281,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mrs. Erlynne",
               "gender": 1,
               "credit_id": "52fe4a63c3a368484e15063f",
               "name": "Irene Rich",
               "profile_path": "/cD7RvrTsqG0cApA08efTIpJA74C.jpg",
               "id": 14871,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Lord Augustus Lorton",
               "gender": 2,
               "credit_id": "543161cc0e0a265694001f31",
               "name": "Edward Martindel",
               "profile_path": "/puF23jgXqefQgp7sxWzxzb45Yu2.jpg",
               "id": 1189949,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "The Duchess of Berwick",
               "gender": 0,
               "credit_id": "543161ea0e0a2656e2001e9f",
               "name": "Carrie Daumery",
               "profile_path": null,
               "id": 1329662,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e15062f",
               "name": "Ernst Lubitsch",
               "profile_path": "/fJeGenaTarQTLl21eDlnx4MIM9K.jpg",
               "id": 2428,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a63c3a368484e150645",
               "name": "Julien Josephson",
               "profile_path": null,
               "id": 97986,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "5431609f0e0a264649003612",
               "name": "Darryl F. Zanuck",
               "profile_path": "/pfl8oR2otTYihADFtjLkrtKoFrM.jpg",
               "id": 8502,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "543160cc0e0a26464300353c",
               "name": "Ernst Lubitsch",
               "profile_path": "/fJeGenaTarQTLl21eDlnx4MIM9K.jpg",
               "id": 2428,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54316106c3a36811ef001e6c",
               "name": "Harold Grieve",
               "profile_path": null,
               "id": 1351810,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5431611ec3a36811ef001e6f",
               "name": "Sophie Wachner",
               "profile_path": null,
               "id": 960153,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54316132c3a36831ac0034ea",
               "name": "George Hippard",
               "profile_path": null,
               "id": 1371315,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "543161490e0a265872001e00",
               "name": "Ernst Laemmle",
               "profile_path": null,
               "id": 1167523,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5431635d0e0a2658b2001e82",
               "name": "Oscar Wilde",
               "profile_path": "/5e4dEOQM7o4niRageovpPosslxn.jpg",
               "id": 56712,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "55140d2d9251412c5200119e",
               "name": "Charles Van Enger",
               "profile_path": null,
               "id": 14478,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.171963,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 121379,
      "vote_count": 3,
      "budget": 320000,
      "overview": "Mrs Erlynne, the mother of Lady Windermere - her daughter does not know about her - wants to be introduced in society, so that she can marry Lord Augustus Lorton. Lord Windermere, who helped her with a cheque, invites her to his wifes birthday-party, but Lady Windermere thinks, she has reason to be jealous, so she decides to leave her husband and go to Lord Darlington, who is pining for her. Mrs Erlynne finds this out and tries to prevent her of this mistake, but her daughter leaves her fan in Lord Darlingtons residence.",
      "similar": [],
      "original_title": "Lady Windermere's Fan",
      "runtime": 120,
      "poster_path": "/ob7DnShvrpaj0THZMbXVK9y1mO7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1925-12-26",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Ernst Lubitsch"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Oscar Wilde",
         "Julien Josephson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016004/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxNjQwOTUxNF5BMl5BanBnXkFtZTgwOTIwNzY2MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Irene Rich, May McAvoy, Bert Lytell | See full cast and crew »"],
      "reviews": [
         "When a stage play is turned into a movie the results can be dire, especially when the play is a dialog-driven comedy of manners, full of quips and epigrams. Unless it's handled carefully even a great play might come off as 'canned' and lifeless on screen, amounting to little more than what Alfred Hitchcock dismissed as \"photographs of people talking.\" A few exceptions come to mind: The Philadelphia Story, the two versions of Holiday made in the '30s, the Rex Harrison/Margaret Rutherford Blithe Spirit, and a handful of other stage-to-screen adaptations that manage to be lively and entertaining despite heavy reliance on dialog. But these films are surpassed in achievement, in one sense at least, by an adaptation from 1925 which perfectly captures the spirit of the play it presents while scarcely quoting it! Before seeing Ernst Lubitsch's silent version of Lady Windermere's Fan at the Museum of Modern Art this summer I re-read Oscar Wilde's play, which I enjoyed, but I didn't have high hopes for the movie, despite the involvement of a director I count among my favorites. I imagined the movie would consist of actors standing around in tuxes and evening gowns pretending to mouth witty sayings, which would then be presented to us in numerous title cards; but because I admire Lubitsch's sound films a great deal I thought I'd give it a try. Plus, I thought it'd be interesting to see Ronald Colman in a silent film, deprived of that wonderful voice. What a pleasant surprise to find that this is one of the best sophisticated comedies of the silent screen. The flavor of Wilde's play is distilled to its essence, and clearly conveyed without relying on a single one of his famous epigrams. (Interestingly, a recent biography of Lubitsch says that the film quotes only two or three lines from the play, but if so I didn't catch them.) How is this possible? Lubitsch conveys Wilde's notions about high society swells and their prejudices cinematically, not verbally. When the notorious Mrs. Erlynne (Irene Rich) appears at the Ascot race track, the reaction of \"society\" is quickly made clear to us by the scandalized facial expressions of the ladies present; who, nonetheless, can't stop looking at her or talking about her. The tone of their remarks is obvious from their sour expressions. Naturally, the men are interested in Mrs. Erlynne, too. She is shown, montage fashion, from many different angles, through lorgnettes and binoculars, long-shot, extreme long-shot and close-up, and while the horse race is reduced to mere background. It's a funny and informative sequence, yet it isn't in Wilde's play at all. In another scene that more closely follows the text, Lord Darlington (Colman) calls on Lord and Lady Windermere at their home. He is formally announced, and pretends briefly that he actually came to see Lord Windermere on some minor matter. But when Windermere conveniently leaves on business, Darlington, shown in a stately long-shot, strides away from Lady Windermere (May McAvoy), sits, shoots her a sly look, and announces that he is in love with her. Shocked, she crosses and drops into a chair next to him. He rises, crosses away from her, and drops into a different chair. They both look miserable. Fade-out. It's a beautifully staged scene, and no additional dialog is necessary. Another sequence that occurs late in the film perfectly epitomizes the famous Lubitsch Touch while deftly conveying the spirit of Wilde's play: a title card announces that \"The relations between a man and a woman can be told by the way he presses her doorbell.\" Various ways in which this is so are then demonstrated. You wouldn't think that a close-up shot of a doorbell and a gentleman's gloved hand could be so suggestive, but Lubitsch manages to suggest a great deal. The black & white cinematography of Lady Windermere's Fan positively shimmers; happily, this is one silent film that has been well preserved. The acting is quite restrained by the standards of the day, and even without his voice Ronald Colman has the presence of a star, while Irene Rich gives the performance of her career. It's a wonderful adaptation of a great play that can stand on its own as cinema; and it may come as a surprise to those who believe silent film comedy begins and ends with Ben Turpin and the Keystone Cops.",
         "At first it might not seem as if the combination of Ernst Lubitsch and Oscar Wilde would work very well, but this silent-screen adaptation of Wilde's \"Lady Windermere's Fan\" is both enjoyable and well-crafted. Instead of clashing, Lubitsch's stylish, mischievous approach and Wilde's perceptive cynicism complement each other. The characters and the story are Wilde's, the acting and the style are Lubitsch's. Although the material is heavily re-worked from the original play, Lubitsch's decisions all seem to work pretty well. Wilde's witty and resourceful dialogue is gone, but his insightful portrayals of human nature remain. Lubitsch also makes good use of the camera to bring off some shots that could not have worked on the stage. In particular, at times he makes the fateful fan seem almost a full-fledged part of the cast. This movie version features solid performances by May McAvoy and Bert Lytell as the Windermeres, with a youngish-looking Ronald Colman suitably ingratiating as Lord Darlington. But Irene Rich has the most interesting character, and as Mrs. Erlynne she also gives a fine performance that particularly stands out in her scenes with the other characters. She and Lubitsch both capture the nature of her unpopular but admirable character, while carefully setting up the contrasts and conflicts between her and the other characters, who are in general more socially acceptable but far less worthy. This also works well simply as an entertaining, often very amusing, and sometimes dramatically compelling story. For most silent film fans, it would definitely be worth tracking down and watching.",
         "If you haven't seen the 1985 TV version, which is very accurate to the original play, I recommend you do, as otherwise some of the character histories and motivations won't come through in this 1925 film. This 1925 version delves more deeply into the complexities of the characters than does Wilde's original: 1. From the first scene of the 1925 film, it is clear Lady Windermere feels a powerful sexual attraction for Darlington, which she is trying to resist, to be faithful to her husband. Thus she is much more vulnerable, and likable, from the very beginning in this film than she is in the play, and thus viewers care more about her. 2. Mrs. Erlynne, Lady Windermere's mother, is more complex and conflicted in this 1925 film -- she is, after all, a woman who threatens her daughter's husband that she will ruin her own daughter's life unless he pays her a large sum. To make such a woman sympathetic is very tough, but the director here and the actress pull it off, by showing how snowed-under she is with bills and debts. The original play omits all this and leaves open the possibility that Mrs. Erlynne is coldly threatening her daughter's future for nothing more than greed and pride. 3. Lady Windermere was raised believing her mother honorable, but died young. In fact, her mother (now going under the name Mrs. Erlynne) left husband and baby girl for a lover, dishonoring herself; then that lover dumped her. A key question, regarding Lord Windermere's character, is whether he knew before he met Mrs. Erlynne that the story about his wife's mother was a cover-story -- whether he knew, at the time he met and married his wife the future Lady Windermere, that her mother had this dishonorable past. In the original play, this is not answered, but in this 1925 film, a title card makes clear that Lord Windermere knew long before he met Mrs. Erlynne that his wife's mother, whoever she was, was dishonorable. The only thing Mrs. Erlynne must prove to Lord Windermere is that she is, in fact, that mother. This factor makes Lord Windermere a more admirable character than the character in the original play, because it is clear that he did not let his wife's mother's disreputable reputation stop him from loving, respecting and marrying his future wife. In this 1925 film Lord Windermere is also shown as very understanding of human frailty, in that he shakes hands with Mrs. Erlynne on several occasions even after she puts the bite on him. 4. This 1925 version deals with two major plot problems in the original that involve servants. The key to Lady Windermere preserving her husband's love for her, and her reputation, is that her husband never learns that she (a) left her house and (b) went to Lord Darlington's rooms. Mrs. Erlynne seeks to preserve Lord Windermere's belief that Lady Windermere was always in her home by getting Lady Windermere out of those rooms and back home before Darlington and the other men find her in his rooms. But in that era, Darlington would have had a valet or butler to answer his door, and when Lady Windermere arrived, that man would know, of course, since she could not enter unless he let her in. Thus merely getting her out wouldn't preserve secrecy; the servant must also be convinced to keep silent, or at least, to be discrete, not to blurt out in anyone's hearing that Lady Windermere had been there. Similarly, in the Windermere house, servants would know that she left the house and did not return until hours later. Indeed, in the play a servant says she left the house, and later, another servant says she knew when Lord Windermere returned (5 AM) which means the servants would also know when Lady Windermere returned (after 2 AM). Thus Lady Windermere's secret would be exposed to her husband, because Darlington's servant might blurt out her presence, and Lord Windermere's own servants would tell him his wife had left and later returned. The 1925 film solves the Windermere \"servant problem\" by having Lady Windermere sneak out without any servant knowing, and having Mrs. Erlynne see this, so no servant need know that the mistress of the house had left. Presumably Lady Windermere could also find a way to sneak back in unseen by any servant, when she returned. As to the Darlington \"servant problem\", the original play opens the relevant scene with Lady Windermere already in Darlington's rooms, in an attempt to finesse the issue; but to any audience member who realizes there must have been a servant to open Darlington's door, this fails, and leaves a hole in the story. The 1925 film at least signals it knows of the problem, and assumes that some members of the audience will realize that there must have been a servant, because it shows that Darlington's door is opened by a servant. But the servant is never shown. In effect, the 1925 film acknowledges that there must have been a servant, but tries to get the audience to overlook it, and to overlook the problem. It would have been better if the film inserted a brief scene in which Mrs. Erlynne, having arrived at Darlington's rooms, called in the servant and told him not to tell his master, Lord Darlington, that either of them had visited, except in total privacy where none of the other men who might be with Darlington would overhear. Of course, eventually Darlington would have to learn from his servant of Lady Windermere's visit, but since Darlington has already announced that he's leaving England forever, and since it would be unthinkable of him to expose Lady Windermere, the audience will understand that her secret is safe with him. Postscript June 2009: my DVD version runs 2 hours 13 minutes, much longer than the 89 minute version now on DVD by the Am. Film Inst.",
         "'Lady Windermere's Fan' is one of the great plays of Oscar Wilde, so it is curious to see it here as a big budget silent film from Warners Brothers. Starring May McAvoy and Bert Lytell as the Windermeres, with Irene Rich as Mrs Erlynne and a young Ronald Colman as Lord Darlington, this film is directed by Ernst Lubitsch, known mainly now for his stylish musicals and dramas from the sound era. Despite the obvious drawback of not using any of Wilde's text, either spoken or as title cards, this adaptation does succeed in putting across most of the play's plot, just making a little tweak here and there to move the plot along or to bring matters to a satisfactory conclusion. Sets and costumes are of the jazz age and are beautiful, and McAvoy is a winsome Lady Windermere, all indignant eyes and little rosebud mouth. The film however belongs to Irene Rich who portrays Mrs Erlynne as desperate, calculating, and everything in-between. She was a superb technician without overacting, and it's a pleasure to watch her. Ronald Colman as well shows signs of the star quality to come. This 'Lady Windermere' is well worth watching.",
         "Nobody was as savvy about the intricacies of the human heart as Lubitsch, and of how virtue is never an absolute. This warmly empathetic, highly sophisticated gem is an adaptation of Oscar Wilde, with virtually none of the play's dialog utilized, but as suggestive and outrageous as Wilde himself, conceived, framed and edited as pure cinema. From the exact same period as Cecil B. DeMille's infinitely more crass sex comedies and Charles Chaplin's equally brilliant and morally ambiguous 'The Woman of Paris', but carried by an indistinguishably European sensibility. Irene Rich as the woman who sacrifices herself in secret is impossibly glamorous and subtle, May McAvoy is truly heartbreaking as the socialite suspicious of her husband's philandering, but Ronald Colman, alas, is left with nothing much to do except smolder sexily at the fringes with those impertinently raised eyebrows. A highlight is the Ascot game, a marvel of choreography and mime, a delicious baiting of upper class hypocrisy.",
         "I agree with the other reviewers that Lubitsch did a great job reworking parts of Wilde's play to make it suitable for silent film, and adding some of his signature touches. But I don't think the movie stands up to some of his later pieces, such as \"Trouble in Paradise\" and \"Design for Living\" (also reworked from a famous play, to good advantage). \"Lady Windermere's Fan\" is much more slow-paced, which can make it hard for a modern viewer, and not all of the characters are as interesting. However, the performances are good, especially the marvelous Irene Rich (whose high-fashion costumes are endlessly entertaining), the production values are high, and if you have the patience, you will be rewarded with some nice little bits of Lubitsch's social observation. It's interesting to consider how drastically attitudes toward male-female relations have changed over the decades: the film's plot depends on beliefs that have mostly, and rightfully, vanished. In contrast to convention, Lubitsch obviously enjoyed helping Rich create an older woman who was fascinating and sexually powerful.",
         "\"Lady Windermere's Fan\" is an enjoyable old silent film, though it's far from perfect. First, the film seems as if it's missing some intertitle cards and as we watched the film, I had to explain some of the plot to my daughter. As a fan of silents, I understood a lot of what was implied in the plot--and you might just find it a tiny bit hard to follow. Second, the film is based on a single plot idea that COULD have been worked through very easily had the husband just talked to his wife early in the movie--and it's hard to base an entire film on this. But, on the other hand, the story is quite enjoyable and it had some nice twists here and there that kept my interest throughout. The film begins with a loving husband receiving a cryptic note. He goes to the appointed place and is surprised to see his wife's mother--a woman who was supposed to have died many years earlier and who had a sordid reputation. She wants him to pay her not to reveal herself to the wife--in other words she's blackmailing him. This really didn't make a lot of sense, though, as her later character was nothing like this...hmm,...perhaps I should have also listed this as a problem with the film in my first paragraph! When the husband is seen visiting his mother-in-law by some other society folks, they begin to spread rumors--not realizing or caring to know his intent. And, an evil opportunist jerk (played by Ronald Colman) decides to exploit this to try to break up the happy marriage. How will all this turn out, see the film for yourself--as there is a lot more to the film's interesting plot. If you love silents, you'll no doubt love this film. If not, well, see it anyway--as it's still a pretty good film!",
         "The Mexican novelist Pitol once remarked the challenge and paradox of making a silent movie after a Wilde play, transferring an action-less witty stage play, all speech and no action, no outer movement, all verbal dynamism and witty virtuosity, into a masterpiece of images and montage, visual syntax; that's pretty challenging, and it took an quite early auteur, liked by the Hispanic buffs (Pitol and Borges both register as Lubitsch buffs), to be delicious, using a Wildean partition and idea, in a way Wilde himself never was�no spoken words, all play. I do not know the play, but the movie is common�sensed, with a sense of rational bonhomie that I liked and approved of, the way Mrs. E. was about to leave the party, then suddenly gets lucky and wins the evening, charms everybody at the Lady's birthday reception, etc.�those scenes are, how should I say, humane�also those in the labyrinthine, dreamlike garden�they are also the ones in which Margaret looks best�as a matter of fact, I believe that Colman and Irene Rich seem the most conspicuous because of their parts, not the other way around, which is a way of saying that the other actors are also as good. The plot is quite dry, quite austere, no fanciness or lyricism, mere social play, rather bleak at core, one might say, quite illusion-less�but, as I said, also common�sensed and earthy. There's enough of Wilde in this old silent comedy. The very template of his comedies�and of his writings, generally�is peculiar, intriguing and instructive. You can sense this in 'Windermere'. Lubitsch sensed this display, I wished there was a better word, less reprobating, but what can you do about a melodramatic comedy, what choice of words do you really have�so, on with what I termed the display�I was about to say, showcasing�of compassion. Because this template, for a comedy, is peculiar, unusual. It's not heartless, on the contrary, it's presumably heartfelt, basically melodramatic, anyway the template dictates this, melodramatic with touching moments. Thus, it can serve to illustrate both the bleakness and 19th century sadness�and the Russian tendency of Wilde, his interest in�and maybe feeling of�compassion, etc.. Lubitsch at his most charming and lively, a lot of frames of unusual beauty; the version I saw ran for 86 minutes. Being without score, it felt a bit awkward. When I was a bit younger, I used to pick a score for these movies, but it was quite at random, and sometimes it's better silently. It has been claimed that Lubitsch translated ideally Wilde's dialogs into a silent format; I disagree. On the contrary, the movie is cleaved between the pointlessness and almost flatness of the attempted transferal, and the usual brio of Lubitsch's own accuracy. As a Wilde equivalent, it only spells the failure of attempts at a too literal rendering�because a genuine translation would mean a minimum of Wildean stuff or content, but the charm of the wit. Lubitsch might of found an equivalent for something Wildean�but not here, where he's almost enslaved by literalism, by a literal rending of the play's plot�and, in silence, that plot means melodrama, with the extra sentimentalism and delusions of Russian grandeur, peculiar to Wilde. That's why I call it a not very good movie. In Wilde's hands, the plot has been redeemed by the dialogs; in Lubitsch's, too much of the ooze of cheap sentimentalism remained, with little of the intended wit and charm. It follows Wilde too much into the irrelevance and cheapness of an essentially disappointing plot. A good amount of craft exists, though. I enjoyed some ideas�the maze, etc.�and the actors, and Colman is awesome, his funny walk notwithstanding. Anyway, the tag�line would be: not the best of Lubitsch, but likable. The melodrama feels of creepy because you sense Wilde really invested in it, he strove to make it seem deep, he cared about it, and that's creepy, almost morbid �.",
         "One day Lady Windermere's husband receives a strange note. He is called to a secret location, where he meets a woman called Mrs Erlynne who turns out to be the mother of his wife. She is a woman who is thought to be dead but who had a sordid past (she left her husband and daughter for a lover). She blackmails the man, saying she will reveal herself otherwise. Some of his society peers see him with this woman and start malicious gossip. While at the same time a mutual friend called Lord Darlington tries to use these rumours to steal Lady Windermere for himself. The mother and daughter duly meet and by the end Mrs Erlynne has saved her daughter from falling into the arms of the nefarious Darlington and, hence, saving her from the same fate as herself. This is a stage play that was adapted to film. It was written by the famous wit and word-smith Oscar Wilde. This presents a fairly obvious drawback, as seeing that it is a silent movie it cannot use any of Wilde's dialogue. Having no familiarity with the play I can't say how this effects things but I would imagine quite a bit. Its values are somewhat out-dated too. The way that Mrs Erlynne is a social pariah because she became another man's mistress seems odd now. But I suppose it's interesting in the way it reflects the attitudes of a different era.",
         "In \"Lady Windermere's Fan\" the great Ernst Lubitsch may have bitten off a bit more than he can chew. First and foremost, how can you reproduce Oscar Wilde's witty dialogue in a SILENT FILM?? True, the famous 'Lubitsch touch' is apparent, but minus Wilde it becomes a romantic drama. The players are excellent and above reproach, in particular Irene Rich as Mrs. Erlynne - in fact, it is basically her picture. A youthful Ronald Colman as Lord Darlington underplays his role but is urbane and charming (in truth, I have not read or seen the play before but that is my perception). I have always liked Colman in everything I have seen him in, but, of course, you can't hear his marvelous voice and diction here. Despite these drawbacks I enjoyed the film and felt the photography was exceptionally good. I just felt it would have been even better with a soundtrack, as it lacks the requisite bite and panache. Sadly, a drawing room comedy of manners such as \"Lady Windermere's Fan\" wouldn't work today, as modern day audiences would be baffled by the subtlety and lack of action. That may be why it hasn't been remade successfully in the sound era. I give it a rating of 7."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["Mrs Erlynne, the mother of Lady Windermere - her daughter does not know about her - wants to be introduced in society, so that she can marry Lord Augustus Lorton. Lord Windermere, who helped her with a cheque, invites her to his wifes birthday-party, but Lady Windermere thinks, she has reason to be jealous, so she decides to leave her husband and go to Lord Darlington, who is pining for her. Mrs Erlynne finds this out and tries to prevent her of this mistake, but her daughter leaves her fan in Lord Darlingtons residence."],
      "budget": 320000
   },
   "movielensId": 73125,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1925-12-26",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Ernst Lubitsch"],
      "runtime": 120,
      "movieId": 73125,
      "title": "Lady Windermere's Fan",
      "mpaa": "",
      "actors": [
         "Ronald Colman",
         "May McAvoy",
         "Bert Lytell",
         "Irene Rich",
         "Edward Martindel",
         "Carrie Daumery"
      ],
      "imdbMovieId": "0016004",
      "originalTitle": "Lady Windermere's Fan",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Mrs Erlynne, the mother of Lady Windermere - her daughter does not know about her - wants to be introduced in society, so that she can marry Lord Augustus Lorton. Lord Windermere, who helped her with a cheque, invites her to his wifes birthday-party, but Lady Windermere thinks, she has reason to be jealous, so she decides to leave her husband and go to Lord Darlington, who is pining for her. Mrs Erlynne finds this out and tries to prevent her of this mistake, but her daughter leaves her fan in Lord Darlingtons residence.",
      "tmdbMovieId": 121379,
      "avgRating": 3.35714,
      "releaseYear": "1925",
      "numRatings": 7,
      "posterPath": "/ob7DnShvrpaj0THZMbXVK9y1mO7.jpg"
   }
}