{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "suicide of father",
            "id": 12103
         }
      ],
      "imdb_id": "tt0790676",
      "video": false,
      "title": "The Good Life",
      "recommendations": [
         27984,
         118991,
         46737,
         19033,
         121822,
         76800,
         14422,
         9867,
         84201,
         44015,
         52855,
         41478,
         150065,
         70374,
         56441,
         16433,
         15719,
         29649,
         15006,
         39310
      ],
      "backdrop_path": "/7lM6wkv8kEKakPE13u1yLfWIDwq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jason",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e026663",
               "name": "Mark Webber",
               "profile_path": "/s7QzjQ8qiaN7P2MSMa5NWkmefbd.jpg",
               "id": 4451,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Frances",
               "gender": 1,
               "credit_id": "52fe447ec3a368484e026667",
               "name": "Zooey Deschanel",
               "profile_path": "/6JL7CD40ylCcqirCetEcsFNmU44.jpg",
               "id": 11664,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gus",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e02666b",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Robbie",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e02666f",
               "name": "Bill Paxton",
               "profile_path": "/53Ln1wTC0OCLzBF4HNlwhMXYgOU.jpg",
               "id": 2053,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tad",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e026673",
               "name": "Chris Klein",
               "profile_path": "/foKh17RAUIhmfNgZ3TIvHJrNkDR.jpg",
               "id": 21594,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Andrew",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e026677",
               "name": "Patrick Fugit",
               "profile_path": "/37RM0m1mDJ4YxC3n7QgwpXSUpkp.jpg",
               "id": 11663,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dana",
               "gender": 1,
               "credit_id": "52fe447ec3a368484e02667b",
               "name": "Drea de Matteo",
               "profile_path": "/6rAp86rimrbRbZtm61jQoc5Fmkv.jpg",
               "id": 70767,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Frank Jones",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e02667f",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Daryll",
               "gender": 2,
               "credit_id": "52fe447ec3a368484e026683",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe447ec3a368484e026689",
               "name": "Stephen Berra",
               "profile_path": null,
               "id": 114841,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe447ec3a368484e02668f",
               "name": "Stephen Berra",
               "profile_path": null,
               "id": 114841,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.898096,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 24050,
      "vote_count": 14,
      "budget": 0,
      "overview": "A story about a mostly normal young man who makes the most out of fitting in when he obviously doesn't.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         339692,
         281957,
         241
      ],
      "original_title": "The Good Life",
      "runtime": 106,
      "poster_path": "/4CY1xkWoPewhwX1teKYZCSBI2WO.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2007-01-18",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Berra"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Stephen Berra"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0790676/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk1NjA0MjQ0OF5BMl5BanBnXkFtZTcwMDU5OTAzMg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Mark Webber, Zooey Deschanel, Harry Dean Stanton | See full cast and crew »"],
      "reviews": [
         "Given there's already quite a number of reviews of The Good Life--it did play at Sundance, after all, I'm not going to discuss the plot of the film, except to briefly say that it's a film about the suffering and isolation of one man, Jason, in a town he's trapped in for all the wrong reasons. He is surrounded by deceitful and manipulative individuals who do nothing but bring him down and pull him further and further into desolation. That is, except for his one true friend, Gus, an old man who owns a neighborhood theater. The film deals with themes and perspectives and actions viewers don't typically find appealing on screen--and it is largely depressing. Reviews are mixed for this film, as to be expected. Some find the film hopeful or inspiring at the end--I just see it as survival. The well-fleshed out characters in this gloomy tale are all impressively played. Mark Webber's performance as Jason is incredibly riveting and believable. As for Chris Klein, I agree with some critics who believe this might be his best role yet. Zooey Deschanel manipulates me into loving her once again. Bill Paxton's character is quirky and odd and gay, and Bill pulls it off perfectly. Gus, however, is probably my favorite character. I kept looking over at Harry Dean Stanton, who gives a heartfelt performance as a dying man, wondering, as the film progressed, how he felt watching himself play this character--at his age--and how it effects him. Of course, he's far more active than Gus... (on my blog there was a picture of Harry Dean waving his hands in the theater at the audience, announcing \"I am not a crook.\") Professional skateboarder Stephen Berra has written and directed a truly important film, built on decent story and cemented together with remarkable performances from the actors. Berra's portrait of small town America manufactures a painful environment which grabs the viewer by the throat. The film doesn't necessarily say anything new or even profound for that matter, but it's certainly an emotional experience I won't soon forget.",
         "I saw this one at the AFI Dallas festival..The story of a young guy who has a very bad family environment, a medical condition and an attitude toward football, all of which serve to alienate him from his surroundings. He works at a gas station and helps out at an old movie theater. He tries to keep the bills paid at home, where he lives with his mother, but he doesn't always succeed. Stephen Berra, a pro skateboarder writes and directs, and from what he said after the movie, you'll be seeing more of his work. Mark Webber (Jesus' Son, Broken Flowers) stars with Zooey Deschanel (Trillian in Hitchhiker's Guide to the Galaxy) Harry Dean Stanton and Bill Paxton. Webber is very real and sympathetic and Zooey does a good job as the almost angelic and quite strange Frances. A moving, intimate film.",
         "This is at its heart a story we've seen in movies many, many times, either as a primary or secondary plot: Mid-20s underachiever feels alienated and lacks true purpose in life while caught in a small town. Jason (played my Mark Webber, a brilliant up-and-coming actor you will hear more and more about) suffers from a disease that makes him lose all his hair. He lives with his vulnerable mother, who keeps holding him back because she is unable to care for herself. He cannot connect with the rest of his awkward family. He works several low-paying jobs, including one at a theatre. The theatre's owner is mentally ill and so, Jason must also take care of him. Throughout the duration of the film, we see him interact with other individuals, most of which are quirky, most of which seem just as alienated about this \"good life\" in Nebraska, with unrealized ambitions, broken dreams and broken lives. This kind of synopsis might appeal to me if I hadn't seen it all before, several times. But where The Good Life redeems itself somewhat is in the execution. Stephen Berra has written organic, believable characters, starting with the protagonist Jason, who has to battle several issues including the legacy his father has left to him. There is a haunting theme throughout the movie that people around Jason have raised the white flag on a better life. Jason's father has done worse, abandoning all hope not only for himself but for his loved ones, inviting them to give up as well. The other key character here is Frances, a role perfectly suited for the charming and quirky Zooey Deschanel. When Frances meet Jason, she becomes a catalyst for his renewed interest in fighting for his life. A true good life. But unlike the prototypical feel-good Hollywood movie, Frances is not just a device to allow Jason to go on to a better life. She is human and flawed and her sudden interest for our underachiever is complex like all real life relationships are. And this is where I think this movie shines. The various people Jason meets and interacts with all seem to have their own problems. There is no wise sage around the corner waiting to selflessly give a hand. Selflessness might be the trait that most defines Jason. Underneath, he has all those aspirations, on the surface he neglects his true self while living a life he finds pointless. And so to me, the movie is mostly successful in making you reexamine the mutuality of relationships, the duties we impose upon ourselves and our true motives. Is being selfless always a good and noble act? If you enjoy indie dramas and the themes described above, you may enjoy The Good Life as I did.",
         "I had the honor of seeing this film at the first annual Lone Star International Film Festival. I really can't remember the last time I was so drawn into a film. I never checked the time or anything I typically do in a movie. It was really a brilliant piece of art. There were many themes throughout the film. The one that really stuck out to me was mental illness. At least 5 characters in the film portray symptoms of various mental disorders. When I asked Stephen Berra about it after the showing, he said that he had never seen it from that light, that it was not intentional, and that he thinks all of us show symptoms of mental disorders. While I understood that, I definitely think that that theme was integral to the story. The only thing is...there are no memorable quotes on here! There were so many good ones...someone please get on that. Also, I really hope this makes it out into the general audiences. This is a great film that I would see again and again.",
         "The arc of the plot is much like THE RIVER KING. Though entirely different as far as genre and intended audience, both movies do a very good job at introducing a multitude of characters and potential conflict and then shamelessly just ignore any attempt at resolution, be it good or bad, moral or immoral, clear or ambiguous, etc. Having said so much, TGL is the more highbrow of the movies. The acting, shots, script are excellent and for about an hour this viewer was very involved with the main character and engrossed in his conflicts (indeed, our protagonist is the focus point in every scene, except for the football coach TV blurbs that serve as the backdrop of the setting). There are multiple, well conceived and introduced plot conflicts: coming of age, love interest, parental, Oedipal, antagonist, death (even, though not-so-well, sexuality) just to name a few. Plot conflicts do not have to be resolved, life is not so neat. They can be compromised, contained, accepted, condoned, absorbed (name your own disposition!). But they must be treated in some form or manner. Mr. Berra has made a movie of interest and we can look forward to more. Next time, however, he should finish his film.",
         "Imagine the life of Jason, a sensitive man suffering from a strange illness, Alopecia, that made him lose his hair. When we meet him, he is working at his daytime job in a desolate gas station. At night, Jason works at the old movie theater that Gus has run for many years. Jason's life is at the center of this bleak story that will reward the viewer that takes a look at it without any expectation. The opening sequence shows Jason walking toward a crowded downtown area with a gun in his hand, something that gives us an indication of the desperation going on his mind. Life in Lincoln, Nebraska for Jason and his mother is not exactly what one would expect. They are hardly making a living; their electric bill has not been paid in quite a while, and the house has seen better days. Yet, for all the problems Jason has to face on a daily basis, he is not bitter at all. Hope arrives in the form of Frances, a kind soul that loves to watch the old movies shown at the Capitol. She bonds with Jason in many ways that might lead us to believe they will go beyond the friendship into something deeper. Yet, Frances has the opposite effect on Jason when he discovers she has been telling hims lies based on borrowed lives of larger than life stars, like Judy Garland, one of her favorites. Jason comes to an abrupt decision after he finds Gus dead in the projection room. The idea of losing his one true friend serves as a waking call for Jason to escape to a different kind of life and leave his miserable days behind. Meeting Robbie, the strange fellow that is attracted by the old films, makes Jason realize how cruel Frances has been to him, while at the same time, going to Robbie's apartment makes one think that perhaps he was looking for an affection, any kind of affection, being from Frances, or from this man. \"The Good Life\" is one of the most misleading titles for an Indie in recent memory because it is not exactly a film that is uplifting, yet, it has some positive message in the way things turn out. Director Stephen Berra shows great promise with this movie that he also wrote. Mr. Berra's second movie shows a sensitivity that in someone else's hand could have turned in another direction. He is to be commended by the performances he got from his cast. Best of all is Mark Webber who makes a great appearance in the leading role. Mr. Webber has been involved in a lot of worthwhile movies and has a bright future that one hopes will take him far. Zooey Deschanel is perfect as Frances, the dippy girl that brings some happiness to Jason while not telling him the truth about herself. Harry Dean Stanton is seen as Gus, the older man whose life has changed after his wife died. Bill Paxton, Patrick Fugit, Chris Klein, Drea DeMatteo, Deborah Rush and Bruce McGill are part of the ensemble players. Patrice Lucien Cochet does justice to the seedy backgrounds where this dark movie takes place. Don Davis incidental music is also effective. The film is worth a look by discerning fans of this genre because the good work of Mr. Berra and his star, Mark Webber.",
         "This film serves no constructive or productive purpose. Writer/director Steve Berra might have thought he had a good reason for telling this story. For all I know, there was such a reason, at least at some point in production. After watching The Good Life, however, I can find no justification or rationale for its existence. It's well enough made for what it is, but it never answers the most fundamental questions about itself. Why should people watch this movie? Why should they care about anything that happens? What is the viewer supposed to get out of it? Jason Prayer (Mark Webber) is a 20something kid living in Nebraska. He's worked the last 7 years as a gas station attendant. He's also the main support for his broken down mother (Deborah Rush) and Gus (Harry Dean Stanton), the owner of the old movie theater where Jason also works. Gus suffers from Alzheimer's or just has a profound aversion to pants. Either way, he's even more dependent on Jason than his mom. Jason is harassed by Tad Tokas (Chris Klein), another 20something Nebraskan who's so angry at life he can barely contain it, and romanced by Frances (Zooey Deschannel), a pretty young woman who latches onto him like a lovesick lamprey and then breaks his heart to soothe her upper middle class unhappiness. Jason also suffers from an immune disorder that causes all of his hair to fall out. Oh, and his dad just died and left him a present which Jason refused to open. Needless to say, The Good Life is not exactly a laugh riot. There's something vaguely resembling a plot at work here but honestly, this story is about how Jason's life sucks and keeps on sucking until falling into an ending that's supposed to teach us something about the resiliency of the human spirit or some such claptrap. Outside of a skimpy, unformed and ill thought out analysis of the sociological importance of college football in Nebraska, which comes off as the remnants of a more significant element in an early draft of the script, The Good Life does nothing but ask us to genuflect before the quiet desperation of Jason Prayer. To which I can only respond...why should I give a crap? It's a simple query that far too few indy filmmakers ask themselves. Why should I give a crap about Jason Prayer? Why should I give a crap about how his life has turned out? Why should I give a crap that he's unhappy? Jason takes care of his mom and Gus, proving he's a basically decent person, but so what? Why should I care more about Jason than Andrew (Patrick Fugit), his friend and fellow gas station attendant? Particularly when Andrew demonstrates a sense of humor about the poor state of his life, compared to Jason's sullen and somber stoicism. Why should I care more about Jason than the tormenting Tad? Even though Tad is cast as the villain and has far less time on screen, Chris Klein powerfully demonstrates though Tad's disturbingly aggressive behavior that his life sucks and he's just as unhappy or more so than Jason. Writer/director Berra failed to do the most basic sort of storytelling to try and make me people care about Jason. The most obvious way to generate sympathy or empathy for such a character is to show the audience what he's given up or lost to end up where he is. It's not enough to stick Jason with two menial jobs and a couple of near helpless adults. You've got to let the audience see the opportunities Jason has lost by being dragged down with such responsibilities. It's that unfairness, that injustice, that mirror image of the audience's own lost possibilities that people will respond to. There's none of that in this movie. Yes, Jason's life is hard and disappointing. So what? There's never a second when you get the impression that Jason could ever be more than what he is if his life had turned out differently. I'm sure Berra felt some connection to his main character. He never builds such a connection between Jason and the folks watching The Good Life. There is a point where the lovely Zooey Deschannel takes her shirt off and a topless Zooey would have been all the reason in the world for this film to exist. Her hands cover up her breasts the entire time though, which makes it feel like Berra is just screwing with viewers. Outside of an awkward and cumbersome plot thread about Judy Garland, The Good Life is written with a certain amount of intelligence. The acting is perfectly fine and the direction is unobjectionable. I just can't think of any reason why anyone should spend their time and money to watch this film. There's nothing for anyone to get out of it.",
         "The story is about a small town and how life sucks for almost everyone. And we see a depiction of the various coping mechanisms - taking it with humor, the dire situation fueling aggression, escapism, acceptance and resilience. It's quite an interesting theme. Unfortunately the comparison between the different ways of handling life falls short and the focus lying solely on Webber's and Deschanel's character makes the movie one sided and weakens the whole premise. This and the attempt to give the movie a melancholic undertone makes it rather boring to watch. With less stereotyping of the other characters and a more in depth portrayal of them could have made the movie a really good one. Overall: It's not bad and definitely worth watching on a lazy Sunday - it just doesn't live up to it's potential.",
         "Sad, poignant, and rich, this quiet film will give you a glimpse of the human condition from the unique voice of Stephen Berra who writes and directs. He has created something to be forever proud and for those of us that run across it over time on NetFlix (or like I did recently on The Movie Channel) to be thankful for. The presence of wonderful actors including Harry Dean Stanton, Bill Paxton, and Zooey Deschanel should draw people to this film and the excellent acting and writing will hold them until its end. Mark Webber is warm and believable as the young man stuck in a Nebraska town that is frigid both physically and existentially. Zooey creates a memorable character and even briefly sings in this film which is always a delight. Give this one a try. It will not waste your time.",
         "Jason Prayer lives his sad life as a round peg in the square black hole of college football-obsessed Lincoln, Nebraska. Writer/director Stephen Berra has provided his hero with plenty of bizarre baggage so that an audience can easily tag him as one of Indie Film's stereotypical oddball protagonists. He suffers from alopecia, an auto-immune disorder which has left him completely hairless. His father has committed suicide, and he lives with his mother in a shabby house besieged by the electricity company's debt collectors - and he works the day shift at a gas station where he's terrorized by a muscle car maniac. Jason's evenings are spent assisting the senile owner of a decaying cinema, where vintage movies are projected over empty auditoriums. His prospects perk up when beautiful, warmhearted Indie-girl Frances shows up at the theater, and recognizes him as a kindred spirit. Later that night she drives him home after he gets beaten up by the psychotic motor-head, but unfortunately the course of true love never runs smoothly for sensitive Indie heroes. By the end of the film it's uncertain whether Frances is escaped-from-an-asylum crazy, or a figment of Jason's imagination created by too many nights at the movies. Either way, she's the catalyst that prompts him to embark on a mythic Indie quest for a Golden Fleecy life beyond freezing wintry Nebraska - and that can't be all bad."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "FarFalla Films",
         "Buffalo Gal Pictures",
         "Fostoria Films"
      ],
      "summaries": ["A young man (Webber) is encouraged by a new friend (Deschanel) to cope with living in a town where he doesn't necessarily fit in."],
      "budget": 3500000
   },
   "movielensId": 73135,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-01-18",
      "dvdReleaseDate": null,
      "directors": ["Stephen Berra"],
      "runtime": 106,
      "movieId": 73135,
      "title": "The Good Life",
      "mpaa": "",
      "actors": [
         "Mark Webber",
         "Zooey Deschanel",
         "Harry Dean Stanton",
         "Bill Paxton",
         "Chris Klein",
         "Patrick Fugit",
         "Drea de Matteo",
         "Bruce McGill",
         "Donal Logue"
      ],
      "imdbMovieId": "0790676",
      "originalTitle": "The Good Life",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story about a mostly normal young man who makes the most out of fitting in when he obviously doesn't.",
      "tmdbMovieId": 24050,
      "avgRating": 3.38889,
      "releaseYear": "2007",
      "numRatings": 18,
      "posterPath": "/4CY1xkWoPewhwX1teKYZCSBI2WO.jpg"
   }
}