{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0038206",
      "video": false,
      "title": "Under the Bridges",
      "recommendations": [
         73363,
         93175,
         60743,
         62098,
         33686,
         59895,
         51555,
         64319,
         26294,
         27560,
         73313,
         72529,
         46401,
         27917,
         75637,
         129075,
         256651,
         932,
         106828,
         109383
      ],
      "backdrop_path": "/9bzGKwNL1Lx3BjOjOS5wFX5txoC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Anna Altmann",
               "gender": 0,
               "credit_id": "52fe4b59c3a36847f81ff5df",
               "name": "Hannelore Schroth",
               "profile_path": "/gnjhu0UspHkCgNyhw6RvBYikSPE.jpg",
               "id": 46039,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Hendrik Feldkamp",
               "gender": 2,
               "credit_id": "52fe4b59c3a36847f81ff5e3",
               "name": "Carl Raddatz",
               "profile_path": "/kqmZ01s7Am2P30ABssH07fTY7jE.jpg",
               "id": 36837,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Willy",
               "gender": 2,
               "credit_id": "52fe4b59c3a36847f81ff5e7",
               "name": "Gustav Knuth",
               "profile_path": "/mVaZRIWxkWLWaYNin0lgnT9S14E.jpg",
               "id": 6254,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Wirtschafterin",
               "gender": 1,
               "credit_id": "52fe4b59c3a36847f81ff5eb",
               "name": "Margarete Haagen",
               "profile_path": "/vczaaSuae9vV8rNoshCVTomyNsQ.jpg",
               "id": 37909,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe4b59c3a36847f81ff5ef",
               "name": "Ursula Grabley",
               "profile_path": "/3QCxsqEfFHigruL796GQtDdHSCK.jpg",
               "id": 38267,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Girl in Havelberg",
               "gender": 1,
               "credit_id": "52fe4b59c3a36847f81ff5f3",
               "name": "Hildegard Knef",
               "profile_path": "/cbhfFSRIdPVenX1Zu4lxK1yipI7.jpg",
               "id": 14168,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mann auf der Brücke",
               "gender": 0,
               "credit_id": "536a1b290e0a2647cb009c93",
               "name": "Walter Gross",
               "profile_path": "/feAHZc6zyDcWxEpwUO7Wc5l2zgW.jpg",
               "id": 37912,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b59c3a36847f81ff5c9",
               "name": "Helmut Käutner",
               "profile_path": "/yH9QOB55jFjMwGt3k5h6edO7wpi.jpg",
               "id": 26436,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b59c3a36847f81ff5cf",
               "name": "Helmut Käutner",
               "profile_path": "/yH9QOB55jFjMwGt3k5h6edO7wpi.jpg",
               "id": 26436,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b59c3a36847f81ff5d5",
               "name": "Leo de Laforgue",
               "profile_path": null,
               "id": 1105829,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b59c3a36847f81ff5db",
               "name": "Walter Ulbrich",
               "profile_path": null,
               "id": 72239,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56a568789251412b44000676",
               "name": "Walter Ulbrich",
               "profile_path": null,
               "id": 1489716,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a56881c3a368389b0087ea",
               "name": "Bernhard Eichhorn",
               "profile_path": null,
               "id": 49247,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56a56889c3a36838a300779b",
               "name": "Igor Oberberg",
               "profile_path": null,
               "id": 32530,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56a56891925141551c00377f",
               "name": "Wolfgang Wehrum",
               "profile_path": null,
               "id": 50194,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a568989251410c08006157",
               "name": "Jupp Büttgen",
               "profile_path": null,
               "id": 1568002,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56a5689fc3a368389b0087f8",
               "name": "Hans Ender",
               "profile_path": null,
               "id": 1568003,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56a568b09251412b44000688",
               "name": "Anton Weber",
               "profile_path": null,
               "id": 1406156,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56a568b89251412dda00154b",
               "name": "Arnold Jensen",
               "profile_path": null,
               "id": 1268500,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56a568c09251412b44000692",
               "name": "Charlotte Kersten",
               "profile_path": null,
               "id": 1568004,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56a568ca9251417207008588",
               "name": "Viktor Eisenbach",
               "profile_path": null,
               "id": 1568005,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56a568d2c3a368388b008a2c",
               "name": "Kurt Paetz",
               "profile_path": null,
               "id": 1568006,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56a568db9251412b440006a2",
               "name": "Kurt Fritz Quassowski",
               "profile_path": null,
               "id": 1568007,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "56a568e4c3a3683893008174",
               "name": "Rudolf Jugert",
               "profile_path": null,
               "id": 36842,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56a568ec925141419f003b55",
               "name": "Wolfgang Wehrum",
               "profile_path": null,
               "id": 50194,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56a568f69251410c0800617c",
               "name": "Gustav Bellers",
               "profile_path": null,
               "id": 1568008,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.368631,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 114790,
      "vote_count": 5,
      "budget": 0,
      "overview": "Two barge skippers fall in love with the same woman.",
      "similar": [],
      "original_title": "Unter den Brücken",
      "runtime": 99,
      "poster_path": "/qDbV6xjAO50c58zq3nXTzBBPMKO.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Terra Filmkunst",
            "id": 8219,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Universum Film (UFA)",
            "id": 12372,
            "origin_country": ""
         }
      ],
      "release_date": "1946-08-31",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Helmut Käutner"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Leo de Laforgue",
         "Helmut Käutner"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0038206/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MDgxNDc0Nl5BMl5BanBnXkFtZTcwMTc2OTI0MQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Hannelore Schroth, Carl Raddatz, Gustav Knuth | See full cast and crew »"],
      "reviews": [
         "Hendrik and Willi are co-owners of a cargo barge on the German River Havel. Goods are sent along the river's lifeline to the major ports of Germany. Rotterdam to Berlin and back again. Life is good on the river as far as it goes yet something is missing. Quick jump-offs in the towns along the way become habit. Loneliness can be baggage that we all pack unwittingly. Hendrik played by Carl Raddaz, realizes that real life is going by without them. Especially absent is the company of true female companionship. The river becomes a willing partner to the player who wishes to tempt fate for the rewards of life. Fate draws a 'pat hand' when late one evening, from the moored barge, a pretty, young women is observed on a bridge ahead. Her lone lamp-lit silhouette showing against the background of night. Appearing distraught, she is crying. The men whisper she might end it all with one last step off the bridge and into cold eternity. Suddenly, she drops something into the black depths below, but by this time our bargemen are there, under the bridge, in their small dingy to retrieve the article. They observe the girl much closer. What to do? For fate, in it's seeming randomness, allows a new chapter to unfold in three people's lives in post-war Germany. Their meeting becomes a driving gamble of need, and hope. The reward of human companionship, acceptance and the search for true happiness becomes a riddle these players must unravel only to discover that everyone are amateurs in this pageant. What are the mysterious steps required to win the battle over an almost predestined lonely future? Director Helmut (The Devil's General) Kutner's allegorical tale is a canvas of light and shadow. Mixing pre-war German Industrial high-contrast themes with a kind of pre-natal Cinema Verite he presumes life's outward evidence of happiness is salted with an inner, lonely core which cannot be purged until the lessons of hope are proffered and dangled to the whole world to judge these volunteer competitors. Win or lose? Is the game worth the reward? You 'betcha!",
         "\"Under the Bridges\", made in the last year of the Third Reich, proves that artistic genius can flourish even under the most difficult circumstances. The film completely transcends its time and presents a simple love story, the themes of which are universal. Through both his settings and his actors, Kautner achieves a naturalism which has seldom been equaled. That he managed to do this in 1944-45 Germany is almost unbelievable. A fortunate and unexpected treasure from a most unfortunate time.",
         "This film was made in the last months of WWII. Because of the allied bombers flying over the set on their way to Berlin and because of the destruction of many locations shooting often had to be stopped and was resumed later when the alarm was over. And yet \"Unter den Brücken\" became the most beautiful love-story in german cinema (apart from Ophüls' \"Liebelei\" of course) without any trace of propaganda. The acting of Hannelore Schroth is wonderfully natural even today and the cinematography reminds me of Jean Vigo's \"L'Atalante\" and Charles Laughton's \"The Night Of The Hunter\". This movie stands out as a real miracle and as a singular event in UFA history.",
         "This can be considered one of the very last films to be made in Nazi Germany - it passed the censorship in March 1945, but for obvious reasons didn't make it to the cinemas as the street battles were about to commence in Berlin in a few weeks. It's true that at least three new movies had their opening nights in Berlin as late as in March 1945, and reportedly two in April, which seems quite unbelievable. In most of his films Helmut Käutner succeeds in creating a world of his own, a sort of microcosm that holds only the people that we see on the screen. He did also excel in historical costume epics, but his forte was a simple, intimate film about what goes on in the soul. People often wonder, how is it possible that Käutner managed to create his films which are seemingly totally free of any kind of propaganda or references to the war and destruction around him during the time when propaganda was becoming the only remaining weaponry. But I don't think that's quite true: if Under the Bridges were made in a period of peace, it would totally lack the mesmerizing feeling that is attached to this film as we view in proper context. Suddenly it becomes amazingly human, allowing us to realize that even as most of the people in Germany must have thought they were facing total destruction and annihilation literally any day soon, they still kept living and loving and at some point the inner world must have eclipsed the world outside, were death was running amok. Being of the generation that hasn't seen war, I can only imagine how intense one's love or loneliness can grow in the world where there seems to be no tomorrow. Whatever the story or the genre, Käutner manages to find aspects that make it interesting and wake a lot of human compassion. His storage of empathy and his skills to share it are bottomless. He truly was a great maker of great films about little people.",
         "This is one of Helmet Kautner's best films.His last before the war ended.He has Carl Raddatz as playing a captain of a ship barge, in the same style that Hans Alber looked in Grosse Frieheit N. O. 7 including accordion.Gustav Knute,express with an l in German, is his assistant. Everything is happy go lucky in their business. They look at people on the bridge when they go under, until one day they meet a girl,played by Hannalore Schroth ,at night. They notice above the bridge she drops money into the water. They both stick the paddle out of the ship barge to pick the money up,wondering why she drop the money.As if she was going to commit suicide. They go up to her she tell them only that she about to go home but she missed the last bus. They offer her a ride . This is when the conflict between the two friends begin as they both become interested in her.As they reach Berlin the friends friction increased and they slowly start to fight each other for the girl.The war was still going on and Kautner were shooting this film a a location where there were no bombings,The last day she decides to cook a meal for them but the end up arguing about her . She leaves immediately.Carl later finds out where she lives. This is when they both really fall in love as she soaks his soar finger . But Knute shows up and spoils everything and Carl leaves. Later they both have a fight and Gustav leaves the ship and gets a job as a crane operator.Later both Gustave and the girl show up near the river to wait for Carl to show up . He never does. Later as Gustave is boat paddling her on the river. She finally reveals the secret of why she dropped the money in the river. Her ex boy friend was an artist and had hired her as a nude model for his painting. She was hoping he would fall for her but he was only interested in her as a model subject. When he an she is back near her apartment. She noticed that the light's on . She quickly runs to her apartment and it's him . He's back. Carl and Gustave later reconcile . They are all back at the ship barge together again. The location shots were at some parts of Berlin. Character actress of Germany Margete Haagen shows up as the landlady.HildegargKneff makes her early film appearance earlier in he picture. This film is worth a collection. If T.C.M wasn't greedy they could premiere this at their import show on Sundays but they are biased.",
         "Under the Bridges is another fantastic film from German director Helmut Kautner. The plot of the film centers on a barge on the waterways of Germany in some unidentified time and the relationship between the two owners of the boat. This relationship becomes strained, and develops into a classic love triangle, when a woman comes on board and stays with them for a short time. As is usual of Kautner's films the characters are highly sympathetic and their relationships very realistic and well thought out. Almost anyone can identify with at least one of these archetypal main characters, whether it is the \"Damsel in Distress\" Anna, the \"Loner with a Heart of Gold\" Hendrick, or the \"Nice Guy\" Willy. The most interesting factor in this film though is one that happens off screen. Filmed in 1945, and often interrupted by overhead allied bombers, this was one of the final films to pass the censors of the Third Reich in March 1945, the month before the suicide of Adolf Hitler and the soon following German surrender. Despite the pervasiveness of the looming military and political disaster that was apparent in Germany at the time the present is entirely absent from the film. The plot takes place in some sort of time out of time that is familiar and identifiable as some time in 20th century Germany, but this is only a vague placement. The timeless quality so embraced is indicative of Kautner's desire to remain apolitical during the war and to remain simply a filmmaker. The blissful ignorance of the film's contemporary political reality gives the film a very escapist quality, a very probable goal of Kautner's. This film taken in its historical context has a very important message. It seems to largely be saying that no matter what happens on the world stage we are all still human and that no matter what befalls us we continue to survive, thrive, live, and love. This attitude towards human life is something that gives Kautner's films their human quality; that certain feeling that comes through them which seems to say \"Despite all that happens, we must maintain hope.\"",
         "Another comment said that this film \"completely transcends its time\". That's true, but I wonder how the contemporary audience interpreted this \"transcendence\". Was not-talking-about-war in the last days of WW2 understood as talking about war in a different way or simply as escapism?"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Terra-Filmkunst",
         "Universum Film (UFA)"
      ],
      "summaries": ["Two barge skippers fall in love with the same woman."],
      "budget": 0
   },
   "movielensId": 73145,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1946-08-31",
      "dvdReleaseDate": null,
      "directors": ["Helmut Käutner"],
      "runtime": 99,
      "movieId": 73145,
      "title": "Under the Bridges",
      "mpaa": null,
      "actors": [
         "Hannelore Schroth",
         "Carl Raddatz",
         "Gustav Knuth",
         "Margarete Haagen",
         "Ursula Grabley",
         "Hildegard Knef",
         "Walter Gross"
      ],
      "imdbMovieId": "0038206",
      "originalTitle": "Unter den Brücken",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two barge skippers fall in love with the same woman.",
      "tmdbMovieId": 114790,
      "avgRating": 3.5,
      "releaseYear": "1946",
      "numRatings": 4,
      "posterPath": "/qDbV6xjAO50c58zq3nXTzBBPMKO.jpg"
   }
}