{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "russian",
            "id": 2808
         },
         {
            "name": "seaside town",
            "id": 187224
         },
         {
            "name": "russian woman",
            "id": 208205
         }
      ],
      "imdb_id": "tt0258761",
      "video": false,
      "title": "Last Resort",
      "recommendations": [
         14358,
         343725,
         465,
         106222,
         15730,
         26195,
         25985,
         37339,
         117233,
         100017,
         14344,
         37640,
         27986,
         35404,
         280509,
         61149,
         26292,
         62661,
         15494,
         28157
      ],
      "backdrop_path": "/ngAxs84ELdoQg8tFGFPL9yrAyuH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alfie",
               "gender": 2,
               "credit_id": "52fe44a49251416c91017cad",
               "name": "Paddy Considine",
               "profile_path": "/fnVTS3GWIYEkKFaqzzNH49MGXmq.jpg",
               "id": 14887,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Tanya",
               "gender": 1,
               "credit_id": "52fe44a49251416c91017cc3",
               "name": "Dina Korzun",
               "profile_path": "/cTOblq1IhskKiKgWUsBKpoNz5P7.jpg",
               "id": 105668,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Artyom",
               "gender": 0,
               "credit_id": "52fe44a49251416c91017cc7",
               "name": "Artyom Strelnikov",
               "profile_path": null,
               "id": 124093,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Les (as Lindsey Honey)",
               "gender": 2,
               "credit_id": "52fe44a49251416c91017ccb",
               "name": "Steve Perry",
               "profile_path": "/8PODBurq35Mp4om1w4dJzxxpQ50.jpg",
               "id": 124094,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Immigration Officer",
               "gender": 2,
               "credit_id": "52fe44a49251416c91017ccf",
               "name": "Perry Benson",
               "profile_path": "/kco06yHRhBNi0x06KHHE3q85R8T.jpg",
               "id": 59076,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Katie",
               "gender": 0,
               "credit_id": "5786cd0bc3a36842bf000209",
               "name": "Katie Drinkwater",
               "profile_path": null,
               "id": 1649856,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Council Official",
               "gender": 2,
               "credit_id": "5786cd16c3a3684339000234",
               "name": "Adrian Scarborough",
               "profile_path": "/i4oo8zApNAbKQKI4yKc0T571dBI.jpg",
               "id": 40311,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "2nd Council Official",
               "gender": 0,
               "credit_id": "5786cd29c3a3682f6e000597",
               "name": "David Auker",
               "profile_path": null,
               "id": 1181938,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Policeman",
               "gender": 0,
               "credit_id": "5786de6b92514113bf0009fc",
               "name": "Bruce Byron",
               "profile_path": "/5TDTgFth7inBi9hSA544NAu4aa3.jpg",
               "id": 25675,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c91017cb3",
               "name": "Paweł Pawlikowski",
               "profile_path": "/byvdpzxrXE4SPm70D9K9DTr58Ux.jpg",
               "id": 64194,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c91017cb9",
               "name": "Paweł Pawlikowski",
               "profile_path": "/byvdpzxrXE4SPm70D9K9DTr58Ux.jpg",
               "id": 64194,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a49251416c91017cbf",
               "name": "Rowan Joffe",
               "profile_path": null,
               "id": 17608,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "548cd89192514122ea002c3d",
               "name": "Ruth Caleb",
               "profile_path": null,
               "id": 55419,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "548cd89e92514122ff002824",
               "name": "Max de Wardener",
               "profile_path": null,
               "id": 928097,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "548cd8a992514122f20029e4",
               "name": "Ryszard Lenczewski",
               "profile_path": null,
               "id": 960261,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "548cd8b892514122f9002ca0",
               "name": "David Charap",
               "profile_path": null,
               "id": 47204,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "548cd8c892514122ff00282a",
               "name": "Chloe Emmerson",
               "profile_path": null,
               "id": 982978,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "548cd8dc92514122fc002996",
               "name": "Julian Day",
               "profile_path": null,
               "id": 45058,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "548cd8eb92514122ea002c4c",
               "name": "Tom Bowyer",
               "profile_path": null,
               "id": 1398762,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.384558,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 31875,
      "vote_count": 8,
      "budget": 0,
      "overview": "When a young Russian woman and her son leave Moscow to meet her fiancé, who fails to show up, she declares political asylum.",
      "similar": [
         2539,
         594,
         16859,
         3131,
         13223,
         101,
         508,
         581,
         616,
         1164,
         63849,
         241239,
         416477,
         23631,
         2252,
         1370,
         7451,
         608,
         1669,
         156022
      ],
      "original_title": "Last Resort",
      "runtime": 73,
      "poster_path": "/b2sr7f28WuydA3IlvZtSGKVQ26D.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [],
      "release_date": "2000-02-23",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pawel Pawlikowski"],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Rowan Joffe",
         "Pawel Pawlikowski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0258761/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MjkzOTM3OF5BMl5BanBnXkFtZTcwMzc3OTYxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Dina Korzun, Artyom Strelnikov, Paddy Considine | See full cast and crew »"],
      "reviews": [
         "A young Russian woman Tanya and her son arrive in England and claim political asylum in order to be allowed to stay. They are then put in a holding area in a sea-side town in Northern England and told they must wait for 12-16 months while their claims are processed. They find their situation and the town to be equally bleak and look for a way out. Two options present themselves - the kindness of arcade owner Alfie and the well-paying exploitation of pornographer Les. This is a little gem of a film - very short but strong in almost every other area. The plot is not a typical life of an asylum seeker in the UK but it allows us to see life from their point of view. This doesn't mean that it's all bleak - Tanya sees humanity, exploitation, hate and indifference (the officers just doing their job who can't look into everyone's needs). The story is quite straightforward and at times doesn't seem to be going anywhere - the conclusion is pretty open, it's clever but it isn't satisfying for those wanting an end to the story. It's more a character piece that also looks at the UK's asylum policy. However it doesn't judge anyone or anything - it is wonderful in the way it simply presents the story with little sentiment or emotion and without pointing fingers at anyone or any situation. It could have easily been very preachy. The cast are great. Korzun is a great actress and brings her character's vulnerability through. Strelnikov is also good as her son although doesn't have as much to do. Considine is excellent as Alfie - at first his character just seems to be a wide-boy type, saying \"man\" every few words and boasting about his fights and stuff, but his character is deeply written and is well brought out. The surprise performance for me was the role of Les, the internet pornographer who offers good money to Tanya for some strip work. It was a surprise because he was played by real life pornographer Steve Perry (his porn name is Ben Dover - quite famous in the UK) - although here he is credited as \"Lindsey Honey\", a made-up name. The fact that he essentially plays himself (just in terms of his job) but allows himself to be judged by the audience makes it an excellent, brave performance and he deserves recognition for it. The film's weaknesses are minor but the fact that it is so bleak may be a turn off for those not willing to look past the surface. Also it moves quite slow and may frustrate at times. The way the scenes fade to black give it a bad TV feel - it feels like it was made to fade out to commercial breaks. Also the way that the seaside town is portrayed as \"big brother\" style town where the authorities see and know everything is at times a little hard to swallow. Overall it is a great character piece that also gives a view of the UK from an foreigners point of view. It's slow, thoughtful and non-judgemental.",
         "This is a stylistically outstanding film, where Pavilkovsky pares down the usual omnipresent noise of the modern world and allows the protagonists to interact in controlled conditions, like a professor in a laboratory. The result is something uniquely beautiful that exists somewhere on the outskirts of modern film-making, at least from my humble perspective. In a sense, we feel as if we've been allowed access to world outside of our own, close to, but vitally different from ours. As a bad analogy, think of Reservoir Dogs, where Tarantino constructs a microcosm which looks familiar to us, but the events and the atmosphere within that microcosm are alien to us. (N.B. That is where parallels between the two films end!). Considine turns out another sublime performance, showing us his ability to court our empathy, and then throw it back in our face when his simmering rage boils over (see also A Room For Romeo Brass and My Summer Of Love). Dina Korzun provides the perfect foil as a picture of stoic vulnerability. She plays the role of mother, friend, struggling provider, lover, and jilted lover without ever missing a beat, and in a perfect world would have received an Oscar nomination for her role. To me, this film embodies the joy of film watching. You quickly realize that in order to appreciate it, you must surrender yourself to it and allow it to lead you where it will, unquestioningly. And the rewards are plentiful. For me, the beauty lies in the simplicity, the lack of hyperbole, the feeling that despite the director's attempts to present an abstracted vision of the modern world, he is still commenting heavily on it, and there is something within for us to reflect on. Hollywood could never, and perhaps would never, make a film like this, there's nothing in-your-face witty or clever about it, but as a reflection of a world that actually exists, it is absolutely uncanny.",
         "When Jean-Luc Godard made '2 or 3 Things I know about her' in 1967, he was trying to capture the monumental soullessness of consumerist society as embodied in its high-rise tenements and the like. The problem was, as Eric Rohmer noted, Godard's camera couldn't help the ugly look beautiful. Something of the sort happens here. The Russian heroes are sent to a dismal English sea-resort, Stonehaven, in 'the armpit of the universe', its very name suggesting a negating of 'haven', refuge, home, by 'stone', architectural, bureaucratic. This is where all asylum seekers are stranded by the British government, their applications taking over a year to process. It is a literal prison, with fences, vigilant policemen, huge dogs, and surveillance cameras (pointedly compared to the porn monitors). In one alarming scene, the film stock changes to grainy video, following Tanya and Artyom as they try to leave for London. This seems like another stylistic affectation on the drector's part, but is quickly revealed to be part of a huge CCTV panel, with a faceless apparatchik watching every move; the pair are quickly picked up by the police. The streets are littered with bored packets of refugees, endlessly queuing for the one telephone, joylessly playing the gaming machines. As during the war, food is rationed, with vouchers to chippers where the battered fish contain no fish. this is all grim enough. But even if Stonehaven wasn't a refugee camp, it is still a sea-resort off-season, its amusements ostentatiously unused, tediously rusting, just lying there like beached whales. In this atmosphere, any sign of colour or sound - eg the gaming parlour - seems forced and artificial. Tanya's huge tower-block stands like a boil in this armpit. Stonehaven is like an economically deprived, northern town during the 80s, by the sea. Kids have nothing to do but smoke, get drunk , smash things, steal. The one thriving business in the town is an internet porn company. A horrible place, hell frozen over. You can imagine how a Mike Leigh or Ken Loach might film it, mercilessly emphasising its soul-destroying numbness. When Tanya first enters her designated flat, she looks out the window at the arcade, where 'Dreamland' is proclaimed in dull neon. The point seems laboriously obvious - if this is a dream, it is a nightmare, and I want to wake up. And yet, somehow, Pavlikovsky does make Stonehaven a dreamland: if not the land of your dreams, than certainly a land in your dreams. It's not just that these old dilapidated pleasure resorts have a perverse Benjaminian nostalgic beauty, not necessarily a reminder of former happiness, but of a former, failed idea of what might constitute happiness. It's not just that the mundane paraphernalia of a sea resort, such as the bright auburn carousel on top of a gaming machine, or the tacky colour of tatty wallpaper with a Malibu pattern, seem evocative. A lot of it has to do with the old cliche of looking at the everyday through new eyes. The very first sequence, as Tanya and Artyom sit in an airport luggage carousel waiting for the exit light, alerts us to the strangeness of the realism. Even dull shots emphasising immovable tedium, such as the repeated views of the tower-block, becomme magical, because of the different camera angles and the differing quality of the sky light. This light casts a very unEnglish colour over the misery throughout, breathtaking lilacs, blues and olives. The violence of the sea can break up the staticness of the image. Even something as oppressively routine as bingo night is made to seem alien, fantastic. That this is a transforming vision is suggested by Tanya's beautiful painting, which looks like an intricate Eastern tapestry, and suggests how something flat can have resonance. When she leaves, she takes her vision with her, but she leaves the painting with the already marvellously strange Alfie, hopefully galvanising him into a new way of looking at the world, as she/Pavlikovsky did us. That a journey into a strange land so harrowing, that a romance ending up unconsummated and in a shattering act of violence (reminiscent of Shane Meadows' films, but undermining his bleakness) should result in a film so uplifting, so heartening of spirit, is only one of Pavlikovsky's miraculous achievements.",
         "A few days have past since I saw Last Resort and it's still on my mind, especially Paddy Considine's performance. Last Resort is undeniably technically good, shot really well, great locations, top editing etc. The script is good but it's the performances that really make this drama as good as it is. I would love to know how this director got these actors to behave so realistically in every situation for every scene. All three leads were fantastic but Paddy Considine constantly stole the screen and brought humour along with him for the ride. I would recommend you watch this if you ever get chance, it is believable, rich, funny and lovely.",
         "Excellent film that rightly received awards in independent categories. Throughout there was an unpretentious feel to this film that shows the directors craft and subtle methods. Made without a script this simply highlighted the talent of the actors. Considine as ever delivers a simple yet compelling performance and the young Artyom also showed a maturity beyond his years. Again credit must be given to the direction and the subtle use of light that created the feeling of isolation and solace as well as an other wordly dream like paralysis. Really well crafted and paced and beautifully shot. Enjoyable and compelling and worth a watch.",
         "Having rented this film completely at random from my college library and placed it in my PS2 having no knowledge of what or who to expect from this film. A grim account of how refugees are treated in Britain, it certainly brought home a lot of feelings i already had about the underlying current of racism in our country, but also showed the character of Alfie (Paddy Considine) to be the typical nice guy, running round and generally being a good bloke. There is a certain degree of stereotype in this (the kids getting drunk so young, the nice British guy just looking for love, the fish out of water who learns to love), but a certain scary aspect of this film is the fact that these stereotypes may just be real life.. everyday, somewhere in the armpit of the country. To sum up, though, those with pre-misconceptions of immigrants and asylum seekers being dirty money launderers will find themselves very horrified to see the truth in this film, as that is exactly what the director has portrayed in this brilliant and (for me) surprise piece of cinema.",
         "A contemporary film that perfectly captures the asylum crisis in 21st century Britain. It's a touching well-acted film, reminiscent of some of the earliest Film Four productions in the 1980s. Ultimately it poses so many questions. Should action be taken, and is here a limit to the number of asylum applications? Why do they come, when they're treated so awfully?",
         "A glowing review of this film on the radio enticed me. The review, I recalled in retrospect, was about the film's technical points. I experienced the film as a sad and predictable home movie about a Russian woman and child, who simply do not know what they are doing with their lives. The one counterpoint character in the life-in-the-gulag story line, played very well by Paddy Considine, kept the film alive, in my opinion. I was impressed with the film's ending. There was a message about responsibility and self victimization that was very refreshing. I did not feel that the film offered entertainment, even in my broadest definition, but it did offer a look at poverty, brutish bureaucracy and the consequences of ignorance in the whole realm of illegal immigration. Perhaps it could be shown regularly at airports in developing countries.",
         "Hot on the heels of news that the british are reputed to be the most rascist nation in the EU comes this elucidation of why that may be the case. A russian woman comes to england to meet her fiance and is only allowed in to the country if she applies for refugee status. told she has to stay in a detention centre for a year and a half and given only food vouchers and terrible accomodation to live on. At this point the movie could turn into a kafkaesque fable but instead is an ultra-naturalistic study of live in british emigration centres. It's a film that's cautiously optimistic about human nature, as a deus ex machina in the form of sweet, loving Paddy Consadine comes to save her from what he himself describes as a hell hole. This annoyed me a little bit; it seemed to be putting across the message that the english are really tolerant towards foreign immigrants and that it's \"The System\" that mistreats them. This seems a bit fanciful to me. One other thing that annoyed was that the only person to be hurt was an internet pornographer who pays the woman the equivalent of a month's wages back home for about an hour's striptease work. Is it really him that deserves to be hurt, and not the government, the immigration authorities, and the editors of rabble-rousing right-wing newspapers? But this is a warm, generous, beautifully shot, human film that i fear will never be seen by the people who need to see it most.",
         "LAST RESORT / (2001) ** (out of four) By Blake French: \"Last Resort\" suffers from exactly the opposite problem that agonized \"Surveillance.\" That film had a really interesting style, part documentary, part detective story, totally photographed with a variety of digital cameras, giving the movie an authentic sense. The movie failed because the filmmakers did not put enough energy or effort into the script. \"Last Resort\" has a heartbreaking, oddly engaging story, but its style keeps the viewer distant and distraught. As I left this movie, I felt cheated out of what could have been a very good film. Pawel Pavlikovsky, the Polish writer and director, certainly avoided the usual clichés involved here. He creates focused characters who define their environment and determine their own future. Most of the movie is unpredictable and hidden, we are unsure where things are headed from the first shot. Pavlikovsky combines psychological truth and realism in the film's visual style; there are frequent switches between hand-held shots and static composed wide shots. It's as if the characters are submerged in a dreamlike documentary reality. The movie tells the story of Tanya (Dina Korzun), and her son Artiom (Artiom Strelnikov). Tanya leaves Moscow with her street wise 10 year old to meet her fiance in England. When he is not at the airport, she requests political asylum. The two confused individuals find themselves virtually imprisoned in a deserted seaside resort where all refugees are forced to reside. There are no privileges, no money, and no means of escape. With failed attempts to get a hold her alleged finance, Tanya finds herself in a strange relationship with a nice man named Alfie (Paddy Considine). Tanya is not really eager to start a new relationship though, being betrayed by her fiancee and all. Her complications deepen when Artiom becomes friends with the wrong kids, and as a means of making money to pay for her passport, she becomes involved with an Internet pornographer, challenging her morality and conscience, as well as jeopardizing her relationship with Alfie. Dina Korzun's performance is interesting because she bases every scene on the fact that she is a stranger in an unfamiliar area. The rest of the characters cannot really do much with the material because it is so focused on the gimmick. Pawlikowski injects a fun subtle terror through a carnival funhouse atmosphere, but the movie never takes off with the material; success would be unequivocal if the film was created in a typical Hollywood fashioned rather than Pawlikowski's attempt at new and original filmmaking techniques. This film has ample potential and an interesting premise, but it is so depressing when director's noble intentions get in the way of an otherwise captivating motion picture."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["British Broadcasting Corporation (BBC)"],
      "summaries": [
         "Tanya arrives in London with her son Artyom, expecting to be met by her boyfriend. When he doesn't show and immigration wants to send her back to Russia, she asks for political asylum to buy some time. She has no idea that this will consign them for at least a year to a detention center, a fenced \"city\" near an abandoned seaside amusement park. Once there, realizing her boyfriend will never help her, she just wants to go home, but withdrawing the petition for asylum takes months. She's approached by pornographers inviting her to strip on line for cash; she's befriended by Alfie, a clerk at a convenience store at the center. She's a dreamer; what can she do?",
         "When a young Russian woman and her son leave Moscow to meet her fiancé, who fails to show up, she declares political asylum."
      ],
      "budget": 0
   },
   "movielensId": 73399,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "2000-02-23",
      "dvdReleaseDate": null,
      "directors": ["Paweł Pawlikowski"],
      "runtime": 73,
      "movieId": 73399,
      "title": "Last Resort",
      "mpaa": "",
      "actors": [
         "Paddy Considine",
         "Dina Korzun",
         "Artyom Strelnikov",
         "Steve Perry",
         "Perry Benson",
         "Katie Drinkwater",
         "Adrian Scarborough",
         "David Auker",
         "Bruce Byron"
      ],
      "imdbMovieId": "0258761",
      "originalTitle": "Last Resort",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["9OYCmjVI5hg"],
      "plotSummary": "When a young Russian woman and her son leave Moscow to meet her fiancé, who fails to show up, she declares political asylum.",
      "tmdbMovieId": 31875,
      "avgRating": 3.1,
      "releaseYear": "2000",
      "numRatings": 10,
      "posterPath": "/cUGSbHzTOvoujTLOC3M55sBQImC.jpg"
   }
}