{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0044982",
      "video": false,
      "title": "The Flavor of Green Tea Over Rice",
      "recommendations": [
         64728,
         117569,
         20528,
         52980
      ],
      "backdrop_path": "/6bOihGhzEYSppJvbmj5SMNopl2B.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mokichi Satake",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177aa3",
               "name": "Shin Saburi",
               "profile_path": "/zBwxMkwcOJDdUHtgxzoCHvGZIbh.jpg",
               "id": 213484,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Taeko Satake",
               "gender": 1,
               "credit_id": "52fe48c1c3a36847f8177aa7",
               "name": "Michiyo Kogure",
               "profile_path": "/note2I9UhHyoakYOXPVW3WwZ01X.jpg",
               "id": 108025,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Noboru Okada",
               "gender": 2,
               "credit_id": "52fe48c1c3a36847f8177aab",
               "name": "Koji Tsuruta",
               "profile_path": "/pbXRrMMu2OTnUuUWSLpLBx4hgzp.jpg",
               "id": 108024,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Aya Amamiya",
               "gender": 1,
               "credit_id": "52fe48c1c3a36847f8177aaf",
               "name": "Chikage Awashima",
               "profile_path": "/wEx5TrA1a2NibEPhiRXM8g6CGme.jpg",
               "id": 213495,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Setsuko Yamauchi",
               "gender": 1,
               "credit_id": "52fe48c1c3a36847f8177ab3",
               "name": "Keiko Tsushima",
               "profile_path": "/lruUVMbyeb3HWJ07rAbE5ARglJn.jpg",
               "id": 20831,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Yamauchi",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177ab7",
               "name": "Eijirô Yanagi",
               "profile_path": null,
               "id": 134312,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Chizu Yamauchi",
               "gender": 1,
               "credit_id": "52fe48c1c3a36847f8177abb",
               "name": "Kuniko Miyake",
               "profile_path": "/zLBRUKTnAcaTFcCT5gKUXs6XeRV.jpg",
               "id": 131016,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Koji Yamauchi",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177abf",
               "name": "Kôji Shitara",
               "profile_path": null,
               "id": 213488,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sadao Hirayama",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177ac3",
               "name": "Chishû Ryû",
               "profile_path": "/ocEzSylcvsKIKw8LciHEA3E1LEG.jpg",
               "id": 33135,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Shige",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177ac7",
               "name": "Yûko Mochizuki",
               "profile_path": null,
               "id": 213497,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Toichiro Amamiya",
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177acb",
               "name": "Hisao Toake",
               "profile_path": null,
               "id": 134346,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177a93",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c1c3a36847f8177a99",
               "name": "Kogo Noda",
               "profile_path": "/gK4hSppQWVZab0Y1LL4pg7UcSsf.jpg",
               "id": 131010,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48c1c3a36847f8177a9f",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56779e3092514179e7007df9",
               "name": "Takeshi Yamamoto",
               "profile_path": null,
               "id": 1115028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56779e38c3a368168b007aa5",
               "name": "Ichirô Saitô",
               "profile_path": null,
               "id": 125001,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56779e3fc3a3681683007dca",
               "name": "Yûharu Atsuta",
               "profile_path": null,
               "id": 552001,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56779e5192514179db0088ec",
               "name": "Yoshiyasu Hamamura",
               "profile_path": null,
               "id": 552002,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56779e5892514179e3008037",
               "name": "Tatsuo Hamada",
               "profile_path": null,
               "id": 552003,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56779e5f92514179e300803a",
               "name": "Setsutarô Moriya",
               "profile_path": null,
               "id": 1551744,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56779e66c3a368167a008872",
               "name": "Taizô Saitô",
               "profile_path": null,
               "id": 1453075,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56779e71925141691a004c66",
               "name": "Tomiji Shimizu",
               "profile_path": null,
               "id": 1551745,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56779e7b92514179d20081c1",
               "name": "Shōhei Imamura",
               "profile_path": "/4sULUAZvllOvsWLT0ngtBFRbXBT.jpg",
               "id": 20025,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56779e88c3a3681680008049",
               "name": "Kintarô Yamamoto",
               "profile_path": null,
               "id": 1547531,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "56779e92c3a3681683007ddc",
               "name": "Yoshisaburô Senoo",
               "profile_path": null,
               "id": 1542919,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "56779e9fc3a368168000804f",
               "name": "Katsumi Uzawa",
               "profile_path": null,
               "id": 1551746,
               "department": "Sound",
               "job": "Sound mixer"
            },
            {
               "gender": 0,
               "credit_id": "56779ea792514179e10088ac",
               "name": "Yoshiomi Hori",
               "profile_path": null,
               "id": 1551747,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.369489,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 55197,
      "vote_count": 5,
      "budget": 0,
      "overview": "A childless middle-aged couple faces a marital crisis of sorts.",
      "similar": [],
      "original_title": "お茶漬けの味",
      "runtime": 115,
      "poster_path": "/hQHjvUJLEndvGUxu3jqcbrzZZg0.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Shôchiku Eiga",
         "id": 5070,
         "origin_country": ""
      }],
      "release_date": "1952-10-01",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Yasujirô Ozu"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Kôgo Noda",
         "Yasujirô Ozu"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0044982/",
      "coverLink": null,
      "actors": ["Stars: Shin Saburi, Michiyo Kogure, Kôji Tsuruta | See full cast and crew »"],
      "reviews": [
         "This is both typical and untypical Ozu - typical in that its a simple story with a typical simple point (but of course told with deceptive skill and complexity), but its unusual in that its set among the upper middle classes, not the 'average' Japanese family of most of his movies. The story is straightforward - an unhappy marriage between a rich girl and her successful but relatively low born husband. She can't hide her contempt for his dullness and rustic ways. He is unhappy but never argues back, just finds his own little ways of getting pleasure out of life. A series of incidents finds them having an unexpected late night simple meal (green tea over rice is essentially 'leftovers' when nothing else is available) and suddenly she realizes she loves him after all. As always with Ozu, the richness is in the characters. Taeko, played by Michiyo Kogure is spoiled and insensitive, but a compelling, capricious character. Mokicho (the husband) under his dull salary-man skin is really a sensitive, caring man. The other characters are all vivid and memorable, especially Setsuko, the headstrong niece. There are also wonderful set pieces, usually involving Taekos friends, having little girls nights together, gossiping about their husbands and plotting marriages. With Ozu a brief overview of his movies always makes him sound dull. But in reality this is funny, moving and compelling. Its not first rate Ozu - the theme of the movie is too straightforward and obvious, the ending a little too neat and tidy. But second rate Ozu is still head and shoulders above almost any other drama. The humanity of the characters shines through, creating a little world we can sink into. The wonder of Ozu is that we are not observing characters, we are sitting with them, in the middle of their lives. I can't help but compare this to Naruse's 'Repast', another movie about a marriage in trouble, where the wife cannot hide her contempt for her husband, but in the end they both realize why they love each other. Naruse was more of a pessimist, so the reconciliation at the end of Repast is both happy and sad, as the characters realize that that living together, even without a great love, is better than being lonely. In Ozu's more traditional world, the couple (product of an arranged marriage) eventually find love, even after many years of marriage by the acceptance of each others little foibles. Taeko learns that simple things can be as pleasurable as luxury. It seems a little trite, and it would be in another film makers hands, but somehow Ozu finds depths of wisdom even in such clichés. The irony is that Ozu was a lifelong bachelor, yet he made perhaps the best movies ever made at examining families in detail. If I had my way I'd put this movie and 'Repast' as compulsive viewing for all engaged couples. It would be more effective than any pre-marriage course!",
         "Its about a rich family and arranged marriages. Taeko is in an arranged marriage which is not so successful, they communicate very badly and she lies to get out and do fun things with her friends. For her it is easy to lie to the husband as she thinks he is very stupid. Her niece don't want to go on a arranged marriage meet, but decide for herself who she wants to marry probably a sign of the times, the transition from traditional to modern Japan. In other ways also the modern is juxtaposed with the traditional, they wear kimonos as naturally as western style clothes. And her sister is working in a top position as a designer. As another IMDb reviewer said this is most interesting because of the charming characters. The elegant, but a bit arrogant and selfish Satake Taeko (Kogure Michiyô) had me spellbound from beginning to end. All characters are interesting and the interaction and communication between them make up the movie. The city itself takes up a small role in the movie as well, something I like a lot. Editing also is very clever at times. Its never ordinary or dull.",
         "This film mines much of the territory of Ozu films, including the complex relationships of the major characters, the resistance of a young lady to agree to an arranged marriage and the aesthetics of everyday living amongst the working classes. The film has two main stories, parallel to each other, running through it: Takeo, who is bored with her husband who is very simple in his needs, lies to him so she can go to a spa with her friends. Their niece, the pretty Setsuko, is the one who is resisting the arranged marriage meeting. How the two stories bisect is typical Ozu, creating conflict and anger. This film is not as good as much of Ozu's output at the time, but that includes \"Tokyo Story\", \"Early Summer\" and \"Late Spring\", which are standout classics. The great Setsuko Hara is not in this film and the equally great Chishu Ryu is a bit player, but I think you'll still find this film worthy of your time. If you haven't seen an Ozu film, start with \"Tokyo Story\" or \"Late Spring\" (others too, including \"Good Morning\" and \"Autumn Afternoon\") but give this a try. I don't think you will be disappointed.",
         "Flavor of Green Tea Over Rice starts with an excellent shot. Riding in the back of a car are two women, one is dressed in modern westernised clothes, while the other is dressed in a kimono. Such a shot perfectly captures many of Ozu's themes. Ozu then strengthens his topics with a simple conversation where Setsuko discusses seeing a French movie. Taeko is a bored housewife that insults her husband on a country getaway with her friends and niece. This really offends her niece Setsuko, and when it comes time for a wedding interview Setsuko is terrified that she will end up like her cruel aunt. Taeko's husband Mokichi is a very simple man with great patience. He tries to go along with his wife, but eventually it all becomes too much. She doesn't like the way he eats, the way he travels, or the cigarette brand he smokes. If I have one problem with this movie it's that Taeko is the most unlikable of Ozu's characters I have seen. She is simply cruel to an extent that it goes beyond culture/generational differences. Luckily it all adds together for an incredible ending. In true Ozu style, the married couple struggling to make something as simple as rice ignites their love and they decide to really make a go of things. It's really comforting to see a film that avoids all melodrama and rushes to the airports. It proves that subtlety can be a powerful thing.",
         "Another sensitive Ozu film about family. In this one, a somewhat upper-class woman resents her more simple, middle-class husband (by arranged marriage), while also encouraging her niece to go to arranged marriage meetings. As always with Ozu, I found an awful lot to like about this movie, but I wasn't quite enamored enough to gush over it. Most of the core cast is superb, although it's not Ozu's usual team (Setsuko Hara is nowhere to be seen, although Chishu Ryu and Chikage Awashima have minor roles). Michiyo Kogure might be a little too nasty, but I have to say it's kind of refreshing to see a less restrained character in an Ozu film. Perhaps the film wraps up too nicely and neatly, going too obviously for a touching moment, but I wouldn't say it's entirely unwarranted. At any rate, I enjoyed the film with its insights and gentle humor.",
         "Japanese master Yasujiro Ozu made this 1952 film between two masterpieces, Early Summer and (especially) Tokyo Story, and this film suffers a bit by comparison with them. As in other (somewhat more accomplished) movies by Ozu (one thinks especially of the superb Late Spring) the plot deals on the issue of whether a young woman should marry, and if that marriage should be a love marriage or arranged one. There is a middle aged, childless couple, the snobbish, nasty Taeko (Michiyo Kogure) and her husband, the honest, good but a bit dull salary man Satake (Shin Saburi). Her nephew, the pretty young Setsuko (Keiko Tsushima) comes to visit, she has to go to an interview for an arranged marriage, but seeing the loveless marriage between Taeko and Satake, and how she mocks him behind his back, is not very interested. Ozu's best films haven't dated a bit, but this one has somewhat. Moreover, while I don't agree with the generalization that all of Ozu's films are slow (not all of them are), this one is on the leisurely paced side. What's more, the movie takes some time to develop its plot so it does require a bit of patience from the viewer. You will eventually warm up to this movie, I think, but not immediately. On the plus side, it is a good, interesting movie, with believable, well developed characters. Chishu Ryu, Chikage Awashima and Kumiko Mikaye (all regular of many Ozu films) have bit roles here.",
         "Ozu continues to unfold a worldview of melancholy joy. Here we are offered an insight of what informs this: the glum husband wants things that are 'intimate, primitive, familiar and relaxed', from his brand of cigarettes to pouring tea over his dinner of rice. So it seems Ozu gravitates towards his camera and world not from deep introspection or need for formalism but towards an intuition. The benefit is that he naturally envelops space. He doesn't construct it, each visual scene is a soft pencil-stroke tracing and re-tracing paths as a way of arriving at shape. Some kind of life emerges. In the scenes of the wife lounging with her friends in a spa around a table with drinks and then lazily feeding the fish in a pond, or the two army buddies reminiscing about a beach in Singapore during war with its palm trees, a melancholy breeze blows through it carrying sense, life, contact, memory, evocation. Individually there are wonderful visual moments here, some of the best in his films. (In all this, he's in line with the great tea master Rikyu's instructions about serving tea, whose name appears in the film. It should not be a lavish or formal ceremony, but sparse and intimate, looking for spontaneous appreciation of what two people relaxing in each other's presence can inspire. Serving tea is merely the opportunity, the framework for contact.) The flipside of that intuitive approach is that it's enough for Ozu to sketch as he goes. The idea is that life is a bit like this, apparent only in retrospect. He does have in mind a larger transition: a marriage that has grown cold and distant, the lonely night of breaking them apart and, as the man's flight is unexpectedly cancelled, their coming together again in the empty house. This is a great great notion, the idea that you can create an entire life and for this to slowly crystallize realization in a single moment between two people. It resembles more clearly than any of his other films where Cassavetes would take this mentality in his Woman. Ozu had tried this several times. For whatever reason, probably a rushed production, he's not in control of it here. This is the most disjointed of his films, a real mess. The ending is possibly the worst work Ozu has done, the wife now enlightened about the purpose of marriage explaining to the young girl (and through her to young women in the audience).",
         "FLAVOUR OF GREEN TEA OVER RICE is a couple of notches below Ozu's best but it is still a fantastic film. Many Ozu films centred around a marriage to be, and while that is a subplot here, the main story (once Ozu gets around to it) is about a marriage that already is and how poorly it is doing. What I mainly enjoy from Ozu isn't the plot but the great characters and their interaction and relationships. The wife in this film does walk a fine line of annoyance but in the end redeems herself. The film strolls to a wonderful climax where the estranged husband and wife realise how much they miss each other and after a talk begin love a new over a meal of tea over rice.",
         "An unassuming husband finds the nerve to employ non-violent resistance against his contemptuous wife after hanging out for an evening with a rebellious niece who skipped her own interview with an arranged fiance. I really could have cared less about the story as the characters were so lovingly drawn and their interactions were a joy to listen to, and that's really where the action is in Ozu movies, the sounds and spaces between people as they repeatedly bump into each other and modify each other's state of mind in ways both large and small. Masterful as is almost always the case with Ozu, the film only let me down at the end when it seemed to side firmly with the henpecked husband, as if this were a wimp's rendition of TAMING OF THE SHREW."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Shôchiku Eiga"],
      "summaries": [
         "Takeo, a capricious wife from Tokyo high-society, is bored by her dull husband, a quiet and reliable company executive raised in the country (Shin Saburi) After a crisis, she understands better his true value. A parallel sub-plot shows her niece rebelling against the tradition of arranged marriages.",
         "A childless middle-aged couple faces a marital crisis of sorts."
      ],
      "budget": 0
   },
   "movielensId": 73457,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1952-10-01",
      "dvdReleaseDate": "2005-06-27",
      "directors": ["Yasujirō Ozu"],
      "runtime": 115,
      "movieId": 73457,
      "title": "The Flavor of Green Tea Over Rice",
      "mpaa": null,
      "actors": [
         "Shin Saburi",
         "Michiyo Kogure",
         "Koji Tsuruta",
         "Chikage Awashima",
         "Keiko Tsushima",
         "Eijirô Yanagi",
         "Kuniko Miyake",
         "Kôji Shitara",
         "Chishu Ryu",
         "Yûko Mochizuki",
         "Hisao Toake"
      ],
      "imdbMovieId": "0044982",
      "originalTitle": "お茶漬けの味",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A childless middle-aged couple faces a marital crisis of sorts.",
      "tmdbMovieId": 55197,
      "avgRating": 3.85714,
      "releaseYear": "1952",
      "numRatings": 14,
      "posterPath": "/hQHjvUJLEndvGUxu3jqcbrzZZg0.jpg"
   }
}