{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "sailor",
         "id": 41599
      }],
      "imdb_id": "tt1002539",
      "video": false,
      "title": "Liverpool",
      "recommendations": [
         94649,
         119905,
         285697,
         121359,
         35075,
         30688,
         214251,
         47100,
         164328,
         43974,
         36281,
         186332,
         104317,
         141145,
         255554,
         128042,
         167571,
         192142,
         69913,
         182099
      ],
      "backdrop_path": "/4tjJ0eaXw5oDdD16LE7x7CoZnhy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Farrel",
               "gender": 0,
               "credit_id": "58fb6d7d925141642f00e64c",
               "name": "Juan Fernández",
               "profile_path": null,
               "id": 1801265,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Trujillo",
               "gender": 0,
               "credit_id": "58fb6d8bc3a3687a2a00d89b",
               "name": "Nieves Cabrera",
               "profile_path": null,
               "id": 1801267,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Analía",
               "gender": 0,
               "credit_id": "58fb6d97c3a36879be00e593",
               "name": "Giselle Irrazabal",
               "profile_path": null,
               "id": 1801269,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49e6c3a36847f81ac6f3",
               "name": "Lisandro Alonso",
               "profile_path": "/dtM6Pj4FTlDy2YV7iQeLqv1S2ud.jpg",
               "id": 1002601,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58fb6cb0925141642f00e5ba",
               "name": "Lisandro Alonso",
               "profile_path": "/dtM6Pj4FTlDy2YV7iQeLqv1S2ud.jpg",
               "id": 1002601,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58fb6cb8c3a36879be00e4e7",
               "name": "Salvador Roselli",
               "profile_path": null,
               "id": 1022346,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58fb6cc0925141640b00e482",
               "name": "Flor Maleva",
               "profile_path": null,
               "id": 1159608,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58fb6cc7c3a36879be00e4f3",
               "name": "Lucio Bonelli",
               "profile_path": null,
               "id": 68145,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58fb6ccfc3a3687a2500dd5b",
               "name": "Marianne Slot",
               "profile_path": null,
               "id": 6151,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58fb6d46925141642f00e626",
               "name": "Luis Miñarro",
               "profile_path": null,
               "id": 28503,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58fb6d50925141643c00e3f4",
               "name": "Ilse Hughan",
               "profile_path": null,
               "id": 1159613,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58fb6d5b925141642800e22c",
               "name": "Christoph Hahnheiser",
               "profile_path": null,
               "id": 32168,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "58fb6d64925141640b00e500",
               "name": "Lisandro Alonso",
               "profile_path": "/dtM6Pj4FTlDy2YV7iQeLqv1S2ud.jpg",
               "id": 1002601,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.889599,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 101006,
      "vote_count": 10,
      "budget": 0,
      "overview": "A sailor takes a short leave to visit his hometown and see if his mother is still alive.",
      "similar": [
         4922,
         881,
         4421,
         387,
         2669,
         18311,
         8619,
         714,
         71805,
         1913,
         2623,
         75674,
         152747,
         643,
         28292,
         2019,
         277834,
         14886,
         335788,
         11335
      ],
      "original_title": "Liverpool",
      "runtime": 84,
      "poster_path": "/r5vQhOvIpjBHJxciXvR9B9dPC7d.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Black Forest Films",
            "id": 1394,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Slot Machine",
            "id": 7777,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CMW Films",
            "id": 20008,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eddie Saeta S.A.",
            "id": 35558,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "4L",
            "id": 39339,
            "origin_country": ""
         }
      ],
      "release_date": "2008-10-30",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lisandro Alonso"],
      "runtime": 84,
      "synopsis": "Liverpool vs Norwich City Live Coverage Here. Catch the match live here it provide crystal clear HD video and smooth clear sound so stay tune and enjoy Liverpool vs Norwich City English Premier League EPL soccer live.",
      "writers": [
         "Lisandro Alonso",
         "Salvador Roselli"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1002539/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxNTY0NDI4Ml5BMl5BanBnXkFtZTcwODM3MjQzMg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Juan Fernández, Nieves Cabrera, Giselle Irrazabal | See full cast and crew »"],
      "reviews": [
         "Liverpool is a painstakingly meticulous study of an inborn loner's journey of solitude, soul-searching and guilt. It is a credible projection of one's decision to isolate and marginalise himself and the price to pay for leaving his everything behind. It is not an easy subject which one may hear about or witness day in day out. The film is rather empirical than critical and is conscious not to press hard for an answer or value judgment. I can fully understand why some people left the cinema halfway through the screening or even sooner. To some, the mentality and behaviour of the lead character is bound to be a completely alien if not incomprehensible concept. Certainly it is not their fault for not being able to understand, and indeed this may be a bliss for them. On this premise a relatively low \"popular\" rating is explained. However, to some in the audience, Liverpool can be a long-awaited mind-reader which crosses paths only once in a lifetime and can be a deeply personal movie which speaks loudly for and into their hearts. It is bound to be a mainstream miss. But it is priceless to some.",
         "This is one of those films, which gets better in your mind the more you reflect on it. The director before the showing, spoke to us about what he was trying to create, that is a simple piece about a guy's search for meaning. I thought he succeeded really well. The cinematics were bold, but worked to make an emotional impact. For example we see a whole four-minute single shot of our man packing his bag to leave the ship. No dialogue but the superb and understated acting by Nieves Cabrera leaves us in no doubt that this is a man in turmoil and on the cusp of facing his demons. In fact the single shot, no dialogue gambit is deployed a great deal in this film, but it works due to Cabrera and no little contribution from the stunning and unforgiving sub Antarctic scenery. This is a personal journey, brilliantly done by the director and his lead. Thought provoking and real sums Liverpool up for me.",
         "With less than 80 shots and faithful towards an idea of cinema, the fourth Lisandro Alonso film repeats the best of his previous works and goes toward a new territory, let's say, a poetic minimalist narrative, complex and simple at the same time, but always plethora of many readings. A man called Farrel works in a big ship, a sailor, of course. When he arrives in the southern city, Usuhuaia, he asks for permission to his captain to go somewhere; it seems to be her mother lives in a small village, not so far from there. But, there's a secret agenda which is about family matters but not strictly maternal issues, an undisclosed purpose till the very end, in which a narrative twist will be revealed through a \"fetish\" key-chain with a name on it. It's a movie about solitude and the longing for otherness, although it's also a portray of human beings as existential animals deeply rooted in landscapes, in this case the majestic cold mountains from Tierra del Fuego. Formally daring, there're many passages in this film which can be seen as paintings in movement, although it's a narrative decision its bravest choice: his main character, Farrel, will leave us 30 minutes before the film ends.",
         "Some crew members are playing a video game, just to while away the time that is getting long on a ship journey such as this. In the background, a guy, probably in his late 30s, is sitting quietly, having a smoke. He does not participate in the game, does not even care to listen to the exclamations of his comrades. In fact, he does not do anything. After some time, seemingly bored, he gets up and leaves the room, unnoticed. This scene, right at the beginning of Lisandro Alonso's 4th feature film, already says a lot about Farrel. He is a man that nobody cares about and, conversely, that does not care about anyone either. Or does he? Does he have any passions? In his cabin, there is just one picture on the wall, probably cut out from a magazine, showing an Asian beauty. What is the connection between her and Farrel? The only thing that we now know for sure now is that he is a far-traveled man. Does he have any human relationships? A few days later, we find out that he obviously has a daughter, a mentally handicapped one, called Analía. She lives in a remote part of Patagonia, together with her demented grandmother and an older guy called Trujillo who apparently looks after both of them. Where is Analía's mother? Has she left the country like her father did? Because Farrel, and so much is certain, has definitely left the place of his childhood and ventured out into the big world even before his daughter was born. He became a seaman and has never felt the urge to come back and assume responsibilities. Until one day his ship approaches his native Patagonia again, and availing himself of the opportunity of its resting at the harbor of Ushuaia for a few days, he asks his superior for leave in order to find out \"whether my mother is still alive.\" Ushuaia, considered the world's southernmost city, is shown as an inhospitable place, abounding with frost and snow. The place, as well as the surrounding countryside, may well be seen as an effigy of Farrel's soul which is equally cold and uncommunicative. He is never seen in a friendly conversation with anyone or even trying to establish a contact that goes beyond a mere asking for the information that is needed in order to continue his journey. It is a significant scene when he is waiting to get a lift, a young woman, Mariela, is waiting in the same room, watching TV, while he is sipping a coffee. Then the truck that will take them is announced, and for a little while they are walking alongside towards it, but not a single word is exchanged. Mariela is then allowed to sit in the driver's cab, while Farrel has to content himself with the load floor. This physical separation is another indicator for Farrel's estrangement from humanity. His behavior when finally at his home village is rather peculiar. Instead of revealing his identity, he prefers a secret approach, hiding himself in a shed. Just before freezing to death, he is found by Trujillo and brought into the house, where he slowly recovers but feigns to be unconscious when Trujillo addresses him, showing his recognition but also his disdain towards Farrel. While his dying mother is unable to recognize her son, there is some indication that Analía has an understanding of the fact that she is confronted with her father. When Farrel places a freshly bought loaf of bread on the kitchen table, she does not touch it but instead requests some money, a demand that the visitor eventually grants her. Why should he do so? Is it a feeling of guilt that determines his actions? After all, he shirked his responsibility for the family when he decided to leave the village without leaving any trace. Apart from the money, Farrel hands over another gift to the girl, before disappearing forever into the remoteness of the landscape: a key-chain, whose letters form the name of an English port city: L-I-V-E-R-P-O-O-L. It is unlikely that the retarded Analía knows the significance of this word, so it is up to the spectators to provide some meaning to it. Farrel has obviously bought it on one of his journeys, and more than just leaving a personal item of his as a sign of attachment it also conveys a message: It stands for his conscious decision to leave the limitations of his village and his family life behind and find a new destination - a resolution whose moral implications have to be judged individually by each viewer.",
         "This \"film\" has about 5 minutes of material, and even that is pretty uninteresting. Loneliness, bleakness, alienation, alcoholism, all have done before a thousand times better than this. Endless scenes of minimal content, virtually no dialogue, opaque characters, all add up to a movie that can be watched at triple speed with no loss, because, despite claims for it as a bleak masterpiece, there is no THERE there. How many times do we have to watch this man trudge through the snow, put on his coat, take off his coat, eat a meal? How did such a film ever get financed? Perhaps a state grant? Maybe some leftover funds to be distributed before the end of the fiscal year? There is no other explanation. Don't waste your time.",
         "Normally I like neorealism or just plain realism type films--films that show real people in a real environment. However this by itself is usually not enough... the main character or characters in these films whether professional actors or not...have to be able to carry the movie. They have to have some ability to show the theme of what the film is about. In this film it would be going back to a place you came from and finding the people cold or indifferent (his mother did not even recognize him). Fine this is a good theme... but the actor in this film does not react in a convincing way to that type situation...so what you end up with is a bunch of real life scenes and faces but nothing else in fact the sailor kind of destroys the film he could be left out and you'd have a better result.",
         "I went to see it bcs is Argentinian, from a region I didn't know. As a tourism ad it works pretty well. I loved the big, fat dark-gray rabbits. The ways and work of these people (assuming that everything show is real) is interesting. There is practically no dialog. It fits the solitude of the landscape, Farrell's incapacity of communicate, the slow motion of the locals living there. It surely leaves an impression but is it good? Not sure. Things I didn't like: Some of the camera \"tricks\", like not moving from a frontal take, not pan, not showing other people that enter the room and make noise in the background (or the video game screen that begins the movie) are good, but too much of something good is saturating/interfering. It also leaves the impression that the director -cannot/don'want- do it in a different way. In the same way, cutting short some scenes and leaving others longer would have made a more interesting movie. Some other things felt artificial: Farrel's accent and modisms don't match the rest of the characters, which are probably locals, non actors. I've seen absolute non-actors carrying over whole movies, notably in Italian early realism (e.g., \"La Terra Trema\", \"Germania Anno Zero\", etc.). This is different. The lines (few) given to these people seem not to belong to them. Like if they had selected the wrong professions or had no rehearsals. Farrel begins and finish conversations with non-chalantly city-like (Buenos Aires-like?) fast modisms of speech that don't seem to match the other's characters speech in pronounciation or speed. He is supposed to be from this same area. In retrospective, considering how little he interacts with his shipmates, it's unbelievable that he had changed his ways of speech by traveling. This separates him from the others, is that the intention? The daughter's non-sequitur, without voice inflections, repetitions of \"give me money\" made me think at first that she was disable in some way. Maybe she is just stunted-out by the area's living conditions and ennui... or by the screenplay lackings? The mother seems a real case of Alzeihmer; I would have appreciated less realism here, say a 70 instead of a 90 year old non actress. In any case, the dialogs are so trite that even the nonagenary manages. Nothing seems important or everything has the same importance; the movie has no center or care for the details. Even the sheep are not interested in the food, probably artificial grass."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "4L",
         "Black Forest Films",
         "CMW Films"
      ],
      "summaries": ["A merchant sailor returns to his home in Tierra del Fuego after spending most of his life at sea."],
      "budget": 0
   },
   "movielensId": 73492,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2008-10-30",
      "dvdReleaseDate": null,
      "directors": ["Lisandro Alonso"],
      "runtime": 84,
      "movieId": 73492,
      "title": "Liverpool",
      "mpaa": null,
      "actors": [
         "Juan Fernández",
         "Nieves Cabrera",
         "Giselle Irrazabal"
      ],
      "imdbMovieId": "1002539",
      "originalTitle": "Liverpool",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A sailor takes a short leave to visit his hometown and see if his mother is still alive.",
      "tmdbMovieId": 101006,
      "avgRating": 3.45,
      "releaseYear": "2008",
      "numRatings": 10,
      "posterPath": "/r5vQhOvIpjBHJxciXvR9B9dPC7d.jpg"
   }
}