{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0371683",
      "video": false,
      "title": "Games People Play",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Keith",
               "gender": 0,
               "credit_id": "535ae1e00e0a264fd8000680",
               "name": "Joshua Coleman",
               "profile_path": null,
               "id": 1112388,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Chloe",
               "gender": 1,
               "credit_id": "535ae1e80e0a264fe800064e",
               "name": "Dani Marco",
               "profile_path": "/wOARl9iGKemg0kVLVkoRnsjfv0u.jpg",
               "id": 205770,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "535ae1f80e0a264fd8000682",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "535ae1ff0e0a264fd8000684",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "535ae20f0e0a264fd50006c0",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "535ae2170e0a264fd8000686",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "535ae21e0e0a264fd8000688",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "535ae2240e0a264fe5000681",
               "name": "James Ronald Whitney",
               "profile_path": null,
               "id": 1085919,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "535ae22f0e0a264fe5000684",
               "name": "Neil Stephens",
               "profile_path": null,
               "id": 1313679,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.002375,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 266687,
      "vote_count": 0,
      "budget": 0,
      "overview": "In the style of many reality shows, six people (three men and three women) vie for a cash prize of $10,000 by performing risqué stunts and offering up scintillating",
      "similar": [],
      "original_title": "Games People Play",
      "runtime": 97,
      "poster_path": null,
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fire Island Films",
         "id": 22329,
         "origin_country": ""
      }],
      "release_date": "2004-03-12",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Ronald Whitney"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["James Ronald Whitney"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0371683/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MzcxMzUwM15BMl5BanBnXkFtZTcwNjU2MzAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joshua Coleman, Dani Marco, David Maynard | See full cast and crew »"],
      "reviews": [
         "I had the chance to see \"Games People Play\" at the CineVegas Film Festival and was highly disappointed. I don't recommend this film to anyone. The hardcore reality show junkies will be disappointed at the unbearably slow pace and lack of originality while the raincoat crowd will be unaroused by the lack of eroticism in the quasi-comic situations. The description the festival program gave the film sounded very intriguing, calling this it \"an extremely explicit and graphic reality show where the contestants bare their skin and their souls.\" That was all I needed. Curiosity took hold of me and I readily admit that I trekked to the theatre immediately and hoped to see both. In the nudity department, the film delivers. About 1/6 to 1/4 of the entire film has people in the buff. Full frontal, unabashed, male and female nudity. If that's all you want then you get it. Just don't expect it to be erotic because it's not. Regular people playing practical jokes in the buff is the furthest thing from a turn on I found. And that would be okay it the jokes were funny or shocking, but you see them coming from a mile away. The few times I found myself chuckling, my humor quickly left as I saw that the filmmakers intended to exploit their few original jokes past the maximum time allowable by law. All skits went on and on and on until they were far from funny and almost painful to watch. I had to wonder if the filmmakers had ever heard of the cutting room floor. The cutting room floor is where the rest of the film belongs. It also is unbearably slow and boring. Every situation is dragged out for as long a possible. We see the filmmakers select the cast for the game show for what feels like a half hour. Boring. Then we get intimate portraits of each of the six contestants (3 male & 3 female). While they are supposed to be baring their souls as the advertisements promised, what actually comes across is a fake, melodramatic whining in a pitch that is not too unlike that of fingernails on a chalkboard. Painful The contestants then do their challenges (the aforementioned practical jokes) and compete for points to see who will win. Why anybody cares would've been a more suspenseful premise if you ask me. Bad movie. Avoid at all costs.",
         "I think this film is a piece of garbage. I can't believe I actually wasted two hours of my life watching it. Sloppy editing and unclear motivation behind the whole piece make for a lot of confusion about what the point of it is. Some funny gags here and there sure, but nothing you haven't already seen elsewhere and pulled off a lot better as well. The rest of the film left me bored, annoyed and looking for something to put me out of my misery. I found the director exploitive and a host not fit to be in front of the camera and his cast of judges extremely fake and also better served not in the audiences vantage point. A sad addition to the realm of reality entertainment. Watch it to learn what not to do.",
         "A reality MOVIE. There are auditions for a new reality show in New York. Six young (20 somethings), attractive people (6 men, 6 women) are chosen. They are to go out (with hidden cameras) and do stunts that wouldn't be allowed on TV. The guys have to get urine samples from people; the women have to (literally) seduce delivery boys; the guys have to act out a scene on a casting couch and try to seduce the actresses; they all have to go out in Times Square and get total strangers up to their hotel room to be part of a naked, singing trio... There's also the auditions which include tons of full frontal nudity (male and female), simulated sex (straight and gay) and the stunts have the main six actors almost constantly nude. If you want to see attractive, young people nude this is your movie! Also the six are psychoanalyzed by a woman during the show (which only lasts 72 hours). They all have deep, painful things that come out and these are very disturbing to watch. The same thing during the auditions--they had over 100 people and all had to open up. These sequences are almost impossible to watch--the one that got me was a woman admitting she was bulimic and seeing her boyfriend out in the audience crying. They're fascinating but VERY uncomfortable. I almost left. Some people would call this pure exploitation but the actors knew they were being filmed and agreed to it. So--if they didn't mind.... So those scenes were extremely powerful. But the stunts were just silly and (despite all the skin showing) quite dull. However there was a twist at the end I didn't seeing coming and all six actors were exceptionally good. What I really liked was even though they were competing they were always very friendly and there for each other. That was refreshing. The nudity was certainly attractive...but it gets old quick and none of it was really erotic. Some people like this...others don't. Really hard to rate but I'll give it a 7. They DO have a sequel in the can that takes place in Hollywood. I saw a screening where one of the actors--David Maynard--had a Q&A afterwords. He defended the movie pointing out all of it was real and no one was forced to do anything. He came across as a very friendly, handsome guy--I think his talk helped boost my rating a little.",
         "James Ronald Whitney wastes no time in telling the audience that this film is a pitch for a possible game show, a game show that must be watched after the kids have been put to bed. Full-frontal nudity, a boatload of it, is the least surprising thing about the film. We are first made privy to the auditions for the film, which turn out to be very interesting in themselves. The entire film was shot in 72 hours, which is why the raw feel to its production is forgivable. If anything, it actually enhances the experience of watching it and lends some credibility to the film. The question the film asks the audience directly is: What would people do to win $10,000? While that amount is minuscule compared to the grand prizes awarded on other shows, it will no doubt be higher if the show is picked up by a network. Once the foundation for the film is in place, 90 minutes of adult pranks, voyeurism and stunning confessionals follow. Where most \"reality\" shows are inflated and overly self-conscious, Whitney's film does not claim to be something it's not and it makes no apologies for its content. It has a rare kind of integrity to it and ultimately, the viewer is rewarded with a satisfying ending, one that has you secretly craving a little more.",
         "Ever watch Temptation Island and wish that all those hot people would just get naked? Ever watch scare tactics and think they don't go far enough? Ever watch reality television and wish they had a show that included real actors, crazy scenarios and crazier pranks? Reality television today will be changed forever when the movie `Games People Play New York' is seen coast to coast. I recently caught this movie playing at Brenden theaters at the Palms Casino for the Cinevegas film festival and Boy was I impressed. Set in New York City this film/game/documentary/T.V pilot follows three actors and actresses as they play adult games on ordinary people. Not only does it raise the bar on reality television but it raises the question of is reality television addressing reality? A must-see movie of the year creates an entirely new genre of film never seen before.",
         "While at Cinevegas 2003 I came across an intriguing new film by the name of \"Games People Play\", a film I enthusiastically recommend all too watch. Beginning as just a casting call, the film progresses into a fascinating series of complex counseling sessions, hilarious adult pranks and has a twist that leaves you wanting more. This movie is what reality television has been lacking. A combination of Candid Camera, The Real World, nudity and a bunch f*^&ed up individuals who end up creating a thrill ride that will have you talking for weeks. Reality-whore's throughout America will not be disappointed. You are immediately entered into the director's journey to create a television pilot that is being pitched to the networks. The journey continues as you quickly pass through the sensory-invigorating screen tests and true stories. The mood quickly changes as the hotter-then-fire cast of six is chosen and the games begin. From pranks on pedestrians, to delivery boys, to the titillating casting couch the game jumps back and fourth to the intimate true-stories of the contestants that will leave you weeping. This refreshingly original, campy and wholesome movie will leave you contemplating, happy, distraught, and utterly in disbelief of what you just watched. An original movie I recommend for everyone to watch.",
         "This flick is a prime example of all that is wrong with independent film today. Take a damaged egomaniac, some money, and desperate actors and you get this disaster of a \"film?\" If you enjoy this consider therapy. Were it not for the publics insatiable appetite for the lowest form of entertainment (ie. reality tv) this turkey would be roasted for Thanksgiving. Mr. Whitney uses the cast to work out his own issues, probably masturbating during the process. What could be seen as \"edgy\" is in really just a desperate attempt to get on the radar. Support of this film constitutes acceptance of mediocre to horrible production values, and a cheap payoff as entertainment. Watch out there are more coming.",
         "Why not throw yourself down the stairs? Because it hurts. Well that is the feeling you get when you sit through this awefull movie. Would I recomend it? Not to people I know. I would to people I hate and want to torture. Was it that bad, not the worst I have ever seen, but was screaming \"I want to be somebody!\" Much like most reality shows, no one will ever be famous from this. I think this will hurt their careers more than help. Editing help, get off the emotional roller-coaster, show the funny stuff, not the garbage. The best was last, and the whole movie should have been this sort of candid camera style movie has been missed by many and could have been the market James Ronald Whitney was looking for, but missed by miles.",
         "I just saw the film Games People Play: New York. In the wake of Janet's boob and the whole \"Reality Television\" craze, this film could not have come out at a better time. Every week we are subjected to a number of reality shows that offer us glimpse into the lives of people we've never met in person, but by the end of the season, we know what they eat, how they dress and even how they kiss. The only problem is that what we watch is cropped and watered-down so it won't offend the adults and or corrupt the kiddies. Reality is life and life never gets to be edited and restricted. Games People Play: New York is an unrated look into the uninhibited world of reality games where anything goes...including cursing and full frontal nudity. This film shows us exactly how far 6 actors are willing to go in order to be famous and win a cash prize...with a great twist. Check this one out of you really want to see the ultimate reality game.",
         "It captured my attention and I thoroughly enjoyed it. It was quite different from any other film I've seen. All the elements of creativity, deroulement, interaction among characters, and great writing came together to create a viewing experience that has yet to be experienced by many. Great job!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Fire Island Films"],
      "summaries": ["In the style of many reality shows, six people (three men and three women) vie for a cash prize of $10,000 by performing risqué stunts and offering up scintillating confessionals on camera."],
      "budget": 0
   },
   "movielensId": 7350,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-03-12",
      "dvdReleaseDate": null,
      "directors": ["James Ronald Whitney"],
      "runtime": 97,
      "movieId": 7350,
      "title": "Games People Play",
      "mpaa": "",
      "actors": [
         "Joshua Coleman",
         "Dani Marco"
      ],
      "imdbMovieId": "0371683",
      "originalTitle": "Games People Play",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "In the style of many reality shows, six people (three men and three women) vie for a cash prize of $10,000 by performing risqué stunts and offering up scintillating",
      "tmdbMovieId": 266687,
      "avgRating": 2.64286,
      "releaseYear": "2004",
      "numRatings": 7,
      "posterPath": null
   }
}