{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1104694",
      "video": false,
      "title": "Garbage Warrior",
      "recommendations": [],
      "backdrop_path": "/aW7wnLeGCIATXpDl4BEqyYjkjvI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael Reynolds",
               "gender": 0,
               "credit_id": "52fe45c8c3a368484e06eb31",
               "name": "Michael Reynolds",
               "profile_path": null,
               "id": 102960,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chris Reynolds",
               "gender": 0,
               "credit_id": "52fe45c8c3a368484e06eb35",
               "name": "Chris Reynolds",
               "profile_path": null,
               "id": 102961,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Shauna Malloy",
               "gender": 0,
               "credit_id": "52fe45c8c3a368484e06eb39",
               "name": "Shauna Malloy",
               "profile_path": null,
               "id": 102962,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dave DiCicco",
               "gender": 0,
               "credit_id": "52fe45c8c3a368484e06eb3d",
               "name": "Dave DiCicco",
               "profile_path": null,
               "id": 102963,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45c8c3a368484e06eb43",
            "name": "Oliver Hodge",
            "profile_path": null,
            "id": 102967,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.153182,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 29110,
      "vote_count": 3,
      "budget": 0,
      "overview": "Garbage Warrior is a feature-length documentary film telling the epic story of maverick US architect Michael Reynolds and his fight to introduce radically sustainable housing. An extraordinary tale of triumph over bureaucracy, Garbage Warrior is above all an intimate portrait of an extraordinary individual and his dream of changing the world.  Written by The Works International",
      "similar": [],
      "original_title": "Garbage Warrior",
      "runtime": 86,
      "poster_path": "/3RMgOn5PmdjXmJy5FaipBqPnKWt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-04-19",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.garbagewarrior.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oliver Hodge"],
      "runtime": 86,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1104694/",
      "coverLink": null,
      "actors": ["Stars: Michael Reynolds, Chris Reynolds, Shauna Malloy | See full cast and crew »"],
      "reviews": [
         "Mike Reynolds is the \"garbage warrior\", an architect who has been designing homes from refuse and natural objects (largely dirt) for roughly forty years. This documentary opens up his world to viewers who otherwise would not consider such living possible, and certainly wouldn't be aware of the potential comfort levels available. I was shown this documentary by a friend who, to say the least, is fascinated by Earthships. She has met Reynolds, been in an Earthship and swears that some day she will live in one -- something I find to be quite plausible. My enthusiasm doesn't come close to hers, which made for an odd viewing experience (her excitement can be overwhelming), but it's a good film that should be seen by more people. Reynolds' ideas of \"radically sustainable living\" and \"Earthship Biotecture\" need to be ported out to other communities and get recognition for their amazing achievements. The houses are not perfect -- some leak, some have little or no temperature control -- but they are experimental, and Reynolds and his crew are still learning. Objections aside, the good that can come of these homes is outstanding -- complete \"off the grid\" power, self-producing food, and a waste system that cleans and filters \"black\" and \"gray\" water. I'm somewhat skeptical of how well these ideas would work on a mass scale. However, even if they didn't, it seems fairly safe to say that certain aspects could be adapted into rural or urban settings... and any effort to get energy independence and sewage filtration into the mainstream is welcome. World governments are taking important steps towards renewable energy, but after seeing this film, you may start to think the answers have been here for decades and we're just dragging our feet. My only real complaint with the documentary is that it is by no means objective. Reynolds is cast as the hero and as something of a savior. Now, this is not to say that he's not a hero, because he is. But without hearing from his detractors (aside from some clueless politicians) this film comes off more like an infomercial, which leaves a bad taste in my mouth. It could simply be that nothing bad can be said, though. My petty objections aside, Reynolds is an unsung hero and his work really does need to get noticed by more. Even those who are environmentalists may not familiar with his work, which is a shame. The man is almost dead... let's get him some attention before that \"almost\" is gone.",
         "The first part of this film shows the huge amount of wood, and manpower, that is being used to build an Earthship. Just look at the cost of Earthships, and you'll see that they cannot be the solution to the problems they claim to solve. Strawbale houses can be built for £10,000 (Google \"£10,000 Strawbale House\") - Brian Stinchcombe built such a house in the 1990s, and of course, the local planning officers had to put a stop to it, because their rich building industry friends, (who would never give them bribes of course), couldn't allow the rest of the population to see that you could build a house for only £10,000, and a super insulated, super quiet, super eco-friendly strawbale one at that. When are we going to see a film about Brian Stinchcombe's £10,000 strawbale house, or any other £10,000 strawbale house? Earthships use the most labour intensive (and stupid) form of construction possible - tyres rammed with earth.",
         "I found this documentary online after seeing an Earthship house outside of Taos NM. What the houses represent is compelling - self-contained off-the-grid houses built mostly from local materials. Dozens of these houses dot the high desert blending into the landscape. The movie is about Michael Reynolds, the man behind these novel structures and his thirty year journey. Initially, he is a dreamer, then a designer and experimenter. Over time people join him and his vision starts to spread. He and the people he attracts come across as a little crazy, but in a fun way. There is a bit of real-life problems for the protagonist. The movie shows how he adapts to some serious adversity. This makes the movie even more interesting. Perhaps the forces arrayed against him are simplified and not given a fair shake in the film that approaches the issues firmly from the point of view of Michael Reynolds. That's okay really. Michael and a lot of the people he deals with come from two different worlds, Most of us were born inside the system or 'the box'. Michael Reynolds (and a lot of people) think the system isn't sustainable. He is looking for solutions outside of the box. This is the crux of the movie. If you are worried about where things are headed, the movie should give you a little hope. And that isn't a bad thing.",
         "Overall Garbage Warrior was a documentary focusing on the architect Michael Reynolds and his advancements in ecological and sustainable living. Michael Reynolds is a trained architect of the University of Cincinnati. Soon after completing his studies Reynolds realized architecture as it stood then was worthless in the sense that it was not about people of the planet and what they needed. He then decided architecture as he knew it did not address the issues we are faces with and don't guide us where we need to go. Mike has since displayed strong focus in the efforts of these issues that people and the planet may encounter. The architect is obsessed with his work and often dreams of his projects. Michael Reynolds devotes his life to revolutionizing the world of architecture with a focus on ecological and sustainable living. Ecological and sustainable livings are seen as issues that need to be addressed NOW rather than later. These include issues of the quality of life and survival, working to discover methods of living that allow people to take care of themselves. The documentary stresses limited resources and the planet running out of oil and fresh water while also revealing issues of ozone depletion and their relation to population growth, thus expressing the planet will soon be uninhabitable. Michael Reynolds works to fight the ideas of big cities and infrastructure. He creates infrastructure inside of the structure, putting matter of life into the people's hands with potential to enhance the planet. These visions shaped the fundamental ideas of Reynold's earth-ships. Earth-ships provide their own infrastructure: providing internal sewage, growing its own food, and is also self-insulated. These earth-ships are glorifies in the documentary as big steps in directions for humanity. Earth-ships are self-sustaining and essentially provide no bills- they provide their own food with animals, bugs, and trees, and introduce ideas of thermal mass or self-insulation, along with other environmental alternatives. These earth-ships are stressed to be experimental houses. It takes clients to express Reynolds' visions physically and they are often cases of trial and error. Many times these experiments fail and the crew is sued for mistakes in building. Obvious examples of these earth ships are provided in the documentary such as Reynolds' \"Thumb House\". This house uses bricks made of mostly beer cans tied together with wire. This innovation lead Reynolds to other environmental building materials, eventually just using cans and bottles with mud to create walls of homes. This house also helped in the forming of ideas, such as orienting windows to the south for solar gain. These homes became more about function and possibility then of beauty, representing trial and error, experiments, and learning. Although each theory hypothesized and later proved by Michael Reynolds is not explained throughout the documentary it is easy for the reader to gain insight on the immense amount of knowledge Reynolds bears on his topic. Michael Reynolds, as portrayed in the documentary, uses his sustainable houses to aid in situations of natural disaster. In the case of the documentary, the architect and his crew build earth- ships in India made out of recycled materials. These earth-ships are proved beneficial economically, providing advantaged to the victims of disaster with the lack of bills and the decrease in the general cost of living in a self-sustaining home. By building these earth- ships in places of need, Reynolds' is not only able to help the environment but also to enhance the economy in these places as well. It is important to save resources by reducing the usage or electricity and gas but also to save money by cutting the costs of living and the dreadful bills that are seen by Americans as every- day expenses as well. Michael Reynolds is not the only master-mind behind these earth- ships though; he is generally accompanied by his crew, generally a group of men with an almost paternal, parasitic relationship to Reynolds and the earth-ship. Seen as a giant family, all members of the crew including Reynolds work towards a common motive of creating a self-sustaining society. The crew is responsible for building their own sustainable community, each granted 10 acres of their own land. An example of these communities would be the \"Greater World Community\" where crew members live with their families and teach the ways of their ecological studies to those around them. The members also work in a collaborative effort to create a sense of family and bonding and generally all feed off of the hard work and successes of one another. These are trained architects working together through physical labor and innovative thinking to create a revolutionary society that is not dependent on limited resources. It is important to exemplify not only the beautiful effect of stain glass created when burning plastic bottles into walls, but also to notice the architectural and environmental break-through these communities present. This was an enjoyable documentary to watch. I found myself fascinated with the work of Michael Reynolds. The documentary glorifies Reynolds almost in a sense of a God or a genius, which is not quite the entire case. The architect provides an example of larger-than-life thinking; who knows if earth-ships are really the answer to our problems or a temporary collection of recycled materials? The ideas behind his advancements and the evidence it provides obviously support his ideas of an architectural revolution with an emphasis on sustainability without exact portrayals of the success or failure of these experiments. Personally as a student of urban architecture, I envisioned Reynolds' ideas of sustainability and earth ships but on a larger scale of an urban area; imagining these structures or earth-ships as skyscrapers or multi-level structures. The documentary mostly places earth-ships in a rural or dessert-like site which may be unrealistic if these are being seen as revolutionary. Imagine earth-ships and the role they could play in regulating pollution in industrialized areas; now that could be closer to revolutionary.",
         "Garbage Warrior is a documentary about an \"Eco-architect\" based in New Mexico named Michael Reynolds. Director Oliver Hodge gets a chance to focus on the life and works of this unique architect who develops homes out of using recycled materials like old tires cars or soda cans. This is truly a great film and I recommend everyone to watch this documentary because it will teach of the current and pressing issue of environment. The main point of this film to educate people on how there is a possibility to be completely self-sufficient but hardly anyone is pushing for this cause. Michael Reynolds feels that since we are part of nature there is spiritual connection and we have a responsibility to make this connection flourish. Michael Reynolds started began his career in the 70's, he had a very different set of mind believing that what architecture was providing for the world was pointless. He became very interested in building affordable housing that used recycled materials and where completely self-sufficient, like create its own power, or filter their own water, and/or grow their own food. Houses like this are called earth ship homes, while they sound very radical they turn out to be very beautiful. There is one scene where he is explaining the plan for his latest house and he was describing how trees will be growing in the center of the house and that birds will be able to live in there. He wanted to totally merge nature with modern living. In the 70's though was the first oil crisis so that gave him the incentive to start creating prototypes to present to people and companies. The first projects he came up with were unusual but he had faith that one day they would get more traction and more people would follow in his footsteps. HE states in the film \"I always thought if you are doing things right for people, they will find you\" this mind set is the reason he was able to continue his work to this day. All of his ideas have been trial and error, he did address the fact that no all of his ideas have worked and since this such an experimental project that there is a lot of room to fail. But this idea of thinking outside the box is what I believe to be the theme of this film. Reynolds was doing all of this work outside of the law and since they are self-sufficient buildings they didn't need any of the public services. The law quickly caught up with him and he was restricted so badly by the authorities of New Mexico that he quit working. Reynolds faced many adversities in this process and they labeled his work and unsafe and unhygienic. He fought relentlessly against this regulations and he wanted to create a bill that allowed areas of land to be considered land where experimental can be developed. By creating this bill the regulations that stopped him in the past would be more flexible so he could continue to work. Hodge was able to follow Reynolds through long process of the New Mexico administration. Reynold's license as an architect was revoked yet he still fought very hard to show the state legislature that his work was beneficial to not only Tsao, New Mexico but the globe as a whole. After years of hard work and persistence he was able to get the bill passed and was able to continue his work not only in New Mexico but in Honduras, Bolivia, and France. There is portion of the film where Reynolds goes to the Andaman Islands after a tsunami hit to see if he and his crew could provide any help to the redevelop the islands. He was able to design a house that captures rain water and stores it in the cellar, while air is drawn in over the water to keep the air cool. This house was built out of tires and old bottles. The film is very unique because of how it is able to capture so many things within it. Yes, it follows Michael Reynolds and his team but it follows the continuous battle of society becoming more Eco-friendly. It is people like Michael Reynolds who are the ones who inspire because it is easy to see that he is willing to die for what he believes in. Time Out New York says \"Perhaps one of the primary reasons for the film's success is that the director felt it important to not preach to the choir: 'I wanted this to go out to as wide an audience as possible to get the notion of sustainable living to an audience that wasn't necessarily involved in green issues.' He notes that the film, which has been released in numerous countries, has already helped Reynolds win new commissions, including a seven-story building in Norway proving that Garbage Warrior succeeds as more than just a movie.\" I feel that this article expresses how much this meant not only to Michael Reynolds but to director Oliver Hodge. It seems like that this is what Hodge and Reynolds were trying to achieve this whole time with this documentary, all they needed to do was get the word out and with more people knowing about the benefits then more houses that are self-sufficient will be created. Reynolds expresses many times that humans will not be able to live on this planet much longer, and if don't make any changes soon then will be too late. I really enjoyed this film because it shows the creativity some people in this world have, while it is very hard to believe that someone builds homes out bottles and tires I would recommend anyone and everyone to watch this film. While watching this film you will learn not only the hardships of making change in today's system but see some truly beautiful homes. Sources Cited 1. Time Out New York",
         "In Garbage Warrior, Mike Reynolds captures people's imagination of new ways of building homes with renewable products such as beer bottles, tires, and plastic soda bottles. The homes seem to be so beautiful that it could entice anybody to live in. The documentary depicts the journey architect Michael Reynolds endures in trying to create a community that is self-sustaining. He believes that there is a spiritual connection to nature that there needs to be a focus on, and that can work away from mass consumption and mass production. He is seen as a pioneer and true humanitarian that could actually change New Mexico's standards of home improvements. The documentary main arguments are the endless possibilities of using and recycling waste products, an ecological environment, bureaucratic attack, and strong visionary attempt. He created \"Earthships,\" defined as passive solar home made of natural and recycled materials, thermal mass construction for temperature stabilization, and renewable energy and integrated water systems make the Earthship an off-grid home with little to no utility bills. He started to turning away from his label as an architect and started to consider himself a biotecture, which he defines as a profession of designing buildings and environments with consideration for their sustainability with a combination of biology and architecture. After creating these communities that were self-reliant, this created friction with the developers and the state legislators in New Mexico because he did have his homes regulated up to housing codes. As the documentary progressed, the destruction of his communities, when developers labeled these communities as unsafe and unhygienic, caused him to reevaluate his goals. After he was revoked his architecture license, he made it his mission to take a state legislative role, and lobby for architects to create more homes that would be self- sustaining. As he was continuously being shot down for his ideas, he decided there was no hope in changing the standards set by the state, but he still does not give up. This demonstrates the states unwillingness to move away from making profits and establishing a better way of way of living. While politicians and lobbyist are ignoring the severity of the global warming and the intensity of droughts and extreme weather, Michael Reynolds is called to India after a tsunami strike causing hundreds of people to lose their family members and homes. He can utilize his skills without restrictions because of the people's desperation to solve the problem. The purpose of this segment was to show that desperation is the new father of invention. Oliver Hodge portrayed most of the politicians as villains and Reynolds as an unsung hero. There is an urgency that Reynolds express that humans are not going to survive on this planet for much longer if conservations is not taken into action. But there is a downside, he is only working to create a test site rather than actually create homes for people to live in. Based off of the film, there seems to be a fear of conservation because the awareness was slim. His home ideas needed to be altered because the people of the state needed to see an economical prosperity. People could not understand why these Earthships would be better alternative. So then the argument is, how much of it is actually is his idea anymore since he changed so much of it? Filmmaker Oliver Hodge solely targets on Mike Reynolds's point of view rather than providing an on camera interview with a developer or regulator as to why the communities were shut down. Why were these homes so unsafe? The argument seems to be very one-sided. There were some issues that were dangerous for the people that would have moved in. For instance, when they had created an Earthship with complete windows, the home was too hot and started to melt everything that was made of plastic. There are reasons for these regulations, so that peoples' lives would not be put in danger. Also, these Earthships could not work in everywhere in the United States, but it could allow people to spin ideas off of these inventions. It takes years before Reynolds ideas are approved by legislators, so that he can construct only a test site. My questions are then: how much would the system have really changed if he had gotten approval from the beginning? Could he have gone further if he had just regulated his sustaining ideas up to many codes? Does it take a person to conform to regulation to make a real change in the system? As an architect, he should have known that his communities would not last because his Earthships were not up to code. Someone was bound to find his communities unsafe. On the contrary, these risks need to be taken in order to develop better ideas and work towards homes that can be self-sustaining. This does not excuse the state from its responsibilities of changing the standards of what is acceptable of construction materials. I really enjoyed the documentary's core honesty of how stubborn changing the system can really be. Garbage Warrior makes it seem impossible for any change to happen to make an impact on society, which can be intimidating. In my opinion, it seems that Earthships would only work in an environment that was humid, dry, and tropical. How well would the homes stay together after a monsoon in India or heavy rainfalls in California? This documentary is mostly targeted to people whom live in a desert. But it does offer an insight of how menacing and tedious the system really can be. There is a sense of hope that Reynolds offers because if people gather together to change the standard; it can make a real impact. He could not do it without his allies in legislation and his fellow architects and builders.",
         "Michael Reynolds is a man who has gone through formal architectural training and earned his license, but he does not fully believe or accept everything he has learned. According to him the field has so much power to change how we live and how we use resources but architecture, specifically homes, hasn't gone through any radical changes. Mike Reynolds strives to change this and his innovative \"earthships\" are proof of this. Earthships are homes that are self-efficient, sustaining and are mostly built from recycled materials, or what we would consider garbage. This means that the homes do not need any outside energy or heating as these are provided with the construction of the home. They are also less costly to build since materials like tires, aluminum cans, and bottles are used in the homes' construction. Solar panels provide energy, rainwater is collected for the water source, large windows allow solar heat to warm the home, and an in-house greenhouse allows for plants and food to grow. His purpose in making these homes is to live off the grid, correctly use the earth's resources as well as reusing and re-purposing garbage that would otherwise harm the earth if it were to continue to build up. This film Garbage Warrior documents the construction of these earthships, his own life, and the efforts he goes through to change how we think about housings. The most captivating aspects of this film are the homes Mike Reynolds builds. I find what makes up the homes and there purpose is extremely innovative. Unfortunately, not much time is spent on this. The film is very much focused on Reynolds as a person and how he defies traditional architectural discourse. While I understand that it is important to get to know this man, I feel way too much time is spent on this. Going deeper into the construction process of an earthship and their history would've made a more effective film in my opinion. His work is so remarkable that it is in fact capable of speaking for itself and relaying this message of who he really is. A person's identity and character can be reflected through what they create so this is why I say that there is really no need to excessively focus on him or the people he hangs out with. This film is instead too focused on the people who do the work and not their actual work. It's nice to know that there are others in the world who support Reynolds' projects, but is this something new that we are learning? I feel like it is obvious that there are people who believe in what he does, that's why there is a documentary film being made. The last half of the movie is where my interest was fading because of how it seems like Reynolds is being put on a pedestal. This part of the film is spent on the process of Reynolds trying to pass new legislation which would allow him to build his earthships but as tests on test sites. In these moments he comes off as whiny and impossible as if he is the only one who has had trouble passing legislation. Passing laws that only benefit those who can make money from them happens all the time. Even when people are fighting for something that can benefit most people and change the world, the law is not passed. The film makes Reynolds seem like he is a victim, but like I said he is not the only person in the world who has gone through this. Because of this, there are too many instances in the movie in which Reynolds is separated from the audience. He often comes off as being above others it seems, because he is the only one who cares about these issues and he builds these houses. This is my biggest issue with the film and this is why I think that less focus on Reynolds' personal life would have made for a better film. What I do like about the documentary is that it exposes the personal agendas and stubbornness of our bureaucratic system. Even though Reynolds is raising new points and bringing up extremely relevant issues, it takes some time before the legislation's benefits are seen and it is passed. This is something that happens all the time and everybody, even those who have the best intentions, goes through this experience. The film also shows us the alternative of living off the grid and the benefits of doing so. While the film does have a bunch of new information to offer, it does not succeed in presenting us this information. Glorifying Michael Reynolds for the work he is doing is where the film goes too far. There are many innovative minds before him who have accomplished such feats whose stories are untold, but the film makes it seem as if Reynolds is the only one. There needs to be more balance in terms of who he is and what he builds. A little history on alternative housing wouldn't have hurt either. I'm sure it was not the filmmaker's intention to make Mike Reynolds come off like this but they succeeded in doing so. More focus on his work and his development of these ideas would have made Reynolds appear to be someone who is well invested in transforming housing and architecture and cares deeply for the Earth.",
         "The documentary garbage warrior primary focus was based on ecological concern, and sustainable housing for all. It was very important because it will bring affordability of housing comfort to virtually everybody irrespective of societal status. But, due to the fact that its concept went against the normal bureaucratic acceptable standard of the capitalist ideology, the idea was vehemently antagonized. However, what they failed to recognize was the fact that the idea was a genuine movement that was born out of reality by the few who had witnessed it. The outline on the documentary main arguments can be classified as follows: recycling of waste product, ecological friendly environment, bureaucratic attack, and strong visionary attempt. Garbage warrior documentary emphatically proved that recycling of waste product could be useful in another dimension by turning it to remarkable materials for the construction of solid building for the betterment of many which had never been put to practice by any known person before; but architect Reynold was able to push his idea into reality for all to see the visibility of the structures. On creating an ecologically friendly environment; there is no doubting the fact that the world as a whole is highly polluted by many scientific chemical emissions that had created a lot of hazardous health problems for many people throughout the world. But, this innovation has brought up a different approach to the way and manner houses are being built or constructed through the regular conventional ways of doing things that had contributed to the deterioration of health of many, while uncountable souls had also been lost through it. Moreover, the bureaucratic attack that came the way of architect Michael was highly unprecedented in his attempt to push his idea across the bureaucratic conventional ways; because it was more or less an affront and somewhat confrontational to the already established status quo which was not meant to be challenged by not just anybody. But, due to strong visionary mind of architect Reynold, he never relent in his efforts to get things done, as he made his focus the priority of his mission to achieve what he initially set out to do by not allowing all the obstacles that came his way to deter him of his vision. Because he was very convinced that his idea was one of a kind that could change and turn the old concept around for better. The basis of the argument on the issue raised in the documentary could be said to be the durability, acceptability, and comfort-ability of the projected proposed housing idea movement; which came as a surprise to the capitalist bureaucrats who never wanted an alternative view to their already established ideology. But the practicability of eco-friendly housing structure was made possible by architect Michael and his few allies who had built some and had started living in it. The major fact of the matter is that they had succeeded in generating their own solar energy, growing their own food, providing their own water, and supplying their own heat, as well as recycling their waste without the support of any modern technology which is at the cost of cut throat rate. The combination and compilation of many waste products such as plastic bottles, empty beer cans, old tires, and other waste items put together by this genius architect was never thought to be possible, talk less of having acceptance in Andaman Island after the deadly tsunami attack. In furtherance of the set out goal, it was a mission accomplished for architect Michael and his team; but a no go area for the capitalist who never wanted a prospective change that will benefit the mass majority. Because the prospect of its success will be a huge compromise on their part. Although, no institution will like to lose its domineering trend, but the only thing that is constant in life itself is change; hence, sooner or later further research will emerge to give this noble development the authenticity it deserve for the greater advantage of the entire humanity. In evaluating the argument thrown up in the documentary Garbage Warrior; many factors will have to be put into consideration in the sense that there are already established procedures and protocols that must be dully followed before any meaningful housing structure can be erected. However, despite the fact that rules and regulations must be respected to promote a decent society. We should not also forget the fact that it is to the advantage of all to equally give room to positive change irrespective of where it is coming from; because nobody could claim monopoly of knowledge, and the way architect Michael went about his research and idea was never armful to anybody. In fact he was always ready to subject himself to the authority to proof his discovery whenever they are ready to listen to him. This conclusion could be attest to in many of the comments relayed in the course of the argument by various people, due to the prospect it will have on their wellbeing, and it equally shows how worried and concern many feel as it relates to the environment which they knew very well the eventual consequence will be to the detriment of many if the eco-friendly idea is not looked into. The quality of the data had a very good analysis because it was well looked into, and without being biased Reynold himself was a qualified architect that pretty much knew what he was doing. Also the effectiveness of the argument was very catching, and the presentation was equally impressive for adequate understanding of the issue. The missing part was not really visible for many to see, so it cannot be controverted as such. Therefore, without any fear of contradiction, I can convincingly say that the documentary surely added up to my knowledge of understanding on urban planning issue.",
         "The early to mid-2000s have brought us a new genre, the environmental start-over film. Whether it's plastic, trash, food, plastic bags, this waste genre is one that has been crying out for exploration. In keeping with the overall cultural trend, the films are mostly documentaries. They do well raising our consciousness level, even if only temporarily. This film does not quite pull it off in my opinion, but it does have something to contribute. At the beginning of Garbage Warrior we are presented with images of building in progress and, along with the narration, we are meant to see the structures as really impressive. But his houses are not things of beauty from the outside (they are better on the inside). It would have been better to have approached them from a more humble perspective. Meaning, show a leaky sewer system at first, and then build from there - these are impressive houses because they are self-sufficient - lower our expectations and then build them up. Presenting those rather misshapen structures as objects of impressive architecture left me skeptical right from the get-go, and that's not the way you want to start a film. I do come to the end and of it, and realize that the achievement of beauty is actually a lesser point, one perhaps that Reynolds might one day concede. Nevertheless, had his ego permitted, some architect with some taste as well as skill could have come to his aid and helped him produce nice-looking houses from the outside. This would have gone a long way towards furthering his overall goals of sustainable living, especially in the eyes of key decision-makers. Second point: he says that cities are dead - that people are going into the cities to mine the materials. I had to ask myself, having lived in a city for 20 years and that is now adding 1,000 new residents every month, just what he was talking about. I live in the city, and I don't have a car. I ride a bicycle. I live in much less space than those houses, that is for sure. Still, I realize that even American cities are very wasteful when it comes to energy efficiency, and until we take seriously not just per capita output, but also total output of carbon and pollution, we won't really have an honest discussion. What I'm trying to point out is how dishonest and a bit off the charts his notion is of cities being 'dead,' or energy inefficient. What about the prime importance of community? Oh, and what about fossil fuels? It is undeniable that the inhabitants of those earthships have an extreme reliance on the car. What about all the plastic they use and I'm not talking about in the building (drinking out of plastic cups during the b'ball game - plastic containers of liquid soap)? He says his house has lasted 20 years. So what? Big whoop. You're an architect and you're bragging that a house you built has lasted 20 years? Shouldn't it? And so, they become a subdivision. Is that truly sustainable? Starting a new community on land where previously there were no humans? Can we see the sewage system, please??? Can we see how it all works? Heating and cooling? Prove it. We need proof. I'd like to hear more about all the failures. I'm not sure he is a man who inspires a lot of trust. Run in with the authorities - yes the situation around him is worse after he had to \"conform.\" It's only at that point that I began to have a even a small amount of of sympathy for him. And the tsunami and going to Asia? Much more sympathy. Also, I admire his lobbying efforts - more sympathy for him there. What a number this film does! But to be really really radical, retrofit an already existing community. Why do people think building is energy efficient? Retrofit old buildings. The more tastefully and beautifully, the better. Please - let's not leave style, aesthetics, and proportionality out of the picture. From time to time, I see this type of passionate environmental idealist in the city. The problem is, so often these kinds of people get corrupted when they don't get their way and become small-scale dictators. I see it time and again, and what's worse is that they are very ineffective. Michael Reynolds was able to reach and go further and have a degree of success probably because of being in the West and perhaps because of his own integrity (hard to say) - that Baptist background was good for something afterall. There were two concepts that he brought up that were intriguing. The idea of going outside the law to get the information. And the idea of his own personal evolution. I hear what he says and appreciate it. But still, there is a very very very fine line between renegade and ineffective, hypocritical hippie."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "Imagine a home that heats itself, that provides its own water, hat grows its own food. Imagine that it needs no expensive technology, that it recycles its own waste, that it has its own power source. And now imagine that it can be built anywhere, by anyone, out of the things society throws away. Thirty years ago, architect Michael Reynolds imagined just such a home - then set out to build it. A visionary in the classic American mode, Reynolds has been fighting ever since to bring his concept to the public. He believes that in an age of ecological instability and impending natural disaster, his buildings can - and will - change the way we live. Shot over three years in the USA, India and Mexico, Garbage Warrior is a feature-length documentary film telling the epic story of maverick architect Michael Reynolds, his crew of renegade house builders from New Mexico, and their fight to introduce radically different ways of living. A snapshot of contemporary geo-politics and an inspirational tale of triumph over bureaucracy, Garbage Warrior is above all an intimate portrait of an extraordinary individual and his dream of changing the world.",
         "Garbage Warrior is a feature-length documentary film telling the epic story of maverick US architect Michael Reynolds and his fight to introduce radically sustainable housing. An extraordinary tale of triumph over bureaucracy, Garbage Warrior is above all an intimate portrait of an extraordinary individual and his dream of changing the world."
      ],
      "budget": 0
   },
   "movielensId": 73868,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-04-19",
      "dvdReleaseDate": null,
      "directors": ["Oliver Hodge"],
      "runtime": 86,
      "movieId": 73868,
      "title": "Garbage Warrior",
      "mpaa": "",
      "actors": [
         "Michael Reynolds",
         "Chris Reynolds",
         "Shauna Malloy",
         "Dave DiCicco"
      ],
      "imdbMovieId": "1104694",
      "originalTitle": "Garbage Warrior",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Garbage Warrior is a feature-length documentary film telling the epic story of maverick US architect Michael Reynolds and his fight to introduce radically sustainable housing. An extraordinary tale of triumph over bureaucracy, Garbage Warrior is above all an intimate portrait of an extraordinary individual and his dream of changing the world.  Written by The Works International",
      "tmdbMovieId": 29110,
      "avgRating": 3.71739,
      "releaseYear": "2007",
      "numRatings": 23,
      "posterPath": "/3RMgOn5PmdjXmJy5FaipBqPnKWt.jpg"
   }
}