{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1149400",
      "video": false,
      "title": "Note by Note: The Making of Steinway L1037",
      "recommendations": [],
      "backdrop_path": "/3HzISgYhyjMgiJySpfIybaTHmA7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4532c3a368484e04d909",
            "name": "Ben Niles",
            "profile_path": null,
            "id": 97162,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.301552,
      "production_countries": [],
      "id": 27182,
      "vote_count": 3,
      "budget": 0,
      "overview": "A feature-length independent documentary that follows the creation of a Steinway concert grand, #L1037- from forest floor to concert hall.",
      "similar": [],
      "original_title": "Note by Note: The Making of Steinway L1037",
      "runtime": 81,
      "poster_path": "/vxF0ow8yFXxUDrY50X27sRCTj87.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2007-11-07",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.notebynotethemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ben Niles"],
      "runtime": 81,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1149400/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxNzA3ODk5OF5BMl5BanBnXkFtZTcwODM0MDY3Mg@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Pierre-Laurent Aimard, Harry Connick Jr., Hélène Grimaud | See full cast and crew »"],
      "reviews": [
         "You don't have to play a note of music to enjoy 'Note By Note:The Making Of Steinway L1037'. This is a loving Valentine to instrument making & music in general. We get to see the Steinway piano being produced over a one year period, from trees in the forest, to the finished product. The film is rife with interview footage with the workers who poured their life & love into this (and all of the)piano. The film also gets screen time with interviews with figures from the musical world (Harry Connick,Jr.Lang Lang,etc.). This film,like the piano itself is a labour of love & is well worth seeking out. Distribution is a bit limited,due to it's release on video,but will be well received when it is released on DVD.",
         "This is one of those rare films that is too short, you hope it won't end! A year in the making of a Concert Grand Steinway piano comes alive not only because of the details of the gathering of the wood, the process of building it and the beautiful tone of the finished product but because of the people who build it over that year of its birth. They show such love and enthusiasm for what they are doing and such care, respect and love for each other that it made me want to move to NYC to work at the Steinway factory. Fat chance though, the workers seem to stay there for years when they get a job there and it looks like you have to have an \"in\" to get the job in the first place! Friends, families, co-workers - they all count here with the gorgeous pianos bursting with tone the icing on the cake. The employees seem to know how lucky they are working in piano heaven! It's an 11 on a scale (no pun intended) of 10. I'll be buying the DVD immediately upon its release!",
         "The stars of this film ought to have been the piano and the people who dedicated their lives to building it. Through very personal interviews, the workers impress us with their commitment, but they are never allowed fully to impress us with their skills. Instead, much of this already short film focuses on the end users (the pianists and their needs, opinions, tastes), on endless shots of 'L1037' (just so we know it's the same piano), and on the Steinway Building (in case we forgot where we are.) Perhaps the filmmaker felt the technical details of how a piano is made would not be compelling enough to carry the movie. Still, I was disappointed that I came away with no real understanding of what each and every worker was contributing, how all the pieces fit together, and what skills these passionate artisans bring.",
         "NOTE BY NOTE is a documentary that is not a documentary: it is a love story the begins with the initial choice of wood form Sitka, Alaska, through the multiple aspects of creating the case, the soundboard, stringing and creating the hammers and pads, and finally the tuning of the piano before placing it before the public wither for sale or for storage in the Steinway Headquarters in New York for pianists to select for performances in the New York area. Each step of the process introduces the craftsman responsible for particular aspects of the building of this near sacred musical instrument: it takes a year to handcraft a Steinway piano. Each step of the process of creating the piano, here the selected piano is numbered L1037, is explained and demonstrated but that is where this film is so very unlike other films that attempt to achieve the same 'this is how it is done' process: this is a story of a 'lover' passed from person to person until the wooden and metal and pad-filled 'box' is presented to the hands of a variety of musicians for the acid test. Throughout the film we are in conversation with such pianists as Hélène Grimaud, Pierre-Laurent Aimard, Lang Lang, Harry Connick, Jr. and Hank Jones. But the real radiance of this film directed by Ben Niles is the series of tender tributes each of the workers adds when attempting to describe how working to build a Steinway is as rewarding an occupation as possible. This little film is a quiet love story and very awe inspiring. Grady Harp",
         "I saw this last night on Netflix streaming video. Anyone who is a musician, or who just loves piano music, would enjoy this. Or even just craftsmen who want to see this fascinating process. This was filmed in the Steinway factory in New York. I was a bit surprised at how Steinway has remained almost completely a manual process, building each and fitting each by hand, with craftsmen using chisels and other tools putting the finishing touches on parts that need to fit properly. I believe they said they make 2000 pianos a year, while other more automated piano factories make 200 pianos a day! Piano L1037 is the one followed for the almost year it takes to make it. Why so long? Well they start with raw wood, form the multi-layered sides with a mold, manual labor, glue, and clamps. So it has to sit for periods to cure, including 8 weeks in the warehouse after the sides are fully formed. Then at other points, including after stringing, the piano has to sit for periods to allow all the stretching and tons of forces inside the piano to settle in. The film also includes interviews with a number of pianists, including Harry Connick Jr, and in the end one of them is playing beautiful music on L1037 after it is complete and is transported to the Steinway facility where all the finished pianos are displayed.",
         "If you were going to produce a documentary about the making of a piano, there are several directions you could go. You could produce an informative and dry blow-by-blow account, or you could do what this documentary does and provide enough technical details so as not to bore, but let the audience get to know some of the interesting people involved in the process. The Steinway numbered L1037 is a 9-foot concert grand and the movie follows its year-long production from milling the wood to final roll-out. I had assumed that the making of a piano in the 21st century would be highly automated, but the amount of handcrafting involved in making this piano surprised me. Even the number L1037 is hand stamped into the wood. Steinway turns out about 2,000 pianos a year whereas other makers turn out up to a hundred a day. As the movie follows the piano through its history we meet the craftsmen who lovingly work on it. Along the way we see people working on shaping the rim, sanding, fitting the soundboard, stringing the piano wire, finishing the wood, and tuning. When the plant lets out for the day and we see the workers heading home they look like working-class folk that you would see coming out of any manufacturing plant. But these people are highly skilled and specialized craftsmen who deal with millimeter tolerances. The recorded interviews document how devoted these workers are to their tasks and what a reverence they have for the product. A number of musicians are interviewed about their relationships with their pianos. Among these are classical pianists Hélène Grimaud, the brilliant Lang Lang, and the fussy Frenchman Pierre-Laurent Aimard. Also featured are jazz pianists Marcus Roberts, Bill Charlap, and Harry Connick, Jr. After hearing these artist talk about pianos and do some playing I came away with a much better understanding of why each Steinway piano is a unique instrument. I got a kick out of people sitting down to play a few notes only to get up and announce, \"This will not do.\" As fascinating as it was to hear the professionals talk, the most moving scene for me involved a teenager who, having selected a piano at a Steinway sale, awaited its arrival at his apartment with his parents and grandparents. I don't think I have ever seen a person so excited about getting a possession as this young man, and there was so much happiness in the room when he played for his parents and grandparents that it brought tears to my eyes. The ending has Hélène Grimaud playing a transfixing performance of the Rachmaninov Prelude in G Sharp minor, Op.32, No. 12. I am a woodworker with an appreciation for classical piano, so I may be biased, but I found this documentary absorbing from beginning to end.",
         "I can't play piano, but in the 1960s-70s I grew up with a 1913 Steinway on which my mother practiced for several hours every day. When my parents first got married they were close to broke, lived in a tiny apartment, and almost never ate out, but they bought that Steinway so that she could have a great tool for her profession. She played the hell out of it for half a century, then traded it in for a new one which sounds even better. I'm sure that a lot of people have nostalgic stories like this. Sure, nostalgia is nice, but these pianos truly are wonderful, and this documentary shows why. I think that as Americans we really shine when we MAKE big beautiful things, whether airplanes, rockets, or pianos. It's even better that in this case many of the workers are immigrants who came looking for jobs. The interviews make clear that they stay at Steinway because they truly love what they do. My mom's an immigrant, too, and it's wonderful that she's playing an instrument made in Astoria, New York. Watch this video and you'll come away smiling. Afterward, if you have the opportunity to buy a piano, cough up the bucks for a new Steinway--you'll get an absolutely superb instrument, and you've seen some of the good folks who make it, right here in the good ole US of A."
      ],
      "genres": [
         "Documentary",
         "Family",
         "Musical"
      ],
      "productionCompanies": [],
      "summaries": [
         "Note By Note is a feature-length independent documentary that follows the creation of a Steinway concert grand, #L1037. It explores the relationship between musician and instrument, chronicles the manufacturing process, and investigates what makes each Steinway unique. _Watch the evolution L1037?from forest floor to concert hall _Meet the craftsmen and women who shape L1037?s personality _Discover the depths of artists? relationships with their instruments From the factory floor in Queens to Steinway Hall in Manhattan, each piano?s journey is complex?spanning 12 months, 12,000 parts, 450 craftsmen, and countless hours of fine-tuned labor. Filmed in key Steinway locations?the factory, Steinway?s reserved ?Bank,? and private auditions?Note By Note is the first documentary to portray the patience, craft, and personality built into each Steinway.",
         "The most thoroughly handcrafted instruments in the world, Steinways are as unique and full of personality as the world-class musicians who choose them above all others. Note By Note is a feature-length independent documentary that follows the creation of a Steinway concert grand, #L1037. It explores the relationship between musician and instrument, chronicles the manufacturing process, and investigates what makes each Steinway unique and why that's important.",
         "A feature-length independent documentary that follows the creation of a Steinway concert grand, #L1037- from forest floor to concert hall."
      ],
      "budget": 0
   },
   "movielensId": 73862,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-11-07",
      "dvdReleaseDate": null,
      "directors": ["Ben Niles"],
      "runtime": 81,
      "movieId": 73862,
      "title": "Note by Note: The Making of Steinway L1037",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1149400",
      "originalTitle": "Note by Note: The Making of Steinway L1037",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A feature-length independent documentary that follows the creation of a Steinway concert grand, #L1037- from forest floor to concert hall.",
      "tmdbMovieId": 27182,
      "avgRating": 3.72727,
      "releaseYear": "2007",
      "numRatings": 11,
      "posterPath": "/vxF0ow8yFXxUDrY50X27sRCTj87.jpg"
   }
}