{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0094661",
      "video": false,
      "title": "Anna",
      "recommendations": [
         52618,
         12551,
         8419,
         11243,
         1816,
         11107,
         11039,
         271,
         11112
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anna Pelzer",
               "gender": 0,
               "credit_id": "52fe4a1c9251416c910c38c5",
               "name": "Silvia Seidel",
               "profile_path": "/kkvKNWlmjwldXaEImOg9MXG0iIG.jpg",
               "id": 124445,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rainer Hellwig",
               "gender": 2,
               "credit_id": "534085810e0a2679a70009fb",
               "name": "Patrick Bach",
               "profile_path": "/xYBZE3U4PcXtKzWjF15RqbSIqUj.jpg",
               "id": 1240314,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Stefan Pelzer",
               "gender": 2,
               "credit_id": "534085b50e0a2679ad0009ea",
               "name": "Eberhard Feik",
               "profile_path": "/6AikFp5VM1lPWfhMLK0S1IQ0hBg.jpg",
               "id": 36614,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ute Pelzer",
               "gender": 1,
               "credit_id": "534085f30e0a2679a10009b3",
               "name": "Ilse Neubauer",
               "profile_path": "/htdUTKlZvSfxJTDgtyQ30XPJINX.jpg",
               "id": 1198796,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "George Mamoulian",
               "gender": 2,
               "credit_id": "534086150e0a26799e0009be",
               "name": "Anton Diffring",
               "profile_path": "/uJ0l6TulElk9iEkuMKz6uvZBSfq.jpg",
               "id": 97935,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "557aed899251417f6e0022f2",
               "name": "Justus Pfaue",
               "profile_path": null,
               "id": 1240313,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5340862f0e0a2679a7000a04",
               "name": "Frank Strecker",
               "profile_path": null,
               "id": 26635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "557aed97c3a3680b5c000045",
               "name": "Justus Pfaue",
               "profile_path": null,
               "id": 1240313,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "557aedb79251417f7400222d",
               "name": "Bernd Burgemeister",
               "profile_path": null,
               "id": 6675,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "557aedcec3a3680b5c00004a",
               "name": "Claus Hardt",
               "profile_path": null,
               "id": 50084,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "557aede2c3a3680b3d00005f",
               "name": "Joachim G. Staab",
               "profile_path": null,
               "id": 1476511,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "557aedf5c3a3680b3a00005c",
               "name": "Sigi Schwab",
               "profile_path": null,
               "id": 100730,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "557aee0ac3a3680b4f000050",
               "name": "Peter Ambach",
               "profile_path": null,
               "id": 1389210,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "557aee1fc3a3680b5c000057",
               "name": "Margret Borsche",
               "profile_path": null,
               "id": 1476512,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "557aee38c3a3680b3d00006e",
               "name": "Wolfgang Hundhammer",
               "profile_path": null,
               "id": 1319735,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "557aee4fc3a3680c22000056",
               "name": "Monika Hanke-Strecker",
               "profile_path": null,
               "id": 1476513,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "557aee65c3a3680b36000072",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "557aee87c3a3680c2200005f",
               "name": "Mary Cybulski",
               "profile_path": null,
               "id": 992965,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.781409,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 89488,
      "vote_count": 3,
      "budget": 0,
      "overview": "This film is the theatrical follow-up to a very popular German TV-series (also called \"Anna\"), about a young girl who wants to make it as a prima ballerina.",
      "similar": [],
      "original_title": "Anna – Der Film",
      "runtime": 95,
      "poster_path": "/xS660yc3imTYmbqfyUXjHwu3Gwg.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zweites Deutsches Fernsehen (ZDF)",
            "id": 4606,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TV-60 Filmproduktion",
            "id": 2048,
            "origin_country": ""
         }
      ],
      "release_date": "1988-12-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yurek Bogayevicz"],
      "runtime": 100,
      "synopsis": "An aging Polish actress Anna (Sally Kirkland) wakes up to a ringing telephone from her agent commanding her to get to an audition for a new play in downtown Manhattan. After asked to perform ridiculous stunts onstage for an inept director she bumps into Krystyna (Paulina Porizkova) a lovely young Polish actress who has traveled to the United States to meet and work for her idol, the old actress. Anna takes her into her apartment, feeds her, and Krystyna with her beauty immediately becomes an attraction to some of the best people to know like the legendary Baskin (Larry Pine) who takes the young model off to his retreat in the Hamptons and takes her around to parties in New York. Anna shares with Krystyna the main reason that she came to America and realizes that she is a force of inspiration to the younger woman. As Krystynas career ignites Anna understands that her own career has waned and the effect the two women have on each other is life-changing.",
      "writers": [
         "Yurek Bogayevicz",
         "Agnieszka Holland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092569/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyNTkzOTc2MV5BMl5BanBnXkFtZTcwMTgwMDUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sally Kirkland, Paulina Porizkova, Robert Fields | See full cast and crew »"],
      "reviews": [
         "This little-seen film (shown way back 1987) is promising, specially upon seeing Kirkland's Oscar-nominated performance as a one-famous movie star and now striving to have a normal life in California. Supermodel Paulina Porizkova made her movie debut here, and she is nonetheless fine. In spite of the script's inconsistencies, Kirkland's brilliant rendition of Anna (reminiscent of the classic \"All About Eve\") is worth a watch. I really cried when I first saw it. Inspiring. 7/10.",
         "I found it quite absorbing. I haven't seen it since 1988 or so. I remember Paulina Porizkova was a pretty famous model back then, pre-supermodel days. I was deeply struck by the relationship between the two woman. Youth and middle-age. The incredible losses of not only youth, but of possibility and love are touched on in a way very rarely seen in movies. Especially from a woman's point of view. The mentoring of the younger woman and then the incredible sense of loss when she is whisked away by public reaction to her beauty and then actually takes on the painful past of her mentor, in a way steals it is incredibly moving. You end up feeling for Kirkland's character because she seems to have greater depth than the younger woman, but at the same time is that just the result of age and circumstance? And the poignant relationship to her lost image and the contacts and opportunity that her youthful beauty once promised her. Now she is alone and forgotten in a foreign land. It is pretty incredible.",
         "Sally Kirkland is standout in this character driven drama. This film is what great films are all about, they tell great stories about people and get you thinking. The script is fantastic and Kirkland is heart breaking. The film should be far better remembered than it is and film schools should use it in class. Kirkland should have won the Oscar and had the film had better distribution and some more money behind it, she would have, but CHER had a huge campaign behind her for Moonstruck. Kirkland is under rated and her two best roles since ANNA have failed to get distribution: What's up Scarlet and Norma Jean, Jack, and Me. A must see for film fans and those who love actors...",
         "A once famous Czech actress, fallen on hard times since emigrating to New York City in 1968, finds the strain of maintaining her professional integrity beginning to take its toll after too many humiliating off-Broadway auditions. But unlike its title character the film of the same name is (thankfully) far less neurotic, presenting a fresh mix of otherwise familiar narrative elements. It's part show-biz satire, part fish-out-of-water drama, and in large part a cross cultural variation of 'A Star Is Born', with the melancholy Anna sheltering an impoverished but attractive peasant girl from the Old Country (Paulina Porizkova) whose unexpected (and unsolicited) success begins to eclipse her mentor's own fading career. The relationship is given added resonance in the young protégé's naive ignorance of Prague Spring, giving the domestic show business story a richer European perspective, which no doubt came natural to screenwriter Agnieszka Holland, an accomplished filmmaker herself. But after having created such memorable characters (rewarded in the title role by a performance to match, from unlikely Oscar nominee Sally Kirkland) it's too bad Holland's script then had to settle for such an abrupt and artificial ending.",
         "As an actor who works in film and television, I think Kirkland's performance in \"Anna\" is one of the greatest ever given by an American actress on screen. Every actor should see it, as well as Kim Stanley's in \"The Goddess\" and Geraldine Page's in \"The Trip to Bountiful\". I also think this film is important in its message to Hollywood - stop putting looks above talent! This film is a fascinating story, all too true for actresses in the US, especially today. Anna, an enormously talented middle-aged woman, is overlooked, while exceptional opportunities come along for a pretty young girl with little to offer but looks and a perky personality, who just happens to use Anna to get to the top. The story is supposed to be based on a real person and her experience trying to find work in New York after having been a star in Europe. Kirkland brings this character to life with amazing depth and courage. Although she lost the Oscar that year to the well - deserving Cher for \"Moonstruck\", I think if more people had seen this film, Kirkland would have walked away with the little gold man that night. I am still inspired by what the film has to say about women in this business who lose opportunities because of ageism. What is it with American producers? I love Judi Dench and Vanessa Redgrave, but if they were American women, they would never find work! The Hollywood film industry should take a lesson from their European counterparts and use the talented older ladies we have right here!!! Every time Dench or Redgrave make a film, they are nominated or win for it. There are thousands of equally gifted ladies right under our noses in Hollywood who never get a shot at greatness. Sadly, Sally Kirkland just had the one...",
         "what makes this film worth watching, other than the unrecognized talent of sally kirkland, is the authentic feel of lower new york and the off broadway scene. the ending is not what i expected and i appreciate the fact that someone knows how to write an ending that makes you think about what you just saw and feel somehting for the characters that you have to think about before you decide exactly what you felt. i saw this film several years after its release and i think if i could vote the oscars now i would vote it in lead actress, screenplay and cinemotagraphy. an excellent film proving creativity not money is what makes something worth watching on screen. 3 and 1/2 stars. timelessly moving",
         "Unable to sleep late at night, I got one of my brother's old VHS tapes and played something called Anna. This 20-year old movie made by European artists in America for the independent film company Vestron Pictures starred Sally Kirkland in the Oscar-nominated title role as a former Czech movie actress who's now struggling off-Broadway as an understudy for seven roles in an art-house play. Robert Fields plays her writer boyfriend Daniel, Steven Gilborn-who I remember as Kevin Arnold's math teacher in \"The Wonder Years\"-her ex-husband Tonda, and supermodel Paulina Porizkova is Krystyna-Anna's protégé. When I read the end credits, at the last name on the cast list was Francis' daughter Sofia Coppola as Noodle though I don't remember her or the character. Anyway, this movie began amusingly enough with Anna suffering an audition reciting a nursery rhyme while standing on one leg and shouting but as the film went on we feel for her as she suffers a breakdown after Krystyna steals Anna's life story for her own as she-with Anna's help-rises in stardom. Kirkland deserved her only Academy Award nomination that I felt was even better than the one who actually won in the Best Actress category that year: Cher in Moonstruck. Porizkova was also pretty good for her ingénue role as we see her and Kirkland initially bond. Since Vestron no longer exists, this movie may be difficult to find now but Anna is definitely worth a look.",
         "ANNA is a very uneven film BUT Sally Kirkland's performance is not. Shame that more people didnt see if they did she might have gotten an Academy Award. Fortunately she was nominated.",
         "This film is all about Kirkland's performance, which is still one of the best performances I've ever seen on film. She was nominated for an Oscar but lost to Geraldine Page for The Trip to Bountiful in one of those sympathy votes going to the lesser performance things (Page had been nominated without winning something like eight times prior, so a lot of people in the Academy probably thought it was time to give her something). Porizkova does pretty well for her debut performance, but then again she was pretty much playing herself as an eastern European beauty who is discovered and becomes a model. But I'm writing this review solely to give Kirkland the praise she deserves for her terrific performance.",
         "\"Anna\" is the movie with perhaps the greatest disparity between my opinion and everyone else's, so seems appropriate for my first comment on IMDb. Anna (Sally Kirkland) was a legendary actress in Czechoslovakia, and in New York suffers a career in shabby productions with avant garde or artistic pretensions. Krystyna (Paulina Porizkova), an immigrant from Czechoslovakia with acting aspirations, spends her first days on the streets of New York searching for Anna, fainting from hunger virtually on her doorstep. Anna takes her in, and they become intimate friends. Porizkova's Krystyna is as compellingly ambitious and wily as any of Werner Herzog's roles -- and this in an area calling for a subtler social sense. Krystyna seems not to be Anna's daughter, given up for adoption at a young age. But the malleability of memory -- Krystyna's in an obvious way, though perhaps also Anna's -- is treated more interestingly than in some of Agnieszka Holland's better known movies, such as \"Olivier, Olivier\" or \"Europa, Europa.\" Almost as interesting as some real life cases: The erstwhile mental illness \"fugue\" comes to mind (see, for example, the Times Literary Supplement, 16 July 1999; as this is a movie database, I'll also point to \"Paris, Texas\" for a portrayal of the phenomenon). So does the case of Benjamin Wilkomirski. I could but won't extend this list. On the negative side, the description of Jewish life in New York is a mixture of inappropriately projected Christian norms and condescension (maybe due to unfamiliarity, or laziness of imagination)."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Magnus Films",
         "Vestron Pictures"
      ],
      "summaries": ["Anna is a middle-aged actress looking for work in New York City, with the help of her sometime lover, Daniel. She used to be a Czech film star married to the director Tonda, who is now successfully making commercials in New York. After the 1968 invasion of Czechoslovakia, Anna was imprisoned and eventually exiled. Anna takes in the young girl Krystyna, who has just arrived from Czechoslovakia, and speaks no English. Anna and Daniel help Krystyna learn English and start a promising acting career. However, the only job Anna can find is as an understudy."],
      "budget": 0
   },
   "movielensId": 7404,
   "movielens": {
      "languages": [""],
      "releaseDate": "1987-11-28",
      "dvdReleaseDate": "2004-03-16",
      "directors": ["Yurek Bogayevicz"],
      "runtime": 100,
      "movieId": 7404,
      "title": "Anna",
      "mpaa": "PG-13",
      "actors": [
         "Sally Kirkland",
         "Paulina Porizkova",
         "Robert Fields",
         "Sofia Coppola",
         "Stefan Schnabel",
         "Steven Gilborn",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0092569",
      "originalTitle": "Anna",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Czech refugee Krystyna (Paulina Porizkova) travels to New York in search of her actress idol and fellow expatriate, Anna (Sally Kirkland). After her own arrival in the Big Apple, Anna finds that celebrity often doesn't travel well, and she must go through a battery of humiliating auditions to try and get work in her adopted land. But when Krystyna and Anna finally meet, they provide a support structure for each other.",
      "tmdbMovieId": 89488,
      "avgRating": 2.70833,
      "releaseYear": "1987",
      "numRatings": 12,
      "posterPath": "/FlV1DrGK9nCMCjxswJrp1xRc97.jpg"
   }
}