{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jinx",
            "id": 4367
         },
         {
            "name": "divorce",
            "id": 15160
         }
      ],
      "imdb_id": "tt0026261",
      "video": false,
      "title": "Dangerous",
      "recommendations": [
         43075,
         83667,
         92341,
         106635,
         95797,
         114302,
         162064,
         118570,
         22965,
         85783,
         38468,
         52365,
         28439,
         156322,
         46401,
         38774,
         52228,
         77123,
         90010,
         82970
      ],
      "backdrop_path": "/8aDeRqeJqynCKtd2I7e75Tqi4d5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Joyce Heath",
               "gender": 1,
               "credit_id": "52fe4847c3a36847f815f6f3",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Don Bellows",
               "gender": 2,
               "credit_id": "52fe4847c3a36847f815f6f7",
               "name": "Franchot Tone",
               "profile_path": "/140grYtawkKzF3ruaFjHVnlaUes.jpg",
               "id": 72059,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gail Armitage",
               "gender": 1,
               "credit_id": "52fe4847c3a36847f815f6fb",
               "name": "Margaret Lindsay",
               "profile_path": "/2lDJFueklrAQBc7gg13NyVAy8HL.jpg",
               "id": 20365,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mrs. Williams",
               "gender": 1,
               "credit_id": "52fe4847c3a36847f815f6ff",
               "name": "Alison Skipworth",
               "profile_path": "/31okBT6NukBP0Pon266W06yJQSv.jpg",
               "id": 131234,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Gordon Heath",
               "gender": 2,
               "credit_id": "56ad78d1c3a3681c3f0087b7",
               "name": "John Eldredge",
               "profile_path": "/vZ37F574lieQGt8ifJP8zm6dt1L.jpg",
               "id": 96701,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Teddy",
               "gender": 2,
               "credit_id": "56ad78de9251417c98003b44",
               "name": "Dick Foran",
               "profile_path": "/bOOhd2C58tafUadbbtKNHglyhKD.jpg",
               "id": 81168,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Roger Farnsworth",
               "gender": 2,
               "credit_id": "56ad78e69251417e20007c07",
               "name": "Walter Walker",
               "profile_path": "/9RgAFUeUDjxnUsa4Y2dbGqpqH6E.jpg",
               "id": 590550,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Pitt Hanley",
               "gender": 2,
               "credit_id": "56ad78efc3a3681c31007a14",
               "name": "Richard Carle",
               "profile_path": "/vw8of7fmAsdOfpgWWs0pqdlMVPw.jpg",
               "id": 19553,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Charles Melton",
               "gender": 2,
               "credit_id": "56ad78f9c3a3681c34007286",
               "name": "George Irving",
               "profile_path": "/js2u7KGDeYSKf4eOrVQJxDPfaUP.jpg",
               "id": 13823,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "George Sheffield",
               "gender": 2,
               "credit_id": "56ad79019251410e8f0074d2",
               "name": "Pierre Watkin",
               "profile_path": "/s9Z72wx6hJ2BwG6feVC6s4TcWrb.jpg",
               "id": 30216,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Elmont",
               "gender": 0,
               "credit_id": "56ad790ac3a3681c370071e9",
               "name": "Douglas Wood",
               "profile_path": null,
               "id": 34447,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Reed Walsh",
               "gender": 2,
               "credit_id": "56ad79129251417e1a0075a3",
               "name": "William B. Davidson",
               "profile_path": "/6MmhkoDiuyoW7HxlJ6F42kPkm6J.jpg",
               "id": 95729,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4847c3a36847f815f6e9",
               "name": "Alfred E. Green",
               "profile_path": "/oqzfZ6R6wjlz7UebaHqpp0XTbE6.jpg",
               "id": 97774,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4847c3a36847f815f6ef",
               "name": "Laird Doyle",
               "profile_path": null,
               "id": 149128,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "56ad7851c3a3681c54007cb8",
               "name": "Laird Doyle",
               "profile_path": null,
               "id": 149128,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56ad78589251417e20007bf7",
               "name": "Laird Doyle",
               "profile_path": null,
               "id": 149128,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56ad7868c3a3681c47007f00",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56ad7875c3a3681c47007f03",
               "name": "Jack L. Warner",
               "profile_path": "/oVadCy7cR1EcdXwPqZX0YiZAIfR.jpg",
               "id": 1529469,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56ad787d9251417c98003b2f",
               "name": "Ray Heindorf",
               "profile_path": null,
               "id": 30267,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ad7885c3a3681c5c007f71",
               "name": "Bernhard Kaun",
               "profile_path": null,
               "id": 29810,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ad788dc3a3681c5c007f75",
               "name": "Heinz Roemheld",
               "profile_path": null,
               "id": 30268,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ad78959251417e290076a6",
               "name": "Ernest Haller",
               "profile_path": null,
               "id": 2774,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56ad789dc3a3681c3b007dc5",
               "name": "Thomas Richards",
               "profile_path": null,
               "id": 14447,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56ad78a39251417e14007d55",
               "name": "Hugh Reticker",
               "profile_path": null,
               "id": 1132401,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56ad78aa9251417c98003b39",
               "name": "Orry-Kelly",
               "profile_path": null,
               "id": 4127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56ad78b49251417e20007bff",
               "name": "Russell Saunders",
               "profile_path": null,
               "id": 1529473,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.769384,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52863,
      "vote_count": 12,
      "budget": 0,
      "overview": "Dan Bellows finds former stage star Joyce Heath a penniless drunk and takes her to his Connecticut home for rehabilitation. Unaware that she is married to Gordon, he asks his fiancée Gail to free him and offers to sponsor Joyce in a play. When Gordon refuses to give Joyce a divorce, she runs the car into a tree crippling him for life. Joyce urges Dan return to Gail, opens her play, and begs Gordon for forgiveness.",
      "similar": [
         60243,
         12102,
         12220,
         239563,
         225886,
         24420,
         158907,
         1359,
         1903,
         4944,
         10404,
         37094,
         51828,
         82693,
         50646,
         46705,
         45269,
         85350,
         38,
         59
      ],
      "original_title": "Dangerous",
      "runtime": 79,
      "poster_path": "/2UskcpJ7iOCoXCMTWez7kourZDE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1935-12-25",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "An alcoholic actress considered a dangerous jinx is rehabilitated but shows she's as dangerous as ever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred E. Green"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Laird Doyle",
         "Laird Doyle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0026261/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MDI5Njg3NV5BMl5BanBnXkFtZTcwMTM5NTQxMw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bette Davis, Franchot Tone, Margaret Lindsay | See full cast and crew »"],
      "reviews": [
         "Bette Davis plays a down and out actress who believes she curses everyone she becomes involved with in \"Dangerous,\" one of Davis' Oscar-winning performances. It is in this film and the earlier \"Of Human Bondage\" that the Davis image really solidifies - high energy, strong, smoking, and smokin'. If she seems at times a little over the top, it can be attributed to the acting style of those days, which was a carryover from the stage. What Davis gives is very much a stage performance - with the invention of talkies, the studios raided the theater for actors who could speak, and Bette Davis was among them. Over the years, with the advent of television, acting has become more intimate, more natural, and Davis' complaint about the newer approach was that it can also be boring. She never was. Davis costars in this film with Franchot Tone, who plays an architect that brings the Davis character out of the gutter, only to find himself face down in it himself. Smooth and classy, he's the type of leading man that one doesn't see anymore, and he's a good romantic lead for her. The lovely Margaret Lindsay is Tone's discarded fiancé, and there's a wonderful performance by Alison Skipworth as Tone's housekeeper. Davis, of course, draws all of the focus, with the fire in her eyes, the bite in her voice, and those flashes of vulnerability. She was always a fascinating screen presence, and she won't disappoint you in \"Dangerous.\" \"Dangerous\" is a little bit dated, but what isn't, 70 years later.",
         "Bette Davis plays a former actress turned low-life drunk in this highly emotional drama. She is convinced she has a 'jinx' on her because she seems to make bad things happen. A wealthy man recognizes her drunk in a bar and takes her to his country house. Sparks fly. The problem - he's engaged. Dangerous is a terribly beautiful bittersweet tale and Bette Davis carries it off perfectly. When she is in the scene, your eyes are always on her and nothing else. She is a captivating and riveting actress with pure talent. Her acting style is so easy to like. The story is incredibly realistic and very thoughtful. The script is very good, every line believable. Dangerous is a truly good movie with moving, touching and believable performances. Bette Davis shines in her role - one of her earlier dramas. I was surprised and very satisfied with the ending. Wonderful movie.",
         "We're it not for the fact that Bette Davis won her first Academy Award in Dangerous, this film would hardly be remembered by anyone except the most ardent Bette Davis fans. There were a number of films that woman carried by sheer force of nature and this is probably the best example of one. Her character of Joyce Heath is rather obviously based on Jeanne Eagels who was only dead six years and who many had vivid memories of on stage and screen. In fact at one point in the film it's mentioned that a play that Franchot Tone is interested in being the financial backer of could only be played by Bette's character Joyce Heath and Jeanne Eagels. Franchot Tone is a dapper successful young architect to the rich and famous and he's got a few bucks himself and he's engaged to society débutante Margaret Lindsay. But one fateful night he meets up with Bette Davis who was once big, but is now down and out. She broke many a heart in her day and even she considers herself a jinx to any who get involved with her. That don't stop Tone who hears his hormones calling. You will not forget Bette as the hedonistic and reckless Joyce Heath, she really dominates this film. Because of that and because there was a big outcry about her not even being nominated the year before for Of Human Bondage, Davis got a nomination and to her surprise got the Oscar for Best Actress. If the criteria for winning an Oscar is carrying a mediocre film to glory than Bette deserved it. There have been a few times in Academy history that a performance of a star just totally dominates the film, the best examples I can think of besides this is Jose Ferrer is Cyrano DeBergerac and Susan Hayward in I Want To Live. But both Jose and Susan had a whole lot better material to work with. Even Davis while proud of the Oscar thought the film mediocre, the way Elizabeth Taylor felt about Butterfield 8. Part of the reason is that the Code had come into being. If this film had been made a year or two earlier we would not have had the absolute cop out of a finish. Still Bette's fans will love it, no doubt.",
         "Bette Davis began appearing in films in 1931 at the age of 23. She was an extremely hard working actor, and by the time she made this film in 1935, she had appeared in 27 films including `Of Human Bondage' for which she received her first Oscar nomination the year before. The story is compelling. Don Bellows (Franchot Tone) is an architect who claims that his life was changed forever by a theater performance by a young actress named Joyce Heath (Bette Davis) who came to prominence quickly and vanished almost as fast. He was so moved by her performance that he re-evaluated his life and took on a new direction, moving from being a stockbroker to indulge his more creative side by studying architecture. One day he comes upon Joyce Bellows who is stinking drunk. He recognizes her and attempts to engage her in conversation, but she is cruel and derisive. When she passes out, he takes her back to his place to sober her up and care for her. Despite her decrepit condition, he is captivated by her and falls madly in love with her, breaking off his engagement to Gail (Margaret Lindsay). Don begins the process of rehabilitating Joyce and though she is resentful and bitter at first, she is won over by his devotion to her and agrees to take a part in a play that she always wanted, a play that he used all his money to back. However, Joyce has a secret that dooms the relationship. She is a dangerous woman who ruins the men who love her. The world comes crashing down on her and on the men in her life. This is a well-crafted story that keeps the viewer intrigued from beginning to end. Davis is electrifying in the role. I consider this and her performance in `All About Eve' (where she also played a bitter actress) to be her best. She throws herself into the role and delivers a performance that ranges from the highest of highs to the lowest of lows. She won her first of two Academy Awards for this film and went on to be nominated a total of 13 times. This film is a must for anyone interested in Ms. Davis body of work and for the classic film buff in general. I rated it a 10. It is a terrific story that is enhanced by a riveting performance by one of the legends of film.",
         "So let her be flamboyant, if she wants to be. She had audiences riveted to their seats in 1935 with this strong performance. How remarkable today, in 2000, that this 65-year-old portrayl can still hypnotize. It is solid Bette Davis work, with Franchot Tone lending fine support in every scene. This legendary actress may chew a bit of scenery here and there, but then that's what makes her work so distinctive: here's a real personality, a star, who puts it all out there. She doesn't apologize either. . . just let's it all hang out and, if you like it, fine--if not, tis no big deal. She seems to have been a born actress, too -- with her style the opposite of the Method. Go on and indicate emotion when you're not up to drawing a sincere response. Keep folks wondering where the real Davis begins and the posing one leaves off. You're so good a what you do, you don't need to worry. . . your fans will lap it up anyway. Which they did, by the millions. Davis was recently voted the number one film actress of the 20th century in a popular poll by moviegoers. That speaks legions about how her work, after all these years, is still regarded. ###",
         "Contrary to what another commentator to this forum says, Bette Davis was not nominated the year before for an Oscar for her excellent work in \"Of Human Bondage\", a much better film than this one. In 1935, the year after being bypassed for the Academy Award, Hollywood, acting in a forgiving manner, gave her the award as Best Actress. By Ms. Davis' own admission, Katherine Hepburn should have won for \"Alice Adams\". We are not saying she wasn't worth it, on the contrary, Ms. Davis always gave her best in all her films. Sometimes, contributors to IMDb, upon sending their comments, have a way of predicting that the film they are reviewing, or one of its actors will receive the nomination, or the award come Oscar time. In fact, as it seems to be in most cases, bypassed actors on a particular year get awards for work, later on, for inferior work they did that year and were overlooked by the fickle voting members of that body before. \"Dangerous\" was directed by Alfred Green and based on a story by Laird Doyle. The story of an actress who has fallen victim to alcoholism makes good melodrama. As such, Joyce Heath, Ms. Davis' character, is seen at the beginning of the film as a woman who wants to forget it all, in order to do some serious drinking. Donald Bellows is a man that was deeply impressed by the actress, who he saw as Juliet in the New York stage, and became obsessed by her artistry. When he meets her at the dive where she is drinking cheap liquor, he believes he can save this woman who is wasting her talent. Joyce, eventually, falls in love with Don, but she is reluctant to marry him, which is a puzzle to us. Little do we know about the secret Joyce Heath is hiding from Don, which comes to haunt her at the end of the film. Bette Davis transforms herself from the opening scenes where she looks disheveled into the glamorous actress of the theater she really is. Her performance is good, but we have seen much better performances by this glorious actress, before this film, and after. Franchot Tone makes an appealing Donald Bellows, the man who tries to save his idol from her addiction to the bottle. Margaret Lindsay plays Gail, who is engaged to be married to Donald. This is a film that merits a look by all of Bette Davis' fans, as it will not disappoint.",
         "The aristocratic architect Don Bellows (Franchot Tone) worships the former successful actress Joyce Heath (Bette Davis), who prematurely left the stage considered a jinx, for changing his life for better. When Don goes with his fiancée Gail Armitage (Margaret Lindsay) and a friend to a bar, he sees Joyce completely drunken and penniless, and he takes her to his house in the countryside. Joyce stays there for a period in rehabilitation, and Don falls in love with her and calls off his engagement with Gail. Don also decides to produce a play for her and to get married with Joyce after the opening night. But Joyce has a secret in her past that will affect their lives forever. \"Dangerous\" is a melodramatic movie with a great story but a corny conclusion, with Joyce Heath returning to her crippled husband. Bette Davis has a great performance and won her first Oscar of Best Actress. My vote is eight. Title (Brazil): \"Perigosa\" (\"Dangerous\")",
         "Unlike some users ,I do not consider \"Dangerous\" one of Davis's best parts.Her career is so rich that you can name at least twenty movies that are far superior to this old hat melodrama:have you heard about \" little foxes\" \"All about Eve\" \"Now voyager \"whatever happened to Baby Jane\" and the unfairly unknown \"lo scopone scientifico\" which might be the most extraordinary part she ever played. \"Dangerous\" casts Davis as an alcoholic has been actress ;Tone wants her redemption ,so he sacrifices everything,money and fiancée to make the dream come true.The story is finally terribly sententious ,in \"the magnificent obsession\" mold ,but without Stahl's \"enough is enough\" side,which makes that director's works so priceless.",
         "Apparently Bette Davis said she was \"punch drunk\" from overwork when she was given \"Dangerous\", or as it was originally called \"Hard Luck Dame\" very loosely based on the life of Jeanne Eagels. She also said she had to work like 10 men to make something of the script but work she did, as her performance is the only reason for seeking this film out. To me Davis showed how she could rise above a trite, soapy script with, an at times very intense performance. Joyce Heath (Bette Davis), once a Broadway comet, has been declared a theatrical jinx - ever since her leading man was killed on opening night. She is now a down and out, occasionally working on vaudeville to keep herself supplied with liquor. Don Bellows (Franchot Tone) is a young man who owes Joyce Heath his destiny. Seeing her as a youth he decided to become an architect. He sees her at a seedy bar and when she passes out he takes her to his farm to recover. Miss Davis certainly has some memorable scenes but definitely it is a film to watch only for her performance. \"I've seen you before\" - \"which doesn't make us old friends\". With the calm of the country, she begins to dream of a comeback and to put her life in order - on her terms. She also wants Don to fall in love with her, which he does, but Don has a fiancé, Gail, (sweet Margaret Lindsay) that he seems to have forgotten about. He decides to produce the play \"But to Die\" to give Joyce another chance. He also wants to marry her, but Joyce is not so sure and before opening night her secret is revealed - she is already married!!! Gordon (John Eldrege) has always loved her and even though she has wrecked his life, he will never divorce her. Driving him to the country, she drives into a tree, intending to kill them both. I actually thought this was a dreary film, definitely not one that I would watch if I wanted to see Miss Davis at her most electrifying.",
         "Bette Davis plays the \"femme fatale\" as no other actress before or since. Every scene she plays gives us a riveting performance even though at times we may think it a trifle theatrical. In \"Dangerous\" she plays the role of Joyce Heath, a great actress, yearning for love which is denied to her. Her frantic outbursts make life for those around her difficult to comprehend. Desperate situations require desperate remedies and in a fit of madness Joyce Heath decides to resolve her difficulties in her own dangerous way. The ending may appear rather glib but the actors themselves give performances not to be missed and Bette Davis is a worthy recipient of an Academy Award."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Dan Bellows finds former stage star Joyce Heath a penniless drunk and takes her to his Connecticut home for rehabilitation. Unaware that she is married to Gordon, he asks his fiancée Gail to free him and offers to sponsor Joyce in a play. When Gordon refuses to give Joyce a divorce, she runs the car into a tree crippling him for life. Joyce urges Dan return to Gail, opens her play, and begs Gordon for forgiveness.",
         "The aristocratic architect Don Bellows worships the former successful actress Joyce Heath, who prematurely left the stage considered a jinx, for changing his life for better. When Don goes with his fiancée Gail Armitage and a friend to a bar, he sees Joyce completely drunken and penniless, and he takes her to his house in the countryside. Joyce stays there for a period in rehabilitation, and Don falls in love with her and calls off his engagement with Gail. Don also decides to produce a play for her and to get married with Joyce after the opening night. But Joyce has a secret in her past that will affect their lives forever.",
         "An alcoholic actress who is considered a dangerous jinx is rehabilitated, but she then shows that she's as dangerous as ever."
      ],
      "budget": 0
   },
   "movielensId": 74263,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1935-12-25",
      "dvdReleaseDate": null,
      "directors": ["Alfred E. Green"],
      "runtime": 79,
      "movieId": 74263,
      "title": "Dangerous",
      "mpaa": "",
      "actors": [
         "Bette Davis",
         "Franchot Tone",
         "Margaret Lindsay",
         "Alison Skipworth",
         "John Eldredge",
         "Dick Foran",
         "Walter Walker",
         "Richard Carle",
         "George Irving",
         "Pierre Watkin",
         "Douglas Wood",
         "William B. Davidson"
      ],
      "imdbMovieId": "0026261",
      "originalTitle": "Dangerous",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ysOEA-QNlVk"],
      "plotSummary": "Dan Bellows finds former stage star Joyce Heath a penniless drunk and takes her to his Connecticut home for rehabilitation. Unaware that she is married to Gordon, he asks his fiancée Gail to free him and offers to sponsor Joyce in a play. When Gordon refuses to give Joyce a divorce, she runs the car into a tree crippling him for life. Joyce urges Dan return to Gail, opens her play, and begs Gordon for forgiveness.",
      "tmdbMovieId": 52863,
      "avgRating": 3.10714,
      "releaseYear": "1935",
      "numRatings": 14,
      "posterPath": "/2UskcpJ7iOCoXCMTWez7kourZDE.jpg"
   }
}