{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "tradition",
            "id": 941
         },
         {
            "name": "becoming an adult",
            "id": 1412
         },
         {
            "name": "forbidden love",
            "id": 3691
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "elite",
            "id": 9309
         },
         {
            "name": "principal",
            "id": 12974
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "discipline",
            "id": 46962
         },
         {
            "name": "school life",
            "id": 190116
         },
         {
            "name": "teachers and students",
            "id": 193547
         }
      ],
      "imdb_id": "tt0213890",
      "video": false,
      "title": "Mohabbatein",
      "recommendations": [
         13986,
         4252,
         11854,
         41902,
         14134,
         14395,
         131940,
         97351,
         8079,
         4254,
         20359,
         14072,
         22316,
         93519,
         12273,
         20656,
         86004,
         19637,
         4251,
         10757
      ],
      "backdrop_path": "/fl3qYiOMao4BJu2anQh7zKKDZXo.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "TheTenth",
         "id": "5a8d46e4c3a36820a800564b",
         "content": "Gurukul university is know for its excellency. Her dean Narayan Shankar (Amtabh Bachchan) has very strict rules though : you must commit to your studieswith no distractions, especially love. \r\n\r\nWhen new students Karan (Jimmy Shergill), Sameer (Jugal Hansraj) and Vikram \"Vicky\" (Uday Chopra) enter, they have dreams of great success in life. When out of the school for errands, they meet Kiran (Preeti Jhangiani), Sanjana (Kim Sharma) and Ishika (Shamita Shetty) and start developing feelings for them. But Kiran tells the others of the story of the \"sad poet\". Once a student in Gurukul, he fell in love with a girl, they got along very well, but she was Narayan's daughter and when he heard about that, he fired the young man without even seeing him, and when fired from Gurukul, you can never find a place in another university.\r\nSo they have no choice but get on with the studies.\r\n\r\nOne day, a new professor comes, Raj Aryan Malhotra (Shah Rukh Khan), he wants to teach music, and at first Narayan refuses, but gives him his chance to teach music if he finds enough students. But Raj is not here to only bring back love in the students' hearts, he has some unfinished business with Gurukul\r\n\r\nThis is a romantic/drama, but in the Bollywood way, there are lots of funny moments. The story is both the developing love stories of the new students, and the story of Raj (and also Kake - Anupam Kher in a very funny role). It's very impressive how they fit 4 love stories and an opposition of character in the same movie. Acting is astounding by SRK and Bachchan, and strong from the newcomers. The dance numbers and songs are so great too.\r\nVery recommended.",
         "url": "https://www.themoviedb.org/review/5a8d46e4c3a36820a800564b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Narayan Shankar",
               "gender": 2,
               "credit_id": "52fe44509251416c7503061d",
               "name": "Amitabh Bachchan",
               "profile_path": "/9daoHX8vQrrk2oLQQdrvRV0UlE6.jpg",
               "id": 35780,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Raj Aryan Malhotra",
               "gender": 2,
               "credit_id": "52fe44509251416c75030621",
               "name": "Shah Rukh Khan",
               "profile_path": "/unfoh4zAiPvnQsHeE2CUgpNOX9u.jpg",
               "id": 35742,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Megha",
               "gender": 1,
               "credit_id": "52fe44509251416c75030647",
               "name": "Aishwarya Rai Bachchan",
               "profile_path": "/3iSTsyBx5FwfbIrMJXMKFJ0eWlL.jpg",
               "id": 87773,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Karan Choudhry",
               "gender": 2,
               "credit_id": "52fe44509251416c7503064b",
               "name": "Jimmy Shergill",
               "profile_path": "/1Pj38LAhEceystAgXOw4oP8Sr0m.jpg",
               "id": 35792,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Kiran",
               "gender": 0,
               "credit_id": "52fe44509251416c75030657",
               "name": "Preeti Jhangiani",
               "profile_path": "/qcDYeBpwQRKoXBRiKLtQfx67V9h.jpg",
               "id": 125205,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Sameer Sharma",
               "gender": 2,
               "credit_id": "52fe44509251416c75030625",
               "name": "Jugal Hansraj",
               "profile_path": "/uJErrCnZF5E72fSAH2cT2WjWnCa.jpg",
               "id": 69711,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Sanjana",
               "gender": 1,
               "credit_id": "52fe44509251416c75030653",
               "name": "Kim Sharma",
               "profile_path": "/91y8GVJlS9YfGGiPHe2DgbYY4gc.jpg",
               "id": 87705,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Kake",
               "gender": 2,
               "credit_id": "52fe44509251416c7503066b",
               "name": "Anupam Kher",
               "profile_path": "/kgU5Ap1Kf9RnicB5DMcXEZqed2f.jpg",
               "id": 6217,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Vikram Kapoor",
               "gender": 2,
               "credit_id": "52fe44509251416c7503066f",
               "name": "Uday Chopra",
               "profile_path": "/dE8SJ1In3L5zHeVOB91LBJXmtN3.jpg",
               "id": 69709,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Ishika Dhanrajgir",
               "gender": 0,
               "credit_id": "52fe44509251416c7503064f",
               "name": "Shamita Shetty",
               "profile_path": "/zAJhRuHWW3i74did86oJGADtcjr.jpg",
               "id": 85732,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Preeto",
               "gender": 1,
               "credit_id": "52fe44509251416c75030667",
               "name": "Archana Puran Singh",
               "profile_path": "/xO2umMOSVoZb1gFr5Amm9JvhzbS.jpg",
               "id": 87304,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Major General Khanna",
               "gender": 0,
               "credit_id": "52fe44509251416c7503065b",
               "name": "Amrish Puri",
               "profile_path": "/nrRQUwZcPYUWfpgpL2g7Grkb3Mz.jpg",
               "id": 691,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Nandini",
               "gender": 0,
               "credit_id": "52fe44509251416c7503065f",
               "name": "Shefali Shah",
               "profile_path": "/7FYMoD3iEWIELBjfRt6c87HIoy0.jpg",
               "id": 120430,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Sanjana's Father",
               "gender": 2,
               "credit_id": "52fe44509251416c75030663",
               "name": "Saurabh Shukla",
               "profile_path": "/cb67OSMb4Mz7UVKzRuYPkuS7ZoP.jpg",
               "id": 76789,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 0,
               "credit_id": "59732282925141787a006158",
               "name": "Parzaan Dastur",
               "profile_path": "/oiUaJs2ynsXhCq6t9pDheNXrHpP.jpg",
               "id": 1835337,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Miss Monica",
               "gender": 1,
               "credit_id": "59da54b792514124c50451d6",
               "name": "Helen",
               "profile_path": "/i71XRME3MCKrboV5drbty69SKfI.jpg",
               "id": 110102,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44509251416c7503062b",
               "name": "Aditya Chopra",
               "profile_path": "/zEVU7NkHcsZi4gjp2x8GC7pdY6H.jpg",
               "id": 35771,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44509251416c75030631",
               "name": "Aditya Chopra",
               "profile_path": "/zEVU7NkHcsZi4gjp2x8GC7pdY6H.jpg",
               "id": 35771,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c75030637",
               "name": "Yash Chopra",
               "profile_path": "/69iwaoauWMlXGIeOww5ysXqe5Mo.jpg",
               "id": 35770,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c7503063d",
               "name": "Jatin Pandit",
               "profile_path": null,
               "id": 69712,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44509251416c75030643",
               "name": "V.V. Karnik",
               "profile_path": null,
               "id": 69714,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c75030675",
               "name": "Manmohan Singh",
               "profile_path": null,
               "id": 82079,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.522425,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 11518,
      "vote_count": 74,
      "budget": 0,
      "overview": "In India, open romance is forbidden, as is showing affection in public. A college principal named Narayan is a strong believer in this, aware that a male student named Vicky is in love with Ishika; while another male student is hopelessly in love with Sanjana; and a third man named Karan is in love with a married woman named Kiran. No amount of persuasion can get Narayan to change his mind. Then the college recruits a music teacher named Raj, who eventually starts fanning the flames of love among the students, much to Narayan's chagrin, anger, and displeasure. Things get worse when Narayan finds out that Raj was the very man who fell in love with his daughter who eventually committed suicide when he didn't grant them permission to get married. Will the six young people be also heartbroken by Narayan, and if so, who will be the first to kill himself or herself?",
      "similar": [
         10947,
         449176,
         11887,
         8457,
         7326,
         85350,
         2108,
         10530,
         272693,
         10229,
         9880,
         308369,
         286565,
         8193,
         315635,
         8363,
         3597,
         133805,
         10625,
         376660
      ],
      "original_title": "मोहब्बतें",
      "runtime": 216,
      "poster_path": "/zB7zJQgk4pPoxsPzZP0CqUgHuXN.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": "/5WSkzUe6OiyKlpX2hJUghLlWkiU.png",
         "name": "Yash Raj Films",
         "id": 1569,
         "origin_country": "IN"
      }],
      "release_date": "2000-10-27",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Some Love Stories... Live Forever",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Aditya Chopra"],
      "runtime": 216,
      "synopsis": "Three young men arrive at a famous private school in India, Gurukul. Gurukul is headed by a stern headmaster named Narayan Shankar, played by Amitabh Bachchan. The headmaster has instituted a strict anti-romance policy. Students are there to learn, he says, not to party and flirt. Students who become romantically involved will be expelled. The three of them all have their eyes set on a girl. Sameer played by Jugal Hansraj, who works in a cafe, is in love with his long time friend Sanjana played by Kim Sharma but she has a boyfriend. Vikram played by Uday Chopra accidentally bumps into Ishika played by Shamita Shetty when he catches her stealing apples from the Gurukul gardens and Karan played by Jimmy Shergill sees Kiran played by Preeti Jhangiani on a hill when he is waiting for a train. The three of them, encouraged by Raj Malhotra played by Shahrukh Khan, follow their hearts and break the rules of the school. As the story unravels, the three boys fall in love and the relationship between the headmaster and the music teacher begins to become strained. It is revealed the Raj was once also a student in Gurukul, who fell in love with the headmasters daughter, Megha played by Aishwarya Rai. When Narayan found out he banned them from seeing each other, and after Megha tried consoling her father she bacame upset and ultimately comitted suicide by throwing herself out the window.",
      "writers": [
         "Aditya Chopra",
         "Aditya Chopra"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0213890/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2ODY3NjQxNF5BMl5BanBnXkFtZTcwOTE2MjYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Amitabh Bachchan, Shah Rukh Khan, Uday Chopra | See full cast and crew »"],
      "reviews": [
         "I have seen some good movies in my life but this one totally caught me off guard. I have never seen any character, in movies or real life that believes in love and the power of love as strongly as Raj Aryan does. Raj Aryan's character is everything that is good about mankind. Ironically it was a quirk of fate that made him the way he is, but nevertheless his character is most amiable. Amitabh's character is just perfect for him, something he is very comfortable playing. With the changing times, he had turned from the `Angry Young Man' to the `Angry Old Man' - he plays it wonderfully. One can actually feel his pain and sympathise with his character. The three love stories are the only loose ends of the movie but without them the overall movie would not have been able to take shape. If you believe in the inherent goodness of mankind then this movie is for you. It teaches us no matter what we do, love finds a way. But the real reason you should see this movie is because it's a real entertainer.",
         "One of the best Shahrukh Khan movies I must say. I am not a Shahrukh fan but this has to be one of his best performances. I am not a Hindi movie buff, and I prefer watching English rather than the soapy Hindi movies but this 3 hour plus epic has to be an exception. One of the prime reasons why I loved this movie is because the fictitious \"Gurukul\" is almost identical to my old school, Calcutta Boys'. When Big B says those words that \"Gurukul students hold top positions in all fields in the outside world, due to the strict discipline\" I am forced to think back of Clifford Hicks, our principal in the late 60's. He became nominated to the Parliament because of his fame as a stupendous disciplinarian. Back to the movie, Shahrukh plays a music teacher, whose appointment is much to the displeasure of the principal of the school. Little does he know that he is the former lover of his daughter who committed suicide since she couldn't be with him. Her death drove her father to sheer rage that he drove her young lover a student of his own school, and stopped his education altogether, by refusing him admission in all of the contemporary schools. Years later driven by his own passion and fuel, the young man returns to his old school determined to undo the wrongs that caused him so much misery and suffering. He learns of 3 such youngsters who had fallen in love to 3 different girls. He encourages them and gives them ideas of winning the girls' favours. This infuriates the principal and he stops all of them and even threatens to throw them out much like the fate of their music teacher. In the end this teacher reveals his true identity in front of the man who could have been his father in law. Suffering from grief and sorrow the principal breaks down and in the end love rules over discipline. One of the best family movies for a long time, with plenty of comedy and emotion. Arguably the best performances of King Khan and one of the best of Big B. Overall its a must see for everyone. If you haven't seen it yet, I recommend you getting a DVD and watch it right now.....",
         "Probably the one serious complaint against Mohabbatein is that the movie just goes on and on and on and on... lasting for more than 3-and-a-half hours! (not that its completely a bad thing..) in fact, most of the movie is actually quite enjoyable. what really makes the movie kinda drag is the tacky ending, in which narayan shankar (an excellent amitabh bachchan) gives this exceptionally long lecture about him losing to love. aside from that, everything else in the movie is of supreme chopra quality! all six newcomers (though jugal hansraj isnt technically a newcomer) have managed to give decent performances, and have stood their ground in front of amitabh and shah rukh. the movie is reminiscent of several other blockbusters of the past, such as dilwale dulhaniya le jayenge (also directed by aditya chopra), kuch kuch hota hai, and dil to pagal hai.. in fact, mohabbatein steals many of the elements of these previous classics! yet, the audience comes out of the theater feeling full and satisfied. though not as emotionally gut-wrenching as DDLJ, mohabbatein is still a gem of a movie.. P.S. if you still don't know about the famed special appearance of this mega-actress, then i suggest you not try to find out yourself.. trust me, it's intended to be a surprise!",
         "The movie was one of the biggest hit in Bollywood and won some awards too. After all, it was a perfect entertainer \"paisa wasool\" movie. The length come out as as positive part. In India the more length is the movie the more \"paisa wasool\" it is. Especially movie like this, which is full of romance, drama, music and female body shows. I love the music of the movie. It was great. Also the acting by the legends Amitabh and SRK. And as usual of Yashraj films, the filmography and camera work was great too. The problem I have is with what exactly message the movie wants to spread? I feel that the movie is trying to say, love first other things later. Other things including discipline, your studies and your career. The \"Gurukool\" is an ideal school for the college students. The principle expects from them that they should only concentrate on their studies, their career, personal development and their future, at least for the time which they will be spending in this college. (Thats another problem. What kind of school is it? Is it after 10th or after 12th school? And if it is after 12th, why are they wearing uniform?) And to accomplish this he has some strict set of rules. (They are too strict, Agreed.) Now from nowhere a new music teacher comes to college (when the principle does not allow any cultural program in college, why at first place he appointed this music teacher?). Now the music teacher is a real romantic guy, who has done romance with the daughter of the principle, when he himself was in the same college. As this is against the rules of college, principal throws the boy out, and his lover suicides, as her father rejected her love. (This is far too stretched. What? No, it isn't. OK. Not far stretched, and can happen in reality.) And this teacher has now swore that he will fill the entire college with the love. Means he will teach the student the cheap acts of how to write love letter in more effective ways (like using 'Piple ka Panna' as letter), or bung the lecture to meet the girlfriends, and also by bringing neighboring girls to the hostel in absence of principal.(In reality, one of those girls will get pregnant in such situation.)By doing this he think he is doing a great thing for the boys and for the society. By now, you must have understood what my problem is. They say at the end that a balance of discipline and love is required, but actually more weight in given to love, and the man with the discipline has negative shades in character. The next part of the movie is clear. These three students fail in their exam, or pass with the low score, and after college has problem in finding job, and very low knowledge for opening their own business. But the movie ends way before this happens. It is good to give entertainment to the people, but then one should also pay the attention to what actually you are teaching. The movie which was released at the same time \"Mission Kashmir\" was having exactly opposite characteristics. The movie was having very less entertainment but gives out gives out good moral to the people. And again it is fact that \"Mission Kashmir\" flops and Mohobbatein was a great hit. Sometimes, things like these upset me for Bollywood. But fortunately now the Bollywood audience is also giving attention to the spirits of the movie. And hence KANK is super-flop, and Munnabhais are doing great in all parts.",
         "Mohabbatein is set in the school of Gurukul, where Narayan Shankar runs his school through fear. He teaches his students how to become great and successful men, bringing discipline into their lives. Raj Aryan believes in freedom of expression through music, and love being more powerful than Narayan Shankar's rule through fear. Through the lives of three young students, Raj Aryan tries to break Gurukul's traditions, and bring love back to life. Maybe the story is unrealistic, maybe the songs are not as original as they could be, but Mohabbatein works. Everyone who loves this film loves it for different reasons, because each story appeals to different people. For me, I felt some of Raj Aryan's dialogue so moving that I've begun thinking about the love in my own life differently. For some people it was Amitabh Bachchan who stole the film, for others it was the love stories between the youngsters. I'm fairly sure, if you have ever felt true love and true loss, you will love this movie. It is a simple movie, just like love should be.",
         "Put a legend, an icon, a star, and six fresh buds waiting to bloom all in the same movie and what do you get? Mohabbatein. Sure, the story is the oft-repeated tale of forbidden love, unappreciated lovers and the traditions that gag and bind us, but the all-star cast, the skilled direction, and lively musical numbers all contribute to make this a movie worth noting. The setting of Mohabbatein is the Gurukul School, an elite school housed in a cold, uninviting, castle-like edifice. Narayan Shankar (Amitabh Bachchan) is the stern, disciplinarian and somewhat tyrannical headmaster of Gurukul who rules the school with an iron fist. The story begins on a dark and quiet night at the local train stations where three young men, prospective students at the school, meet on the platform and set out on a journey that brings them closer together than they ever could have imagined. Vicky (Uday Chopra) is an athletic, energetic playboy type, seemingly unshaken by the harsh reality of the school. Sameer (Jugal Hansraj) is the timid and shy one with boyish charm and innocent looks. And Karan (Jimmy Shergill) completes the trio as the more mature, intense member of the pack. The three lads are struck by cupid's arrow when they meet the three heroines; Vicky loses his heart to a rich and spoiled girl named Ishika (Shamita Shetty) while Sameer is reunited with his childhood buddy, the bubbly Sanjana (Kim Sharma) and Karan falls hard for the bashful widow, Kiran (Preeti Jhangiani). As with every true-to-form Bollywood movie, their love stories are met with several obstacles, such as differences in class, no-good boyfriends, and familial obligations, but the most important hurdle in their path is none other than Narayan Shankar who is convinced that love is a pure waste of time. A glimmer of hope comes their way when a maverick music teacher, Raj Aryan (Shah Rukh Khan) sweeps into the picture and helps nurture their young loves. What follows is a battle of good and evil, love and hate, and sheer determination and conviction on both sides at the end of which � (well, let's not get carried away! Just make sure you have a box of tissues handy!).",
         "Mohabbatein is a beautiful and sensitive.It is one of my favorites.This was Aditya copra's Second film after Ddlj(Dilwale Dulhania Le Jayenge).I have heard Aditya wanted this to be his debut.He has done a great job.The story is sweet.It opens when 3 boys named Karan,Samir,Vickram are going to Gurukul.The headmaster says no to love.Later the 3 boys are in love with Ishika,Sanjana,Kiran.Then a music teacher cames to school named Raj.On valentines day he tells that he used to be a student there.He also told he was in love with principals only daughter Megha.When Megha found that he was thrown out.She committed suicide by jumping out of a window.Years later (Possibly 6-7 years)Raj has come back to take revenge.On valentines night he found everybody in love.Raj exxplains to him.AND BELIEVES IN LOVE..Shahrukh dominates the flick with a brilliant performance.Ash did good.Bachan was wasted.Sanjay Dutt should have played his role.Shamitha,Kim,Uday did a bad job.The other 3 new comers did well.Anupham,Archana,Amrish,Shefali were good in cameo.Dialogs are terrific.Scenes were the boys except Jugal when they say the girl there emotions were beautiful and lovely.Chemistry beetween Ash and Shah Rukh was amazing the other lead pairs did not have chemistry.Songs are great.The songs like\"Hum Ko Humise\" and\"Zinda Rethi Hain\"are deeply moving and soothing and are emotional ones.Highly Reccomnded",
         "Mohabattein was the first Hindi movie I ever saw. It was sent to me by a friend who is crazy for Shahrukh Khan. My first impressions were, `WOW, this Shahrukh guy has a tremendous screen presence (but, yikes, what a profile!)' and `I love the old guy with the black hair and the white beard. He's too cool.' As for the movie itself, I wondered how in god's name anybody could enjoy that horrid cat-in-heat screeching which issued forth whenever that gorgeous young woman (Aishwarya Rai) opened her mouth to sing. And I found the interminable love stories of the three young couples to be boring, boring, boring. I spent all my time waiting for Mr. Aryan and Mr. Shankar to come back onscreen. As for the story, I was completely out of sympathy for the silly idea that it's more important to spend your college years running around trees and going to dance parties with scantily clad girls than to be studying or going to prayer. As a westerner who has watched my own treasured Catholic traditions thrown overboard one by one for every goofy, modern idea that comes down the pike (clown Masses, anyone?) I was firmly on the side of Mr. Shankar: `I don't like change, Mr. Aryan!' I've since learned that Amitabh Bachchan is like the Sean Connery of Indian cinema, and that Shahrukh Khan is known better for his manic, over-the-top performances than the quiet, mature act I saw in Mohabattein. (I cringe whenever he is referred to as `The Tom Cruise of India'�Tom Cruise can only wish he had Shahrukh's talent and screen presence. Sharhukh definitely would win that contest by a nose.) But to be honest, I didn't like this movie much, and after seeing about 50 Hindi films since then, I still don't like it much. It has some great songs that are almost completely destroyed by the ancient, crackling voice of Lata Mangreshkar (sorry if I spelled it wrong), and I still can't sit through the endless love stories of the three young couples. ONE couple would have been plenty to get the point across, and it would have cut the movie by 45 minutes or so, which it badly needs. As a person who grew up on the MGM musicals of the 40s and 50s, I have eagerly embraced Bollywood (but no kissing). And although I get bored pretty easily with the dancing around trees (it all starts to look the same), I just can't get enough of those Holi celebrations! Bring �em on.",
         "This movie clearly proves that Love is the strongest thing in this world more powerful than fear or anything else. I have seen many Hollywood and Hindi love based movies but this is best. \"today you want to forget her, just because she loves someone else this is very bad.Never fall in love with a condition there are no conditions in love so there should not be any regrets, so what if today she is not with me i still love her the same way not because i can n0t find someone else to love, but loving her makes me happy whenever i miss her, i close my eyes and she is with me\" Directed by Aditya Chopra the same guy who directed DDLJ...",
         "This movie was really phenomenal. Seeing two talented actors like Amitah Bachan and Shahrukh work side by side was mind blowing. I wish them both success in all their future endeavours.The new actors as well were well casted and may their future be always bright. The story reminds us that love is all powerful and with it we can overcome the most difficult of situations."
      ],
      "genres": [
         "Musical",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Yash Raj Films"],
      "summaries": [
         "In India, open romance is forbidden, as is showing affection in public. A college principal named Narayan is a strong believer in this, aware that a male student named Vicky is in love with Ishika; while another male student is hopelessly in love with Sanjana; and a third man named Karan is in love with a married woman named Kiran. No amount of persuasion can get Narayan to change his mind. Then the college recruits a music teacher named Raj, who eventually starts fanning the flames of love among the students, much to Narayan's chagrin, anger, and displeasure. Things get worse when Narayan finds out that Raj was the very man who fell in love with his daughter who eventually committed suicide when he didn't grant them permission to get married. Will the six young people be also heartbroken by Narayan, and if so, who will be the first to kill himself or herself?",
         "GURUKUL is one of India's top colleges headed by Narayan Shankar. He is a man of staunch principles who does not like any changes in the way the college is run. He also opines that love brings only pain with it, so romance is strictly forbidden within the walls of GURUKUL. Enter Raj Aryan, the music teacher who not only believes in love but also induces three of his students to follow their heart and fall in love. Vicky loves Ishika from girls' college nearby but Ishika hates him . Then there is Sameer who loves his childhood friend Sanjana but she has a boyfriend already. Lastly there is Karan who loves Kiran but their love is forbidden since Kiran is already married to a soldier who is reported missing and believed to be dead. When Narayan Shankar comes to know of Raj's activities he decides to fire Raj . But then Raj reveals his real identity, his past connection with Narayan Shankar, and that the real reason behind his arrival to the college is to change the old-fashioned way it is run. This confrontation draws the battle lines between the two strong-willed men. Who wins in the end - Raj or Narayan? Do the three boys finally find their love? Watch for yourself in MOHABBATEIN.",
         "Three young men arrive at a famous private school in India, Gurukul. Gurukul is run by a stern headmaster named Narayan Shankar, played by Amitabh Bachchan. The headmaster has instituted a strict anti-romance policy. Students are there to learn, he says, not to party and flirt. Students who become romantically involved will be expelled. The three of them all have their hearts set on different girls. Sameer works in a café and is in love with his long time friend Sanjana. Unfortunately for Sameer, she has a boyfriend. Vikram accidentally bumps into Ishika when he catches her stealing apples from the Gurukul gardens, and falls in love at first sight. Karan sees Kiran on a hill when he is waiting for a train. Kiran is married to an Army Officer who never returned from war, yet she holds hope that he is alive. The three of them, encouraged by Raj Aryan, their music teacher, follow their hearts and break the rules of the school. As the story unravels, the three boys fall in love and the relationship between the headmaster and the music teacher begins to become strained. Much to the chagrin of the headmaster, Raj begins to implement many changes. It is revealed the Raj was once also a student in Gurukul, who fell in love with the headmasters daughter, Megha played by Aishwarya Rai. When Narayan found out he banned them from seeing each other, and after Megha tried consoling her father she became upset and ultimately committed suicide by throwing herself out the window. This tragic experience inspired Raj to spread love throughout Gurukul, and in the end, Narayan Shankar realizes that love and change are necessary.",
         "Narayan Shankar heads a private institution for male students in and around India to study in. He has certain rules and regulations that must be followed by all his students without any exception; 3 young men Vikram Kapoor, Sameer Sharma and Karan Choudhry takes an admission, fall in love with three young ladies Vikram with Ishika Dhanrajgir, Sameer with Sanjana and Karan with a widowed young woman named Kiran. Unfortunately they are unable to continue with their romance due to the fear of being expelled by Narayan Shankar; however their fear disappears when they are encouraged by the new music teacher, Raj Aryan Malhotra to boost their romance without knowing that Narayan is against love as in the case of Aryan who was at one time a student of Narayan's institution and was rusticated as he was in love with Narayan's only daughter, Megha.",
         "Narayan Shankar, the principal of a prestigious college, decides to reprimand Raj Malhotra, one of his students, for making romantic advances toward Megha, his only daughter, knowing fully well that both Megha and Raj are in love. Megha is heartbroken and eventually dies. Years later, Narayan hires a music teacher named Aryan, unaware that it is really Raj Malhotra, who has now come back to teach Narayan a lesson that will never be forgotten."
      ],
      "budget": 4000000
   },
   "movielensId": 74426,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2000-10-27",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Aditya Chopra"],
      "runtime": 216,
      "movieId": 74426,
      "title": "Love Stories",
      "mpaa": "PG",
      "actors": [
         "Amitabh Bachchan",
         "Shah Rukh Khan",
         "Aishwarya Rai Bachchan",
         "Jimmy Shergill",
         "Preeti Jhangiani",
         "Jugal Hansraj",
         "Kim Sharma",
         "Anupam Kher",
         "Uday Chopra",
         "Shamita Shetty",
         "Archana Puran Singh",
         "Amrish Puri",
         "Shefali Shah",
         "Saurabh Shukla",
         "Parzaan Dastur",
         "Helen"
      ],
      "imdbMovieId": "0213890",
      "originalTitle": "मोहब्बतें",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "IHneFtei6P4",
         "W9uBxzhE98E",
         "hMpf6fFoQXA",
         "m8G_KiZG6II",
         "OjlZFIY7VHU"
      ],
      "plotSummary": "In India, open romance is forbidden, as is showing affection in public. A college principal named Narayan is a strong believer in this, aware that a male student named Vicky is in love with Ishika; while another male student is hopelessly in love with Sanjana; and a third man named Karan is in love with a married woman named Kiran. No amount of persuasion can get Narayan to change his mind. Then the college recruits a music teacher named Raj, who eventually starts fanning the flames of love among the students, much to Narayan's chagrin, anger, and displeasure. Things get worse when Narayan finds out that Raj was the very man who fell in love with his daughter who eventually committed suicide when he didn't grant them permission to get married. Will the six young people be also heartbroken by Narayan, and if so, who will be the first to kill himself or herself?",
      "tmdbMovieId": 11518,
      "avgRating": 3.14035,
      "releaseYear": "2000",
      "numRatings": 57,
      "posterPath": "/zB7zJQgk4pPoxsPzZP0CqUgHuXN.jpg"
   }
}