{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "french noir",
         "id": 155845
      }],
      "imdb_id": "tt0046429",
      "video": false,
      "title": "Thérèse Raquin",
      "recommendations": [
         98636,
         111397,
         115647,
         11907,
         73138,
         37462,
         68528,
         57251,
         42720,
         108634,
         44052,
         29268,
         73455,
         69995,
         26380,
         43338,
         46149,
         45577,
         91426,
         84508
      ],
      "backdrop_path": "/yWYp0WsmF1lYOUqdbS7fP6sEAHt.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55213047c3a36828d10017c1",
         "content": "Thérèse is no Tease.\r\n\r\nThérèse Raquin (AKA: The Adultress) is directed by Marcel Carné and Carné co-adapts the screenplay with Charles Spaak from the Émile Zola novel. It stars Simone Signoret, Raf Vallone, Jacques Duby, Maria Pia Casilio and Roland Lesaffre. Music is by Maurice Thiriet and cinematography by Roger Hubert.\r\n\r\nCarné reworks Zola's novel to be set in post-war Lyon and slips into a film noir gear. Plot essentially finds Signoret as Raquin, a severely repressed woman stuck in a marriage to her wimpy weasel of a cousin, not only that but she also has to share a home with his domineering mother. Then one day the strapping Laurent LeClaire (Vallone) enters her life, sparking a fiery affair, but as plans for the future are plotted, a turn of events drastically changes everything.\r\n\r\nThe characterisations are strongly performed, the five principals (Lesaffre arrives late in the play as a key character) giving performances that really draw you into their respective worlds, for better or worse as regards the human condition. Carné skillfully blends the beautiful side of Lyon, such as the quaint cobbled streets and the River Rhone, with a dull bleakness that fogs Thérèse, a woman who has forgotten how to smile, sexual fulfilment a non entity. Hubert also brings his photographic skills to the show, providing some blisteringly gorgeous night shots that offer hope for the new found lovers. But there is a sign post up ahead and it says that the next stop is noirville, and after having spent half the film building his characters, Carné dashes hope and replaces it with misery. Fate plays a big part in the crux aspects of the film, a film noir staple of course, right up to the clinical finale that comes with a thunderous fait accompli.\r\n\r\nIt's a bit draggy in parts as the director is at pains to show the humdrum side of life, but the change of gear at the mid-point - and the brilliant last quarter, make this a worthy addition for collectors of Frenchie noir. 8/10",
         "url": "https://www.themoviedb.org/review/55213047c3a36828d10017c1"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Thérèse Raquin",
               "gender": 1,
               "credit_id": "52fe4774c3a368484e0c7dbb",
               "name": "Simone Signoret",
               "profile_path": "/vRI2Vt3HX911uDrVK170waQsL8b.jpg",
               "id": 12266,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Laurent",
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7dbf",
               "name": "Raf Vallone",
               "profile_path": "/kmXprY5YSYc5ubCVzDjGTK0lntq.jpg",
               "id": 3268,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Camille Raquin",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7dc3",
               "name": "Jacques Duby",
               "profile_path": "/yy9BaP1Nokiz5URuMdrm6PoAQ4t.jpg",
               "id": 28262,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Georgette, la bonne",
               "gender": 1,
               "credit_id": "52fe4774c3a368484e0c7dc7",
               "name": "Maria Pia Casilio",
               "profile_path": "/myrv6zhrilKAfjEJVORpKyysTXU.jpg",
               "id": 224209,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Henri dit « Riton »",
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7dcb",
               "name": "Roland Lesaffre",
               "profile_path": "/f0uUxD6ECVtfjsqiY51OK1t4CKB.jpg",
               "id": 36911,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "le médecin",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7dcf",
               "name": "Nerio Bernardi",
               "profile_path": "/sFt9XjJo2rq1NAuAZDT62DOrkJw.jpg",
               "id": 99530,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Françoise",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7dd3",
               "name": "Françoise Vernillat",
               "profile_path": null,
               "id": 579760,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mme Noblet",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7dd7",
               "name": "Madeleine Barbulée",
               "profile_path": "/b5JQiHcQsd9tbGVVNPvlfxsPfEz.jpg",
               "id": 28278,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "M. Michaud",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7ddb",
               "name": "Marcel André",
               "profile_path": "/sSeP74JX0jYRR5aQdn9Mm34ppKj.jpg",
               "id": 9743,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "le contrôleur dans le train",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7ddf",
               "name": "Paul Frankeur",
               "profile_path": "/eZIlxKZY4Q7raxVaYDOYWYctMYH.jpg",
               "id": 24684,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "le chef de gare de Dijon",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7de3",
               "name": "Lucien Hubert",
               "profile_path": null,
               "id": 40537,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "le serveur de l'hôtel",
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7de7",
               "name": "Jacques Hilling",
               "profile_path": "/2d61vEdKwjf8qdnNXSss8PnJUQo.jpg",
               "id": 55620,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "un camionneur",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7deb",
               "name": "Alain Terrane",
               "profile_path": null,
               "id": 579761,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "M. Grivet",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7def",
               "name": "Martial Rèbe",
               "profile_path": null,
               "id": 579762,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Madame Raquin",
               "gender": 0,
               "credit_id": "52fe4774c3a368484e0c7e0b",
               "name": "Sylvie",
               "profile_path": "/dDBLIqQ3juohC6Jso0qNfOHX4mL.jpg",
               "id": 37462,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7db7",
               "name": "Marcel Carné",
               "profile_path": "/6ZFHCA0MlQDLIMUzUykmA1Nx08G.jpg",
               "id": 25161,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7df5",
               "name": "Émile Zola",
               "profile_path": "/oXA6DkOtc1xYaKmmbAUc2l56UEh.jpg",
               "id": 87667,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7dfb",
               "name": "Marcel Carné",
               "profile_path": "/6ZFHCA0MlQDLIMUzUykmA1Nx08G.jpg",
               "id": 25161,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7e01",
               "name": "Charles Spaak",
               "profile_path": null,
               "id": 39206,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4774c3a368484e0c7e07",
               "name": "Charles Spaak",
               "profile_path": null,
               "id": 39206,
               "department": "Writing",
               "job": "Dialogue"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.147241,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 67736,
      "vote_count": 11,
      "budget": 0,
      "overview": "Star-crossed lovers Thérèse (Simone Signoret) and Laurent (Raf Vallone) think they've gotten away with murder after Thérèse's weakling husband \"falls\" from a speeding train. But when forced to contend with a blackmailer's demands and the mute accusations of Thérèse's mother-in-law (French stage and screen diva Sylvie, in a scene stealing performance), it's only a matter of time before the law, their passion or blind chance trips them up.",
      "similar": [
         269,
         1818,
         5511,
         1093,
         10363,
         827,
         2786,
         8072,
         1651,
         4191,
         42741,
         20778,
         2912,
         34145,
         25047,
         2527,
         27430,
         35797,
         68822,
         49842
      ],
      "original_title": "Thérèse Raquin",
      "runtime": 102,
      "poster_path": "/iYxDp15T8R2n69ucSsWGlODClOp.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Paris Films Productions",
            "id": 386,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lux Film",
            "id": 1679,
            "origin_country": ""
         }
      ],
      "release_date": "1953-11-06",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marcel Carné"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Émile Zola",
         "Marcel Carné"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0046429/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MzgzNTc1M15BMl5BanBnXkFtZTcwMzQ3NjUzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Simone Signoret, Raf Vallone, Jacques Duby | See full cast and crew »"],
      "reviews": [
         "People generally think that Carné's heyday comes to an end with \"les portes de la nuit\" (1946)And it's sure that- whatever the new wave's view on the matter-these thirties and forties movies are among the very best French cinema gave to the world(\"le jour se lève\" \"quai des brumes\"\"les enfants du paradis\" and \"hôtel du nord\" ,to name but four are the crème de la crème ,easily equalling the best of Renoir)One always tries to minimize Carné's importance,mentioning the actors (Gabin,Arletty,Simon,et al)and Jacques Prévert's screen plays.One often forgets that Carné did direct these masterworks and he always chose the right actors,decorators(Alexandre Trauner who was to work in Hollywood later),musicians,with mind-boggling results. \"Therese Raquin\" (1953)came before the new wave but Carné 's credibility was sinking fast and he was given the coup de grace by his young \"nouvelle vague\" colleagues -before being restored to favor after 1980,actually after he stopped directing .\"Therese Raquin is a fine mixing of pre and post -war elements Pre-war:the lovers' impossible dream,fate -here represented by a young sailor-,scumbags who cannot stand true love-the scene on the train between Raf Vallone and Jacques Duby recalls the famous one between Jean Gabin and Jules Berry in \"le jour se lève\" (1939) particularly when Vallone screams\"are you gonna shut your mouth?\"(the lines are almost the same). Post-war:the influence of the film noir-which was influenced by Marcel Carné's work mainly \"le jour se lève\"-who cares if it's a Zola adaptation?:the scenarists have transposed the action to the fifties,to the era of the making of the movie,and James Cain could have written it as the story reminds the spectator \"the postman always rings twice:more than Tay Garnett's excellent version(1946),\"Therese Raquin\" is actually closer to Luchino Visconti's (Ossessione,1942),because of the Italian Raf Vallone's presence. But in spite of the transposition,Zola's spirit remains intact:the stifling petit bourgeois milieu in which Thérèse (Simone Signoret)lives is meticulously depicted:the notions store ,the walk on the Rhone banks,the ludicrous board game,the dreadful mother-in-law(Sylvie is absolutely extraordinary;after she suffered an attack after her son's death,she's completely paralyzed ; only her eyes (her frightening eyes) are alive,accusing her daughter-in-law:Cain's eye in the Bible.In her over possessive part of a mother who has turned her only child into a poor guy,a sissy,Sylvie surpasses the excellent Signoret and Vallone. No,Carné's career was not over in 1946,but after \"Thérèse Raquin\",the slump began:\"\"les tricheurs\" (1958)tried to catch up with the nouvelle vague with mixed artistical results,but has remained watchable.\"Trois chambres à Manhattan\" (1965)was moderately interesting,thanks to its stars ,Maurice Ronet and Annie Girardot.After,it's downhill:\"les jeunes loups\" (1967)is a would be \"a la mode\" bomb,\"les assassins de l'ordre\"(1971) tried André Cayatte's style ,not exactly the right move and \"la merveilleuse visite\"(1973) failed dismally(as in \"les visiteurs du soir\",(1942),Satan sent two people,it's God's turn who send an angel!) \"Thérèse Raquin\" should not be missed.You won't be disappointed .",
         "I'll have to disagree with some of the more negative comments about this film. Marcel Carne has succeeded beautifully in capturing the mood and major themes of Zola's novel in THERESE RAQUIN. It's nice to see a film from the period dealing with common working class people caught up in the turmoil of love and everyday life. The main romantic leads initially seem a little mismatched but by film's end the ice has more than melted between them. How many times have we seen the female lead fall too quickly for her suitor. Here it takes its sweet time and plays the better for it. Signoret's titular character seems almost a bit too stoic but considering her numbingly bland and lenghty marital situation, it may well be authentic. As many women are in reality, Therese is fiercely loyal to her husband, whether he deserves it or not. The ruggedly handsome Raf Vallone is ideally cast as the trucker who steals her attention and makes a good contrast to her dishrag of a husband. A blackmailing sailor who appears in the middle of the film before making a menacing reappearance near the end is very effectively played by Rolland leSaffre. He is as creepy as Robert Mitchum in CAPE FEAR. Do seek this one out and enjoy the ride!",
         "Emile Zola's novel about adultery, blackmail and murder, was adapted for the screen by Marcel Carne and Chales Spaak, two men who knew about all the elements that show so prominently in the book. In fact, Mr. Carne seems the obvious choice to tackle this work that packs quite a lot. Emile Zola was one of France's best writers of his time. His work always reflected human beings at a crossroad, as is the case in \"Therese Raquin\", one of his best novels. Therese, the young woman at the center of the story, is married to her sickly cousin Camille. One look at Therese tells it all, she's caught in a no win situation as long as she remains married. Therese is ready to satisfy the sexual desires bottled in her. Enter the dashing young driver Laurent. He likes Therese and she feels, for once in her lifetime, the spark that brings her to life. It's clear she falls for this stranger with a passion she didn't know she had within her. Zola seems to be a role model for writers like James Cain, who also saw what passion could do to sexually repressed individuals. The theme of \"Therese Raquin\" evokes some modern novels like Mr. Cain's \"The Postman Always Ring Twice\", and \"Double Indemnity\", to cite only two of his works also turned into successful films. Camille, who senses his wife's betrayal, decides to take her away to some relatives where she would be safe, away from the temptation of the handsome man that could mean her salvation. Therese and Laurent have another thing in mind, as it becomes clear when the young lover happens to be in the same train as the Raquin. Little prepares them for the stranger that is also riding the train and who will come back to haunt them. Simone Signoret makes an appealing Therese. Ms. Signoret was an interesting actress to watch on any of the films she appeared. Therese was one of her best creations as she gives the director a nuanced performance in what remains to be one of her best roles she played on the screen. Handsome Raf Vallone appears as the man who seduces the beautiful woman in an unhappy marriage. Sylvie is perfect as the mother who knew in her heart about her niece's betrayal. Marcel Andre as the blackmailer Michaud also creates the necessary tension for the lovers. \"Therese Raquin\" is not seen often theses days, but it's worth a look for people who love the genre to watch one of Marcel Carne's best works in the French cinema.",
         "Therese Raquin (1953) You may be familiar with the lead actress, Simone Signoret, from Les Diaboliques, made a year after this film, and she plays a similar conflicted or complex, strong type of woman in a sordid world. She plays the title character, based on a Zola story, who is swept into a romance she doesn't completely expect and then a murder that she doesn't completely abhor. And she is rather brilliant, a slightly different type than American actresses of the time, but commanding in her stoic intelligence. The two men are both first rate, one a foreign (Italian) charmer and the other a sharper fellow who is only slightly over his head. In fact, everyone is just slightly extended into decisions they don't quite know how to make. The fact that things go wrong is just part of great drama, and part of life, too. The filming (photography and editing) is totally gorgeous here, The plot progresses slowly enough it might seem to drag, but I think it works in the long run, setting a deliberate and inevitable pace to events. What is maybe weakest is the ending, where things get a little spectacular, perhaps in a fascinating way, but certainly no longer believable. Director Marcel Carne is no household name in this country, but the strength of this film alone makes me want to find others and get a feel for his style. Recommended for those who like drama, melodrama, and a sort of Euro-noir style, and who don't mind reading subtitles.",
         "Because of the major impact they had as a team on both French cinema and cinema in general we tend to find ourselves speaking of Marcel Carne and Jacques Prevert as Pre and Post their collaboration, which spanned approximately ten years and delivered seven films, Jenny, Drole de Drame, Quai des Brumes, Le Jour se leve, Les Visiteurs du soir, Les Enfants du paradis and Les Portes de la nuit, which embedded themselves in the memory-banks of movie buffs the world over. Therese Racquin is post-Prevert Carne, dating from 1953, some seven years after their final collaboration Les Portes de la nuit and although Carne was never to make a wholly satisfying film without Prevert this is not as bad as you might think. It's tempting to find echoes of Double Indemnity inasmuch as there are scenes where 1) an adulterer lover hides behind an open door and 2) the 'inconvenient' husband is murdered on a train. Against this is the fact that in Double Indemnity it was the woman (Stanwyck) hiding behind McMurray's door as he ushered out Barton Keyes whilst here it is the man (Raf Vallone) hiding behind Therese's door as she speaks to her mother-in-law and in Indemnity Stanwyck's husband (Tom Powers) wasn't actually killed 'on' the train but his body was left on the tracks as IF he had fallen off. Here the confrontation between husband, wife and wife's lover takes place on the train and results in the husband's death. There was no way that Carne was going to make a BAD film but the Prevert touch is definitely missed. Signoret is, of course, superb but Raf Vallone was way out of his league in this company. The black and white photography enhances the mood and the 'feel' is about three-quarters right but the ill-contrived deus-ex machina lets down all that has gone before. Well worth watching.",
         "Thérèse Raquin (AKA: The Adultress) is directed by Marcel Carné and Carné co-adapts the screenplay with Charles Spaak from the Émile Zola novel. It stars Simone Signoret, Raf Vallone, Jacques Duby, Maria Pia Casilio and Roland Lesaffre. Music is by Maurice Thiriet and cinematography by Roger Hubert. Carné reworks Zola's novel to be set in post-war Lyon and slips into a film noir gear. Plot essentially finds Signoret as Raquin, a severely repressed woman stuck in a marriage to her wimpy weasel of a cousin, not only that but she also has to share a home with his domineering mother. Then one day the strapping Laurent LeClaire (Vallone) enters her life, sparking a fiery affair, but as plans for the future are plotted, a turn of events drastically changes everything. The characterisations are strongly performed, the five principals (Lesaffre arrives late in the play as a key character) giving performances that really draw you into their respective worlds, for better or worse as regards the human condition. Carné skillfully blends the beautiful side of Lyon, such as the quaint cobbled streets and the River Rhone, with a dull bleakness that fogs Thérèse, a woman who has forgotten how to smile, sexual fulfilment a non entity. Hubert also brings his photographic skills to the show, providing some blisteringly gorgeous night shots that offer hope for the new found lovers. But there is a sign post up ahead and it says that the next stop is noirville, and after having spent half the film building his characters, Carné dashes hope and replaces it with misery. Fate plays a big part in the crux aspects of the film, a film noir staple of course, right up to the clinical finale that comes with a thunderous fait accompli. It's a bit draggy in parts as the director is at pains to show the humdrum side of life, but the change of gear at the mid-point - and the brilliant last quarter, make this a worthy addition for collectors of Frenchie noir. 8/10",
         "When \"The Adultress\" (a.k.a. \"Thérèse Raquin\") begins, you soon see a big problem. Young Thérèse (Simone Signoret) and her wimpy husband Camille live with his mother--and this mother babies him and dominates the household. This awful woman insists that it's a woman's duty to serve her husband and romance has no place in marriage! The marriage is clearly a ponderous existence. It's obvious any sane wife would soon get sick of this sort of nothing life--and, not surprisingly, Thérèse does, though she does not yet realize it. It all begins to change when a virile working-class man, Laurent (Raf Vallone) brings the husband home one night when the husband is drunk. Laurent and Thérèse meet and things slowly begin to smolder. And, like in \"The Postman Always Rings Twice\", the lovers decide they cannot continue like this--and eventually they do away with Thérèse's emasculated husband. Of course, that's not the end of the story. While you might think the film borrowed from James Cain's novel, the story is actually much older (and Cain might have been inspired to write \"The Postman Always Rings Twice\") and is from an Emil Zola novel. The parallels are certainly obvious. However, in \"The Adultress\" you actually feel sorry for the wife and given the awfulness of the husband and his mother, you CAN sympathize and almost excuse the killing--especially since it was not premeditated. In the other, however, the wife is essentially an awful conniver and the husband, though old, is a decent and loving man. I actually think the way \"The Adultress\" constructs the story this is better, as it's much easier to connect with the characters and care about their fates. You don't so much excuse their actions but understand and empathize a bit for them. Plus, Thérèse is the opposite of Cora (from \"The Postman\")--she DOES have a conscience and she is not exactly evil. Overall, \"The Adultress\" is an excellent film with exceptional performances. I also loved the moral ambiguities about the film--ambiguities that make the viewer think. I also appreciated the very unusual and very surprising ending--it's worth it!",
         "Emile Zola wrote page turners. He focused on the injustices of the great unwashed of France, from miners to prostitutes. His books were incredibly naturalistic and moralistic. His characters seldom came through unscathed but made a statement about the cultural milieu of the time. This is a story about passion. Therese Raquin is the wife of a tiresome mama's boy hypochondriac. She is beautiful and is married to this childish wimp. Along comes the handsome truck driver after she has spent six empty years with this guy. They have tryst and even let the husband know that he is going to lose his wife. Everything changes when, on a train trip to Paris, fate takes over. Granted, there are lots of plot contrivances, but that's the literary style of the period. Also, in the naturalist tradition, the characters often lose control of their destinies. There is a broader moral sense that trumps the likable ending that people are used to in movies made at this time. The writer and the director can't turn their backs on issues like these and so life goes on and the impulsive and evil are punished alike.",
         "When a woman who has never known love or happiness has a chance at both, everyone in her orbit suffers the consequences. Very loosely based on Emile Zola's 1867 novel of adulterous lust, murder, torment, and poetic justice, Marcel Carne's THERESE RAQUIN stayed true to the spirit of the Realist movement as a character study of a woman undone by the pressures of her environment. Therese (Simone Signoret) is so resigned to her life and it's injustices -and so misguided in her obligations to it- that her story could easily have been subtitled \"The Misfortunes Of Virtue\". Long past quiet desperation, Therese has anesthetized herself to a dismal future and when her husband's new-found friend, Laurent (Raf Vallone), falls for her it's impossible for the woman to break free from her self-imposed prison. The love she feels for Laurent nearly stirs her to action but ultimately the affair only emphasizes a \"No Exit\" situation. Passion and premeditated murder characterized both the Zola horror novel and Luchino Visconti's James M. Cain-inspired OSSESSIONE (to which Carne's film has been erroneously compared) but here they have been eliminated and an inexorable fatalism have taken their place. Therese's existence is self-fulfilling prophesy and her bad karma literally and figuratively drain the life out of her husband and his mother, her lover, and even her blackmailer. Bitter irony is only the natural course of events and the black cat she keeps as a pet symbolizes the bad luck its mistress brings; when Therese's lover kills her husband in a fit of anger, the attempt to cover it up only hastens their love's pre-ordained end. Adapting Emile Zola is an ambitious undertaking; the effects of heredity and surroundings are key in his works but so is the sex and savagery inherent in the human beast and it can't be cut out without emasculating the whole. There's some passion in Vallone's Laurent before Signoret's inverted Emma Bovary begins to have an effect on him but not enough to carry a film. Director Marcel Carne took a theme or two beloved of Zola as well as Film Noir and, by having the heroine sleepwalk to her fate, created a strangely numbing portrait of dashed dreams in a bourgeoisie trap with no way out. Setting the tale in the present instead of the late 1800s when women's options were far more limited only diluted the theme of an oppressive environment's effects. On the plus side, the world-view is very downbeat-dark and should have been a \"noirist's\" delight because it ended badly for everyone, including the peripheral characters -and when that happens, it's the film's philosophy and universe. Happiness here can only come at the expense of others: Therese's husband and his mother's happiness came at a cost to Therese and her shot at happiness was devastating to them. The war hero/blackmailer's dreams were extorted from both Therese and Laurent while Laurent's happiness was undercut by the one who made him happy. A truly ugly world ...and, honestly, why bother living in it? Unhappy fates are a given and not even the ruthless who care nothing for what it costs others can never attain what they really want -or if they do get it, its not for very long. All of this is great \"noir\" ...but what happened in it's filmic depiction? There's some great symbolism that show the care and effort Carne et al put into this: The black cat (Therese's luckless lot) was put outside while the lady entertained Laurent in her room (the only happiness she'd ever know) but old Mme. Raquin brought it right back to her door; Therese doted on the omen which signifies an embrace of her fate. Those weekly games of chance were a metaphor for life and contains a favorite noir theme concerning existence: \"You can't win, you can't break even, you can't even quit the game\". Here, if you do win, you've either cheated or are accused of it and, of course, it always comes at a price to someone else. I should have been depressed looking in on their world ...or angry ...or something as the end credits rolled -and that's just it -I wasn't moved at all. Could that have been what Carne intended all along? To be as deadened to the proceedings as Therese was to her life? There are a few suspenseful moments, a superb supporting cast, some beautiful Lyon scenery, a touch of homo eroticism, and train scenes reminiscent of LA BETE HUMAINE/HUMAN DESIRE, but a Zola-inspired tale doesn't guarantee deliciously dark entertainment and the film is neither recommended nor to be avoided. Kino has used a pristine print for its DVD transfer and this weighs in its favor but the lack of extras doesn't.",
         "A woman (Therese) brought up by an aunt and more or less forced to marry her whiny sickly pasty fleshed cousin (Camille) has resigned herself to a dull gray loveless life working in a small fabric shop owned by her mother in law. Through accident she meets Laurent who makes a play for her and becomes her lover. This love affair intensifies and Laurent pressures Therese to leave Camille...there is a confrontation between the members of this triangle on a train and Camille is accidentally killed when an enraged Laurent pushes him off the train in a scuffle. His death is ruled accidental and all would seem to be OK until a witness shows up to blackmail the couple. The movie presents the essential theme of the original Zola novel. In the book the lovers grow to hate each other as they wait for things to cool down after Camille's death (they drown him) and there is much more twisted psychological drama between them and the mother in law. However this is a tight nice story in this form and the movie has 3 attractive good actors and is suspenseful fun entertainment. RECOMMEND"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Paris Film Productions",
         "Lux Film"
      ],
      "summaries": [
         "Therese has a boring life. She married Camille, her cousin, a sickly haberdasher, fully dominated by his mother (who lives with them). She dreams about passion. One day comes a truckdriver, Laurent... and of course they fall in love. But they will be pursued by fate.",
         "An updating of Zola's orphan girl story finds Therese married to her elderly, sickly cousin, Camille Raquin, and his dominating mother lives with them. It is a dull and empty life, void of romance, until she meets truck-driver Laurent. Suspicious, Raquin takes his wife to Paris. Laurent is on the same train and is surprised by Raquin when he is talking to Therese. Laurent throws the husband from the train, and the two lovers agree to keep silent. The police take Therese into custody when she reports her husband missing, and show her his body but she does not break down. A witness to the crime blackmails Therese, and the lovers pay him his extortion money, but he is killed while crossing the street in front of a speeding truck. But he has ordered his maid to mail a letter if he does not return.",
         "A truckdriver kills the husband of the woman he loves, and becomes the object of blackmail."
      ],
      "budget": 0
   },
   "movielensId": 74613,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1953-11-06",
      "dvdReleaseDate": "2005-11-22",
      "directors": ["Marcel Carné"],
      "runtime": 102,
      "movieId": 74613,
      "title": "Thérèse Raquin",
      "mpaa": null,
      "actors": [
         "Simone Signoret",
         "Raf Vallone",
         "Jacques Duby",
         "Maria Pia Casilio",
         "Roland Lesaffre",
         "Nerio Bernardi",
         "Françoise Vernillat",
         "Madeleine Barbulée",
         "Marcel André",
         "Paul Frankeur",
         "Lucien Hubert",
         "Jacques Hilling",
         "Alain Terrane",
         "Martial Rèbe",
         "Sylvie"
      ],
      "imdbMovieId": "0046429",
      "originalTitle": "Thérèse Raquin",
      "genres": [
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Star-crossed lovers Thérèse (Simone Signoret) and Laurent (Raf Vallone) think they've gotten away with murder after Thérèse's weakling husband \"falls\" from a speeding train. But when forced to contend with a blackmailer's demands and the mute accusations of Thérèse's mother-in-law (French stage and screen diva Sylvie, in a scene stealing performance), it's only a matter of time before the law, their passion or blind chance trips them up.",
      "tmdbMovieId": 67736,
      "avgRating": 3.55556,
      "releaseYear": "1953",
      "numRatings": 9,
      "posterPath": "/iYxDp15T8R2n69ucSsWGlODClOp.jpg"
   }
}