{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "infection",
            "id": 4884
         },
         {
            "name": "cow",
            "id": 5543
         },
         {
            "name": "quarantine",
            "id": 6898
         }
      ],
      "imdb_id": "tt0446719",
      "video": false,
      "title": "Isolation",
      "recommendations": [
         40168,
         10894,
         16973,
         9017,
         18196,
         22007,
         13849,
         13797,
         27258,
         15991,
         29559,
         38996,
         29030,
         31150,
         31596,
         13094,
         41966,
         25060,
         22172,
         133463
      ],
      "backdrop_path": "/ilhxNZplLP0sVp1lxYy0WXuEoJC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Orla",
               "gender": 1,
               "credit_id": "52fe44e7c3a368484e03d73d",
               "name": "Essie Davis",
               "profile_path": "/4fRr8V4harQBxJCvR8dhPP40tYA.jpg",
               "id": 33449,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jamie",
               "gender": 2,
               "credit_id": "52fe44e7c3a368484e03d741",
               "name": "Sean Harris",
               "profile_path": "/zTUONNd9Lq063lpp7GvtjzZmMLW.jpg",
               "id": 16702,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe44e7c3a368484e03d745",
               "name": "Marcel Iureș",
               "profile_path": "/5SUJOa1L2V8OVDrwpMHv8hMxx54.jpg",
               "id": 15320,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe44e7c3a368484e03d749",
               "name": "Crispin Letts",
               "profile_path": null,
               "id": 45440,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dan",
               "gender": 2,
               "credit_id": "52fe44e7c3a368484e03d74d",
               "name": "John Lynch",
               "profile_path": "/2OHQ4Hck4QlCqDjQ4mK6OMW65n3.jpg",
               "id": 28743,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe44e7c3a368484e03d751",
               "name": "Ruth Negga",
               "profile_path": "/fIVB9H48rDgcV0hhnP7gYrv18zB.jpg",
               "id": 17018,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Garda Hourigan",
               "gender": 2,
               "credit_id": "52fe44e7c3a368484e03d755",
               "name": "Stanley Townsend",
               "profile_path": "/nZZWcRY77Cc01E4bWJhHUyHOJhZ.jpg",
               "id": 25074,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e7c3a368484e03d75b",
               "name": "Billy O'Brien",
               "profile_path": "/l0h8SpvskAn1YD5dD42JwuL3G8K.jpg",
               "id": 124635,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "534a6d0dc3a3682de4001435",
               "name": "Billy O'Brien",
               "profile_path": "/l0h8SpvskAn1YD5dD42JwuL3G8K.jpg",
               "id": 124635,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "534a6d2ac3a3682ddf0013eb",
               "name": "Bertrand Faivre",
               "profile_path": null,
               "id": 52739,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "534a6d44c3a3682e070014d4",
               "name": "Ed Guiney",
               "profile_path": null,
               "id": 43147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "534a6d6fc3a3682df60014ad",
               "name": "Ruth Kenley-Letts",
               "profile_path": null,
               "id": 1058109,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "534a6d88c3a3682dd8001467",
               "name": "Wendy Brazington",
               "profile_path": null,
               "id": 20462,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "534a6dd1c3a3682ded001425",
               "name": "Suzanne Cave",
               "profile_path": null,
               "id": 1309578,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "535695d50e0a26742b0003dc",
               "name": "Adrian Johnston",
               "profile_path": "/2upTqCKUCClWQYNY8M4rlOFhQB2.jpg",
               "id": 72854,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "53569616c3a3687f44000074",
               "name": "Robbie Ryan",
               "profile_path": "/bCxjPSQyy6ucy36YdQUEDahEzvd.jpg",
               "id": 71086,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58efa1b49251416f0d00014b",
               "name": "Paul Inglis",
               "profile_path": null,
               "id": 30463,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "58efa22cc3a3682873000182",
               "name": "Tamara Conboy",
               "profile_path": null,
               "id": 45121,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58efa2c3c3a3682e44000063",
               "name": "Zane Hayward",
               "profile_path": null,
               "id": 1395708,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "58efa370c3a3682e440000fc",
               "name": "Donal O'Farrell",
               "profile_path": null,
               "id": 1118382,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.627176,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 25967,
      "vote_count": 69,
      "budget": 5000000,
      "overview": "On a remote Irish farm, five people become unwilling participants in an experiment that goes nightmarishly wrong.",
      "similar": [
         157424,
         294254,
         10216,
         39538,
         429733,
         25769,
         215830,
         13812,
         293771,
         346651,
         29425,
         336455,
         360784,
         7191,
         6479,
         29427,
         170,
         1562,
         300668,
         126889
      ],
      "original_title": "Isolation",
      "runtime": 95,
      "poster_path": "/2BUV4sw6xBAfdBp4XowwWnf8XnR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/eNdCXEfW6rDxjnO3VdqIzWVuviH.png",
            "name": "Lions Gate Films",
            "id": 35,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Bureau",
            "id": 10441,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Element Films",
            "id": 2274,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Castle Films",
            "id": 21772,
            "origin_country": ""
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         },
         {
            "logo_path": "/trP3GsUyIztMwcqev3jK1gOeCSA.png",
            "name": "Irish Film Board",
            "id": 5267,
            "origin_country": "IE"
         }
      ],
      "release_date": "2005-09-10",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Billy O'Brien"],
      "runtime": 95,
      "synopsis": "It's been 6 years since Billy O'Brien has brought anything to the screen and this is what he gives us. Set on a remote Irish cattle farm, in similar areas that Ballykissangel (1996), Father Ted (1996), and Braveheart (1995) were also filmed, Dan (John Lynch), probably best known for playing George Best in Best (2000), is struggling to make ends meet and has agreed to let an eastern european scientist, John (Marcel Iures), genetically modify the feutus of one of his cows so future cows will breed quicker and grow quicker in return for an agreed sum. The experiment goes a little wrong and an undeveloped mutated cow about the size of a rat with teeth goes on the loose, just imagine the blob of flesh in Jason Goes to Hell: The Final Friday (1993), and you'll get an idea of what this thing looks like. Its soon pointed out that this thing is infectious and can use human DNA to breed further, leaving people dead in its tracks. The hunt is on by a very small cast, as you will notice, and the clock is ticking to catch it before everyone catches \"its\" infection.",
      "writers": ["Billy O'Brien"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0446719/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIzMDU5NzU2N15BMl5BanBnXkFtZTcwOTQ2MTIzMg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Essie Davis, Sean Harris, Marcel Iures | See full cast and crew »"],
      "reviews": [
         "Billy O'Brien pulls no punches and avoids no arm-in-bum shots in this tension-filled, dark film. The first portion of the movie, the viewer is left in a fog of confusion, constantly trying decipher exactly what's happening on the farm. The high level of confusion felt by the viewer perfectly parallels that of the protagonist--Dan, played adequately by John Lynch. Though exactly what \"went wrong\" is never truly established, its effects certainly are and lead to a horrible series of events. Marcel Iures played John, the conductor of said experiments. His performance pushes the film towards its climax. He provides a dark and knowing force in the film albeit a somewhat typical mad scientist mold that he fits into. O'Brien's greatest achievement is the reality in which he creates his film. His frequent use of a hand-held camera lends it a voyeuristic, documentary type of feel. He also utilizes a number of point of view shots to keep the viewer as close to the unappetizing going-ons as possible. That along with the low-key acting creates a very realistic portrait of farm life. Still, a threat found on a bovine farm can only be so terrifying. And though the idea is refreshingly original, the writing is still average at best. The characters share too many traits and seem to lack interests or goals outside of mere survival.",
         "I have just seen this film and was really surprised by it's quality. I knew not of the Director but only of the Irish Film Board that helped in the project, up until today I had yet to be entertained fully by this board. This is no longer the case. I can see that other people on the message board have slated this film with one going as far to say that this is stolen from Scott Sigler Ancestor. Sad as it seems but this said individual does not realise that Ancestor is also a rewrite of many DNA/Animal experiment stories. Dean Koontz watchers for a start or how about Peter Benchley's Creature. With that upset out of the way this Film is a great piece of jump, tension and scare that's well worth your time. Expertly shot, Directed with passion and an effects Team that has used Animatronics instead of cheesy CGI which so many creature flicks these days fall foul of. Like the Thing and Alien this will become a cult hit. I was a very early supporter of the Thing and I turned out to be correct in my belief, I believe this to be true once more. All in all this is nothing new but it's just what you've been looking for since the introduction of CGI monsters and the disappearance of blood soaked, repulsive, gooey textured monsters that look and feel real. Excellent work.",
         "I think that the other review of this film is a bit unfair. Yes it is a quiet movie which moves with a very deliberate pace. No there is not a huge monster nor do we see it overly much. The important thing in kind of indie horror film is to establish tension then retain and gain it. The film was quite effective there. There are a number of moments which are very uncomfortable indeed in this film. By not showing too much of the creature they were using the \"Cat People\" dodge which is that if you don't have the money or resources for a big scary beast then let the audience imagine it. If they had shown something one wonders if the prior reviewer would have trashed them for that as well.",
         "The broken farmer Dan (John Lynch) rents his farm for the scientist John (Marcel Iures) from the Bovine Genetics Technology that is researching genetic modifications of cattle to increase its fertilization. The veterinarian Orla (Essie Davis) is bitten by the calf while helping the cow to deliver, and she feels that something went wrong with the experiment. During the night, the cow has a narrow passage for the calf, and Dan asks the young couple Jamie (Sean Harris) and Mary (Ruth Negga) that is parked in a trailer in front of his farm's entrance to help him in the delivery. When the offspring is born, it bites Dan; Orla arrives later and realizes that it is a genetic anomaly and she sacrifices the calf. During the autopsy of the animal, she discovers that the fetus is pregnant and she destroys the freak hybrids. However, one of them escapes and attacks a cow first and Jamie later. When John arrives in the farm, he discovers that there is the danger of infection of human beings and decides to quarantine the spot. But one offspring is alive and need to be captured. \"Isolation\" is a creepy and gruesome version of Alien in an Irish farm. The cinematography is very dark like the story that is simple but works, and the locations are indeed repugnant. But the direction and the cast make the difference with excellent work highlighting the always excellent John Lynch. The special effects are great and the open conclusion gives a perfect ending to this movie. My vote is seven. Title (Brazil): \"Quarentena\" (\"Quarantine\")",
         "In a time when remakes, sequels and sequels to remakes are just about all the horror genre is getting, it's refreshing to a see a film that isn't merely a copy of another. This film isn't completely original, however, as it has shades of classics such as Alien and The Thing, but the base of the plot is compelling and the way that director Billy O'Brien patiently builds up the atmosphere and tension is impressive. The plot obviously takes influence from the agricultural crisis's we've had in Britain over the last few years; namely foot and mouth, in which the desire not to have people coming and going from various farms was strong. The film starts with a cow giving birth. There's obviously a problem from the outset, and it increases when the cow is born. The calf is somehow not right, and the farmers take the decision to kill it. Upon dissecting the dead calf, it turns out that there's a parasite growing inside of it, and we soon learn that this is the result of an experiment carried out with the farmer's say so by an immoral vet... The film is slow to start, and the first half is really just build up. However, the build up isn't boring and the director generates suspense by never really letting us know what is going on until it is really needed. The second half the film is entirely different to the first as then we focus more on action and gore, and this actually goes well with the beginning of the movie. There aren't many characters in the film, and that means that there aren't a lot of death scenes; but this isn't too important as the central monster looks cool enough, and the death scenes are suitably nasty, even though they're not very gory. The locations the atmosphere is a big stand out, and the director does a good job of ensuring the farm location is integral to the plot and good use of the dirty and eerie locations is used at all times. The film is a long way away from being perfect; the camera-work annoyed me somewhat as Billy O'Brien obviously subscribes to the flashy camera-work school of thought, and sometimes you can't see what's going on. However, this is a well made and well acted little horror film that deserves more plaudits for the fact that it's not a direct rip off. Very well done!",
         "Billy O'Brien's excellent ecologically themed horror is a measured, carefully paced and excellently judged picture featuring bags of sweaty suspense and a few good jolts. The film is further boosted by some strong performances from John Lynch and Sean Harris. The film is particularly effective in evoking the atmosphere of subsistence rural life - one can virtually smell the slurry pits and manure. Uncomfortable memories of the UK's foot and mouth crisis surface as the farm location is quarantined and cow carcasses are torched. It is certainly a challenge to make cows scary - but this does a better job than The Dark. Bob Keen's sparingly glimpsed monster effects are reminiscent of those seen in Cronenberg's Existenz, particularly the scene in that film's Chinese restaurant. His team also did an excellent job on the cow and calf effects. Overall a terrific little terror picture that deserves wide exposure.",
         "Although the significance behind the title is only superficially explored - whether it be from too much 'isolation' from cosmpolitan city life, from interpersonal emotional relationships, from wholesome medical meddling, etc... this tightly told story of science run amok at a backwoods Irish farm becomes frightening due to keen usage of natural elements combined with a focus on natural visual/special effects - no CGI! Although the characters are unremarkable, the unrelenting tension gets its strength from the filmmaker's refusal to ever leave the premises. In addition, the overcast skies and the interiors' infrastructures allow the director many opportunities to increase the audience's fear of when and how the creature will affect the proceedings. Though the audience never witnesses the full poteniality of its metamorphosis (although the budget was almost $9.5 million, they may have run out before unleashing a complete masterpiece) the glimpses of how science's ambitions can run amok are horrifyingly conveyed. Essie Davis is gorgeous, but did not create a 'Jamie Lee Curtis' in \"Halloween.\" Definitely recommended.",
         "I got quite a kick out of Isolation, one of the few Irish horror pictures out there. Its certainly better than the fun but pretty much plot less Dead Meat, though it falls short of being really good. The film involves experiments on cows that go horribly wrong and result in a small group of people being trapped on a farm with a grisly menace. The location is suitably grim, truly isolated, cold and dirty. The cast all perform well with mostly sympathetically drawn characters sparking off each other nicely. The direction brings out a real sense of hopelessness and creepy mounting claustrophobic horror. The film is unfortunately quite predictable and never really shocks, although there is the odd bit of gore. There is more grossness than actual violence, with the creature attacks not too interesting, though the creatures themselves are ace, very slimy and monstrous and made by Bob Keen, of Hellraiser fame. In conclusion, this is pretty cool stuff, very watchable with quite a lot to like, though it seemed a bit too conventional and low key ultimately. Recommended to creature feature and general low budget horror lovers, who will likely get some kind of a kick from this.",
         "About as believable as any good zombie film, Isolation excels at pacing, thorough examination and explanation, and coming full circle with all of the concepts it presents. Something that so many similar movies fail at. If you are looking for a mindless slasher, watch something else, though there's slightly creepy nuances that beckon back to films like Alien. If you need that human relation-based plot, there might be enough here to keep you satisfied, but the film doesn't rely at all on developing side-stories of love and emotion. Characters have seemingly realistic reactions and make understandable decisions (unclouded by the need to make irrational decisions for the sake of building tension in the script). Scenes follow-through to conclusion and don't seem edited for time. Isolation leaves no main plot thread unresolved, and stylishly elaborates on the scientific as well as horrific ideas as they presented. I don't think this will be a widely appealing film, but it didn't take any wrong turns. I don't recall any advertising for it. This might mean it's less Nike and more sandal, but there is a time when sandals are practical. It's every bit as intelligent as the best X-Files episodes, and I wasn't able to find any cheese in the effects, though I half-anticipated it to devolve into Critters or a Texas Chainsaw movie. It didn't, however, and was able to maintain it's integrity throughout. I thought it was a gamble when I chose to rent this over a well-advertised title. But I now feel it was entertaining enough and well worth picking up.",
         "I read somewhere that some commenter said \"a hand was being put up a cows ass 3 times under the time of 15 minutes\". Now that is bull actually. If this person would have listened to the things the actors in this movie had to say, he would have understood that the cow was about to give birth and that the person \"putting his/hers hand in the cows ass\" was a veterinarian that was about to check the calves condition and therefor made a ultrasound on the cow. Anyhow, this movie was actually better than expected. Especially since I read a comment that was no use to me what so ever. I liked this movie because it seemed quite real. It seems like something that could happen. But if you want something including explosions, watch something else. This is not the movie! I have heard that Irish meat could give \"mad cow disease\" and after \"Isolation\" I am not eating any more Irish meat. \"Isolation\" is scaring enough, fun to watch (at least if you like animals), gives a real feeling and this might be why I found it scary. In my opinion the things that scare me the most is stuff that could happen in real life and this could. I liked this B-movie a lot. Enjoy this movie when you are tired of all the explosions from the Hollywood action world."
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Film Four",
         "Lions Gate Films",
         "Bórd Scannán na hÉireann"
      ],
      "summaries": [
         "The broken farmer Dan rents his farm for the scientist John from the Bovine Genetics Technology that is researching genetic modifications of cattle to increase its fertilization. The veterinarian Orla is bitten by the calf while helping the cow to deliver, and she feels that something went wrong with the experiment. During the night, the cow has a narrow passage for the calf, and Dan asks the young couple Jamie and Mary that is parked in a trailer in front of his farm's entrance to help him in the delivery. When the offspring is born, it bites Dan; Orla arrives later and realizes that it is a genetic anomaly and she sacrifices the calf. During the autopsy of the animal, she discovers that the fetus is pregnant and she destroys the freak hybrids. However, one of them escapes and attacks a cow first and Jamie later. When John arrives in the farm, he discovers that there is the danger of infection of human beings and decides to quarantine the spot. But one offspring is alive and need to be captured.",
         "On a remote Irish farm, five people become unwilling participants in an experiment that goes nightmarishly wrong."
      ],
      "budget": 2900000
   },
   "movielensId": 74738,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-09-10",
      "dvdReleaseDate": "2007-06-26",
      "directors": ["Billy O'Brien"],
      "runtime": 95,
      "movieId": 74738,
      "title": "Isolation",
      "mpaa": null,
      "actors": [
         "Essie Davis",
         "Sean Harris",
         "Marcel Iureș",
         "Crispin Letts",
         "John Lynch",
         "Ruth Negga",
         "Stanley Townsend"
      ],
      "imdbMovieId": "0446719",
      "originalTitle": "Isolation",
      "genres": [
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["OHUdt6abG64"],
      "plotSummary": "On a remote Irish farm, five people become unwilling participants in an experiment that goes nightmarishly wrong.",
      "tmdbMovieId": 25967,
      "avgRating": 2.80882,
      "releaseYear": "2005",
      "numRatings": 34,
      "posterPath": "/2BUV4sw6xBAfdBp4XowwWnf8XnR.jpg"
   }
}