{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "taxi",
            "id": 444
         },
         {
            "name": "lebanon",
            "id": 589
         },
         {
            "name": "taxi driver",
            "id": 1749
         },
         {
            "name": "middle east conflict",
            "id": 5907
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "bombing",
            "id": 33702
         }
      ],
      "imdb_id": "tt1094275",
      "video": false,
      "title": "Under the Bombs",
      "recommendations": [],
      "backdrop_path": "/z5tuhRsQm4R6uScbRlEK41sbg33.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Zeina",
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101add9",
               "name": "Nada Abou Farhat",
               "profile_path": null,
               "id": 108827,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Toni",
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101addd",
               "name": "Georges Khabbaz",
               "profile_path": null,
               "id": 108828,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Hotel Receptionist",
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ade1",
               "name": "Rawia Elchab",
               "profile_path": null,
               "id": 108829,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Journalist",
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ade5",
               "name": "Bshara Atallah",
               "profile_path": null,
               "id": 108830,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101adeb",
               "name": "Philippe Aractingi",
               "profile_path": null,
               "id": 108835,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101adf1",
               "name": "Philippe Aractingi",
               "profile_path": null,
               "id": 108835,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101adf7",
               "name": "Michel Léviant",
               "profile_path": null,
               "id": 66736,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101adfd",
               "name": "Philippe Aractingi",
               "profile_path": null,
               "id": 108835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae03",
               "name": "Hervé Chabalier",
               "profile_path": null,
               "id": 108836,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae09",
               "name": "Claude Chelli",
               "profile_path": null,
               "id": 108837,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae0f",
               "name": "François Cohen-Séat",
               "profile_path": null,
               "id": 108838,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae15",
               "name": "Bruno Seznec",
               "profile_path": null,
               "id": 108841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae1b",
               "name": "Paul Raphael",
               "profile_path": null,
               "id": 108839,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae21",
               "name": "Joffrey Hutin",
               "profile_path": null,
               "id": 108840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae27",
               "name": "Henri Magalon",
               "profile_path": null,
               "id": 108842,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae2d",
               "name": "René Aubry",
               "profile_path": null,
               "id": 108843,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bb9251416c9101ae33",
               "name": "Lazare Boghossian",
               "profile_path": null,
               "id": 108844,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.689616,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "LB",
            "name": "Lebanon"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 32092,
      "vote_count": 5,
      "budget": 0,
      "overview": "In the wake of Israel's 2006 bombardment of Lebanon, a determined woman finds her way into the country convincing a taxi driver to take a risky journey around the scarred region in search of her sister and her son.",
      "similar": [
         12162,
         324786,
         374720,
         22972,
         4421,
         1538,
         676,
         227306,
         228150,
         369885,
         9667,
         1369,
         35056,
         2330,
         48138,
         137113,
         10592,
         252178,
         8741,
         746
      ],
      "original_title": "Sous les bombes",
      "runtime": 98,
      "poster_path": "/aQYXEQSqN3hNa6TEOGPO4y9EsOn.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2007-09-02",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.underthebombs.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philippe Aractingi"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Philippe Aractingi",
         "Michel Léviant"
      ],
      "originalLanguage": "Arabic",
      "imdbLink": "http://www.imdb.com/title/tt1094275/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0ODczNTg2Nl5BMl5BanBnXkFtZTcwNjU4MzkzMg@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Nada Abou Farhat, Georges Khabbaz, Rawia Elchab | See full cast and crew »"],
      "reviews": [
         "Not sure why this film isn't rated higher. Its really good. The other review does a good job explaining why its good. (an amazing achievement, part documentary, part drama, great acting, great story, great cinematography) I will add, it is not pro-hezbollah, its not pro-Israel, its anti-war. However it is told from the perspective of a Lebanese woman, so if you are really pro-Israel and pro-war and pro-killing people, you will probably not like it. Really depressing. So if you want feel-good and redemption, don't go see it. It has a great love story too. Its complicated and not trite at all. This is a unique touching film",
         "We were fortunate enough to see this film at the Sundace Film Festival, and I have rarely seen a more accomplished effort at portraying one of the worst atrocities of the past decade. Director Philippe Aractingi's ability to bring two feature actors into Lebanon on the tenth of thirty-three days of brutal Israeli bombing is nothing short of magnificent. Before seeing the film, I thought it may be a better case study of the war-torn environment left by the indescriminate bombing of civilian areas by the Israeli Army, with some actors thrown in at the last minute in a patchwork attempt to create a feature film. I was painfully wrong. This film is a compelling character drama told through the eyes of real people experiencing the worst kind of hell on earth. With unbelievable footage of the actors in the middle of the ongoing conflict, international media coverage, and the U.N. relief mission, Aractingi deftly (and powerfully) combines his fictional characters will real life survivors to tell the story of a mother trying to find her son in the ruins of war-torn Lebanon. The main character's decision to hire the initially lecherous, but ultimately compassionate and sympathetic taxi driver Tony to take her on her journey results in a touching tale of humanity and the place of individuals in a world beyond they're control. When asked about his filming techniques in the Q&A after the movie, Aractingi expressed his desire for the movie to be seen for the message it carries, as it should be.",
         "Director Aractingi shot this film in the immediate wake of the systematic 34-day Israeli bombing of Lebanon in summer 2006, which left much of the country devastated, especially the South. He uses his own footage of the bombing itself, which shows whole neighborhoods being decimated, and then shoots among the rubble to tell the story of Zaina (Nada Abou Farhat), a divorced mother who comes from Dubai, where she was living with her architect husband, to find Karim, her six-year-old son, who was trapped by the bombing in Kherbet Salam, a Shia Muslim village in southern Lebanon. Zaina left Karim there with her sister, ironically, to \"protect\" him from the stress of her divorce. The only taxi driver who'll make the dangerous trip is Tony (George Khabbaz), a Christian who turns out to be from the South himself. Aractingi got the idea of shooting in war devastation with an improvised plot in 1989 as Lebanon's civil war of that time wound down, but fear prevented him from proceeding. Instead he shot 40 documentaries and one feature that used improvisation (the 2005 Bosta) and also starred Nada Abou Farhat. As he got to work with his cast and crew for Under the Bombs, beginning shooting during the bombing and continuing during the ceasefire, he made the decision not to deal with the war so much as its impact on innocent victims, which Zaina and Karim obviously are. And many of the people and their sufferings are authentic and real-time. When Tony and Zaina reach Kherbet Salam the building her sister lived in is completely destroyed. A young woman comes up and tells her Maha, her sister, is a martyr now. Zaina and Tony go to witness the disinterring of those who died to be reburied in \"martyrs' graves,\" hoping to find the body of Maha (they do not). Aractingi films the actual funerals--not an easy task. People say Karim was taken up by foreign journalists and went away with them, and this leads Tony and Zaina further south, just a few kilometers from the Israeli border, where they stop over with Tony's Christian family. It emerges that they were collaborators during the long Israeli occupation of south Lebanon and one brother is among those who fled to live in Israel in the aftermath of that time. The confrontation between Tony and his relatives over this collaboration is the fruit of discussions among villagers which Aractingi and his co-writer, Michel Léviant, condensed into a script. This is one example of how the actual fed into the fictional in the day-to-day shooting. The emotions are powerful and the backgrounds are horrifying in the film. Nothing quite equals the sense of identification when Zaina looks at a whole street where her sister lived and finds only ruins after the systematic bombing destruction. Less successful at times are the interactions between Zaina and Tony, who flirts, comforts, and acts out a surprisingly graphic sex scene with a room clerk at a hotel they stop at on the way. Khabbaz and Abou Farhat are good, but some cutting might have helped eliminate distracting elements. The car's breaking down just before the couple gets to the monastery where Karim is rumored to be seems a rather obvious suspense device too. The film is neutral as it can be, perhaps to a fault. One wonders why Hezbollah is barely even mentioned, since it is the other party in the warfare, and was the prime provider of aid to the victims in the bombing's immediate aftermath. Though the collaborating family members refer to being \"forced to work for the Devil,\" meaning Israel, the focus is on the suffering rather than its source. Aractingi's film has flaws, but its boldness in bringing to the screen the 2006 bombing of Lebanon and the civilian suffering it caused can't be faulted. The San Francisco International Film Festival 2008 provided the West Coast premiere of this film, which was scheduled to open less than two weeks later, on May 12, in Paris. This was nominated for the Grand Jury prize at Sundance and received the EIUC Award at Venice.",
         "This is a really good film. And due to the fact that it was shot during the actual crisis gives it a documentary feel. Complimented with that is the superb acting of the lead characters. It's like real life unfolding on screen - the rampant destruction, needless pains & senseless atrocities of the war. The rustic music also suits the storyline perfectly. A couple sequences though didn't quite fit into the flow of the story: - the sex scene seemed unnecessary and the breaking down of the car at the very end seemed like a little forced upon melodrama. Would recommend this movie to anyone who is in a mood to find out how the Middle East politico-religious crisis affects a common citizen.",
         "I came across this on cable television in Australia, perhaps not so ironically at the same time that Israel was bombing Hamas in Palestine in January 2009. Possibly a deliberate programming choice - perhaps not. This is an interesting film. Without knowing anything about its production, it is apparent that some of the footage is real, and many of the cast are actual civilians affected during the Israeli-Hezbollah/Lebanon war of 2006. What is central to the film is the developing relationship between Zeina, a woman looking for her son, and Tony, a taxi driver with a colourful past. I must admit I did particularly like that the two main characters are not perfect, and indeed their flaws further serve to foster a sense of identification with them. They are not your usual Hollywood war victims. Zeina is a woman who has sent her young son to the South of Lebanon to escape a messy divorce and supposedly philandering husband. Tony the taxi driver is someone trying to make a spare dollar by selling black market medication and there are several references to a brother with a criminal history in Israel. What I most enjoyed about \"under the bombs\" was the raw reality of the story and the lack of morality and bias. The victims of all sides of the war are clearly shown and no one is attached to any particular side. Nada Abou Farhat is a naturally beautiful central actor, and I mean \"naturally\" in that she doesn't present some kind of blow-dried version of war. She is a powerful actor being able to portray the anguish of a mother seeking a lost child. Similarly Georges Khabbaz is a real character - not your sexy leading man - in fact he is a relatively average looking man, not unattractive, but definitely not with stereotyped leading man good looks. He clearly passes as a realistic representation of a Lebanese taxi driver and is quite likable. He really does look the part! Also, the support cast are clearly locals, and I got the sense that many of the stories told were real. The child actors are particularly good. The relationship between Tony and Zeina is interesting, but with some flaws. It is clear that Zeina is a beautiful and quite sexy woman, wearing a figure hugging dress that seems somewhat out of type for the south of Lebanon, but this is okay because it further creates Zeina as a individual ... obviously a woman from the South of Lebanon who has married a 'man of the world' and left her traditional life behind. I wonder whether Tony falls a little into a stereotype of the Arabic male (I would be interested in Arabic men's opinion on this), in that whilst he feels for Zeina's predicament, he sees her as a sexual being. It is often the case that people form intense relationships in traumatic situations, but it is a wonder whether Tony's feelings are totally realistic. In one scene, he is lamenting that Zeina is \"a woman looking for her son but who won't acknowledge me!\" (paraphasing) when a journalist approaches him for a fare while Zeina is looking for her son. I wondered whether this was a little unrealistic. Would an Arabic man let out emotions like these after knowing a woman for two days? Maybe ... but I wondered whether the romantic relationship was paying lip service to traditional cinematic storytelling. I actually feel the film would've benefited more from this romantic tension being far more 'beneath the surface'. What I did really love about this film was its simplicity. It is a simple demonstration of the suffering of people in war. Zeina's grief, when she finds her sister is dead, is palpable and intense to watch. Similarly, the end of the film is bitter and lends itself towards the reality of war. I would recommend this film as a good example of cinema verite and an important contribution to showing the victims of war in a way that doesn't use the usual soft focus, blow dried Hollywood stereotype. Nice work! Gen_x",
         "This movie was chosen by filmmovement.com. Often I find the movies they chose to lack heart and leave the viewer bereft in some way. This is the exception. True, the subject matter is devastating. However, the way it is handled is so delicate that it somehow inherently contains a message of hope. I have seen this movie several times, and find that the characters have stuck with me. I've not gotten enough of them.. I want their story to continue. I will, however, caution the viewer: if you don't want your political consciousness raised, you must stay away from this movie. It in no way coerces the viewer; it simply offers such a different perspective, you can't help but be redirected in subtle ways. Well done to the entire cast and crew of this movie.",
         "In our modern and enlightened age there is no such thing as a 'Non-Combatant'. Whether we like it or not, each of us is on one side or the other. UNDER THE BOMBS tells the story of a young mother who is trying to find her sister and son during the ceasefire of the 2006 Israeli/Lebanon Conflict. She is a wealthy outsider from Dubai who enlists the aid of a sympathetic local cabbie who helps her track down her missing family. The film focuses on their budding friendship against the backdrop of actual war zone footage. Many of the scenes are unscripted, and are shot as the real events unfold, and make for compelling cinema. The film drives home the message that wars are putatively fought and lost for valid reasons, but there are never any winners-only losers. A very thought provoking look at the true cost of a nation's foreign policies.",
         "I did not think that the sex scene was awkward in the movie; I found it quite appropriate. It is clear that Tony is attracted to Zeina, so when a decent substitute comes along for him to express his sexual desire, it seems genuine. The innkeeper may have exaggerated on being scared of the wind, but in wartime there is a sense of alienation and a desire to unify, even if in the most banal ways. Tony is portrayed as a sort-of loner, working man. He initially helps Zeina most likely because of her beauty; I believe he was staring at her breasts when he first offered to help her. As the two bonded on their journey, Tony opened up about his past and became more sympathetic. This is the crux of the character development. The simplicity of the relationship and the romantic nuances exemplify the human spirit. In essence, Tony discovered that he didn't just want to \"bang\" Zeina, but he generally appreciated her for being herself. Likewise, Zeina became less guarded over time and looked to Tony for comfort, especially in the wake of her divorce and her newfound independence. Zeina had a desire to return to her roots and Tony, also being from the same region, comes to be a representation of her own identity.",
         "This was a very engrossing film about the immediate aftermath of the war in South Lebanon in 2006. The film starts with graphic footage of Israeli bombing of Lebanese towns and refugee camps: modern weaponry is not for the faint hearted. A well dressed woman (with interesting décolletage) arrives in Beirut. She is looking for her son and her sister who live in the south. She negotiates with a taxi driver to take her there. At first they spark off each other, not least as she is reticent about her background. The drive south through bomb damaged towns, villages, roads and bridges was quite chilling (as is essentially the whole film). In her home town, which has been flattened, it appears that her sister is dead and buried in a mass grave, but her son may have been rescued. The film follows her on the trail of her son, with her relationship with the taxi-driver slowly thawing. It appears she has just split from her husband, an international architect living in Dubai. They had sent their son home while they sorted themselves out, only for him to be caught in the war. They eventually locate him in a monastery, and have a dangerous drive across country to find him. Cruelly, it is a friend of the son, wearing his jacket: The boy, like his aunt had been killed in the bombing. Filmed on location immediately after the war, the film had, in the trite phrase, a shocking immediacy. The discussions between locals about what was going on were also illuminating: for most it wasn't their war, and Israel was where they wanted to be for work.",
         "Under the Bombs (2007) I can picture this being required viewing for anyone wanting a view of the kind of back and forth fighting between Israel and its many unfriendly neighbors. The devastation from superior Israeli firepower is horrifying. And you can see better the anger that ordinary Lebanese citizens--Muslim and Christian both--have toward the apparently insensitive Israelis. The way this is unfolded is a convergence of two kinds of victims of the violence--a mother looking for her child and a taxi driver who she hires to take her around. In the searching we see all of Southern Lebanon's worst destruction--the real thing, shot on site--and we feel the frustration and hatred in all the people at the situation. We also see that it comes down to coping, as well, with a sense of resignation, that it's all out of their reach, even if the bombs reach them all too easily. So, you'll cry and be in ruins yourself if you let yourself be absorbed. There is eventually going to be a sense that the movie plays the same chords for too long. The search keeps taking new turns, but the rubble, the anger, and sorry, the frustration, and even the relationship between the leads stays relatively the same. It's only in this last respect--a highly unlikely meeting of minds and hearts between to very different classes of people--that there is some evolution. And the search, of course, has a kind of resolution that is sudden and a bit surprising. There are moments of movie drama along the way (the car stalls at the worst possible time, of course, and that kind of thing), but mostly it's about being transported to this very real war torn place using modern cinematography. The acting is intensely strong, and the basic story line heart wrenching. Yes, see it, for those aspects that are overwhelming and necessary to understand as much as possible."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Rhamsa Productions",
         "Art'Mell",
         "Arte France"
      ],
      "summaries": [
         "Under the bombs, a woman searches for her son. A man accompanies her. They have nothing in common. Toni is Christian and dreams of leaving the country. Zeina is Shiite, and has emigrated to Dubai. Back in Lebanon to try and save her son, she realizes she doesn't want to leave anymore. And yet, despite this all, Toni and Zeina will love each other, as a kind of response to the death striking all around them.",
         "In the wake of Israel's 2006 bombardment of Lebanon, a determined woman finds her way into the country convincing a taxi cab driver to take a risky journey around the scarred region in search of her sister and her son."
      ],
      "budget": 0
   },
   "movielensId": 74748,
   "movielens": {
      "languages": [
         "العربية",
         "English",
         "Français"
      ],
      "releaseDate": "2007-09-02",
      "dvdReleaseDate": "2009-05-05",
      "directors": ["Philippe Aractingi"],
      "runtime": 98,
      "movieId": 74748,
      "title": "Under the Bombs",
      "mpaa": "",
      "actors": [
         "Nada Abou Farhat",
         "Georges Khabbaz",
         "Rawia Elchab",
         "Bshara Atallah"
      ],
      "imdbMovieId": "1094275",
      "originalTitle": "Sous les bombes",
      "genres": [
         "Romance",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["J_456UN2HPI"],
      "plotSummary": "In the wake of Israel's 2006 bombardment of Lebanon, a determined woman finds her way into the country convincing a taxi driver to take a risky journey around the scarred region in search of her sister and her son.",
      "tmdbMovieId": 32092,
      "avgRating": 3.35714,
      "releaseYear": "2007",
      "numRatings": 14,
      "posterPath": "/tcGsThrloSJHD4oLhVN4hwRIjtv.jpg"
   }
}