{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "bully",
         "id": 10624
      }],
      "imdb_id": "tt0115676",
      "video": false,
      "title": "Big Bully",
      "recommendations": [
         102059,
         39128,
         41589,
         17207,
         19176,
         19002,
         102947,
         21352,
         117553,
         2620,
         110972,
         117904,
         23945,
         44664,
         42580,
         17745,
         25224,
         369775,
         20551,
         33657
      ],
      "backdrop_path": "/3F0uWe1vjqwshmcbh1iqtEdK6Bu.jpg",
      "revenue": 2042530,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David Leary",
               "gender": 2,
               "credit_id": "52fe461a9251416c910493b9",
               "name": "Rick Moranis",
               "profile_path": "/rVZbTJjM4g0Um6trlLHRiBzBO7t.jpg",
               "id": 8872,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rosco Bigger - Fang",
               "gender": 2,
               "credit_id": "52fe461a9251416c910493bd",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Victoria Tucker",
               "gender": 1,
               "credit_id": "52fe461a9251416c910493c1",
               "name": "Julianne Phillips",
               "profile_path": "/iXf1Echxu1OQjJDGDTYWBsUPAb2.jpg",
               "id": 105962,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Faith Bigger",
               "gender": 1,
               "credit_id": "5457cfa60e0a2648c200a0b0",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Art Lundstrum",
               "gender": 2,
               "credit_id": "5457cfb7c3a36875d800027c",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Clark",
               "gender": 2,
               "credit_id": "5457cfc20e0a26297a002536",
               "name": "Curtis Armstrong",
               "profile_path": "/6rsU7P4jwTC41lifKcXHHKU3uXO.jpg",
               "id": 87003,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Principal Kokelar",
               "gender": 2,
               "credit_id": "5457cfd40e0a2648d6009f34",
               "name": "Don Knotts",
               "profile_path": "/qMqpOuJj69ozHCViUZSiFvgggva.jpg",
               "id": 27726,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461a9251416c910493c7",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5457d0600e0a266b1b0002c1",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "565223329251414af900b549",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.160972,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36929,
      "vote_count": 22,
      "budget": 15000000,
      "overview": "A writer returns to his hometown where he faces the childhood nemesis whose life he ultimately ruined, only the bully wants to relive their painful past by torturing him once again.",
      "similar": [
         15907,
         13339,
         13310,
         258230,
         246115,
         453064,
         332349,
         70821,
         862,
         34584,
         62211,
         82690,
         269149,
         406997,
         449176,
         16996,
         1265,
         1792,
         13205,
         292044
      ],
      "original_title": "Big Bully",
      "runtime": 90,
      "poster_path": "/wtFekK9VKWujQW9R9c6sYbir6wm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1996-01-26",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "A comedy for the kid in all of us.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Miner"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Mark Steven Johnson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115676/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5OTk4OTA0MV5BMl5BanBnXkFtZTcwNjg1MjQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rick Moranis, Tom Arnold, Julianne Phillips | See full cast and crew »"],
      "reviews": [
         "Big Bully is probably more suited to the small screen than the big screen. Some of the dialogue Tom Arnold spouts out is quite funny. Rick Moranis does an acceptable job in the lead role, even though it seems he's been playing wimpy characters for his whole film career. The showdown is a little heavy handed (eg. Arnold firing a nail gun at Moranis), but was obviously thrown in to keep the movie from getting too dull. If it's on TV late at night, watch it...and then go to bed. Rating: **",
         "David Leary was bullied by Rosco Bigger a.k.a. Fang as a kid. He gets even with Rosco the day he rats him out after he stole the \"moon rock\". Soon enough David gets his chance to really get even when his parents tell him he's moving. Some years later David(played by Rick Moranis) is grown up and has a son. He returns to his hometown and discovers that Rosco(Tom Arnold) grown up too. Rosco remembers David and soon all hell breaks lose. I don't understand why it is that people hate this movie. Come on, it's hilarious. Tom Arnold has never been funnier. I think it's kind of strange that David was a victim growing up and now his son is a bully and Rosco was a bully growing up and that his son is a victim. 10/10",
         "I like this film. Not that the plot, acting, script, etc. would worry any kind of awards ceremony on a bad year because they are pretty awful. It's just that the film is watchable at 2am when you need to be bored to sleep by a sappy American movie. That's all I can say about it. The plot is so transparent and formulaic that a five-year-old could have told you the ending, and has more holes than fine lace. The acting is notably bad on all counts. When the established leads get upstaged by an unknown 10 year-old you have to worry. Rick Moranis plays his usual weedy character and Tom Arnold plays his childhood bully. Not challenging parts and this shows; they aren't even trying. I, like many others, was bullied at school and found the story interesting in that it showed both sides but the cheezy(TM) subplot involving their children was forced and let down the one saving grace. All in all, I give this film 2/5. Watchable but certainly not worth missing anything else for.",
         "This movie is nicely done, and Tom Arnold is this really nice and lovable character who (even though he's a bully) you like a lot. A fun movie to watch anytime! Rick Moranis also plays a great character and proves once again he's a great actor.",
         "Much to my surprise, I was actually finding this to be an amusing film for the first hour or so. I laughed more than a few times, and there was a touch of humanity that seemed to fit rather well. Then, for no good reason, the writers tacked on a pathetic ending that left a bitter taste in my mouth. I would even say that this was a good movie for the most part, but the STUPID showdown at the end killed all credibility that had been created. How aggravating.",
         "Big Bully is a film filled with laughter and tears. It's the story of a man who loses his family and finds himself in the process. It's about choices, how the small decisions we make can affect us for the rest of our lives. Not for fans of Stephen King.",
         "Every so often Hollywood takes a serious theme like murder or bullying and tries to make light of it. When that attempt gropes toward the inner pain of dark comedy, the film may have merit. Yet when the focus is on cheap non laughs surrounded by a total disregard for substance, logic, and human decency, the result is most often a bloated, turgid mess like BIG BULLY. Director Steven Miner wastes the limited talents of all concerned. Rick Moranis is a weedy, nerdy little man who has to relive the trauma of childhood bullying by beefy Tom Arnold. As the film opens, both Moranis and Arnold are in the fourth grade. Arnold plays a blubbery bully that one sometimes sees in a filmed version of a Steven King horror movie. But in the hands of a King based script, the bully is a source of unredeemed evil. Here, under Miner's unsure grasp, Arnold is no more than a walking tub of prepubescent lard who seeks to bully the nerdy Moranis. Now if Miner had tried to make a serious movie about childhood bullying, then BIG BULLY might have had something worthwhile to say about the angst of childhood insecurities. Now flash forward twenty years. Moranis and Arnold are both teachers in the same grammar school, and Arnold quickly reverts to the bully that he was. What makes this regression reprehensible is Arnold's justification that as a victim, Moranis thoroughly deserved his fate. What then follows is a ridiculous chase scene between prey and predator that offers no lasting insight into either demented personality. Julianne Phillips is a wasted toss in as Moranis' girlfriend. At the end, when director Miner seeks closure, the film ends in the uneasiest of endings, one that satisfied neither the desire for revenge nor one that offers justification for that revenge in the first place.",
         "[MAY CONTAIN SPOILERS] As young boys, David Leary and Rosco \"Fang\" Bigger were the best of enemies. Rosco was always making life difficult for David. Then one day, a moon rock would be on display at school. It soon turns up missing. David sees Rosco with it and turns him in, the same day David and his family would be moving away...To a place of new beginnings...Oakland. Thirty years later: David (Rick Moranis) has grown up to be a writer. His son, Ben, is a bully. One day, David get's a letter from the school he went to as a lad, it asked him to come back and teach a class, so they head for Hastings, Minnesota. They get to their house and meet their new overly nice neighbors. David finds that nothing's changed, except the librarian informs him that \"Green Eggs and Ham\" is overdue! Several thousand days overdue! David also meets the shop teacher, Ross. He and David become friends, until David notices the one chipped tooth Ross had that looked like a fang. It was him! Roscoe Bigger! Also, Ross's son, Kirby, is bullied by Ben. What an odd turn of events. Ben also thinks his dad's a loser. Ross soon learns that David is the boy he used to pick on and begins pulling mean spirited pranks on him. He does lot's of them, in fact. But before then, Ross was a very passive person. He just didn't do anything when people were horsing around in his class or when his kids at home were messing around. But now that he's rediscovered his roots, he really put's his kids in line and get's a mean student of his to behave by having him come face to face with a grinder. A nervous-wreck teacher and a woman David likes, Victoria, think David's nuts, so he tries to call a truce with Ross. But it was then that Ross found out it was David who turned him in for snatching the moon rock. Now Ross has murderous anger and goes after David, while yelling about what he's been through. But when they're both out on a log over a roaring river in the middle of a rain storm, David stands up to Rosco and inadvertantly knocks him off and into the falls. David tries to turn himself in, but the police station was closed. Probably gone out to get donuts or something. Anyway, David heads home and is confronted with Ross again. Now their sons, Ben and Kirby had become friends. So David and Ross talk it out. Ross had stolen the moon rock because he wanted to be an astronaut. Next day, it was time for the Leary's to move on. They were going to New York City. But they weren't going alone. The Biggers were right behind them. They had a mobile home, which was good because it's mobile. This is a good movie. Rick Moranis and Tom Arnold are good together. Everyone else is good in this movie. Jeffrey Tambor's in it, but Curtis Armstrong, I hate that guy. I think he's a pain in the ass. He's just annoying!! His role in this film wasn't funny. Nor was he good in Jingle All The Way! I just really, really do not like him! But everyone else was good. I recommend this movie!! -",
         "An elementary school nerd, plagued by insecurity and the need to fit in, lives in a nightmare at the hands of a big, fearsome bully. Nearly twenty years later, he's moved on with his life, has a son, and has made a name for himself as a successful writer. He returns home as a local celebrity to join the teaching staff, but once again encounters his old childhood nemesis who's bent on repeating the same torment despite their advanced ages. Not as bad as it sounds, with two likable, enthusiastic leads who provide some occasional laughs, but the film's dedication to juvenile slapstick grows tiresome after a while. Fans of the actors may not mind. **",
         "This movie starts out with David Leary(Rock Moranis) narrating about his youth. He has problems. This huge bully named Rosco AKA Fang bullies him around. He never has a time to eat his lunch nevertheless take a trip to the bathroom. So what does David do? He stakes Rosco out. We shoot past 20 years to Davids older days. He now has a son, Ben Leary(Blake Bashoff), and he now works as a teacher. He finally returns to the town that he had lived in as he was a kid. And who does he meet? The old bully Fang. Fang now has a huge family of his own. His youngest son has problems hanging in with the crowds. So what happens when you have the bullies preys son and the bullies predator son in the same school with both fathers working under the same roof? You have a lot of troubles. Including problems with old friends turned elder. Along with Honey I shrunk The Kids, Honey I Blew Up The Kid and Honey I Shrunk Ourselves this should be a number four classic on your favorite list and shelf. This is a good movie to show your own bullishious son and or daughter."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Lee Rich Productions"
      ],
      "summaries": [
         "David Leary was bullied by Rosco when he was in elementary school. But he got even on the day his parents moved out of town. Now twenty years later, David, who is a successful writer, is invited back to his home town to teach. Everything is great until Rosco, who is still in town, recognizes him. Now suddenly someone is playing mean practical jokes on him. Isn't David a little too old to be running to the Principal saying \"Rosco's picking on me.\" ?",
         "A writer returns to his hometown to teach high school. There he runs across his former nemesis, a bully that constantly harangued him, and now is the shop teacher. The bully's life has been in turmoil for a long time and the return of his old foil turns his life around. Meanwhile their kids have the opposite relationship.",
         "A writer returns to his hometown where he faces the childhood nemesis whose life he ultimately ruined, only the bully wants to relive their painful past by torturing him once again."
      ],
      "budget": 15000000
   },
   "movielensId": 75,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-26",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Steve Miner"],
      "runtime": 90,
      "movieId": 75,
      "title": "Big Bully",
      "mpaa": "PG",
      "actors": [
         "Rick Moranis",
         "Tom Arnold",
         "Julianne Phillips",
         "Carol Kane",
         "Jeffrey Tambor",
         "Curtis Armstrong",
         "Don Knotts"
      ],
      "imdbMovieId": "0115676",
      "originalTitle": "Big Bully",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["rZU6xGcShw8"],
      "plotSummary": "A writer returns to his hometown where he faces the childhood nemesis whose life he ultimately ruined, only the bully wants to relive their painful past by torturing him once again.",
      "tmdbMovieId": 36929,
      "avgRating": 2.45092,
      "releaseYear": "1996",
      "numRatings": 601,
      "posterPath": "/wtFekK9VKWujQW9R9c6sYbir6wm.jpg"
   }
}