{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "harlem",
            "id": 189920
         }
      ],
      "imdb_id": "tt0056952",
      "video": false,
      "title": "The Cool World",
      "recommendations": [],
      "backdrop_path": "/sVJCrfHLVxfJOSpfKx87QgLCfjI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Duke (as Hampton Clanton)",
               "gender": 2,
               "credit_id": "547cbf01c3a3685afd003746",
               "name": "Rony Clanton",
               "profile_path": null,
               "id": 90444,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Priest",
               "gender": 2,
               "credit_id": "547cbf149251411f4e0024c8",
               "name": "Carl Lee",
               "profile_path": null,
               "id": 88147,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Luanne",
               "gender": 0,
               "credit_id": "547cbf249251412d75002ffa",
               "name": "Yolanda Rodríguez",
               "profile_path": null,
               "id": 1392416,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Blood (as Clarence Williams)",
               "gender": 2,
               "credit_id": "547cbf379251412d75003000",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5543a83dc3a3680ce800214e",
               "name": "Warren Miller",
               "profile_path": null,
               "id": 1461670,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe49489251416c910a8697",
               "name": "Shirley Clarke",
               "profile_path": "/mhbautIXao1hKrQPIqeBAk9o5iz.jpg",
               "id": 227525,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5543a89cc3a3680cd700225d",
               "name": "Frederick Wiseman",
               "profile_path": "/uYlxuYtXn27b4CYLII2K8KyqwUc.jpg",
               "id": 138006,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "547cbeb69251412d7f0035dd",
               "name": "Shirley Clarke",
               "profile_path": "/mhbautIXao1hKrQPIqeBAk9o5iz.jpg",
               "id": 227525,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "547cbecb9251412d7c0037a0",
               "name": "Carl Lee",
               "profile_path": null,
               "id": 88147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5543a7e2c3a3680ce6002185",
               "name": "Robert Rossen",
               "profile_path": "/c4rH9ujftvzMEihIGwZBkKntbJI.jpg",
               "id": 14875,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "5543a8af92514158760020d1",
               "name": "Mal Waldron",
               "profile_path": null,
               "id": 1461671,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5543a8c8c3a3680ce60021a3",
               "name": "Baird Bryant",
               "profile_path": null,
               "id": 1355370,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5543a8e7c3a3680ce60021a7",
               "name": "Shirley Clarke",
               "profile_path": "/mhbautIXao1hKrQPIqeBAk9o5iz.jpg",
               "id": 227525,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.669878,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85521,
      "vote_count": 3,
      "budget": 0,
      "overview": "Filmmaker Shirley Clarke (\"The Connection\") directs this powerful, stark semi-documentary look at the horrors of Harlem ghetto slum life filled with drugs, violence, human misery, and a sense of despair due to the racial prejudices of American society. There is no patronizing of the black race in this cinematic cry for justice. A fifteen-year-old boy called Duke is ambitious to buy a \"piece\" (a gun) from an adult racketeer named Priest, to become president of the gang to which he belongs, and to return them to active \"bopping\" (gang fighting) which has declined in Harlem. It is a clearly patent allegory of an attempt by Duke to attain manhood and identity in the only way accessible to him - the antisocial one.",
      "similar": [
         277216,
         858,
         112160,
         141,
         634,
         242224,
         258480,
         43923,
         5176,
         437557,
         297762,
         27586,
         8967,
         9762,
         2288,
         4771,
         12162,
         13223,
         13809,
         866
      ],
      "original_title": "The Cool World",
      "runtime": 105,
      "poster_path": "/2TVAXl7PlZJZELFaQ7YEffwlWku.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Wiseman Film Productions",
         "id": 40031,
         "origin_country": ""
      }],
      "release_date": "1963-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Shirley Clarke"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Shirley Clarke",
         "Carl Lee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056952/",
      "coverLink": null,
      "actors": ["Stars: Rony Clanton, Carl Lee, Yolanda Rodríguez | See full cast and crew »"],
      "reviews": [
         "\"The Cool World\", a 1963 independent film directed by Shirley Clarke is probably the most shocking, interesting, and realistic film I have ever seen. The films follows the character of Duke played by Rony Clanton. This film shows how it really was to be an African American teen growing up in urban America (Harlem, N.Y.) in the 1960's. The gun serves as a character in the film itself, for it demonstrates manhood for the character of Duke. By no means is this film a glorification of street life that is so common today in American pop culture. The viewer will see in this film how ugly crime is especially these characters who are driven to commit crimes because of the desperate, depressed situations of the ghetto. The character of Duke searches throughout this movie for a gun to own as almost a way to arm himself against the failures that surround him daily such as rat infested tenements, garbage filled streets, drugs, pimps, prostitutes, gangs, and over zealous cops. If John Cassevetes is considered the new phase of film making that occurred in the late 1950's with his superb film \"Shadows\" then Shirley Clarke is his female counterpart. Shirley Clarke masterfully merges documentary footage and Jazz music to the actual film that creates somewhat of a frightening, haunting, realistic portrait of urban America that I feel has not been seen very much in cinema since \"The Cool World\". It is interesting to note that actors Clarence Williams III, Antonio Fargas, Gloria Foster, and Peter De Anda who appeared in this film went on to make great strides of achievement in both film and television in the 1970's. \"The Cool World\" is shown in many film festivals across the country. Unfortunately it is not on video, but someday I hope it will be for the world to see. I rate this movie **** excellent.",
         "This film is a tremendous achievement. It is unbelievable to me that it is not being preserved and protected by those who have the power to do so. It absolutely SHOULD be available on video and it should be regularly mentioned in discussions of the great films of the \"American New Wave\". The previous commenter was absolutely right to compare it to a Cassavettes picture because it has a very similar feel, in that it seems not so much like a movie with a narrative, but just a \"snippet\" of a time, almost taken randomly for two hours. We get all kinds of wonderful experiences in that two hours, including 1960's Harlem, disillusioned youth run amok, gritty street fare, etc. Not to mention the music in the film(a fantastic jazz soundtrack). This is a very valuable film, and the fact that it is directed by a woman is significant, as this seems to be an under-appreciated voice in American cinema. Criterion, let's get it together and get this available for people to see. OK?",
         "In the early '70's, at age 12 I was sleepily channel surfing late at night, (past my bedtime at a friend's house) looking for monster movies. I believe I was watching Channel 2, (KTVU Oakland, California's then independent now Fox-affiliated TV station) when I was riveted awake by the most amazing film. For years I looked for it, telling anyone who would listen about how real it seemed. How compelling it was. I never found anyone else who had seen it, let alone a theater showing it, a video or a DVD of it. One of the reasons I came to IMDb was to at last find confirmation of The Cool World's existence (not the Ralph Bakshi cartoon). I found some lobby cards at a collector's fair and bought them. Hope was awakened in me in the early '90's when I heard of a special showing at the Roxie Cinema. The print was on loan from Shirley Clarke as it was so rare. The day came and I arrived at the cinema and the print didn't appear due to a shipping snafu. By now I was losing hope. When I first wrote this I hadn't seen it again. Recently, I saw it at last. It is an amazing cultural document of 1960's Harlem.",
         "The Cool World is the first film about Harlem that was actually shot in Harlem. Hanging the camera from the ceiling provides a very personal experience for the viewer. The viewer is there as a participant, not as a spectator. The Cool World is a very much not a Hollywood looking film with fast moving, up close, scenes. Dark yellow hued interior scenes capture the true feeling of the dwellings of the gang members. Shirley Clarke has taken us into The Cool World. Little known trivia, is that Wally Cox's wife acted in this film. Another little known piece of trivia is that, since she lived in the Chelsea Hotel during the time that Sid Vicious also lived there, Shirley Clarke was a consultant on the film Sid and Nancy.",
         "Shirley Clarke is one of those filmmakers I've heard about but I never seen any of her films, until now. In New York at this time Cassavetes and many other filmmakers were doing films outside of the Hollywood system and tried to tell a different kind of film. Shirley Clarke was definitely a part of this filmmovement using and deploying the same kind of style, tone and content. This socialrealistic, gritty, dramadocumentary about street life in Harlem in 60's seen from a very young African American male by the name of Duke who joins a gang called the Pythons and starts waging a war against a rival gang called the Wolfs, is interesting albeit very flawed film experience. At times this film is reminiscent of Cassavetes but being a very flawed film, the use of stock footage, voice-over, improvisational acting, etc means that Clarke sometimes ends up being a protegé to b-moviemaker Doris Wishman. It may seem odd that I'm comparing the two but at times these two filmmakers seem to have a lot in common. At best this film comes across as very dark, realistic portrayal of inner city youth crime in 60's. The film doesn't shy away from drugabuse, prostitution, interracial relationships etc. Strangely, this film hasn't been released on DVD nor have Criterion, Masters of cinema etc released her films in a DVD box. Shirley Clarke should get that treatment, she deserves it. And this film should be seen by more people interested in early American independent cinema.",
         "There once was a a movement, mostly active in New York and a period in which movies were shot very raw, in an almost documentary like style. These type of movies try to give you an insight on the daily lives of often poor and struggling ethic groups, living in a certain part of town, as if it's really a documentary you are watching. Perhaps the best and also best known example of this style of film-making was John Cassavetes' 1959 movie \"Shadows\". The movie is shot in the fashion of a documentary but that really doesn't mean that it also feels like one though. It's still very obviously an acted out movie, with scripted situations in it. The approach to it all still makes it feel like a very raw and also straight-forward movie, about crime, drugs and racial issues, all set in the Harlem ghetto, in New York City. It's not necessarily a movie that follows a clear main plot line, which is consistent with this style of film-making but it's not really something that I like. Sure, it works out real fine for 20-30 minutes or so but after a while things just start to get less interesting to follow because there isn't really anything happening within the story and it isn't ever really going anywhere. I did understand the points the movie tried to make, with its raw approach, depicting the hard and desperate life within the ghetto but it just never came across as anything provoking or powerful. It still could had been fine if only the movie had some more intriguing and likable characters in it. I don't really feel like we ever got to know any of them, which also doesn't really make you care about any of them or what happens within the movie its story. So no, this movie just isn't for me, though I'm still able to appreciate it and admire the way it got made and shot. So still a movie I appreciated watching, just never one I ever loved. 7/10 http://bobafett1138.blogspot.com/",
         "\"There goes Duke Custus! He's a cold killer!\" 'The Cool World' is truly a radical and rarely-screened classic of 1960s American experimental cinema that is also unflinchingly realistic as well. Adapted from the novel by Warren Miller(and the play by Miller and Robert Rossen), the film is shot in stark black-and-white and also oozes an jazzy score (even Dizzy Gillespie shows up for a street serenade) as the story opens up to 1960's Harlem, starring Hampton Clanton as Duke Custus, the fifteen-year-old baby-faced leader of a gang called the Royal Pythons. Sporadically throughout the picture his naive conscious monologues on how easier life will be once he obtains a piece and starts packing heat as a \"cold killer\". But does Duke's immature inner-longing for an eventual firearm inviting more pleasure or harm into his young life than before as to just being set free from his present situations? Let's take a look. \"When I got to Hollywood, all the movie moguls claimed to be astounded by the reality of my films. How did I do it? And I'd say, \"Well, it wasn't hard to make Harlem look like Harlem\". So responded writer and director Shirley Clarke (Portrait of Jason) in response of mainstream Hollywood filmmakers, recognized as one of the leading independent filmmakers of the early 60's American cinema through this \"fictional documentary\". We watch the youth yearning to aspire in possessing a weapon, but money hinders this as he is willing to face any crucial means to get one in the cold, heartless streets of the slums made up of pimps, guns and juvenile crime. He sees the piece as a means of escape and dreams of becoming respected once he has one in his hands. The film can also be seen as an antagonizing semi-documentary as well, exploring the harsh life in the ghetto for what it really is with drugs, blood and violence therein to show the audience that this indeed a real existence for these people every day. Rarely shown and screened, due to the home DVD-challenged producer Frederick Wiseman, it still remains a reverberating lament of the angst and frustrations of youth rebellion caged within the tortured souls of the individuals making up the only world they know bent on implosion; the inner devastation of crying for a way out only to fall upon deaf ears as the hearts of everyone else burns for the same reason. With brilliant editing, an electric score by Mal Waldron, a memorable trip to Coney Island and a powerhouse ending with gunfire and abusive cops, 'The Cool World' is indeed a shock of reality regarding American segregation. One will not be entertained but feel as if they have earned something more, after seeing the human spirit arise within the being of our main character. Devastating but nowhere further from the truth, 'The Cool World' delivers a vivid picture of inner city life unabashedly with day-to-day desperation, gang wars, and not always guaranteeing nor promising a tangible way out of the metropolitan jungle of crime and fear, leading film critic Judith Christ to described it as a \"loud and powerful outcry of outrage at the world society has created for the Harlem youngsters, and at the human condition of the slum ghetto.\" If you can find a copy, and don't scare easily, I implore you not to miss out on this must-see hallmark of 60's independent cinema that truly emanates a relentless Harlem but even more so the willingness and hope to survive."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Wiseman Film Productions"],
      "summaries": ["Filmmaker Shirley Clarke (\"The Connection\") directs this powerful, stark semi-documentary look at the horrors of Harlem ghetto slum life filled with drugs, violence, human misery, and a sense of despair due to the racial prejudices of American society. There is no patronizing of the black race in this cinematic cry for justice. A fifteen-year-old boy called Duke is ambitious to buy a \"piece\" (a gun) from an adult racketeer named Priest, to become president of the gang to which he belongs, and to return them to active \"bopping\" (gang fighting) which has declined in Harlem. It is a clearly patent allegory of an attempt by Duke to attain manhood and identity in the only way accessible to him - the antisocial one."],
      "budget": 0
   },
   "movielensId": 75367,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-01-01",
      "dvdReleaseDate": null,
      "directors": ["Shirley Clarke"],
      "runtime": 105,
      "movieId": 75367,
      "title": "The Cool World",
      "mpaa": "",
      "actors": [
         "Rony Clanton",
         "Carl Lee",
         "Yolanda Rodríguez",
         "Clarence Williams III"
      ],
      "imdbMovieId": "0056952",
      "originalTitle": "The Cool World",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Filmmaker Shirley Clarke (\"The Connection\") directs this powerful, stark semi-documentary look at the horrors of Harlem ghetto slum life filled with drugs, violence, human misery, and a sense of despair due to the racial prejudices of American society. There is no patronizing of the black race in this cinematic cry for justice. A fifteen-year-old boy called Duke is ambitious to buy a \"piece\" (a gun) from an adult racketeer named Priest, to become president of the gang to which he belongs, and to return them to active \"bopping\" (gang fighting) which has declined in Harlem. It is a clearly patent allegory of an attempt by Duke to attain manhood and identity in the only way accessible to him - the antisocial one.",
      "tmdbMovieId": 85521,
      "avgRating": 2.625,
      "releaseYear": "1963",
      "numRatings": 8,
      "posterPath": "/2TVAXl7PlZJZELFaQ7YEffwlWku.jpg"
   }
}