{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "edgar allen poe",
            "id": 157132
         },
         {
            "name": "torquemada",
            "id": 162863
         }
      ],
      "imdb_id": "tt0100369",
      "video": false,
      "title": "The Pit and the Pendulum",
      "recommendations": [
         56705,
         82315,
         59797,
         40353,
         27390,
         29512,
         69870,
         83913,
         139367,
         180323,
         58864,
         31245,
         62132,
         35945,
         26958,
         44562,
         28128,
         24789,
         28314,
         16191
      ],
      "backdrop_path": "/4t3ljePq2hnXnC4i12lbzDpgjUk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Torquemada",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f812462d",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Gomez",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124631",
               "name": "Stephen Lee",
               "profile_path": "/drAixjx9vjshLlGpWq0m4V5bYIg.jpg",
               "id": 91537,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Dr. Huesos",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124635",
               "name": "William J. Norris",
               "profile_path": null,
               "id": 138048,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mendoza",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124639",
               "name": "Mark Margolis",
               "profile_path": "/ue04GglAWi7FnxLWeESekpRJ8do.jpg",
               "id": 1173,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Contessa D'Alba Molina",
               "gender": 1,
               "credit_id": "52fe471ec3a36847f812463d",
               "name": "Carolyn Purdy-Gordon",
               "profile_path": "/rkNC80zwfLwDAb23eXZuyZO0JOO.jpg",
               "id": 37028,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Contessa's Son",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124641",
               "name": "Barbara Bocci",
               "profile_path": null,
               "id": 138049,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Executioner",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124645",
               "name": "Benito Stefanelli",
               "profile_path": "/5c5ek7iXeJMdx1bEM2mw195zmPD.jpg",
               "id": 4661,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Francisco",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124649",
               "name": "Jeffrey Combs",
               "profile_path": "/3dUeJgdLYu8Gb56MEgXsFaCyiqN.jpg",
               "id": 27993,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Don Carlos",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f812464d",
               "name": "Tom Towles",
               "profile_path": "/nqcpMGjjJkz8IMdDyrObZulUFKg.jpg",
               "id": 27736,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Maria",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124651",
               "name": "Rona De Ricci",
               "profile_path": null,
               "id": 138050,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Antonio",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124655",
               "name": "Jonathan Fuller",
               "profile_path": null,
               "id": 80291,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Cardinal",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124659",
               "name": "Oliver Reed",
               "profile_path": "/we10IusqRV1NHRtA68ftyck2N33.jpg",
               "id": 936,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Sergeant of the Guards",
               "gender": 2,
               "credit_id": "52fe471ec3a36847f812465d",
               "name": "Larry Dolgin",
               "profile_path": null,
               "id": 26761,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Esmeralda",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124661",
               "name": "Frances Bay",
               "profile_path": "/uaT5z1YQKZZ8WcYsnOnnI6DRWdW.jpg",
               "id": 11794,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Beggar",
               "gender": 0,
               "credit_id": "52fe471ec3a36847f8124665",
               "name": "Fabio Carfora",
               "profile_path": null,
               "id": 138051,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "547b4ea79251412d7c000195",
               "name": "Andy Horvitch",
               "profile_path": null,
               "id": 60411,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124611",
               "name": "Stuart Gordon",
               "profile_path": "/6izi3lpxy9tQgiLtxYjOVYxOmCf.jpg",
               "id": 27991,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124617",
               "name": "Albert Band",
               "profile_path": null,
               "id": 19708,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe471ec3a36847f8124623",
               "name": "Dennis Paoli",
               "profile_path": null,
               "id": 58046,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe471ec3a36847f812466b",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "547b4e3b9251412d7000016e",
               "name": "Adolfo Bartoli",
               "profile_path": "/weoIgV80gRk7LxzUtdYFwI0hdMG.jpg",
               "id": 19710,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "547b4e649251412d6d00017c",
               "name": "Giovanni Natalucci",
               "profile_path": null,
               "id": 7205,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "547b4eb49251412d7f00015c",
               "name": "Richard Band",
               "profile_path": null,
               "id": 19711,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "547b4f02c3a3685afd0001f0",
               "name": "Perry Bullington",
               "profile_path": null,
               "id": 31631,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "547b4f169251412d7500016b",
               "name": "Robert MacDonald",
               "profile_path": null,
               "id": 33144,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "547b4f2ac3a3685b050001c9",
               "name": "Michaela Gisotti",
               "profile_path": null,
               "id": 32911,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "547b4f3ec3a3685b000001f7",
               "name": "Michael Catalano",
               "profile_path": null,
               "id": 981584,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "547b4f5e9251412d730001bc",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "547b4f73c3a3685afd000208",
               "name": "Maurizio Garrone",
               "profile_path": null,
               "id": 103052,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.486031,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47090,
      "vote_count": 34,
      "budget": 2000000,
      "overview": "Set during the height of Spanish Inquisition. The beautiful and kind-hearted Maria is arrested as a witch when she inadvertently cries out in horror at the public whipping of a child. As Maria’s husband Antonio tries to save her, Torquemada, the Grand Inquisitor, determines to punish Maria with torture for the desire she inflames in him. Loosely based on Edgar Allen Poe's classic short story.",
      "similar": [
         60304,
         22033,
         767,
         671,
         672,
         675,
         11906,
         27022,
         37430,
         16859,
         76492,
         290595,
         159824,
         129,
         674,
         673,
         9100,
         68728,
         11342,
         6435
      ],
      "original_title": "The Pit and the Pendulum",
      "runtime": 97,
      "poster_path": "/hkqnTzHaLWF5zIiVA2UlQ63AZFH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Full Moon Entertainment",
            "id": 4867,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Empire Pictures",
            "id": 1212,
            "origin_country": ""
         }
      ],
      "release_date": "1991-06-27",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A bizarre descent into hell from the creator of Re-Animator.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stuart Gordon"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Edgar Allan Poe",
         "Dennis Paoli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100369/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1NTI5MjU3OV5BMl5BanBnXkFtZTcwOTA1NjUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Lance Henriksen, Stephen Lee, William J. Norris | See full cast and crew »"],
      "reviews": [
         "Because it's a newer version of a classic horror movie (and it went directly to video), I have been putting off watching Stuart Gordon's take on Edgar Allen Poe's classic story, but after finally catching it; I can honestly say that I don't know why I didn't see it earlier! While the Roger Corman/Vincent Price version of the tale is far better, this update still has a lot in store for the horror fan, most notably it's superb European styled atmosphere, and a fine performance by Lance Henriksen, which may even be the best of his career. While these elements are contributors to the film's success, the main reason why the film works is the story behind it. Of course, it's based (albeit loosely) on Poe's classic tale, so the story is bound to be solid; but it doesn't take all of it's influence from Poe, and so Dennis Paoli can take a lot of credit for the screenplay he wrote for the movie. The idea of 'the pendulum', along with a 'pit' can conjure up many feelings of dread and pain, and this film adequately capitalises on that with it's excellent torture filled finale! As mentioned, Lance Henriksen gives what is maybe his best performance in this film. He is both powerful and frightening in his role as Torquemada, the head witchfinder of the Spanish Inquisition. When he says \"I am the inquisition\", it's enough to make your hairs stand on end. Henriksen is a criminally underrated actor and one that certainly deserves more praise...it's just unfortunate that he tends to shine in movies that don't get noticed. Also in the cast is 'Re-Animator' himself, Jeffrey Combs, who shines in a small role as someone in the inquisition. The film isn't wholly serious, and Stuart Gordon has seen fit to add some comic relief to the proceedings, which is OK but I feel that the movie would be better off without any 'relief'. Certain elements from other Poe stories appear, such as a man being bricked in behind a wall, and this film seems to treat it's subject material with respect. The European horror style is a major plus factor in my opinion, and should please fans of movies from the sixties and seventies. On the whole; surprisingly good!",
         "If you've seen the classic Roger Corman version starring Vincent Price it's hard to put it out of your head, but you probably should do because this one is totally different. Subtlety has been abandoned in favour of gross-out horror - nudity, gore and all-round unpleasantness. OK it's ridiculous, trashy, sensationalised and historically dubious (did any members of the Inquisition really wear horn-rimmed glasses?), but despite all this it is strangely compelling. I literally couldn't tear myself away from the screen until the end of the movie. If there's a bigger compliment you can pay to a film I don't know what it is.",
         "OK, sorry, I couldn't resist. Though this is a pretty grim movie at times, I can't hear the phrase \"Spanish Inquisition\" without going through the Monty Python routine. Once the movie starts, however, I am always so engrossed I forget about the sketch. This movie had me hooked from the first scene the first time I saw it, but it has that rare quality of actually getting better with every viewing. As many have said, this is without a doubt Full Moon's all-time best. I'm a diehard Stuart Gordon fan, and if it wasn't for Re-Animator, I might say it was Gordon's best, too. By the way, the first scene is very grisly and cold-blooded, and you *know* it's gonna be a great movie when that happens even before the opening credits. I'm really saddened that this movie didn't get more of a chance for wide release. I remember it being in the theater for maybe one week and then going to video, and the only reason I even knew it existed was from reading Fangoria. Look at the cast- while they aren't all considered \"A-list\", they are favs among horror and cult fans- Lance Henriksen (Millennium, Aliens) Tom Towles (Henry, Portrait of a Serial Killer), Jeffrey Combs (Re-Animator, From Beyond), Frances Bay (Blue Velvet), Oliver Reed... I think the other strike it has against it is that people see the title (maybe that's why it was changed in some versions, including the R-rated DVD that I rented, to The Inquisitor) and figure it's a travesty to even try to remake. Some friends wouldn't even give the movie a chance (to the point where they didn't even want to look at the box, they were so scornful) until I had to beg them to watch it- they thanked me after the first few scenes. Don't get me wrong, the original is wonderful, and Vincent Price is, well, Vincent Price and in a class by himself. However, this movie has very little in common with Corman's other than the title, the fact that both movies are based on Poe's work, and that there's a scene towards the end where some unlucky b*stard tries to get free before the pendulum slices him in half. The similarities end there, however, and I don't think it's fair or accurate to call it a remake. This version is actually set back in Spain during 1492, the REAL inquisition. Lance Henriksen, who can make his voice sound so quietly evil that Hopkins as Hannibal Lecter sounds harmless by comparison, stars as Torquemada. With the assistance of his underlings, he wants to rid the world of witchcraft and heresy, figuring the best way to do this is to torture and kill what seems like 99% of the population (historically, he was said to be responsible of over 100,000 executions). During one ugly public display involving Gordon's wife Carolyn Purdy-Gordon -other than Re-animator, she always seems to come to a horrible end in his movies) the young baker Antonio and his lovely wife Maria make the mistake of trying to intervene, so they assume she's a witch and toss her in the dungeon. In her cell, she's befriended by kindly Esmeralda. In one of the most clever twists, her cellmate turns out to be the one out of the tens of thousands accused who actually IS a witch. Maria's husband tries to save her and of course is immediately arrested as well. Unfortunately for Maria, ole Torq is horrified to find himself secretly attracted to her (he's a monk, and as Henriksen explains in the feauturette, has 'probably never gotten any in his life') and doesn't know how to deal with it. At first it seems like Maria might be able to use this to her advantage, but since Torq is so psychotically religious that he thinks any human emotions are the work of Satan, things just get more complicated and intense from there. There are several references other than the Pendulum to Poe's work -clever ones, that fit in with the plot and are not just tossed in for the hell of it. Someone is walled up, even quoting the notorious line \"For the love of God!\" \"Yes...for the love of God\" is the grim reply. A cask of wine is revealed to be Amontillado. There's also subtle references to \"The Premature Burial\" and probably more I missed. One of the elements that is actually kind of amusing in a horrible way is that you have absolutely NO chance against the evil forces in this movie, to the point where it is ludicrous. You're reasonably attractive? You're obviously trying to tempt men and must be a witch. You're ugly? That's also a sign of being a witch. You look normal? You're a witch disguised as a normal person! You try to fight back when they tear your clothes off to 'examine' you? You're not co-operating, you're a witch! You give up and co-operate? You're an evil whore! You have a mole or freckle anywhere on your body? That's the mark of the devil and you're a witch. Oh, you don't have any? Someone will pinch you and make a mark. Oh, the mark is starting to fade? You're using your evil powers to make it fade! You're just completely screwed no matter what. Also, if they haven't tortured you yet and you confess first to get it over with? Sorry, no such luck! You might just be trying to avoid torture, so confession doesn't officially count until you've been tortured for days-that is, if you don't die under torture (\"Not another one!\" a torturer complains in exasperation at one point). The cast is amazing. There's not even near enough room to list all the great acting in this movie. Standouts are Henriksen, who not only portrays total evil all too convincingly but the inner struggle against his lust for Maria VS his 'holy duty'. Oliver Reed has less than 10 minutes of screen time as a heavy-drinking Cardinal who comes to visit Torquemada and try to get him to ease up on the mass killing a little, but trust me, you'll remember his scene long after the movie is over. Jeffrey Combs, as the scribe with the prince Valiant haircut and huge horn-rimmed Harry Potter glasses who seems to be the only one involved who is \"just doing his job\" and not getting off on it like all of Torquemada's other flunkies, steals every scene he's in. A less talented actor would have been forgettable in what could have been a boring part, but he makes the most of every second of his screen time. He also gets the some of the best and funniest lines (\"How can they confess if they DON'T HAVE TONGUES??\"), including the best in the movie along with the actress playing Esmeralda. She's wonderful, and one of the best and most memorable scenes of this, or any horror movie for that matter, involves her show-stopping revenge when she's burned at the stake. As she's being dragged up, Comb's character actually tells her apologetically: \"I'm sorry that you weren't properly able to confess. There just wasn't enough time to torture you\". Esmeralda: \"Thanks anyway\". Not only am I running out of room to rave about how much I loved this movie, but I don't want to talk it up so much that I ruin it. Just watch, enjoy, and get the bejeezus scared out of you. Make sure you are not going to be interrupted for 90 minutes, because it is so riveting you do NOT want to have to turn it off even for a minute. Watch, and prepare to be impressed. Caution: this is NOT a movie for kids, or easily upset adults. The movie pulls NO punches in the graphic portrayal of extremely nasty tortures and executions. The movie is scary and disturbing enough; I try not to dwell to long on the fact that it is based on historical events. In the words of a character during a climactic moment that you won't forget for a long time...\"Welcome to Hell!\"",
         "I haven't liked Stuart Gordon's output much since his classic one-two punch of 'Re-Animator' and 'From Beyond' back in the 1980s, so I've avoided seeing some of his movies for years. 'The Pit And The Pendulum' is one. I thought it was going to be a turkey, but now that I've finally seen it, I'm pleasantly surprised. While it isn't as great as vintage Gordon, it's far better than 'Castle Freak' or his recent 'Dagon'. The cast really makes this work. Lance Henriksen is excellent as the tortured Inquisitor Torquemada, and Rona De Ricci is very good as Maria the beautiful girl he becomes obsessed with. I don't know why De Ricci didn't go on to a career as she can act and she's very hot. The supporting cast is way above average, with Gordon regulars Jeffrey Combs and Carolyn Purdy-Gordon, 'Dolls' Stephen Lee, Tom Towles ('Henry: Portrait Of A Serial Killer'), Mark Margolis ('Pi') and even a cameo by Oliver Reed, who let's not forget appeared in 'The Devils' back in the early 70s, a movie which this 'The Pit And The Pendulum' has more in common with than the 60s Roger Corman version starring Vincent Price. I liked this movie a lot more than I expected to. It's underrated and definitely worth checking out, especially for Henriksen's intense performance, one of the best of his career.",
         "The Roman Catholic Church has begun to turn away from the Inquisition, finding its methods and motives more than just a little bit suspect. But the Grand Inquisitor of Spain (Lance Henriksen) has other plans... he is his own authority, allegedly guided by God Himself. A baker and his wife end up on the wrong side of the law -- his law -- when they protest an execution and she is accused of witchcraft. Lance Henriksen has a bad habit of appearing in many low budget horror films, so much so that any credibility he gained as Bishop from \"Aliens\" or Frank Black from \"Millenium\" is overshadowed by his constant self-degradation. Did we really need so many Pumpkinhead films? But \"Pit and the Pendulum\" is one of those rare films that is both lower budget and yet still good, today maybe even carrying on well as a timeless classic. Unlike other Full Moon films, this one has a steady plot and interesting characters -- and a decent cast. Mark Margolis shows up and Jeffrey Combs has a relatively small, but crucial, role to play. (Combs, like Henriksen, has sold out in recent years.... but his very presence makes a film better.) There is excessive -- but not gratuitous -- nudity, bloody torture devices (but not to the point of exploitation like \"Saw\", just for entertainment). This is a fun film in the vein of, say, the original \"Troll\" (but not \"Troll 2\"). Stuart Gordon is best known for \"Re-Animator\" and \"From Beyond\", but if there is a third third of his that deserves recognition, this is it. Gordon (and writer Dennis Paoli) found a way to work within the budget of Full Moon and still make things worth watching rather than poor excuses for \"movies\". Now out on Blu-ray, the film looks better than ever (as much as it can). There is no audio commentary for some inexplicable reason, but there is a very short making-of featurette. Somehow Tom Towles got his name spelled wrong on the credits (a true disgrace). Blu-ray.com notes that the \"transfer isn't masterful, but it's certainly more than capable\" and gives the disc 3 of 5 stars. But if the price is right this film is worth getting.",
         "I think Rona da Ricci (Maria) is one of the most beautiful women I've ever seen. If anyone has any pictures, information or her phone number, I'd be very interested... This is a horrifically dark adaptation of Edgar Allen Poe's story, set in the oppressively religious society of Spain at the time of the Inquisition. The film is well-written, although a few things don't quite sit right with me. Firstly, the comic relief character is a bit vacuous. (At least, I think he was supposed to be funny...) Secondly, there is reference to the Roman Catholic Church trying to stop the Grand Inquisitor from murdering innocent people in the name of God. I somehow doubt that the organization that instigated and perpetuated these massacres over the centuries, in whatever manifestation worked for the time and place, would turn so vehemently against it at any stage, let alone against a wing of it's own organization. I think it was something of a cop-out on the part of the creators of this film. Apart from this, however, the film is enthralling, intriguing and predominately well-acted (though the male lead leaves something to be desired). Also, the cinematography deserves a mention. Not for everyone, but if you have a strong stomach, it's definitely worth a look.",
         "Charles Band takes on the classic Poe tale here with help from a surprisingly good cast including Lance Henriksen, Jeffrey Combs and a small cameo from Oliver Reed! This film is combination of three classic Poe tales which aren't that bad but as you would expect pretty cheap 'n' cheerful looking at times. There is an odd element of humour at times boarding on spoof, yet despite this Henriksen gives us a chilling performance as the lunatic inquisitor 'Torquemada' which is a brilliantly over the top ham fest of a performance, bizarre monk hairdo included and those cutting round eyes of his. Rest of the cast are pretty useless and the effects and sets go from reasonable to down right awful. Plenty of fake blood and cheesy dialog but I saw this mainly for Henriksen really, his presence elevates the film to a guilty pleasure. 4.5/10",
         "Good flick from back in the days when Full Moon Entertainment was serious about making them. Not much of a known cast, however they all put out excellent performances, especially Lance Henriksen who is one of my favorites. Well told story. I strongly recommend this one for Lance Henriksen fans, or someone who wants to see what Full Moon was able to do in their heyday.",
         "I really enjoyed watching this movie and I wish to recommend to as many people as possible. But maybe biased because I'm a huge fan of director Stuart Gordon. I have yet to see a movie of his that doesn't fully lives up to my expectations. From Re-Animator over Dolls to Castle Freak...they all belong to my favorite horror movies. And I do believe Gordon belongs to the most talented directors in the genre because he can handle all sort of horror topics. His debut - the brilliant Re-Animator - was a comedy splatter movie while The Pit and the Pendulum doesn't contain that much violence or gore. This movie contains an intelligent and even educational story and it has great settings and costumes of the 14th century. The Pit and the Pendulum is an adaptation of the famous short story by Edgar Allen Poe. The master of low budget - Roger Corman - already used this story once to make a great horror classic starring Vincent Price. Stuart Gordon's movie isn't really a remake of that one. They just used the same plot. Pit and the Pendulum takes place during the Spanish Inquisition. Lance Henriksen plays one of the best roles of his entire career as Torquemada. He decides whether \"witches\" are guilty or not and when they'll be burned for the eyes of God. A young girl, Maria ( played by Ronna De Ricci who never did anything else in her career )who resists against his way of working is being arrested. Torquemada wants to accuse her of witchery but he's fascinated by her looks and her body. Meanwhile, Maria's husband entered the castle and he wants to free his wife. The atmosphere and the settings impress the most in this movie. The ancient castle and the torture chambers are really intriguing. The costumes are terrific as well. There isn't too much gore and violence to detect in this movie ( especially not compared to previous Gordon movies ) but they're are a few very explicit scenes that show true horror. But it's always shot with a lot of style and class. Even though Lance Henriksen is getting all the attention in this movie, there are a a few other great performances in this movie. I'd like to bring forward Jeffrey Combs...my favorite B-movie actor and frequently cast by Stuart Gordon. His role is pretty limited but very well acted. The Pit and Pendulum is warmly recommended to fans of atmospheric horror and historical stories. One to watch !!",
         "I really enjoyed this film.It was a little poor in some aspects mainly the acting but the story line was adequate. If you are a viewer of dark movies, then you would like this adaption of Edgar Allan Poe. The torture scenes are quite good."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Empire Pictures (II)",
         "Full Moon Entertainment"
      ],
      "summaries": ["It is the time of the Spanish Inquisition. Maria does not like what is going on during the \"Auto De Fe\". When she speaks out, she is arrested and accused of being a witch. Torquemada has plans for her! He orders her tortured, and her tongue to be cut out. Her husband attempts to free her..."],
      "budget": 2000000
   },
   "movielensId": 76298,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1991-06-27",
      "dvdReleaseDate": null,
      "directors": ["Stuart Gordon"],
      "runtime": 97,
      "movieId": 76298,
      "title": "The Pit and the Pendulum",
      "mpaa": "R",
      "actors": [
         "Lance Henriksen",
         "Stephen Lee",
         "William J. Norris",
         "Mark Margolis",
         "Carolyn Purdy-Gordon",
         "Barbara Bocci",
         "Benito Stefanelli",
         "Jeffrey Combs",
         "Tom Towles",
         "Rona De Ricci",
         "Jonathan Fuller",
         "Oliver Reed",
         "Larry Dolgin",
         "Frances Bay",
         "Fabio Carfora"
      ],
      "imdbMovieId": "0100369",
      "originalTitle": "The Pit and the Pendulum",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["jm1E-tMPniw"],
      "plotSummary": "Set during the height of Spanish Inquisition. The beautiful and kind-hearted Maria is arrested as a witch when she inadvertently cries out in horror at the public whipping of a child. As Maria’s husband Antonio tries to save her, Torquemada, the Grand Inquisitor, determines to punish Maria with torture for the desire she inflames in him. Loosely based on Edgar Allen Poe's classic short story.",
      "tmdbMovieId": 47090,
      "avgRating": 2.61364,
      "releaseYear": "1991",
      "numRatings": 22,
      "posterPath": "/hkqnTzHaLWF5zIiVA2UlQ63AZFH.jpg"
   }
}