{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0144688",
      "video": false,
      "title": "Wildflowers",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Cally",
               "gender": 1,
               "credit_id": "52fe4674c3a36847f80ffea3",
               "name": "Clea DuVall",
               "profile_path": "/lNCDz75IsCKIPhr295OBk1SHv2J.jpg",
               "id": 20387,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sabine",
               "gender": 1,
               "credit_id": "52fe4674c3a36847f80ffea7",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wade",
               "gender": 2,
               "credit_id": "52fe4674c3a36847f80ffeab",
               "name": "Tomas Arana",
               "profile_path": "/sx8tDGA7e7d5oDYpQwaydmGcc93.jpg",
               "id": 941,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jacob",
               "gender": 2,
               "credit_id": "52fe4674c3a36847f80ffeaf",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4674c3a36847f80ffe9f",
               "name": "Melissa Painter",
               "profile_path": null,
               "id": 130106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4674c3a36847f80ffeb5",
               "name": "Melissa Painter",
               "profile_path": null,
               "id": 130106,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.703125,
      "production_countries": [],
      "id": 44047,
      "vote_count": 2,
      "budget": 0,
      "overview": "A mysterious girl becomes involved with a 17-year-old girl and changes her life forever.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         112160,
         858,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Wildflowers",
      "runtime": 93,
      "poster_path": "/5bYQSZaiGvs9jAVBHMRKO9DLkkz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-03-04",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Sometimes, a chance meeting can be a chance to change your life....",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Melissa Painter"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Melissa Painter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144688/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3ODUwMzQ1NF5BMl5BanBnXkFtZTcwMDMzNDMzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Clea DuVall, Daryl Hannah, Tomas Arana | See full cast and crew »"],
      "reviews": [
         "This is a beautiful film about real people spanning two generations -- that of the counterculture of the sixties, and the children they bore, and then reared or abandoned. There is a refreshing absence of sixties-bashing, stereotypical characters, phony hippie artifacts, false emotion, and all the other trappings of Indie or Hollywood films desperately searching for an audience. This is a novel on film. I'm grateful to the film-makers because I had despaired of ever seeing the lives we led ever portrayed realistically on film.",
         "The cast is not the best and the story isn't either but I loved watching such fine work from Clea DuVall. Why is this woman not in more good films? She is so wonderful in this film, she is sensitive and touching, you can't keep your eyes off of her. Wonderful Clea wonderful! Thanks for such a inspiring job! Eric Roberts is quite good as well, he too suffers from getting into a good film at times. Daryl Hannah does not do her best work but all in all she was ok. Clea surely steals the film though and I gave a rating of 7 on her acting alone.",
         "Having grown up in the Bay Area (where this film is set, just over the golden gate) in similar communal conditions with parents and guides of the same Vietnam-protesting vagabond/artist generation, I was stunned by the grace and accuracy of this film. The cinematography alone was breathtaking, and with substance to play with like the eucalyptus forests of Marin, the bookshelf lined cafe district of North Beach San Francisco, the misty Pacific coast, and Darryl Hannah (!), I can say without a breath of doubt they did something very magical a whole lotta justice. Hannah's character reeked of a wild wanderlust and a seemingly disorienting excess of love and passion that it seemed as though the bounds of the film itself were keeping her in a captivity that was at the same time thrilling and unbearable. As Darryl Hannah grows older, her incredible grace and growling intricacies are all the more heart-stopping. Though she plays a painfully awkward character, Clea DuVall performs her character wholly (alongside a perfect cast, including still-unknown Richard Hillman). I applaud the author for letting herself be drawn so harshly and honestly in the character of Cally, a seventeen year-old victim of a young parental generation that, though highly effective for the more curious and fervid of us, carelessly left to the wayside the sons and daughters that needed a bit more than just freedom and an echoing concert hall.",
         "From the opening moments, this film promises to be unlike any of the slick, commercial \"product\" being made today. The style of the film harkens back to the turbulent, adventurous, somewhat dangerous times of the 1960s and the movie itself reveals how the events of days gone by continue to reverberate through the lives of the following generation. The photography is breathtaking; the editing is masterful; the performances far more than memorable. This is possibly one of Daryll Hannah's finest character portrayals. The story is a very private one -- yet it reaches out to touch the experiences of many who were swept up by the events of a certain time. It has the startling ring of truth throughout. The beautiful ... the sublime ... the tragic ... the heart-breaking. For those whose lives have spanned this period, this is an unforgettably compelling film journey.",
         "I am pleased to see such a well-made film come out of such limited resources. The boat where I lived was briefly featured in the scenes where the women jumped/were thrown into the water. Seeing my beloved Marin shot so carefully, so richly, was most satisfying. The music was also quite touching and appropriate. I liked the story, but one criticism is that the pacing was too languid. It could've had more ebb and flow in the timing, and perhaps a stronger story ellipse. Otherwise, I'm happy to see the communal counter-culture accurately represented, by somebody who knows it from the inside. I look forward to seeing more work by Clea and Mellissa.",
         "Wildflowers was a film with a simple but moving story. The characters made sense - they were eccentric but down to earth and convincing and the dialogue was realistic and engaging at the same time. Cally and Sabine are wonderfully acted and their relationship is truly fascinating to watch. The peripheral characters, too (Cally's friends and some of the commune members), were great to watch - they had their own personalities and some good lines. One of the best features of the film was definitely the camerawork - stunning shots of Pacific scenery and really evocative lighting in the scenes with people. However, the movie did get slow at times - don't expect anything truly exciting. And maybe it's just me, but there did seem to be some plot holes that never resolved themselves; i found myself wondering \"how does Cally know so-and-so?\" and \"how did she get from point A to point B?\" sometimes. Also, I would have liked to find out more about Cally's past, what life on the commune was like, and other details about the characters that were never revealed. That would have given the events a lot more context. Overall, \"Wildflowers\" was thought-provoking and simply a good film to watch. If you concentrate on what is is rather than what it could have been, I predict you'll love it.",
         "Below average drama that had good cinematography but was not up to par regarding script and screenplay.The story was promising though and the directing was almost good.The two lead actresses were average as well but still,this movie will satisfy big fans of the Marin county/San Francisco area culture and the subject matters regarding the Hippie culture from there and their New Age offspring.This movie should have been a TV or made for cable movie.Big fans of Darrly Hannah will likely tolerate this one as well.......",
         "Watching Clea DuVall and Melissa Painter talk about how much time and effort it's taken to get this story onto the screen, and having seen the result, it's hard to believe that nobody will see this film. Painter shoots around the Bay Area with beautiful results, and cuts the scenes together in a way charming to anyone who liked The Limey or The Thin Red Line. With only 22 days of shooting and no rehearsal with the few other characters, DuVall shoulders the film and carries it brilliantly. If nothing else, this film will serve as a strong calling card for both of its principals. They'll both be heard from again and again.",
         "Bland, boring teenage girl starts obsessing over and stalks a beautiful woman (Daryl Hannah) she sees dancing. Then we find out the girl might have a secret connection with this woman and returns a book that belongs to her. Geez, I wonder what could that connection be? I figured it out probably an hour before the movie finally revealed it. It's so obvious by the way they have set the environment so that this girl wouldn't miss anyone if she connected with this person. Unfortunately when they finally start to meet regularly it isn't heartwarming or special at all, the woman is an emotional wreck who constantly relies on this teenager to look after her and comfort her. The conversations are long and not interesting, the shots of Daryl Hannah can change 5 times within 10 seconds (I thought something was wrong with the video quality!), making me wonder if she couldn't hold back a laugh or something, why else would they need to have so many different shots in such a short time? It also leaves the conversations choppy and it doesn't feel like the actors put much emotion into it as you get the feeling each sentence was done on different days. I also feel they played the same acoustic guitar melody over, and over, and over... the same bland melody finally made me fall asleep as there was nothing to keep me awake anymore.",
         "I grew up in the 1960s, finished college in 1967, and I almost went to UC Berkeley for graduate school. Thanks to then Governor Reagan who put a temporary freeze on out of state assistance, I went elsewhere. Had I gone to Berkeley, hotbed of hippie activity, I might have turned out just like some of the characters in this movie. Clea DuVall is the nominal star as 17-year-old Cally, a product of the 1960s communal living. She was born in 1968 and shortly thereafter her mother disappeared. She was raised by her dad and others in the commune. It seems that she has turned out OK, but she is still restless, wondering who her mother was, something her dad has no interest in filling in details for. Tomas Arana is Wade, her 40-something dad in 1985, he works but not consistently and there isn't always money for food and basic needs. Cally hangs out in San Francisco enough that the clerk at the coffee shop knows her by name. One day she sees an unusual, blond, hippie-looking lady that captures her interest. Daryl Hannah is the mysterious Sabine. The 4th key character is Eric Roberts as Jacob, whom we soon find out was once in love with Sabine and who usually knows where she is. This is an unusual movie in that the viewer can't easily focus on a theme. We know Cally isn't totally happy with her dad and wants to leave the nest. We know she is trying to find out if this mysterious Sabine perhaps really is her mother. But much of everything that leads up to the final conclusion seems a bit disconnected. SPOILERS: In her path through growing up Cally somehow gets attracted to 40-something Jacob. She goes to his place, she takes a shower, there is a quick scene of her naked rear, seemingly gratuitous, then she and Jacob have sex. Maybe the director intended for this to connect Cally to Sabine, who turns out to be her mom, but who never wanted a child and felt inadequate to deal with motherhood. But they do end up bonding of sorts ans we wonder, what might happen next?"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Filmsmith Productions",
         "Fries Film Group",
         "Wildflowers LLC"
      ],
      "summaries": ["A mysterious girl becomes involved with a 17-year-old girl and changes her life forever."],
      "budget": 0
   },
   "movielensId": 7648,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-03-04",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Melissa Painter"],
      "runtime": 93,
      "movieId": 7648,
      "title": "Wildflowers",
      "mpaa": "R",
      "actors": [
         "Clea DuVall",
         "Daryl Hannah",
         "Tomas Arana",
         "Eric Roberts"
      ],
      "imdbMovieId": "0144688",
      "originalTitle": "Wildflowers",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A mysterious girl becomes involved with a 17-year-old girl and changes her life forever.",
      "tmdbMovieId": 44047,
      "avgRating": 2.75,
      "releaseYear": "2000",
      "numRatings": 20,
      "posterPath": "/5bYQSZaiGvs9jAVBHMRKO9DLkkz.jpg"
   }
}