{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "maid",
            "id": 13097
         }
      ],
      "imdb_id": "tt0113211",
      "video": false,
      "title": "The Grass Harp",
      "recommendations": [],
      "backdrop_path": "/zdryyXaJmUWV1XxpYAhxXsZtcDS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dolly Talbo",
               "gender": 1,
               "credit_id": "52fe4709c3a36847f8120445",
               "name": "Piper Laurie",
               "profile_path": "/eKjVK5MQ5RK9XuVLaCC2oYACmbK.jpg",
               "id": 6721,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Verena Talbo",
               "gender": 1,
               "credit_id": "52fe4709c3a36847f8120449",
               "name": "Sissy Spacek",
               "profile_path": "/zauFMssYujKk7Kadz0t100VU5WE.jpg",
               "id": 5606,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Judge Charlie Cool",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f812044d",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Collin Fenwick",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120451",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Catherine Creek",
               "gender": 1,
               "credit_id": "52fe4709c3a36847f8120461",
               "name": "Nell Carter",
               "profile_path": "/sAuomv05KmeVXP9JDQL2yd46Yol.jpg",
               "id": 80866,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Morris Ritz",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120465",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Sister Ida",
               "gender": 1,
               "credit_id": "52fe4709c3a36847f8120469",
               "name": "Mary Steenburgen",
               "profile_path": "/yJhfuqS3yXW7kLSyvRU6n3b35mq.jpg",
               "id": 2453,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Riley Henderson",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f812046d",
               "name": "Sean Patrick Flanery",
               "profile_path": "/1xgb9WblosYkvTGoh0yDuZII9ok.jpg",
               "id": 54789,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sheriff Junius Candle",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120471",
               "name": "Joe Don Baker",
               "profile_path": "/7WQq2nmSXXIC4vR3MhHLYRZD2wE.jpg",
               "id": 10671,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Reverend Buster",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120475",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Amos Legrand",
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120479",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120457",
               "name": "Charles Matthau",
               "profile_path": "/sAbN9pMTTsppMcSTiuKLuJ0xnix.jpg",
               "id": 122728,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4709c3a36847f812045d",
               "name": "Stirling Silliphant",
               "profile_path": "/rU0rdr05rqlBotVaSoYPUnDxAB.jpg",
               "id": 6779,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4709c3a36847f812047f",
               "name": "Truman Capote",
               "profile_path": "/rRrTzbxvYAFCq55UopYDnb2aZw4.jpg",
               "id": 1930,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4709c3a36847f8120485",
               "name": "Patrick Williams",
               "profile_path": null,
               "id": 7422,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5383899b0e0a2624c000d366",
               "name": "John A. Alonzo",
               "profile_path": "/7HN8Ifyp5hNBhBurx0q3rlsQX8r.jpg",
               "id": 1153,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.258371,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46732,
      "vote_count": 7,
      "budget": 0,
      "overview": "Based on the novel by Truman Capote, this often-witty coming-of-age drama looks at a young man growing up with an unusual family in the Deep South in the 1940s.",
      "similar": [
         11421,
         858,
         334,
         425,
         112160,
         376867,
         43923,
         3134,
         5781,
         1374,
         3170,
         141,
         634,
         637,
         14,
         101,
         142,
         675,
         11216,
         745
      ],
      "original_title": "The Grass Harp",
      "runtime": 107,
      "poster_path": "/pcdi92LC26RW3zm97SwF3NXYTUr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Charles Matthau-Jerry Tokofsky-John Davis Productions",
            "id": 17064,
            "origin_country": ""
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-10",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Love is a chain of love... as nature is a chain of life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Charles Matthau"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Truman Capote",
         "Stirling Silliphant"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113211/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwODA3OTkyNl5BMl5BanBnXkFtZTcwMjU4NTgyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Piper Laurie, Sissy Spacek, Walter Matthau | See full cast and crew »"],
      "reviews": [
         "After watching The Grass Harp I felt I had just experienced a feast! If you are tired of the McDonald's diet of recent Hollywood formula movies than you will welcome this gourmet quality film! Based on Southern writer Truman Capote's boyhood, the story reveals the nuances of small town life with humor and wit. The lush visuals and lyric pace create a leisure mood befitting the 1930's when life was simpler. The golden sepia tones of the scenes subtly transport us into the memories of Collin, through whose eyes the story is told. The Southern ambiance, social graces and simple pastimes of a bygone era are beautifully recreated in the world surrounding the characters. I love the barbershop scenes, where locals gather to socialize and get the latest news. You just want to hang out in the shop and shoot the breeze with Walter Matthau and Roddy McDowell. Joe Don Baker is the perfect southern sheriff and his sidekick Ralph (a rooster) adds a hilarious touch of eccentricity to his tough good-old boy demeanor. Charles Durning is hilarious as a self-righteous preacher that can't wait to kick Mary Steenbergen and her brood of a dozen kids out of town. Piper Laurie is the heart and soul of the movie as Dolly Talbo. The timid and ethereal Dolly has been living under the thumb of her overbearing sister (Sissy Spacek) but manages to create a unique life of meaning for herself. Edward Furlong plays their teen nephew Collin who comes to live with them. Dolly and her housekeeper (Nell Carter) take Collin under their wing and try to help him adjust to life in this small southern town. As Dolly advises Collin about the girl he has a crush on, she too falls in love for the first time in her life. Piper Laurie glows like a young girl around the young-at-heart Judge Cool (Walter Matthau). Their scenes together are sweet and heartbreaking. The movie is beautiful, both visually and emotionally. It is funny, sad, and touching. Don't rush this viewing. Sit down with a glass of wine and savor. The Grass Harp is a feast for the eyes and soul!",
         "Set in the 30's, The Grass Harp is a story about an orphan boy who is sent to live with his eccentric aunts. The story follows the plight of social \"outcasts\" with humor and insight. On the surface this story is about love and our connections to others - both living and dead. Yet underneath run themes of social injustice, racial inequality, religion, morals and the struggles of social conformity vs. individual expression - but the film never preaches. It just reveals. Director Charles Matthau accomplished the near-impossible task of adapting Truman Capote's classic book into a beautiful rendered film. Wisely, he approached this multi-layered story with a light touch, allowing the material and talent to shine. Matthau skillfully captures a myriad of complex relationships and emotions, allowing the characters to live and breathe without placing judgment on who they are. The boy's coming-of-age story is entertaining, humorous and poignant. As the film unfolds, Collin encounters a diverse group of characters, from which he gains valuable insights about life. Now an adult he looks back (as the narrator) reflecting on this formative time. Each character is uniquely distinct and true-to-life. The entire all-star cast is at the top of their game. This is the best performance of Piper Laurie's career. She is delicate and mesmerizing as the fragile Dolly Talbo. Her scenes with Spacey and Matthau will break your heart. For those of you who have only seen Walter Matthau in grumpy curmudgeon roles, you are in for a treat! Matthau is wonderful as a Judge Cool, a Southern gentleman struggling to find meaning in his retirement years. As Piper Laurie's love interest he is tender and charming yet dignified. A man of integrity and honor, Judge Cool is the only \"accepted\" towns person with compassion for the outcasts. As a collective, the ensemble cast captures the social pecking order with uncanny accuracy. Jon Don Baker is great as the Sheriff, Nell Carter is a hoot as the eccentric housekeeper and Sissy Spacek is an amazing blend of steely resolve masking her conflicted feelings of vulnerability and insecurity. Roddy McDowell is the delightfully sarcastic barber. Jack Lemmon and Mary Steenbergen are great fun as cons on the run. Mary as a traveling cowgirl evangelist out to save souls - never mind that she is a single- mother of fourteen kids\u0085all by different fathers! She pulls it off with comic charm and sad poignancy. Lemmon is a \"chemical engineer\" (read quack potions salesman) with a scheme to get his hands on Dolly's herbal potion. Even though both Lemmon and Steenbergen are devious cons looking to score, they too are well-developed characters and oh-so-human in their desperate schemes to survive the Great Depression. There is also one of the most delightful casts of furry creatures ever assembled: a host of cats, dogs, fish, and a scene-stealing Rooster named Ralph. It looked to me like Ralph was huffing around wishing he had more lines. I'd be all for him getting his own sequel.",
         "I was really surprised that The Grass Harp turned out to be the great film that it is. The book by Truman Capote is one of my favourites and I didn't think that it would work as a film. It has been cast perfectly with Sissy Spacek and Piper Laurie beautifully bringing to life the Talbo sister's Verena and Dolly respectively. Special mention too should be given to Walter Matthau, Jack Lemmon & Roddy McDowall. All the cast are really quite terrific. Great attention has been made to period detail and the film has a glorious soundtrack. Full marks to the screen writers who have adapted the spirit of Capote's novel. And last but not least to Charles Matthau for his sensitive direction. A must see film shamefully overlooked on its first release.",
         "This is a technically perfect adaptation of Capote's stunning story based upon partially on his own experiences. Laurie is all things Dolly should be: ethereal, giddy, of understated intelligence, committed, etc. Spacek had to stretch to play the cold-hearted sister, but that's what great actors do. It is leisurely paced, but that's totally in keeping with the story. Music, sets, and all are done with precision and with plenty of soul. Matthau and Lemmon have no scenes together, and for a change, Matthau plays the ethically superior character. Edward Furlong is perfect as the story's protagonist, and Mary Steenburgen steals each scene in which she appears. I recommend this movie highly to all who enjoy character development and Southern-US Americana.",
         "An all-star cast, (Sissy Spacek, Piper Laurie, Walter Matthau, Jack Lemmon, Mary Steenburgen), makes this screen version of Truman Capote's novel watchable, and then some. But it's all too whimsical and twee to really work. It's directed by Walter Matthau's son Charles and he seems content to let the material speak for itself. It's straightforward and literal and unexciting. It's like something the Reader's Digest might have produced. However unlikely Truman Capote's source material there was poetry in almost every line. That's missing here despite the quaint Southern Gothic narration, and none of the cast are at their best or anything approaching it. Without anything like direction from Matthau they simply go through the motions. Still, it's a decent yarn and it tugs at the heartstrings and there you have it.",
         "A wonderful adaptation of a favorite book. The casting is fun and unexpected and once you see the film it is hard to imagine anyone else in the roles - they just ARE the characters. The style and tone of the directing are pitch-perfect. The period and setting were captured in every detail. The cinematography looks like a painting and the score is hauntingly beautiful. The exquisite performances make you forget you are watching world class famous stars. They just crawl inside the skin of the characters and bring them to life. Mr. Capote would have loved it. The movie made me laugh and made me cry. I wish the DVD had deleted scenes and extras because I was left wanting more. I am off to buy the soundtrack.",
         "THE GRASS HARP was a novel by Truman Capote, based (in part) on his a youth, living with a pair of aunts in a southern town. Here his narrator hero is orphaned at an early age, and he is raised by his father's cousins (Sissy Spacek and Piper Laurie). Spacek is the actual head of the family, running four prosperous businesses in the small town, such as the town department store and town hotel (complete with Presidential suite). She is a humorless, hard working woman, as opposed to her sister, who is a loving, free spirited type, who (with her friend and assistant (Nell Carter) collects herbs for a patent medicine remedy for \"dropsy\". Edwin Furlong (and, earlier, Grayson Frick) play the hero of the film, Collin (the narration is by Boyd Gaines). The hero quickly finds himself in love with Laurie, and just respectful towards Spacek. As he grows up, he finds himself defending Laurie's reputation (she is seen as quite eccentric). The town people also fear Spacek, but rather openly dislike her. Walter Matthau is retired Judge Cool, a sensible elderly man who \"good\" people consider a nut (he openly admits that there was nothing wrong with a true love affair between a white man and an African-American woman which led to the white man being run out of town). Matthau is having problems in his home with an unsympathetic grown son and the son's wife. Matthau's wife has died years before. Others in this well cast film include Jack Lemmon as a Dr. Ritt from Chicago, whom Spacek brings back home - and whom accidentally sets in motion the delayed rebellion of Laurie and the others against Spacek's stiff and respectable regime. Joe Don Baker plays the local chicken rancher/part-time sheriff (who hates having to cow-tow to Spacek). Charles Durning is the local minister, who is out for only respectable religious leaders (with Bonnie Bartlett as his equally stuffy wife). Mary Steenburgen is the religious threat - an unmarried mother of twelve who has a mobile revival tent in the back country, but whom is pretty likable for all one's questions about her revivalism. Sean Patrick Flannery is Riley, a young man who lives unconventionally, but whom turns out to be a pretty good friend to Collin. Roddy McDowall (in one of his last roles) plays Amos, the local barber. Basically Capote uses his characters to punch holes in what \"nice, conventional\" small town people believe is proper behavior. Spacek is the leader of these people, who believe in organized Christianity, hard work and business, and straight-laced morality. Laurie, Matthau, Carter, Flannery, Steenburgen, and Furlong are all believers in doing what is natural, and from the heart. So as they begin working together they become a model and a danger for the \"nice people\". But as the tale progresses, the nice people find that what they believe in does not emotionally satisfy them. Indeed Spacek suffers several losses in the course of the film that she never expected. Charles Matthau, Walter's son, directed this (very nicely - it is one of the best ensemble movies of recent years). It was also a rarity in the 1990s decade of Matthau-Lemmon films. Whereas GRUMPY OLD MEN, GRUMPIER OLD MEN, OUT TO SEA, and THE ODD COUPLE II were all comedies, this film is dramatic and the two actors only shared one scene (with Roddy McDowall in his barber shop) in the film. Also, Lemmon's character is less likable than usual in this film. The title, by the way, refers to a statement by Laurie's character about how the grass gives off a music like a harp, which is actually the voices of all the people who ever inhabited the earth. It becomes a running metaphor in the film up to the conclusion.",
         "Directed by Walter Mathau's son Walter, this is a superb adaptation of on one of Truman Capote's best stories about how Southern misfits in the 1930's help each other survive. Both Piper Laurie and Sissy Spacek, as the wealthy Talbo sisters, are perfectly cast and neither has ever been better. Walther Mathau, under his son's direction, in his most sympathetic roles, plays a retired judge. Every member of the spectacular cast is completely understandable: Jack Lemon and Mary Steenburgen are a pair of hilarious but unrelated con-artists. Nell Carter is the Talbo sister's very feisty cook, Joe Don Baker is the bumbling sheriff, Charles During the preacher, and Roddy McDowall is the gossipy barber. Look for Doris Roberts (Ray Romano's 'mom') as Mrs. Richards and for the director himself, Charles Mathau, as a barbershop regular.",
         "A delightful movie from Truman Capote's memoir of his boyhood in the South. It is both tender and poignant. The acting is excellent. Piper Laurie as the orphan's free-spirited aunt is superb. Sissey Spacek as the other aunt is excellent. The atmosphere of that time, comes alive. A worthwhile movie for those with a tender heart.",
         "I missed this film on it's theatrical release, (if it had one) - but saw it on video. Ensemble acting at its very best. Piper Laurie excellent in her portrayal of the beautiful and wistful Dolly. Expert support from Matthau, Lemon, Spacek and Durning. Top marks to my hero Roddy. This film had a wonderful story which left me with tears in my eyes at the end. You can keep your action adventure films. Give me a story everyday."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": [
         "Charles Matthau-Jerry Tokofsky-John Davis Productions",
         "Fine Line Features",
         "Grass Harp"
      ],
      "summaries": ["After his mother's death, Collin Fenwick goes to live with his father's cousins, the wealthy, avaricious, and controlling Verena Talbo, and her compliant, earthy sister Dolly. When a city slicker comes to town and convinces Verena to market Dolly's locally-famous tonic, Dolly finally gets some backbone, refuses to divulge the formula, and heads for a tree house with Collin and Catherine, the loyal maid. Verena, who has most of the town in her pocket, sics the law on the renegades. Dolly, Catherine, and Collin find a supporter in a retired judge, Charlie Cool, who's attracted to Dolly. Will Verena's venom win out? And what about that city slicker?"],
      "budget": 8000000
   },
   "movielensId": 767,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-10",
      "dvdReleaseDate": "2005-04-19",
      "directors": ["Charles Matthau"],
      "runtime": 107,
      "movieId": 767,
      "title": "The Grass Harp",
      "mpaa": "",
      "actors": [
         "Piper Laurie",
         "Sissy Spacek",
         "Walter Matthau",
         "Edward Furlong",
         "Nell Carter",
         "Jack Lemmon",
         "Mary Steenburgen",
         "Sean Patrick Flanery",
         "Joe Don Baker",
         "Charles Durning",
         "Roddy McDowall"
      ],
      "imdbMovieId": "0113211",
      "originalTitle": "The Grass Harp",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["1tqWK4wbwk4"],
      "plotSummary": "Based on the novel by Truman Capote, this often-witty coming-of-age drama looks at a young man growing up with an unusual family in the Deep South in the 1940s.",
      "tmdbMovieId": 46732,
      "avgRating": 3.53492,
      "releaseYear": "1995",
      "numRatings": 315,
      "posterPath": "/pcdi92LC26RW3zm97SwF3NXYTUr.jpg"
   }
}