{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hollywood",
            "id": 12396
         },
         {
            "name": "screen test",
            "id": 223369
         }
      ],
      "imdb_id": "tt0023241",
      "video": false,
      "title": "Movie Crazy",
      "recommendations": [],
      "backdrop_path": "/oo3X354D2nX8Gsus6rqLqno7cvH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Harold Hall aka Trouble",
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166435",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mary Sears",
               "gender": 1,
               "credit_id": "52fe486cc3a36847f8166439",
               "name": "Constance Cummings",
               "profile_path": "/uzsum5NHhYiNtspVRy9BkHAHq1i.jpg",
               "id": 19022,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Vance",
               "gender": 0,
               "credit_id": "52fe486cc3a36847f816643d",
               "name": "Kenneth Thomson",
               "profile_path": "/p457u5djPGAGBbP9i0aSt568rEm.jpg",
               "id": 96056,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mrs. Kitterman",
               "gender": 1,
               "credit_id": "52fe486cc3a36847f8166441",
               "name": "Louise Closser Hale",
               "profile_path": "/bVpUj1sQe754pJCmGAAD6iyOjHX.jpg",
               "id": 13344,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "J.L. O'Brien",
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166445",
               "name": "Spencer Charters",
               "profile_path": "/67wOC0rjJG6tpXVQLZsOj6s7clP.jpg",
               "id": 34280,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Wesley Kitterman, Producer",
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166449",
               "name": "Robert McWade",
               "profile_path": "/eQTam5irf6HovM0WueHv7LO0ew7.jpg",
               "id": 30007,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bill (assistant director)",
               "gender": 2,
               "credit_id": "52fe486cc3a36847f816644d",
               "name": "Eddie Fetherston",
               "profile_path": null,
               "id": 133100,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "The Director",
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166451",
               "name": "Sydney Jarvis",
               "profile_path": null,
               "id": 148429,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe486cc3a36847f816641f",
               "name": "Clyde Bruckman",
               "profile_path": "/b5drnn4Fzof0NBkrz7HFVJ7WfAy.jpg",
               "id": 10517,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166425",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe486cc3a36847f816642b",
               "name": "Agnes Christine Johnston",
               "profile_path": null,
               "id": 148426,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe486cc3a36847f8166431",
               "name": "John Grey",
               "profile_path": null,
               "id": 143563,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5684466fc3a368227b00e496",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56844676c3a3686075017ae0",
               "name": "Walter Lundin",
               "profile_path": null,
               "id": 1002959,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5684467ec3a36860e90187d6",
               "name": "Bernard W. Burton",
               "profile_path": null,
               "id": 993210,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5684468fc3a3684be9018091",
               "name": "Harry Oliver",
               "profile_path": null,
               "id": 1456432,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "568446a5c3a3685f89004513",
               "name": "Gaylord Lloyd",
               "profile_path": null,
               "id": 148399,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.645418,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53522,
      "vote_count": 5,
      "budget": 0,
      "overview": "Harold Hall, a young man with little or no acting ability, desperately wants to be in the movies. After a mix-up with his application photograph, he gets an offer to have a screen-test, and goes off to Hollywood. At the studio, he does everything wrong and causes all sorts of trouble. But he catches the fancy of a beautiful actress, and eventually the studio owner recognizes him as a comic genius.",
      "similar": [
         188222,
         10218,
         74643,
         599,
         8012,
         7446,
         856,
         509,
         59436,
         371638,
         313369,
         277547,
         11176,
         270487,
         2118,
         294016,
         427900,
         1826,
         310593,
         11596
      ],
      "original_title": "Movie Crazy",
      "runtime": 81,
      "poster_path": "/2uKvvKPsnOBp9rs2b2v7FZz6tms.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Harold Lloyd Corporation",
         "id": 4111,
         "origin_country": ""
      }],
      "release_date": "1932-09-23",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Clyde Bruckman",
         "Harold Lloyd"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Vincent Lawrence",
         "Vincent Lawrence"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023241/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3NjcxNTMzOF5BMl5BanBnXkFtZTgwODEzODYwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Harold Lloyd, Constance Cummings, Kenneth Thomson | See full cast and crew »"],
      "reviews": [
         "MOVIE CRAZY is one of Harold Lloyd's very best films, and that includes his silents. Sound complements his visual gags and adds depth to the story's characters without slowing down the humor. What really makes this film singular is his relationship with the femme lead. Constance Cummings, one of the great, forgotten thirties performers, provides a complexity of character unique in this kind of comedy, certainly for the time. She's not a tacked-on \"love interest;\" her relation to Lloyd is integral to the story and essential to the success of the film. Her character is cosmopolitan, and an interesting aspect of it is her relationship to her slim, attractive and cultured black maid (NOT your usual thirties movie maid!) who seems more of a companion than a maid. At first Cummings finds Lloyd ridiculous, then irritating, but after a while she finds his natural affinity for disaster strangely interesting and she becomes fond of him. She's amused by him, and toys with him in an affectionate way. Laughter is a mysterious, fragile thing. Among other things, it can be injured by too big an advance expectation. And some comedy needs an audience for fullest effect: Lloyd's comedy is that type. (Keaton, on the other hand, works as well in solitude.) Seeing this film with a large audience, I was helpless with laughter at numerous points in the film. The effect may not be the same if you see it on television, alone. This is not a perfect film (but then really great films are rarely perfect). The sequence where he accidentally dons a magician's coat is funny, but too long and a bit too mechanically calculated. His battle with the villain on a waterlogged movie set meets the requirements for an action-filled finale, but is not the film's most inventive sequence. But the best sequences are terrific. Partly because of the long-time unavailability of his films until recent years, Harold Lloyd has received critical short shrift from the silent comedy mavens. Keaton and Chaplin are demi-gods, and Laurel & Hardy and Langdon have been fully rehabilitated (if ever they were in disrepute), but Lloyd is still in the shadow, and that's unfair. Whatever else he is, Lloyd was consistently the FUNNIEST of them all, and his gags are always fresh, inventive and original. (I say this having seen nearly all the films of all these great performers.) The Lloyd character, too, though it varied from film to film, was never just a cipher, but a real, fully developed persona. Seen in the right circumstances, MOVIE CRAZY can hold its own with filmdom's greatest classic comedies.",
         "A MOVIE CRAZY young klutz comes to Hollywood and tries to become a film star in the worst possible way. Harold Lloyd had a solid success with this, his third talking film. Not only is he still a very funny fellow with outstanding athletic abilities (especially considering that half of his right hand was a prosthetic) but the film itself is remarkable for its feeling of natural realism. It doesn't look or sound like most of its other contemporaries. The dialogue has a true ring to it and much of the acting is perfectly straightforward & unaffected. Much credit must go to the fine work done by the director, writer & cameraman. The production values are of a very high order, offering glimpses of back lot Paramount Studios as a bonus. Harold's gags are often hilarious and he has some tremendous sequences, creating unintended havoc about the movie lot, attending a fancy dance party while wearing a magician's coat maliciously intent on disgorging its contents, or engaging in a climactic battle with the bad guy around a flooded set. Constance Cummings, as the actress who captures Harold's heart, gives a remarkably naturalistic performance, sweetly bringing the viewer under her spell. You want Harold to fall for her, even while he only has eyes for her Latin alter ego. Here is a performer who deserves to be rediscovered. DeWitt Jennings & Lucy Beaumont are enjoyable in their very short opening sequence as Harold's Kansas parents. Kenneth Thomson, as the villain of the film, is effective as the drunken brute who wants Miss Cummings for himself. Spencer Charters is fun as a highly temperamental studio executive. Arthur Housman is on hand playing the patented inebriate he performed so often. And marvelous Louise Closser Hale shines in her only scene as a Hollywood matron who shares a disastrous dance with Harold. Movie mavens will recognize Noah Young, a familiar face from Harold's silent films, as an upset cop & a hilarious Grady Sutton as a nervous fellow who's terrified of mice--both uncredited.",
         "I watched this the other day for the first time in years, and was disappointed. I had distant memories of this being a very funny film but it just \"fair, at best.\" Some national film critics like Leonard Maltin call this Harold Lloyd's \"best talkie,\" but I disagree. Film critics love any story that has to do with Hollywood. Constance Cummings was more entertaining than Lloyd. Her looks and figure didn't hurt, either. Anyway, Harold plays a small-town Midwestern boy who heads to Hollywood to become a famous movie star. He thinks he's talented enough (which he isn't, of course.) The only reason he got invited, and keeps getting tryouts, is because the producer thinks Lloyd is someone else. Meanwhile, since romance is usually a part of these classic comedies, Harold gets a lot of points with Cummings. She's impressed because he's the only male who doesn't fawn all over him. Since mishaps occur wherever he goes, she calls him \"Trouble.\" Much of the story is a series of events that happen to both of the leads, good things and bad things. There are some funny scenes, such as Lloyd putting on a magician's coat by mistake and squirting people in face, etc. However, if you've seen The Three Stooges, you've seen all the sight gaps you see in this movie. In all, nothing extraordinary.",
         "MOVIE CRAZY (1932) isn't one of Harold Lloyd's greatest comedies, or even, in this reviewer's opinion, his best talkie. It's a cliché story: small-town boy comes to Hollywood for stardom and falls flat on his face. Nincompoop wreaks havoc on movie studio. It's been done countless times, from Buster Keaton in FREE AND EASY (1930) to Red Skelton in MERTON OF THE MOVIES (1947). Harold Lloyd plays the part of the fool, who ruins everything he comes in contact with. This type of character (similar to the talkie roles MGM would write for Buster Keaton) is sometimes hard to watch. Hopelessly naïve and pathetic. Viewed as a freak and played for a sucker. Always knocking over stacked objects or falling in puddles. The gags are old and predictable (at least nowadays) and there are no groundbreaking stunts or anything. How many times have we seen the \"oops, we must've switched hats\" routine? And what do you think happens when Lloyd offers to help a woman unfold the top to her convertible? Or open an umbrella? Does that trick magician's jacket look just like Harold's, hanging in the restroom? (You bet it does.) This comedy just isn't all that funny, lacking some of the magic evident in Lloyd's silent classics. The best thing in this movie is the beautiful Constance Cummings, who gives a rather impressive naturalistic performance as a Hollywood starlet whose path is crossed by Lloyd's accident-waiting-to-happen character. Cummings grows fond of Lloyd (whom she nicknames \"Trouble\") and her character manages to bring a cute romantic element to the film. The first half-hour or so is pretty dull, but there's a fun little twist where Lloyd cannot recognize Cummings in her exotic on-set make-up and falls in love with the same woman twice. Cummings realizes this and plays around with Lloyd's heart. But does she actually love him, or is it all part of some game? This interesting \"love triangle\" is the strongest part of the script, and Cummings manages the dual role beautifully. MOVIE CRAZY isn't all bad, but it is something of a letdown. Most of the \"comedy\" is tiresome, although certain bits work better than others. Interestingly, this talkie lacks some of the wit of Harold Lloyd's silent films. The story is nothing special, but Constance Cummings shines in her role and anchors the sweetness that makes the film's second half worth watching.",
         "This is a good comedy, possibly Harold Lloyd's best sound movie, and it features a very nice pairing of Lloyd with Constance Cummings. It's also interesting and entertaining as a light commentary on the movie industry of its day, and the ways that it was perceived. The extreme eagerness of Lloyd's character to break into the movies is interwoven with the main romantic plot in some clever ways. The story has Lloyd's character leaving his Kansas home and heading to Hollywood, where he winds up having a chaotic and very funny romance with a star actress played by Cummings. There are a lot of funny gag ideas, some very nice scenes between the two stars, and quite a bit more, capped off by the kind of funny, exciting set piece that you always hope for as the finale in one of Lloyd's movies. Cummings is very appealing and enjoyable, and she has a lot of good material to work with, as the script sets up a good contrast between her screen character and her real personality. This contrast is used very creatively in the plot, and the effect is aided considerably by how well Cummings and Lloyd work together in all of their scenes. The actress's affectionate nickname of 'Trouble' for Lloyd's character works well, too. Their interplay is the best part of a good comedy that also has a lot of other things working for it.",
         "Came upon this movie which I had never heard of while channel surfing during an episode of insomnia. This was one of the most fun & funny movies I have ever seen! You will be constantly riveted as the scenes move fast and the comedy is clever and extremely well done! The cast is excellent and I found myself laughing out loud over and over again! Was disappointed when it was over as it went way too fast! Sort of like going on a great ride at an amusement park and wanting to go on it again! I would highly recommend this movie to anyone as it is refreshing to see such good acting and fun comedy! I can't wait to see it again!",
         "I've been working my way through the wonderful DVD box set of Harold Lloyd, and I have to say that his silents are superb and I love them to bits. Until the advent of DVD, the only sound Lloyd I'd seen was 'The Milky Way', which was surprisingly enjoyable. So I figured that Lloyd had made the silent-to-sound transition reasonably well, and was eager to see more of the sound features. Alas, 'Movie Crazy' is a particular disappointment, probably because it's been hyped as Lloyd's best sound film. Lloyd seems to fall into the same trap that Buster Keaton succumbed to - the lead character has become a dimwit. One of the greatest joys of the Lloyd silents is seeing his character think up some nimble bit of wit to get out of a jam - think hitching an ambulance ride to work in 'Safety Last' or rounding up a gang of crooks to come to prayers in 'For Heaven's Sake' - but this Harold, this audible Harold, is an unrelenting klutz. It's hardly plausible that he couldn't distinguish between Mary in her civilian clothes and in make-up on set; the kid must need glasses... oh. Maybe it's because the character is moving at the speed of sound, rather than having the slightly fantastic under-cranked zip of silence; maybe it's because this Harold is a stuttering, stumbling, unsure boob rather than the confident, intelligent boy of yesteryear; maybe it's just because Lloyd was running out of ideas; but this is far from his best sound film, let alone being his best film of all. This was the last film with his characteristic young-go-getter persona, although by this time all the go had already got up and gone, and Lloyd himself was a less than youthful 38. Things improved a bit once Lloyd started playing a different kind of role in a different kind of film, in 'Cat's Paw' and 'Milky Way' but it was too late for a full-scale revival of his stardom. The annoying thing about 'Movie Crazy' is that you can see how the gag sequences could have been shot in a silent film, and would have been much funnier if performed with a bit more pace and without the awkward dialogue. A prime example is the scene towards the start of the film where Harold first smashes up O'Brien's straw boater. It's just too slow and the dialogue is unnecessary. Ditto for the later scene of Harold destroying O'Brien's office - a scene which is very reminiscent of one in Keaton's 'The Cameraman' of 1928. Apparently the original US release of this film was only 84 mins. The restored DVD version is 98 mins, and I can't help thinking that knocking a quarter of an hour out of it could help a great deal. It may well be that the reason the film has received such exalted praise in the past is because people have hitherto only seen the shorter edit. Lloyd was noted for previewing his films to bring them to perfection, and if he decreed that it should have been trimmed to 84 mins in 1932, it should have been kept that way on DVD. I'd be keen to see the short version and give 'Movie Crazy' a second chance. This long version wears out its welcome far too quickly, and I can't believe that this cut is what Harold Lloyd wanted audiences to see.",
         "MOVIE CRAZY certainly is one of the best Lloyd's Talkies. From the opening gag on there are so many enjoyable moments only Lloyd knows how to provide. The screen test scenes are among the highlights. As always gags are very tightly built. Lloyd also handles the dialogue and timing pretty well; but Constance Cummings portrays a dominating, intelligent female lead that is rare in Lloyd's movies. Only complaint: if the high rise sequence in Feet First is recycled from Safety Last, the fighting-in-the-water scene here certainly looks familiar as well-from The Kid Brother. It's also a bit long and excessive.",
         "The story of a disaster-prone movie buff who crashes Hollywood and becomes a star in spite of himself might have been lifted from erstwhile silent clown Harold Lloyd's own rags-to-riches autobiography. The film is widely considered Lloyd's best 'talkie', but it can't hope to match his silent classics, and doesn't try to approach the dizzy verbal pace of screwball comedy just then coming into vogue. Ironically, Lloyd himself is the weak link in the film; his (considerable) pantomime talents and optimistic go-getter personality were better suited to Jazz Age silent comedy, and didn't translate well to the Great Depression. Only the somewhat bizarre love interest, between the typically shy Harold and a temperamental actress (who doesn't tell him she's also the Spanish bombshell he's infatuated with) seems more in step with sophisticated sound-era comedy conventions. Technophiles take note: the climactic backstage battle, in which Harold finally proves himself, was clearly shot silent, but the clumsy telegraphing of each gag well in advance kills the tempo.",
         "With my seeing MOVIE CRAZY I have finally seen the last of Harold Lloyd's sound films. My opinion of them remains the same - the best of them are not as good as his silent films. But on their own they are entertaining enough. MOVIE CRAZY was a vast improvement over FEET FIRST. Done about a year after, Lloyd realized now that he had to control the use of sound when certain strenuous sequences (i.e., climbing the side of a skyscraper, or here fighting in a flooding movie set). The visual got reemphasized, and the results were better. Lloyd comes to Hollywood having won a screen test. This is an old plot ploy where the hero/heroine thinks fame and fortune beckons, but that the reality is far less wonderful as there are thousands trying to break into films with them. Oddly Lloyd's two leading silent rivals (Chapln and Keaton) never did a spoof of the film industry in a feature (Chaplin did a Mutual short film in 1917 called BEHIND THE SCREEN that did spoof the budding young industry). Keaton's SHERLOCK JR. spoofs the magic of film making, but not the production of film itself. Harry Langdon did appear as himself in the film ELLA CINDERS where the heroine was trying to break into film. The film follows two plots, of Lloyd getting his film test (which is typically a disaster, though the film crew maliciously tells him it was a success), and his meeting movie star Constance Cumming, which leads to a romantic involvement with her (and the growing jealousy of her co-star, Kenneth Thompson). The best portion of the film is the dinner party and the fight. Lloyd believes he was invited to a party with the Hollywood elite, and ends on the dance floor with the Louisa Closser Hale (the wife of Robert McWade, the studio head). He has accidentally changed his tales with a magician. The result is an onslaught of little animals (unfortunately including mice) that wreck the dinner dance. A highpoint: a drunk waiting his meal is surprised to find it being nibbled on by a rabbit! The finale is the fight between Lloyd and Thompson. Thompson is an extreme egomaniac who would kill Cummings before losing her (he thinks he is her man). He helps humiliate Lloyd earlier, and when he finds Lloyd accidentally on an empty movie set beats him up. But Lloyd later thinks he sees Thompson threatening Cummings and the real fight begins. It is actually on the set of a film where a ship is flooding, but Lloyd does not notice this (as he is concentrating on Thompson). There was a comment on another review of the film on this thread that it was reminiscent of the concluding fight in a flooded ship of Lloyd and Constantine Romanoff in THE KID BROTHER. That's true, but it also reminds one a bit (given how the water just gushes onto the set) of one of the last major silent spectacular films NOAH'S ARK. That film was famous for the massive flood on the set - supposedly so intensely flooded that some people were actually drowned in it. The film does end well, with Harold leaving with girl and contract, and accidentally pulling one last victory over the director of his movie test (Spencer Charters), with the director's own help."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Harold Lloyd Corporation, The"],
      "summaries": ["Harold Hall, an accident prone young man with little or no acting ability, desperately wants to be in pictures. After a mix-up with his application photograph, he gets an offer to have a screen-test, and goes off to Hollywood. At the studio, he does everything wrong and causes all sorts of trouble. But he catches the fancy of a beautiful actress, and eventually the studio owner recognizes him as a comic genius."],
      "budget": 675000
   },
   "movielensId": 76720,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-09-23",
      "dvdReleaseDate": "2005-11-15",
      "directors": [
         "Clyde Bruckman",
         "Harold Lloyd"
      ],
      "runtime": 81,
      "movieId": 76720,
      "title": "Movie Crazy",
      "mpaa": "",
      "actors": [
         "Harold Lloyd",
         "Constance Cummings",
         "Kenneth Thomson",
         "Louise Closser Hale",
         "Spencer Charters",
         "Robert McWade",
         "Eddie Fetherston",
         "Sydney Jarvis"
      ],
      "imdbMovieId": "0023241",
      "originalTitle": "Movie Crazy",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Harold Hall, a young man with little or no acting ability, desperately wants to be in the movies. After a mix-up with his application photograph, he gets an offer to have a screen-test, and goes off to Hollywood. At the studio, he does everything wrong and causes all sorts of trouble. But he catches the fancy of a beautiful actress, and eventually the studio owner recognizes him as a comic genius.",
      "tmdbMovieId": 53522,
      "avgRating": 3.28571,
      "releaseYear": "1932",
      "numRatings": 7,
      "posterPath": "/2uKvvKPsnOBp9rs2b2v7FZz6tms.jpg"
   }
}