{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "cinematographer",
         "id": 4606
      }],
      "imdb_id": "tt0126627",
      "video": false,
      "title": "Who the Hell Is Juliette?",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 0,
               "credit_id": "59f0b41d9251416aab017db8",
               "name": "Yuliet Ortega",
               "profile_path": null,
               "id": 1911987,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "59f0b4259251416ac1018a47",
               "name": "Fabiola Quiroz",
               "profile_path": null,
               "id": 1911988,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59f0b42e9251416aaf0186bf",
               "name": "Jorge Quiroz",
               "profile_path": null,
               "id": 1911989,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59f0b439c3a368068201832d",
               "name": "Victor Ortega",
               "profile_path": null,
               "id": 1911990,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "59f0b44792514148be00dd8b",
               "name": "Michele Ortega",
               "profile_path": null,
               "id": 1911991,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Herself",
               "gender": 1,
               "credit_id": "59f0b4509251416aa30186a6",
               "name": "Salma Hayek",
               "profile_path": "/u5mg73xKVqm8oT93HoMmsgQHyoK.jpg",
               "id": 3136,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59f0b45f9251416aa30186bb",
               "name": "Benny Ibarra",
               "profile_path": "/huaGGEgrpRtzBCp1Fh69w6Ggt3s.jpg",
               "id": 940964,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59f0b46ac3a368068201837f",
               "name": "Francesco Clemente",
               "profile_path": "/fSWJFldTkMM3e8jkjN6FxsLSHUS.jpg",
               "id": 937042,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59f0b4769251416ad00193ce",
               "name": "Daniel Giménez Cacho",
               "profile_path": "/vIelVvfHTvmnwTIpOMzVTLCORma.jpg",
               "id": 1603,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Herself",
               "gender": 0,
               "credit_id": "59f0b489c3a36806ae018444",
               "name": "Oneida Ramírez",
               "profile_path": null,
               "id": 1911992,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4abbc3a368484e164069",
               "name": "Carlos Marcovich",
               "profile_path": null,
               "id": 998745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59f0b3f6c3a368064e0192c2",
               "name": "Carlos Cuarón",
               "profile_path": "/nq08PLLtxg1qG1cSFYfeCUXxjiK.jpg",
               "id": 12529,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59f0b400c3a3682db5011dc9",
               "name": "Carlos Marcovich",
               "profile_path": null,
               "id": 998745,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.295435,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 125103,
      "vote_count": 2,
      "budget": 0,
      "overview": "Cinematographer Carlos Macovich met Yuliet Ortega, a young \"jinetera\" (prostitute) from Havana, when he shot a video in Cuba, starring model Fabiola Quiroz. When he realized that the two women had not seen their respective fathers for many years, he made this documentary, which is also a reflection on the process of filmmaking.",
      "similar": [
         110354,
         8329,
         988,
         11167,
         1888,
         137196,
         397406,
         450088,
         16548,
         421123,
         4250,
         448195,
         266584
      ],
      "original_title": "¿Quién diablos es Juliette?",
      "runtime": 91,
      "poster_path": "/fFIvEbrDQ2bhGXHUWTfIO6mRamf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Génesis",
            "id": 96584,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alameda Films",
            "id": 300,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Instituto Mexicano de Cinematografía (IMCINE)",
            "id": 8861,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Estudios Churubusco Azteca S.A.",
            "id": 11917,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hubert Bals Fund",
            "id": 13413,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Resonancia",
            "id": 76675,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Betaimagen Digital",
            "id": 96581,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cuatro y Medio",
            "id": 96582,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "December Error",
            "id": 96583,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-05",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carlos Marcovich"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Carlos Cuarón",
         "Carlos Marcovich"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0126627/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyMjM2NTM4MV5BMl5BanBnXkFtZTcwNjYxMTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Yuliet Ortega, Fabiola Quiroz, Jorge Quiroz | See full cast and crew »"],
      "reviews": [
         "I was introduced to this film by a friend of mine. What drew me to the story, more than anything, was the theme of fatherless young women. I, too, was a fatherless young woman up until last November when I finally met my biological father--a physics professor from Venezuela. Fabiola, the beautiful Mexican model, and Yuliet, the beautiful, sassy and broken sixteen year old prostitute from Cuba are amazing to watch. Both young women grew up without knowing their biological fathers and carry emotional baggage and pain locked up in their hearts. Although, the subject matter of child prostitution, despair and intense identity crisis seem heavy, the film is funny and uplifting. It also is emotionally rich and may very well make you cry. I found myself wishing the best for both young women. Their beauty and strength of character really struck a chord in my heart. Thank you to the director and the young women who brought so much to this story.",
         "This is a wonderful, highly original documentary, or is it? I'm not sure whats real or if some parts have been staged, but they depict the lives, dreams and problems of a beautiful Mexican model who is in Cuba shooting a music video and a young local girl who is cast as her sister. The film then shifts focus on the girl and what a girl she is! She's about 13 and can be very innocent and girlish in some scenes, and intelligent beyond her years in other as she speaks her mind in the wonderful Cuban-style gift of gab. Through her eyes we see the poverty that most Cubans endure and learn of the exploitation of children by idiotic foreigners who treat Cuban vacations like a sexual free for all. The girl is one of most powerful protaganist I've seen in a film and one can only hope that she achieves her dreams like those people in films like Hoop Dreams. What's interesting about the film is the almost surreal tone to the film, using visual gags and free association of images which I found original and funny. Also, the filmmakers made a choice which is one that very few documentary filmmakers make, and that is that they decided to tear down one of the walls, and actually participate in this girls life and try to help her. This if very different from the other films which at times feels like we're being voyeurs on other peoples misery.",
         "An appropriate festival film that tackled the senses with its incorporated style of documentary, feature film and music clip. The story of a sixteen year old Cuban girl is told through some stunning photography, flashy editing and a MTV style of camera work, (really, Godard was doing this with BREATHLESS in 1959). The life of Juliette, (or is it Yuliette?), crosses paths with a model. They star in a video clip together and the story spreads from there as they both dwell on their lives and the whereabouts of their fathers. I realised midway through that I was grinning at the cheekiness the director, Carlos Marcovich, was up to with a story well told but possibly too long. And from where I was sitting there was a fair few people heading for the exit. They didn't seem to have the patience for the cheeky Juliette, or for that matter, the style of the direction.",
         "A magnificent look at Cuba from an unique point of view. The photography is superb, the direction as well. Plus, this woman's beauty is as powerful as her story. A must for all movie lovers interested in refreshing their senses.",
         "WHO THE HELL IS JULIETTE? is a flimsy premise for a film, however it certainly demonstrates how an astute director can present a non-linear story with a maximum of artistic beauty and emotional warmth. Carlos Marcovich has created a most unusual quasi-documentary about the making of one of his music videos in Cuban during the early 1990's. To ramp up the sex appeal for this nondescript power ballad, he included sultry fashion model, Fabiola Quiroz. And, while in the process of filming, they met a quirky gamine by the name of Yuliet Ortega who is every bit as sexy. WHO THE HELL IS JULIETTE? meanders through the histories and back stories of the principle characters, and haphazardly reveals their personalities. And, also the movie examines the lives of people who just happen to wander by as the film is being shot. Much of the movie is gorgeously photographed on location in Havana, and the sun, sky, sex, and sea blend to create a heady concoction more potent than a very strong Cuba Libre. Yuliet is a real life character like nothing that has been seen on film. Probably she is a prostitute, but has such a bright and irreverent personality, that is is nearly impossible not to fall for her charms. She is equal parts smoldering sex siren, and headstrong and intransigent adolescent, and although she lives a very complicated life in an infamous Cuban barrio, she seems to give as good as she gets. WHO THE HELL IS JULIETTE? probably will offend as many viewers as it captivates, but I found the film a refreshing and spirited look at very low budget, almost tacky, tropical hedonism.",
         "This doc won a lot of awards, largely, I think, because it's 'different,' in that it doesn't follow the usual narrative arc of documentary film-making. Its greatest achievement, in my mind, is that it doesn't rely on the usual rogue's gallery of talking heads that consume three-quarters of most documentaries. Depending on your mood, 'Who the Hell, etc.' can be engaging and even dazzling. Some of the cinematography, particularly around Havana's iconic Malecon seawall, is spectacular. When I discovered that Mexican director Carlos Marcovich is a music video specialist, why was I not surprised? The film is loaded with signature cinematography that appeals to the MTV mobs: panorama shots, razzle-dazzle hand-held work, fast cuts and clips, alternating black&white/colour, faces that suddenly appear and speak, five different locations (we're not sure at one point if we're in Mexico City or Havana), and a 'story line' that is often confusing. Juliette is, in 1995, a 16-year-old Havana prostitute who is a study in contrasts. Her mother died violently when she was two years old, and her father left for the U.S. a year earlier. She is a child of the streets who can be be endearingly playful yet often irritating; she mixes delightful youthfulness with a maturity beyond her years. Toward the end of the film, she finally goes to Mexico City to visit her father Victor, whom she has not seen since she was a year old. Needless to say, it's an awkward reunion. This can be interesting film, particularly when the often-impish Juliette tries to explain her philosophy of being. In the end, we can answer the question 'Who is Juliette?' by saying, 'We're not really sure because she doesn't know who she is herself, but she's trying'. A huge let-down on the DVD extras is a 2006 update on Juliette, replete with footage of an ailing Fidel Castro. But it's entirely in Spanish, with no subtitles, and my rudimentary knowledge of the language left me befuddled. It was a huge -- and insulting -- mistake by the distributors, who had no trouble providing full subtitles for the film itself. This often happens with extras on DVDs -- crucial subtitles are missing. It's inexcusable.",
         "I just saw it and loved it. In addition to what is posted above, it is funny! I tried to Google what had become of Yuliet Ortega, even the 2007 DVD release left it a mystery. I had no luck finding her fate. I did find a 1999 article about her, then living in Mexico City and without any aspirations or evident employment. She did not take the modeling job mentioned in the film. She was just bumming around the DF and clubbing. In the \"Part 3\" addendum to the 2007 release, her grandmother refused to talk to the director. Yuliet appeared briefly but revealed nothing. Note: I had no problem with the subtitles (mentioned above) and there were subtitles to the \"Part 3\". My only complaint is that I couldn't get Spanish subtitles to work, only English.",
         "I liked this film, even though I was lost most of the times. The subtitles didn't help. White on white doesn't work! I feel I got robbed from a good chunk of the film. But I still liked it. The cinematography is beautiful, the people too. Yuliet and Fabiola have completely different background, but they do have one point in common: they're both fatherless. Along their quest to learn what happened to their father, we get to see what is their daily life. Some scenes are very emotional: the one where Fabiola is crying in silence for example. Seen at home, in Toronto, on March 14th, 2006. 74/100 (**½)",
         "This documentary provides an interesting insight into the lives of two very different young women. One (Yuliet) gives us a glimpse of the harsh reality of the life of a young prostitute growing up in Havana Cuba. The other (Fabiola) is an aspiring model on location while shooting a video. While very different, the two share many similarities in that both are young, beautiful, and have had difficult (at best) relationships with their fathers and men in general. These difficulties combined with the dysfunctional nature of their family lives (particularly Yuliet) results in a documentary that delves into the neurosis, depression , and isolation that results from these problems. The movie makes a case for the statement: All men are self-centered, selfish, uncaring jackasses.",
         "This is one of those films that makes you feel that the battle of creativity is not lost, and that Hollywood will not reign if there are filmmakers as Carlos Marcovich. This film is unique, is original, is fresh, is sincere."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Alameda Films",
         "Betaimagen Digital",
         "Cuatro y Medio"
      ],
      "summaries": ["Cinematographer Carlos Macovich met Yuliet Ortega, a young \"jinetera\" (prostitute) from Havana, when he shot a video in Cuba, starring model Fabiola Quiroz. When he realized that the two women had not seen their respective fathers for many years, he made this documentary, which is also a reflection on the process of filmmaking."],
      "budget": 0
   },
   "movielensId": 7699,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Español"
      ],
      "releaseDate": "1997-09-05",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Carlos Marcovich"],
      "runtime": 91,
      "movieId": 7699,
      "title": "Who the Hell Is Juliette?",
      "mpaa": null,
      "actors": [
         "Yuliet Ortega",
         "Fabiola Quiroz",
         "Jorge Quiroz",
         "Victor Ortega",
         "Michele Ortega",
         "Salma Hayek",
         "Benny Ibarra",
         "Francesco Clemente",
         "Daniel Giménez Cacho",
         "Oneida Ramírez"
      ],
      "imdbMovieId": "0126627",
      "originalTitle": "¿Quién diablos es Juliette?",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Cinematographer Carlos Macovich met Yuliet Ortega, a young \"jinetera\" (prostitute) from Havana, when he shot a video in Cuba, starring model Fabiola Quiroz. When he realized that the two women had not seen their respective fathers for many years, he made this documentary, which is also a reflection on the process of filmmaking.",
      "tmdbMovieId": 125103,
      "avgRating": 3.11765,
      "releaseYear": "1997",
      "numRatings": 17,
      "posterPath": "/fFIvEbrDQ2bhGXHUWTfIO6mRamf.jpg"
   }
}