{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mystery",
            "id": 10092
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "marx brothers",
            "id": 190797
         }
      ],
      "imdb_id": "tt0020640",
      "video": false,
      "title": "Animal Crackers",
      "recommendations": [
         13912,
         22553,
         13911,
         20625,
         26182,
         11939,
         26940,
         22575,
         3063,
         15938,
         32044,
         37719,
         77621,
         30278,
         56508,
         45219,
         43124,
         29486,
         51364,
         31409
      ],
      "backdrop_path": "/7rM8bsQTO9Y1WnhyFD3GKsq3d1I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Captain Jeffrey T. Spaulding",
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f5e3",
               "name": "Groucho Marx",
               "profile_path": "/8caITnv5OgMmsQnXIjt9t2uOjqB.jpg",
               "id": 10798,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Professor",
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f5e7",
               "name": "Harpo Marx",
               "profile_path": "/bPBQ1OO6LIuCyt1LNIjyqFJy4wP.jpg",
               "id": 10800,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Signor Emanuel Ravelli",
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f5eb",
               "name": "Chico Marx",
               "profile_path": "/gZXatkAWwGwZjbzyUqEf0LAcT1C.jpg",
               "id": 10799,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Horatio Jamison",
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f5ef",
               "name": "Zeppo Marx",
               "profile_path": "/6H3bwWg4Vly9vQ1ocgaIjqF2lj4.jpg",
               "id": 30014,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Arabella Rittenhouse",
               "gender": 1,
               "credit_id": "52fe45b29251416c7505f609",
               "name": "Lillian Roth",
               "profile_path": "/BfKyqtPc6YB1FHzBix2PJUChgA.jpg",
               "id": 136920,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Mrs. Rittenhouse",
               "gender": 1,
               "credit_id": "52fe45b29251416c7505f5f3",
               "name": "Margaret Dumont",
               "profile_path": "/2IkrEQUFSdymGCzLcrvxpBbZWST.jpg",
               "id": 10804,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Roscoe Chandler",
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f60d",
               "name": "Louis Sorin",
               "profile_path": null,
               "id": 229896,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "John Parker",
               "gender": 0,
               "credit_id": "5671bcbfc3a36836b4017f87",
               "name": "Hal Thompson",
               "profile_path": null,
               "id": 285210,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Mrs. Whitehead",
               "gender": 0,
               "credit_id": "5671bcc8c3a36834c1015c8c",
               "name": "Margaret Irving",
               "profile_path": "/snrOgNbyPplx1zY31dYD5j0vu0r.jpg",
               "id": 99458,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Grace Carpenter",
               "gender": 0,
               "credit_id": "5671bcd392514169e2016642",
               "name": "Kathryn Reece",
               "profile_path": null,
               "id": 1549754,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Hives",
               "gender": 2,
               "credit_id": "5671bcddc3a368535a0188f1",
               "name": "Robert Greig",
               "profile_path": "/ze6PfVLC0AaaoKkwtrJtOLuZkWa.jpg",
               "id": 30262,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Hennessey",
               "gender": 0,
               "credit_id": "5671bce7c3a36836b4017f8c",
               "name": "Edward Metcalf",
               "profile_path": null,
               "id": 1549755,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Six Footmen",
               "gender": 0,
               "credit_id": "5671bcf3925141664f016203",
               "name": "The Music Masters",
               "profile_path": null,
               "id": 1549756,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "The Marx Brothers",
               "gender": 0,
               "credit_id": "5728a66cc3a3685c37002106",
               "name": "The Marx Brothers",
               "profile_path": "/ro1ewHweHewQlzMCWjhqbzeMqi5.jpg",
               "id": 1614687,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b29251416c7505f5f9",
               "name": "Victor Heerman",
               "profile_path": null,
               "id": 144063,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b29251416c7505f5ff",
               "name": "George S. Kaufman",
               "profile_path": null,
               "id": 144060,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b29251416c7505f605",
               "name": "Morrie Ryskind",
               "profile_path": null,
               "id": 10792,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b29251416c7505f613",
               "name": "Morrie Ryskind",
               "profile_path": null,
               "id": 10792,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5671bc75c3a36833b60153ac",
               "name": "Max Reese",
               "profile_path": null,
               "id": 1549753,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5671bc7fc3a368535a0188e6",
               "name": "George J. Folsey",
               "profile_path": null,
               "id": 12307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5671bc86c3a3680e73011e35",
               "name": "Ernst Fegté",
               "profile_path": null,
               "id": 127200,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5671bc8ec3a368535a0188e8",
               "name": "Ernest Zatorsky",
               "profile_path": null,
               "id": 1530911,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.428376,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13913,
      "vote_count": 55,
      "budget": 0,
      "overview": "The famous Captain Spaulding returns from Africa and attends a gala party where a valuable painting is stolen.",
      "similar": [
         8012,
         9798,
         261023,
         75780,
         107846,
         346364,
         392044,
         20126,
         4638,
         193893,
         64688,
         62206,
         49524,
         339846,
         19959,
         4982,
         2118,
         2252,
         1586,
         2832
      ],
      "original_title": "Animal Crackers",
      "runtime": 97,
      "poster_path": "/ijVMX1CvegukEIJxv0UxoOzhrG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1930-08-28",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "The maddest comics of them all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Victor Heerman"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "George S. Kaufman",
         "Morrie Ryskind"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0020640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTYxNjQ0NTE4MV5BMl5BanBnXkFtZTgwMTE5MTM4MTE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Groucho Marx, Harpo Marx, Chico Marx | See full cast and crew »"],
      "reviews": [
         "When \"Animal Crackers\" was re-released after decades in hiding (due to copyright problems), the ticket-buyer & ticket-holder lines at New York's Sutton Theatre stretched down 57th Street for every showing. I was dazzled when I first sat through this film-- it seemed as if there was a kind of magic in the theatre that night. I can remember having goosebumps when Lillian Roth sang \"Why Am I So Romantic?\". I was working as manager of the Paris Theatre on 58th Street when \"Animal Crackers\" opened at the Sutton, and because both houses were part of the Cinema-5 circuit, I was always able to get passes. -- In this case, because I had also worked as 'relief manager' at The Sutton on many occasions, I was well known to the staff and had entry to that theatre whenever I wanted. --During the 'opening' run of \"Animal Crackers,\" I often walked over to The Sutton when my day's shift was complete at The Paris. I can tell you that every screening of \"Animal Crackers\" that I attended was packed. And every time I was present for the film's end, I witnessed a standing ovation-- something that many film producers can only dream of. I often tried to imagine myself attending a 'live' performance of this show. --As many have mentioned here, \"Animal Crackers\" was a hit Broadway show, starring the Marx Brothers, long before it was filmed by Paramount. Rather than complaining that this film is \"stagey\", many who comment here would do well to remember that a film like this is as close to a Broadway show as millions of people will ever get. The annoying penchant some viewers have for wondering why the film version of a Broadway hit show (especially a musical-comedy) isn't more \"opened-up\" is both tiresome and moot. Also, the constant comparison of \"Animal Crackers\" to other Marx Brothers films (especially the later MGM films) is an 'apples-to-oranges' kind of thing. It would make far more sense to compare it to other early filmed-versions of it's Broadway contemporaries, such as \"Rio Rita\" or \"Flying High\" or \"Girl Crazy\".... Although the stage show of \"Animal Crackers\" was on Broadway long before I was born, (and the film's initial premier pre-dates me by almost as long), I am forever gratified to have been able to attend the 1974 \"re-opening\" of the film in New York, and to see, feel, and participate in, the audiences' jubilant reactions. I rated this film 10/10. It's a perfect comedy, with (theatre-goers will recognize this-) honest-to-goodness Broadway music-- and with Lillian Roth, too. \"Animal Crackers\" is a great show in every respect. Hungadunga!",
         "Animal Crackers is one of the best films ever done by the 4 Marx Brothers. For a start, the comedy completely works on screen, especially considering that the film was adapted from the musical stage play. And although Zeppo's comedy has always been underrated and underplayed in the five films that the 4 Marx Brothers did for Paramount Pictures, he proves in this film, as well as the four other movies he appeared with Groucho, Chico, and Harpo, that the 4 Marx Brothers made better films when the four of them worked together; as opposed to when it was just Groucho, Chico and Harpo. All the Marx Brothers films which included Zeppo were zanier films and, to me, the best of their work. Verbally, Groucho is at his razor-sharp best in Animal Crackers, with almost every one-liner dripping with comedic insults and sarcasm. Chico and Harpo perfectly add to the mayhem. The direction by Victor Heerman showed the type of skill needed to professionally control the 4 Marx Brothers to make Animal Crackers the tremendous success that it was. Though the Great Depression was taking hold on the American psyche in 1930, Animal Crackers was the perfect comedy which allowed ordinary Americans to enjoy the spoofing of America's 'Hoi Polloi'. Though the 4 Marx Brothers' succeeding films (Monkey Business, Horse Feathers, and Duck Soup) were even more of the Hollywood film-style comedy successes which crystalized their zaniness and on-screen craziness, one should not underestimate the cinematography of George Folsey, Sr., who made the film look like a movie written especially for the screen. The look of the film (specifically the sets) makes one feel like he or she wished they had been invited to Mrs. Rittenhouse's party in honor of Captain Spaulding. Lillian Roth never looked better, and the best song in the film is her musical number with Hal Thompson, \"Why Am I So Romantic?\" - which was the theme music for the entire movie. Animal Crackers is one of my favorite films that the 4 Marx Brothers did for Paramount Pictures - although all five films made at Paramount are absolute gems. I strongly suggest getting the Marx Brothers' Silver Screen Collection, which is now on DVD. They are a must for your film library!",
         "Judging by the script, you'd never believe that \"Animal Crackers\" is over seventy years old. Think of all the \"postmodern\" things that happen in this movie: Groucho directly addresses the audience to apologize for a bad joke; Harpo shoots a gun at a statue, only to see the statue come to life and return fire; and Margaret Dumont freezes in time while Groucho has a \"strange interlude\" and rambles to the audience about the perils of marriage and living with your folks! Of course, the absolutely ancient and decaying print will remind you that \"Animal Crackers\" is older than the hills, but otherwise, it's much fresher and weirder than the stuff that passes for comedy today. Like \"The Cocoanuts,\" this movie is based on a play, and as such it is considerably longer and stagier than most of the later Marx movies. The pace does drag a bit towards the end, especially since the plot disappears (along with Zeppo) for long segments at a time. But many of the individual segments are classic, including the often (and rightly) praised bridge game and Harpo's gag with the cutlery-filled sleeves. Even the music segments hold up well, particularly Chico's piano routine that gets savaged by Groucho. Interestingly, there is a prominent romantic subplot to this film, which puts paid to the fallacy that Marx Brothers movies didn't have romances until MGM got its hands on them. However, the romance isn't nearly as intrusive or annoying here as in their later vehicles, so there's still plenty of reason to be annoyed with good old MGM...",
         "Is it a surprise that \"Animal Crackers\" takes a simple plot and turns it on its ear in a matter of minutes as a launching pad for the insanity of the Marx Brothers? No, but it makes sense. The characters in \"Animal Crackers\" celebrate the return of world traveler Captain Spaulding (Groucho) while also dealing with the theft of a rare work of art at the home of the wealthy Mrs. Rittenhouse (Dumont), where the soiree takes place. But once the good captain arrives, along with Spaulding's stenographer Jamison (Zeppo), Signore Ravelli (Chico) and the Professor (Harpo), nothing sane or expected takes place afterwards. But really, what did you expect? Perfect foils are the likes of Dumont and art patron Mr. Chandler (Sorin), the latter of which is revealed to be Abie the Fish Peddler from Czechoslovakia by fellow Czech Chico. in fact, here's a FAVORITE LINE: Chandler - (to Chico) \"Hey! How did you get to be Italian?\" Chico - \"Never you a-mind; who's-a confession is-a this?\". What's not to love? Anyway, there's loads of quotable dialogue, sight gags galore, a great running gag with a picture of a horse and a finale that must be seen to be believed. Of course, this whole MOVIE must be seen to be believed! Ten stars and a pair of elephant pajamas for \"Animal Crackers\" - the perfect side dish for four hams. TIDBIT - The song \"Hooray for Captain Spaulding\" was later re-used by Groucho for his game show \"You Bet Your Life\". Can't say that I blame him.",
         "The first two surviving Marx Brothers films were based on their second and third major Broadway successes: THE COCONUTS and ANIMAL CRACKERS. As early movies they suffer from the rigidity of the early talkies. Papers used as props on the set had to be wet in order for the crackling of paper to be reduced as much as possible from being picked by the microphones. It is remarkable that the films survived to continue to bring pleasure to audiences. In the case of ANIMAL CRACKERS, for years it and the later A NIGHT IN CASABLANCA were tied up in copy-write problems that prevented them being released to the public. I did not see it until I went with my sister to see the film in 1974 in Manhattan. This film is the one that established Groucho Marx's theme song, \"Hooray For Captain Spaulding.\" Groucho's Jeffrey T. Spaulding has just returned from Africa, and has been invited to the Long Island estate of Mrs. Rittenhouse (Margaret Dumont). Her guests include the noted art collector and expert Roscoe W. Chandler (Louis Sorin). He's going to reveal a masterpiece of art that he has purchased. Mrs. Rittenhouse's \"friend\" and rival Mrs. Whitehead plans to steal the painting, and hide it to embarrass her hostess. Her daughter and her ex-butler Hives (Robert Greig) are in on this plot. Meanwhile Mrs. Rittenhouse's daughter Arabella (Lillian Roth) is trying to help her boyfriend John Parker (Hal Thompson), a struggling artist prove his abilities. Other guests include the musician, Signior Emmanuel Ravelli and the Professor (Chico and Harpo) and Spaulding's secretary Horation Jamison (Zeppo). There are many similarities between this musical's book and THE COCONUTS, such as both having detectives named Hennesey, and both naming Zeppo Jamison. The struggles of Roth standing by her struggling painter-boyfriend mirror the struggles of Mary Eaton supporting her struggling architect-boyfriend Oscar Shaw. But here Groucho is a visitor, not the hotel owner/manager. And here there is more use for Zeppo. In fact, except for the third film (MONKEY BUSINESS)and the fifth film (DUCK SOUP), Zeppo never had as much to do that was funny in any of the Marx Brothers movies than here. He has to take dictation from Groucho regarding the legal team of Hungerdunger, Hungerdunger, Hungerdunger, Hungerdunger, and McCormick (pronounced \"Hoongerdoonger\"). It is a classic Marx routine. There are some topical humor. Roscoe W. Chandler is a spoof on the noted millionaire and culture maven Otto Kahn, head of the Board of the Metropolitan Opera. Kahn was trying to find a location for the new opera house in the late 1920s, and we hear Chandler and Groucho discussing possibly putting it into Central Park. Kahn was from the old Wilhelmine Empire, and was an immigrant (though one who made good in banking). Chandler, in one stunning moment with Chico, turns out to be Abe Kabible, a fish peddler from Czechoslovakia (Chandler has to pay some blackmail to Chico and Harpo about this, but he does shoot back at Chico an inquiry of how long he's been an Italian!). Another topical jab is regarding Eugene O'Neill's STRANGE INTERLUDE, where O'Neill had characters speak their minds separately from the regular dialog with each other. In fact, Groucho even admits he is going into a strange interlude of his own. His comments are spoken in a clipped, sad voice, and include a final set of lines where he sounds portentous - talking about strange figures, weird figures. Then he starts giving stock quotations! The film is a little slow at spots, as was THE COCONUTS, but the brothers do well, as does Lillian Roth and Margaret Dumont. The film is very entertaining, and it is good that it is still around.",
         "One of the Marx Brothers' earliest films, \"Animal Crackers\" is not nearly as refined as some of their later comic masterpieces, but it is a lot of fun. Some of the sequences are just as good as anything in their greatest films. As in most of their movies, the actual plot is amusing but simple, and serves mostly as an excuse to tie together the various comic bits and songs. Compared with their later movies, this one seems much more stage-bound, and there is more screen time given to the other actors, slowing things down somewhat. But when Groucho, Harpo, Chico, and Zeppo get their chance, they usually deliver. Particularly funny in this one is a hilarious bridge game that matches Harpo and Chico against two society women. Zeppo gets a few good moments, too, as the secretary to \"Captain Spaulding\" (Groucho). And of course Captain Spaulding's theme song is always a favorite. Though the Marx Brothers would later make even better movies, \"Animal Crackers\" is great entertainment in its own right, and well worth watching.",
         "For many years, ANIMAL CRACKERS was a \"lost\" film. Paramount owned the audio, and Universal owned the Visual elements (It may of been vice-versa) During the re-birth of Marx Brother popularity, ANIMAL CRACKERS mad it's way back into theatres in the Fall of 1974. It was a thrill to see the movie in a theatre (the best place to see a classic comedy). The plot concerns a wild, out of control explorer's (Groucho Marx) visit to a Long Island estate. He comes across stuffy snobs and a questionable musician for hire (Chico Marx and his lunatic partner, Harpo.) Groucho's dialog is superb. His verbal assaults on stuffed shirts are priceless \"It's not safe to ask this man a simple question\" Groucho says to the audience when he talks to a pompous \"art critic\". Chico and Harpo provide the more manic visual antics, especially when they steal the birth mark of above mentioned art critic. Even straight man Zeppo gets to be funny and silly. The only real problem with the film is well voiced in critic's Richard Anobile's review \"This is a RECORDING of a stage play. The camera barely moves. it just sits there and records the Marx Brothers\" Still in all, see ANIMAL CRACKERS to enjoy the joy of Marx mayhem",
         "This is one of my favorite Marx Brothers movies. Just sit back and watch the mayhem come at you, and everyone else in their way. Filled with some of their reliable stock players and plots, there's nothing new about this at all- except for their astounding wit and polish and amazing routines. George Kaufman wrote the script, which is one of their strongest, and it's just sublime silliness from the first word. Watch it when you're sick, it'll lift up your spirits.",
         "Once again, this Marx Brothers film is different from most comedies in that is features a mile-a-minute gags, either verbal or sight, constant silliness and some music thrown in the mix. All of it runs the gamut from very clever to stupid. However, if it gets stupid hang around another minute or so and you'll find something to laugh at. One problem, especially with this film, is that some of the humor is dated and/or topical, meaning what was funny back then isn't necessarily now or the subject Groucho or Chico is talking about was big news back then but unknown now. Nonetheless, I still enjoyed this and found a lot of funny material. I enjoy the Marx Brothers clever stuff and their slapstick. I particularly appreciated Groucho apparently ad-libbing one scene. In a few others he acted like he was ad- libbing, turning his head and talking to the camera. You don't see much of that stuff, and it's funny. Two of the three songs were instrumentals, and they seemed to take away from the pace of the story. Groucho's song, \"Hooray For Captain Spaulding,\" is a classic. Some consider this to be the best Marx Brothers movie but I found several others I liked a lot more, such as \"Horse Feathers\" and \"Duck Soup,\" just to name two.",
         "\"Animal Crackers\" is a sure fire way to spend an entertaining hour and a half dazzled by zany quips and brilliant one liners. The film is an absolute showcase for the Marx Brothers talents, particularly Groucho's frenetic, non stop verbal barrage. His character, Captain Spaulding is a famed African explorer, though that distinction is entirely unnecessary. Any backdrop would have served for the socialite party hosted by Mrs. Rittenhouse (Margaret Dumont) for the unveiling of the famed Beaugarde painting at the center of the film's madness and controversy. The painting elicits a great response from it's new owner, Roscoe Chandler (Louis Sorin) upon it's first review - \"Now even the prince is well hung\". Pay attention during the card game between Spaulding, Signor Ravelli (Chico), The Professor (Harpo) and Mrs. Rittenhouse. In a rare display, in fact the only time I've seen it, Chico actually responds verbally to a remark from Dumont's character who says \"I'm not the dummy.\" Chico's Ravelli does a quick aside stating \"Well, you could be.\" The thought came to me as Groucho delivers his witticisms throughout the film - I wonder what it would be like if Groucho Marx, Jonathan Winters, Robin Williams and Jim Carrey were all put together in the same room. Think about that scenario! Though only the second Marx Brothers film, \"Animal Crackers\" is a delight and a great forerunner to their other comedy gems. What more could one say, except that \"This would be a better world for children if parents had to eat the spinach.\""
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Captain Spaulding, the noted explorer, returns from Africa and attends a gala party held by Mrs. Rittenhouse. A painting displayed at that party is stolen, and the Marxes help recover it. Well, maybe 'help' isn't quite the word I was looking for--this is the Marx Brothers, after all...",
         "Mayhem and zaniness ensue when a valuable painting goes missing during a party in honor of famed African explorer Captain Spaulding."
      ],
      "budget": 0
   },
   "movielensId": 7706,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-08-28",
      "dvdReleaseDate": "1998-04-08",
      "directors": ["Victor Heerman"],
      "runtime": 97,
      "movieId": 7706,
      "title": "Animal Crackers",
      "mpaa": "",
      "actors": [
         "Groucho Marx",
         "Harpo Marx",
         "Chico Marx",
         "Zeppo Marx",
         "Lillian Roth",
         "Margaret Dumont",
         "Louis Sorin",
         "Hal Thompson",
         "Margaret Irving",
         "Kathryn Reece",
         "Robert Greig",
         "Edward Metcalf",
         "The Music Masters",
         "The Marx Brothers"
      ],
      "imdbMovieId": "0020640",
      "originalTitle": "Animal Crackers",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["0ykYqkECz9E"],
      "plotSummary": "The famous Captain Spaulding returns from Africa and attends a gala party where a valuable painting is stolen.",
      "tmdbMovieId": 13913,
      "avgRating": 3.93732,
      "releaseYear": "1930",
      "numRatings": 1037,
      "posterPath": "/ijVMX1CvegukEIJxv0UxoOzhrG.jpg"
   }
}