{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0114122",
      "video": false,
      "title": "Pharaoh's  Army",
      "recommendations": [],
      "backdrop_path": "/v4dnzmIOUlEquSbM0n1aHUAC26K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Captain John Hull Abston",
               "gender": 2,
               "credit_id": "52fe49b89251416c910b69f9",
               "name": "Chris Cooper",
               "profile_path": "/ytZY7YofdiAZyiyr4NyiB77lwwQ.jpg",
               "id": 2955,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sarah Anders",
               "gender": 1,
               "credit_id": "52fe49b89251416c910b69fd",
               "name": "Patricia Clarkson",
               "profile_path": "/10ZSyaUqzUlKTd60HmeiGhlytZG.jpg",
               "id": 1276,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Preacher",
               "gender": 2,
               "credit_id": "52fe49b89251416c910b6a01",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Chicago",
               "gender": 2,
               "credit_id": "52fe49b89251416c910b6a05",
               "name": "Robert Joy",
               "profile_path": "/xh5eb9p379k9w3NOGRjEyAw2yrP.jpg",
               "id": 19976,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rodie",
               "gender": 2,
               "credit_id": "56504b679251414b01006d43",
               "name": "Richard Tyson",
               "profile_path": "/fiGyqTvujEfbeN4j7qWjsSYujlr.jpg",
               "id": 14700,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49b89251416c910b69ef",
               "name": "Robby Henson",
               "profile_path": null,
               "id": 21415,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49b89251416c910b69f5",
               "name": "Robby Henson",
               "profile_path": null,
               "id": 21415,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.095397,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87190,
      "vote_count": 5,
      "budget": 50,
      "overview": "Union soldiers in search of food descend on the farm of a Confederate family and decide to stay until one in their ranks' wounds have healed. While the war weary Union captain (Chris Cooper) falls for the mother of the family (Patricia Clarkson) - whose husband is off fighting for the rebels - her son plots revenge on the dirty, double-dealing Yankees. Co-stars Kris Kristofferson.",
      "similar": [],
      "original_title": "Pharaoh's  Army",
      "runtime": 90,
      "poster_path": "/g0OKf2qetnEJ9vuvLLHnD6skfbn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cicada Films",
            "id": 21072,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Independent Television Service",
            "id": 1152,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kentucky Educational Television",
            "id": 21073,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "NEA",
            "id": 21074,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sinkhole Productions Inc.",
            "id": 21075,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TMF Metro",
            "id": 21076,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robby Henson"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Robby Henson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114122/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0NTc2ODYwOV5BMl5BanBnXkFtZTcwMDU5MzYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Cooper, Patricia Clarkson, Kris Kristofferson | See full cast and crew »"],
      "reviews": [
         "It is characteristic that this film is not better known. It obviously lacks most elements that a successful theater film needs: heroes, villains, conflict and resolution, romantic love interest.. Everything is topsy-turvy here, nothing works out as it should, everyone is clumsy, sad, angry, hurt and hungry and nobody has a solution for anything. In short: it is war and it is hell for everybody involved. People try to do best, but interests, allegiances and so called duty interfere. The picture transports us back in time to the Civil War with an intensity seldom seen in today's cinema. Straightforward honest images of an intense beauty. The actors are very well cast for the story and they make the characters come truly alive in front of our eyes. A silver dollar in a heap of nickels!",
         "This is one of my personal favorites, a rare little gem that seems to be undiscovered by the general population. Chris Cooper and Patricia Clarkson form the heart of the piece in what is a well-chosen cast. Few movies have ever captured the true hostilities that undergirded the Civil War, but this one seems to capture all the right tones and moods. If you're a fan of the book, Cold Mountain, try this movie out and see if you don't think it makes a good companion piece.",
         "\"Pharaoh's Army\" defies formula. Instead of selling out for cliches and big stars, it relies completely on the excellent acting from a strong cast, the strength of a well written script, and a fascinating and bitter story. The result is a raw and realistic film that moves along fast, with a heavy emotional current. One of the best I've ever seen about the Civil War, and I think it can owe that to the pleasure of being an independent film (if you like this film, try to see the similarly brilliant indie Civil War film \"Wicked Spring\" as well). \"Pharaoh\" simply tells the true story of a small expedition/forage team of Union men who ride into a Confederate farm to take provisions, but end up stuck there because of an accident of one of the men. Tensions broil and relationships are made and broken. Nothing happens the way Hollywood would write it; this movie comes from the mind of someone who actually cares about quality film and the telling of history. Superb dialogue and plot exposition move along a film that looks highly professional, but often doesn't feel like you're watching a movie, more along the lines of hearing a story. The film boasts an incredible performance from Chris Cooper who shows an amazing versatility in the exploration of his role. He transforms, but is always at the height of believability and is easy to emotionally relate to. Patricia Clarkson is equally as stellar and realistic in a role that many actresses would crumble in. She shares an interesting chemistry with Cooper's character and where she's the more severe of the characters, is still as easy to identify with. The rest of the cast is quite capable, and fill their roles in well. The art design and the set are wonderful, and personally I love the cinematography. It all has the feel of a Civil War period photograph with the camera presenting strong contrasting colors and shadows and a tin-like metalic tint, but always keeping the naturalistic look of the rustic setting. They seem to have used natural lighting, but whatever they used works beautifully. Everything looks like it belongs where it is, it feels period, something I find rare in American period films. The actors act 19th century, not like 20th century people in old clothes. Above all, this film is very personal. I think that as an indie it can afford it. The film is nearly flawless with an outstanding script that effortlessly creates and explores the relationships and personalities of these characters and lets them grow in a situation, as bad as it is. It doesn't fail in getting it's point across, and it gets it's point across without the usual and overused techniques that are used in all war films these days. It's brave. It relies on it's characters, a fantastic script, human emotion, and in the cold hard fact that the Civil War wasn't all CGI, big stars, and hoop skirts.",
         "Pharoah's Army is a rare, realistic view of the American Civil War, which, like all wars, mostly happened \"somewhere else\". While almost all war movies focus on that \"somewhere else\", the pinpoints of battle and battlefields, this one courageously covers the other ninety per cent of the war, in the hills and countryside far from sweeping drama. The director's gift for understatement and getting complex emotions across without phoney speeches give it almost a documentary feel, as does his willingness to let the late autumn Appalachians have their own beauty, without staging or drawing attention to it. His most courageous choice was making the characters normal people: neither evil nor noble, just people, in a hopeless, hurtful time. The actors are incredibly powerful, all of them, down to the dog and the mule. People who know little about the American Civil War, and the scar it left on American society -- still deep in the national psyche, even today -- may find the movie thin; the director assumes viewers are well-informed on these points, and doesn't do any \"teaching\" on them. But Pharoah's Army is one of the best of its genre, and a badly needed perspective that few other directors have explored. It certainly commanded my attention, from start to finish.",
         "Thought provoking, humbling depiction of the human tragedies of war. A small, but altruistic view of one family's interactions with the enemy during the civil war in Kentucky. This movie lessens the \"glamor\" of war; showing it's effect on not only the soldier but the entire family unit. A lot of today's movies show war as an opportunity to highlight the \"hero's\" and other glamorous features of war, but very little attempts to show the true effect war actually takes on a community. This movie attempts this through a retelling of a person's memory of those days. This movie is stated to be loose translation of an actual events, when in reality, this movie is probably a factual reality of hundreds, perhaps thousands of \"actual events\" during the civil war. I highly recommend those interested in our civil war to watch this movie.",
         "If you're even mildly interested in the War between the States, this film is worth watching. It is great historical story telling. No flashing sabres, no cavalry charges, no carnage -- just the story of a sorry group of Union soldiers stumbling into the farm of a Confederate woman and her son and taking as much as their captain's conscience allows. This quantity moves up and down as events unfold affecting his sense of humanity in conflict with his sense of duty to his men and his cause. Ultimately, he reaches a compromise that any of us would be hard put to top. I appreciate the historical treatment of the war in Kentucky, a slave state that tried to stay neutral but eventually opted to remain in the Union under mysterious political circumstances involving the detention of certain legislators. Roughly half the soldiers from Kentucky fought for each side, but there's never been much treatment of what it was like to have lived there through those times. This film makes a great contribution simply in the \"look and feel\" of the time and place.",
         "Let's face it, there aren't that many great Civil War films out there. \"Glory,\" \"The Horse Soldiers\" and \"Ride With the Devil\" are the only ones I recall off hand; \"The Blue and the Gray\" and \"Cold Mountain\" also have numerous good points. \"Gettysburg,\" on the other hand, is a bloated, melodramatic, artificial bore (made exclusively for Civil War buffs, whatever that is); I've never seen its prequel. The peculiarly-titled \"Pharaoh's Army\" is a 1995 indie film about a real-life incident that took place in Kentucky during the Civil War. Because Kentucky was a border state the allegiances of its people were split between North & South. I'm sure it was hard to be neutral. THE PLOT: A Union captain (Chris Cooper) and four soldiers invade a young widow's farm in the Kentucky wilderness (the widow is played by Patricia Clarkson); since her husband fought and died for the Confederacy they supposedly have the right to her livestock, even though she argues that she and her boy will likely starve come winter. One of the soldiers is accidentally wounded and they are forced to stay for a few days. The captain attempts to be a gentleman and even helps out on the small farm, but he fails to win any kind of favor with the widow, who rightly views them as nothing more than invading enemies. Events turn deadly and the captain, even though a good-hearted gentleman, is forced into an intense position. Although the story is based on real events and takes place during the Civil War, this is not an epic war film with big battle scenes, strategizing generals, etc. The entire film takes place in and around the widow's small farm and focuses solely on the events that take place there. This limited scope may turn some viewers off. Even though this is a small indie film, the score, cast, acting and writing are all top notch. The story is fairly slow-paced and there are no cataclysmic events to arouse those with ADD. The first time I saw it, I thought it was good, but not great. I viewed it again about a year later (earlier this summer) and liked it even more. Lately images of this picture have popped into my mind and something occurred to me: The way the film plays out and is presented to the viewer is REAL LIFE. What I mean is that it's almost as if someone went back in time and actually filmed the actual events. This is a good thing as far as I'm concerned. I tire of all the silly hollywoodisms common in modern American cinema -- supposedly humorous one-liners, unrealistic action scenes, excessive explosions, melodrama, unconvincing dialogue, etc. The ending is powerful as the captain, a good man, is thrust into a position of cold-blooded murder in the name of war. It's intense, and so REAL. The insanity of war can easily turn the best of us into heartless killers. The cover of the DVD prominently features Kris Kristofferson, but his role as a pro-South Kentucky preacher is relatively minor. FYI: \"Pharaoh's Army\" was actually filmed in Kentucky, no doubt near where the real events took place. BOTTOM LINE: This is a small film about a minor peripheral incident during the Civil War. It's not a big league Hollywood picture with the corresponding melodramatic, pretentiousness like, say, \"Saving Private Ryan\" (although that film has some undeniable positive qualities, like the D-Day invasion, there are way too many forced, artificial moments and dialogue -- remember the moronic dog tag scene?). \"Pharaoh's Army\" is generally a quiet film and likely won't blow you away or anything. What it has in its favor, however, is unpretentious REALISM. It's refreshing; and it will stay with you. GRADE: B+",
         "This film was my first acquaintance with the talents of Chris Cooper. I was deeply impressed with the character he played. I knew when I saw the film that more great things were to come from this gifted actor. He plays a Union Captain who, along with a couple of enlisted men, are foraging in Eastern Kentucky. They happen upon the farm of a \"Sesech\" woman whose husband has chosen to go off to the Confederacy. The portrayal of Eastern Kentucky, and its seriously divided sentiments during the War, is so very accurate. If you are looking for a war film with a lot of blood and guts, this would not be it. If you are looking for a drama that explores the psychology of peoples at war, actually and philosophically, then this is the best study of how divided loyalties affected the interaction of peoples in the border states during America's Civil War.",
         "Hidden gem here. This is a war film, and it gives us the best of all worlds in film making. However, I don't want to build it up too much. It's best to be somewhat pleasantly surprised, like I was. It gives us the old fashioned war film, with a focus on an isolated group of soldiers. Here, it is the Civil War, and the soldiers are on a patrol to confiscate food for their army from Confederate sympathizers. My initial feeling is that the characters are too three dimensional for most of IMDb's bubble boy posters. For the rest of the world, I dare say this story would envelop them in a world they could believe existed. The cinematography is outstanding. The scenery is powerful. Everything about this film is amazing. I'd nominate everyone from cue card holder up for an Academy Award. I'll echo what others have said. The characters look true to the times. Not like 20th or 21st century actors in uniform between video games. This is the real deal. I also like the way the accents were moderate, more Kentucky than the recent push to turn Kentucky into Mississippi. This was the \"neutral\" state of the Civil War. Historically, and geographically, it has never been the South, but more of the meeting of North and South. I won't tell more of the plot, because I think you should take the ride. Trust these reviews. I don't think this film can possibly get a bad review, unless it's from a jealous competitor.",
         "No, it was not good. I like Chris Cooper very much, he is great in The Patriot, he can do a great job, but here the whole film is so plodding, so gooey and so slow that yawns creep in almost immediately. I understand the intent of the director, but he failed. The tedious, slow, ineptly weak drama drags almost seemingly endlessly for 90 minutes, and even some shooting at the end does not revive this tomb of nature. Bleak, vapid, bland and sepia-tinted tonality is miserable, the performance is at times basic of almost all other actors, and the whole thing is very very dull. I watched this film by force and self-discipline. It never helped, and even the very reality of the whole plot did not help to make this work a bit livelier. No, this one does not work, I am sorry, but this is my impression"
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Cicada Films",
         "Independent Television Service (ITVS)",
         "Kentucky Educational Television"
      ],
      "summaries": ["During the American Civil War, a Union Army captain leads his rag-tag cavalry troop up a misty creek to a remote farm to appropriate enemy (Confederate) livestock. The farm is worked by Sarah Anders, whose husband is away fighting for the Confederate Army. Far from the great armies and battlefields, a very private civil war erupts. The Captain and Sarah are pulled apart by the war's undertow into choices they can not fully control or understand. Each character in this drama must decide whether loyalty will be paid in blood. This story has a relevance to current partisan conflicts. Armies are not filled with murdering psychopaths. Good people can be driven to do bad things. The story chronicles the pathology of war, how escalating events can trigger unasked-for tragedy. Based on a true story about a southern child who shot and killed a union soldier during the Civil War."],
      "budget": 0
   },
   "movielensId": 777,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "2004-07-20",
      "directors": ["Robby Henson"],
      "runtime": 90,
      "movieId": 777,
      "title": "Pharaoh's  Army",
      "mpaa": "",
      "actors": [
         "Chris Cooper",
         "Patricia Clarkson",
         "Kris Kristofferson",
         "Robert Joy",
         "Richard Tyson"
      ],
      "imdbMovieId": "0114122",
      "originalTitle": "Pharaoh's  Army",
      "genres": [
         "Western",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Union soldiers in search of food descend on the farm of a Confederate family and decide to stay until one in their ranks' wounds have healed. While the war weary Union captain (Chris Cooper) falls for the mother of the family (Patricia Clarkson) - whose husband is off fighting for the rebels - her son plots revenge on the dirty, double-dealing Yankees. Co-stars Kris Kristofferson.",
      "tmdbMovieId": 87190,
      "avgRating": 2.90909,
      "releaseYear": "1995",
      "numRatings": 33,
      "posterPath": "/g0OKf2qetnEJ9vuvLLHnD6skfbn.jpg"
   }
}