{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "slang",
            "id": 398
         },
         {
            "name": "skyscraper",
            "id": 1418
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "theatre play",
            "id": 4326
         },
         {
            "name": "theatre group",
            "id": 4333
         },
         {
            "name": "theatre milieu",
            "id": 6034
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "suburb",
            "id": 14632
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "group of friends",
            "id": 155939
         }
      ],
      "imdb_id": "tt0338977",
      "video": false,
      "title": "Games of Love and Chance",
      "recommendations": [
         78992,
         67381,
         259084,
         118895,
         91067,
         86282,
         104234,
         47507,
         72375,
         133246,
         64758,
         83994,
         12156,
         17376,
         66070,
         101183,
         40522,
         64559,
         134184,
         5168
      ],
      "backdrop_path": "/oJO7shVIYgmomsaD617ndNakh0A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Krimo",
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031e8f",
               "name": "Osman Elkharraz",
               "profile_path": null,
               "id": 17459,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe42fcc3a36847f8031e93",
               "name": "Sara Forestier",
               "profile_path": "/xtNEa5vbzZ8IWI5bTn5zlMy6Cz2.jpg",
               "id": 17074,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rachid",
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031e97",
               "name": "Rachid Hami",
               "profile_path": null,
               "id": 17460,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zina",
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031e9b",
               "name": "Hajar Hamlili",
               "profile_path": null,
               "id": 17461,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nanou",
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031e9f",
               "name": "Nanou Benhamou",
               "profile_path": null,
               "id": 17462,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "French Teacher",
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ea3",
               "name": "Carole Franck",
               "profile_path": "/1AgGjzMrBsSb5H4JKfPegeSRBJb.jpg",
               "id": 17463,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Krimo's Mother",
               "gender": 1,
               "credit_id": "52fe42fcc3a36847f8031ea7",
               "name": "Meriem Serbah",
               "profile_path": "/v64Cm9DKi1S9xQKsh3TqhUCe7c6.jpg",
               "id": 17464,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Frida",
               "gender": 1,
               "credit_id": "52fe42fcc3a36847f8031ee7",
               "name": "Sabrina Ouazani",
               "profile_path": "/l2GgPVTlyK1lF70y1hxmqD1D16g.jpg",
               "id": 17475,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42fcc3a36847f8031e8b",
               "name": "Abdellatif Kechiche",
               "profile_path": "/etKLLjgubxAyUDxVFghEmgEvDDg.jpg",
               "id": 17458,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ead",
               "name": "Jacques Ouaniche",
               "profile_path": "/xMRVqGFizhYvrSQPs8eF8L4JeFS.jpg",
               "id": 17465,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031eb3",
               "name": "Lubomir Bakchev",
               "profile_path": null,
               "id": 17466,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031eb9",
               "name": "Antonella Bevenja",
               "profile_path": null,
               "id": 17467,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ebf",
               "name": "Ghalya Laroix",
               "profile_path": null,
               "id": 17468,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ec5",
               "name": "Monya Galbi",
               "profile_path": null,
               "id": 17469,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ecb",
               "name": "Sylvie Peyre",
               "profile_path": null,
               "id": 17470,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ed1",
               "name": "Michel Gionti",
               "profile_path": null,
               "id": 17471,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ed7",
               "name": "Maria Beloso-Hall",
               "profile_path": null,
               "id": 17472,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031edd",
               "name": "Christophe Bourreau",
               "profile_path": null,
               "id": 17473,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fcc3a36847f8031ee3",
               "name": "Nicolas Waschkowski",
               "profile_path": null,
               "id": 17474,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 1,
               "credit_id": "53b3b8770e0a26598600bb81",
               "name": "Ghalia Lacroix",
               "profile_path": null,
               "id": 1066722,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.120164,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 1549,
      "vote_count": 40,
      "budget": 0,
      "overview": "The life of a band of teenager in a suburb near Paris. But instead of showing what would be the \"urban legend\" of this kind of poor suburb (violence, rapes...), Abdelatif Kechiche shows us what's the daily life of those guys: not much to do, not much dreams. Still, some of them have fun rehearsing for a play. Among those \"players\", Lydia, long time friend of Krimo... And Krimo, a bit shy, finds himself in love with this joyful girl.",
      "similar": [
         82695,
         416477,
         810,
         93456,
         1254,
         396940,
         1075,
         24684,
         1443,
         16314,
         228194,
         9517,
         10050,
         1555,
         8841,
         5544,
         481,
         65496,
         44754,
         393764
      ],
      "original_title": "L'Esquive",
      "runtime": 124,
      "poster_path": "/ctP6vzh3F7qsFxgWrzi3eJIHF4Z.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CinéCinéma",
            "id": 6301,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lola Films",
            "id": 26466,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Noé Productions",
            "id": 23433,
            "origin_country": ""
         }
      ],
      "release_date": "2003-11-25",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Abdellatif Kechiche"],
      "runtime": 117,
      "synopsis": "Abdelkrim ( Osman Elkharraz), dit Krimo, quinze ans, vit dans une cité HLM de la banlieue parisienne. Il partage avec sa mère, employée dans un supermarché, et son père, en prison, un grand rêve fragile : partir sur un voilier au bout du monde. En attendant, il traîne son ennui dans un quotidien banal de cité, en compagnie de son meilleur ami, Eric, et de leur bande de copains. C'est le printemps et Krimo tombe sous le charme de sa copine de classe Lydia ( Sara Forestier), une pipelette vive et malicieuse...",
      "writers": [
         "Abdellatif Kechiche",
         "Ghalia Lacroix"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0338977/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NjI0ODIxNF5BMl5BanBnXkFtZTcwNjc1NzIzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Osman Elkharraz, Sara Forestier, Sabrina Ouazani | See full cast and crew »"],
      "reviews": [
         "This movie is getting fresh exposure in France thanks to its win at Les Césars, or the \"French Oscars\" as other countries like to call them. Its success will probably mean that it now gets exposure outside the country, too, and I wonder how successfully. Though an accurate and contemporary examination of France, the film's world is a foreign one, even to many people living here--the specificity of the setting (the projects, in a \"suburb\" of Paris), the language (rapid-fire, slangy, \"vulgar\", and peppered with \"verlan\", a street language of inverted syllables--the word itself could translate as \"wardsback\", and how anyone will translate this dialogue I have no idea), and the behavior (mostly arguing--strident, pushy, beautifully repetitive) may not play clearly outside of France. I'm not sure how clearly it plays here, or how willing people are to watch it, especially as it turns the idea of the scary bad French projects somewhat on its ear. This isn't a criticism of the movie; on the contrary. Kechiche has shot a riveting cross-section of teenagers growing up in social housing, in broken homes and poverty, who lack the tools of expression, and who have adopted the posturing of the wounded (and, in the story, almost entirely absent) adults who raise them, attacking (the movie unfolds at a near-constant level of verbal aggression) and dodging (\"esquiver\" means \"to dodge\" or \"to evade\") one another's attacks with all they can muster. The film's intensely political side feels almost accidental; in its unfolding, it has great heart, and its actors, who are apparently mostly amateurs from around the shooting location, are outstanding. On the whole, it reminded me a great deal of David Gordon Green's George Washington: a simple love story set against a landscape of poverty, played out frankly and honestly, allowed to unfold at a distinctly un-Hollywoodian rhythm. If Green's film is more beautiful cinematic ally, L'Esquive is more concentrated, more unflinching in its examination of the deep repercussions and violence of economic, social, and familial hardship. Its statement that France is no longer a country of the French-of-French-ancestry, and that its refusal to accept its own transformation does not mean its lost generation accepts its loss, could not be more clearly nor more poignantly made. Without spoiling or going into detail, there are things about the plot that are implausible, things that probably hurt the film overall, but watching this movie for plot is like watching Ocean's Eleven for social insight. This is a positive study of character in a bad situation, of a stratum of society rarely filmed and still more rarely treated as fairly as it is offered up here, beautifully and eloquently.",
         "I saw L'Esquive at the San Francisco Film Festival on April 24. I was prepared for a sappy coming-of-age romantic movie but with the first dialogue which whisks you up before even the titles are shown and doesn't put you down until the end of the movie, I got something much more fulfilling. This is one realistic and well-performed movie. The director got some fantastic acting out of an almost 100% amateur cast. Very realistic and fast-paced. It is not a perfect movie, but it is very energetic and definitely a must-see. Well worth seeing and probably the highlight for me at the festival. Hopefully it will screen in the US.",
         "This is a dream film, of which I am so entirely thrilled that it received so many awards over the mediocre but over hyped Rois et reine. The self effacement of the director in this film is impeccable, one has the eerie sense of watching a Fred Wiseman documentary. It is true that dialogue can run long and circuitously, but for those with my taste for extreme realism this can only be a downside if the acting is poor, and in l'esquive it is not. The acting is on the contrary frighteningly good, whatever self consciousness the members of this young cast might have before the camera is immediately absorbed in the documentary-like mise en scene, that is to say, it only furthers the sensibilities and aesthetic as a whole. L'esquive is a singular film that we can only hope will influence a generation of young French filmmakers who are tired of the well lit, over produced cinema this country is getting far too comfortable with.",
         "The first comparison that comes to mind is the movie \"Kids\", but that is a superficial comparison. Both movies employed non-actors and got great performances, but the similarities end there. L'Esquive is set in a Parisian housing project with a majority Muslim population. The slang translation (subtitled) is matched to the slang used in a New York City housing project. Part of the humor comes from this posturing and there is a lot to be laughing about. The performances are strong all around and although the story is simple (a girl drops her boyfriend and he becomes interested in another girl) the kids fill it with energy and drama. There is none of the extreme violence that a similar story, set in the States, would have. There is no bloody shootout at the end - this fact alone recommends it. Sara Forestier (Lydia) you might have seen (if you watch French film) and will see more of - possibly in American film. Osman Elkharraz (Krimo) also has a charisma that makes him a candidate for future roles. The film is a very energetic and fresh examination of kids growing up in a fishbowl, up to and including their harassment and abuse by the French police. If you have any interest in French film, here is a refreshing and funny movie. Enjoy.",
         "Although imperfect from a cinematographic point of view, this film is remarkable as it penetrates deep into the lives of suburbia kids in Paris. All kids are from North Africa. They are boeur, which means arab in their bizarre dialect of french. I really doubt an old french man or woman understand what they are saying without subtitles. To love someone, to leave someone make deep marks in our souls when we are young. This sincere and honest film about teenage love should not be missed, if there is any screening available.",
         "The life of a band of teenager in a suburb near Paris. But instead of showing what would be the \"urban legend\" of this kind of poor suburb (violence, rapes...), Abdelatif Kechiche shows us what's the daily life of those guys: not much to do, not much dreams. Still, some of them have fun rehearsing for a play. Among those \"players\", Lydia, long time friend of Krimo... And Krimo, a bit shy, finds himself in love with this joyful girl. The good thing in this movie is that it shows the suburb as it can be : not really fun but not the awful thing we think it is. No, they're not all juvenile delinquents. Their lives are just no fun. And yes, they don't speak like Moliere did, yes they use F words. It's the way they talk to each other. But when talking to adults, they're just very polite. And even if there's no much suspense in this movie (it's just about wondering if Krimo will go out with Lydia), L'Esquive shows another suburb. A suburb where teenagers (all french, but from different origins, from Spain to Asia) are not dangerous people.",
         "I really did like this film! - those viewers, French or otherwise, who have seen, and been able to follow the sound track of La Haine, will be quite at home in this environment, will know what to expect, and will be sensitive to the message the film conveys. True, it may lack the sort of 'excitement'that some film-goers may seek, but one has to take it for what it is: a hard-hitting social document which will resonate with many who are familiar with the inner-city tensions found in many French towns in recent years. The gambit of choosing amateur actors worked very well,in my opinion, a point which other viewers seem to echo.",
         "\"Games of Love and Chance (L'Esquive)\" is an involving experiment in giving classic French comedy of errors relevance to today, in a dramatic demonstration of \"Plus ça change, plus c'est la meme chose\" -- the more things change, the more they stay the same. Writer/director Abdellatif Kechiche juxtaposes the titular 18th century work by Marivaux with junior high kids in a poor, inner city Arab immigrant neighborhood, for an effect that crosses Larry Clark's \"Kids\" with \"Mad Hot Ballroom.\" Like any period farce, the real relationships are dizzyingly circular: A loves B who loves C who is in disguise with D. A threatens C, B changes places with D to pursue his suit and use Marivaux like Cyrano, C can't make up her mind, friends of B and C misunderstand everyone, and the course of true love doesn't run smooth. While marred by wincingly heavy-handed intellectualizing on class social criticism by the literature teacher who is directing the kids in the play and a deus ex machina insertion of biased cops, the frank life and death-ness of adolescent romance strongly comes through in comparison to Marivaux's mannered floweriness, even as these kids communicate amongst each other with four letter obscenities, bluntly crude slang (that may not be too well represented in the English subtitles but I'm sure French subtitlers likewise have trouble with the patois in movies such as \"Four Brothers\"), heart-tugging looks of longing, painfully hurt tears, and, finally in frustration, physical action. It is not clear if \"the blonde\" as she is referred to in the English subtitles (played by the excellent Sara Forestier, who seems to have been the only member of the cast with some previous experience before the cameras) is also from an immigrant family or Muslim, or if she just picked up use of a couple of Muslim catch phrases in her slang as to whether Kechiche is adding another layer of social commentary. Or she could just be part of the trend in French cinema to fixate on pouty young blonde temptresses, viz. \"La Petite Lili,\" \"À Tout de Suite (Right Now),\" \"Lila Says (Lila dit ça).\" This film has a lot of parallels with \"Lila Says (Lila dit ça),\" not just about sex and social setting, though it dealt with older kids, but also how literature can be an escapist outlet yet also a threat that brings hidden emotions to the fore. The grim mise en scene makes wonderful use of a crowded, high rise neighborhood where the kids hang out chilled because they have little privacy at home, some fathers are in jail, their loving mothers try to keep tabs on them, and cell phones are their expensive lifelines. While the film goes on a bit too long as scenes meander, probably because it isn't clear how much has been scripted and how much the kids are very effectively improvising particulars around a basic story line, their relationships are enthralling, both the romances and the friendships. Each teen actor creates an indelible and different character. 270 years since Marivaux and the human heart hasn't changed.",
         "This French film is a quite disheartening look at life in the public housing projects outside Paris. In a crumbling neighborhood with a majority of immigrants from Northern Africa, a high school tries to produce a play by Pierre Marivaux (1688-1763). The heart of the film is the budding romance between the vivacious blonde Lydia (one of the few \"native\" French living in the neighborhood) and the shy and painfully inarticulate Krimo, who is ridiculized by his thuggish friends for taking a part in the play. All the kids speak in an unintelligible slang, which makes a contrast with the classical French of Marivaux. I wrote it was disheartening (despite not being a drama) because it shows that the marginalized inhabitants of the projects have an almost nil chance of breaking into the mainstream of French society. Thoughtful and worth seeing.",
         "I'm going to keep it short. To be honest I didn't want to see this film, however I had to go so a movie at a film festival for my international cinema class. When I left it was one of those experiences where you want to truly thank a teacher for making you do something. Altogether this was a great movie, yes it was long, however the director captured the real emotions and nuances of teens in love so amazingly you feel like he stole the performances from the young actors. Not to mention this movie gives a great view of the hardships for minorities in the south of France, by not directly addressing them. Check this movie out, no matter what you won't be mad that you saw it."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Lola Films",
         "Noé Productions",
         "CinéCinéma"
      ],
      "summaries": ["In the slums of Paris, a group of students - primarily North African and Southeast Asian immigrants - are staging a class production of the Marivaux play \"Le Jeu de l'Amour et du Hasard,\" about the inevitability of class distinctions. Lead actress Lydia (Sara Forestier) takes to the material, encouraging and bullying the other students to take the production seriously. Meanwhile, her friend Krimo (Osman Elkharraz) plays her love interest on stage and harbors real affection as well."],
      "budget": 0
   },
   "movielensId": 77715,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2003-11-25",
      "dvdReleaseDate": "2006-04-18",
      "directors": ["Abdellatif Kechiche"],
      "runtime": 124,
      "movieId": 77715,
      "title": "Games of Love and Chance",
      "mpaa": "",
      "actors": [
         "Osman Elkharraz",
         "Sara Forestier",
         "Rachid Hami",
         "Hajar Hamlili",
         "Nanou Benhamou",
         "Carole Franck",
         "Meriem Serbah",
         "Sabrina Ouazani"
      ],
      "imdbMovieId": "0338977",
      "originalTitle": "L'Esquive",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The life of a band of teenager in a suburb near Paris. But instead of showing what would be the \"urban legend\" of this kind of poor suburb (violence, rapes...), Abdelatif Kechiche shows us what's the daily life of those guys: not much to do, not much dreams. Still, some of them have fun rehearsing for a play. Among those \"players\", Lydia, long time friend of Krimo... And Krimo, a bit shy, finds himself in love with this joyful girl.",
      "tmdbMovieId": 1549,
      "avgRating": 3.15625,
      "releaseYear": "2003",
      "numRatings": 16,
      "posterPath": "/ctP6vzh3F7qsFxgWrzi3eJIHF4Z.jpg"
   }
}