{
   "tmdb": {
      "original_language": "el",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "greece",
            "id": 1200
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "crete",
            "id": 2365
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "greek",
            "id": 8011
         },
         {
            "name": "author",
            "id": 10818
         },
         {
            "name": "monastery",
            "id": 41592
         },
         {
            "name": "riding a donkey",
            "id": 219988
         }
      ],
      "imdb_id": "tt0057831",
      "video": false,
      "title": "Zorba the Greek",
      "recommendations": [
         49815,
         33667,
         5769,
         27367,
         15421,
         13528,
         14703,
         25673,
         46495,
         24807,
         42122,
         32030,
         32075,
         26661,
         26520,
         53424,
         37467,
         24751,
         59802,
         83750
      ],
      "backdrop_path": "/vNzUbvQtGxRUY1tUaJjdu0Cpy3E.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Alexis Zorba",
               "gender": 2,
               "credit_id": "52fe43919251416c7501588b",
               "name": "Anthony Quinn",
               "profile_path": "/9sKpm4KCoUbmMbR86fpqcgBCHrJ.jpg",
               "id": 5401,
               "order": 0
            },
            {
               "cast_id": 23,
               "character": "Basil",
               "gender": 2,
               "credit_id": "52fe43919251416c750158bb",
               "name": "Alan Bates",
               "profile_path": "/fgfhPgDgFgw1h1FnuCnEcoYsgwp.jpg",
               "id": 27554,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Widow",
               "gender": 1,
               "credit_id": "52fe43919251416c75015881",
               "name": "Irene Papas",
               "profile_path": "/tJ0ErVqe8bmqz5vuU9iJLwiBGle.jpg",
               "id": 18847,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Madame Hortense",
               "gender": 1,
               "credit_id": "52fe43919251416c75015893",
               "name": "Lila Kedrova",
               "profile_path": "/4yFdLNkEEhONH5hvbfXlOZnRXnw.jpg",
               "id": 45523,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mimithos",
               "gender": 2,
               "credit_id": "52fe43919251416c7501588f",
               "name": "Sotiris Moustakas",
               "profile_path": "/iT9D0dKT483pFBI0eLufN9EEYYj.jpg",
               "id": 65842,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Soul",
               "gender": 0,
               "credit_id": "52fe43919251416c75015897",
               "name": "Anna Kyriakou",
               "profile_path": null,
               "id": 65893,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Manolakas",
               "gender": 2,
               "credit_id": "52fe43919251416c7501589f",
               "name": "Takis Emmanuel",
               "profile_path": null,
               "id": 65896,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Lola",
               "gender": 0,
               "credit_id": "52fe43919251416c7501589b",
               "name": "Eleni Anousaki",
               "profile_path": "/zXe5BPBUz5d4Gp9J16Tu3T2HnSi.jpg",
               "id": 65894,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mavrandoni",
               "gender": 2,
               "credit_id": "52fe43919251416c750158a3",
               "name": "George Foundas",
               "profile_path": null,
               "id": 65897,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Acne Faced Boy",
               "gender": 2,
               "credit_id": "52fe43919251416c750158a7",
               "name": "George P. Cosmatos",
               "profile_path": "/6DIKPjnDvr7oHgTPHTXM5te45Qt.jpg",
               "id": 16566,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Pavlo",
               "gender": 2,
               "credit_id": "52fe43919251416c750158bf",
               "name": "Yorgo Voyagis",
               "profile_path": "/bTqroXMCv3t9b0aXUjIM05t3HKU.jpg",
               "id": 24696,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43919251416c75015859",
               "name": "Mihalis Kakogiannis",
               "profile_path": "/prtlp8E2u5YQfaNNTOpDI94TVkH.jpg",
               "id": 65843,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43919251416c7501585f",
               "name": "Mihalis Kakogiannis",
               "profile_path": "/prtlp8E2u5YQfaNNTOpDI94TVkH.jpg",
               "id": 65843,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43919251416c75015871",
               "name": "Mihalis Kakogiannis",
               "profile_path": "/prtlp8E2u5YQfaNNTOpDI94TVkH.jpg",
               "id": 65843,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43919251416c75015877",
               "name": "Walter Lassally",
               "profile_path": null,
               "id": 36967,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43919251416c7501587d",
               "name": "Míkis Theodorakis",
               "profile_path": "/j9xZClyQGFKJwKYKmsBWGh5nbi3.jpg",
               "id": 27439,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43919251416c75015887",
               "name": "Vassilis Photopoulos",
               "profile_path": null,
               "id": 65891,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43919251416c750158b1",
               "name": "Nikos Kazantzakis",
               "profile_path": null,
               "id": 65844,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43919251416c750158b7",
               "name": "Mihalis Kakogiannis",
               "profile_path": "/prtlp8E2u5YQfaNNTOpDI94TVkH.jpg",
               "id": 65843,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5605bcabc3a36829310006d1",
               "name": "Anthony Quinn",
               "profile_path": "/9sKpm4KCoUbmMbR86fpqcgBCHrJ.jpg",
               "id": 5401,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.429592,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "GR",
            "name": "Greece"
         }
      ],
      "id": 10604,
      "vote_count": 76,
      "budget": 783000,
      "overview": "An uptight English writer traveling to Crete on a matter of business finds his life changed forever when he meets the gregarious Alexis Zorba.",
      "similar": [
         82693,
         132344,
         9762,
         4347,
         866,
         510,
         10191,
         235,
         10545,
         13,
         1429,
         51828,
         627,
         180863,
         264660,
         2898,
         10948,
         264656,
         2323,
         68817
      ],
      "original_title": "Αλέξης Ζορμπάς",
      "runtime": 142,
      "poster_path": "/uGKStnYfgUoyLc5kpTzOmHBbxBa.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "ελληνικά",
            "iso_639_1": "el"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1964-12-14",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Life. Lust. Love. Zorba.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Mihalis Kakogiannis"],
      "runtime": 142,
      "synopsis": null,
      "writers": [
         "Nikos Kazantzakis",
         "Mihalis Kakogiannis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057831/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxMDE2NDg5N15BMl5BanBnXkFtZTgwMzY3NjYwMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony Quinn, Alan Bates, Irene Papas | See full cast and crew »"],
      "reviews": [
         "Nikos Kazantzakis' novels lend themselves to cinematic treatment. Jules Dassin made a great adaptation of \"He Who Must Die\", and Michael Cacoyannis was equally successful in bringing \"Alexis Zorbas\" to the screen. Watching this film for a second time puts into perspective a lot of things that escape many a viewer the first time around. Michael Cacoyannis changed the order of events in the book, as well as Nikos, who he transforms into Basil, the Englishman. The changes are not without merit since all the elements contribute to blend well together in the finished product. The director was fortunate to find such collaborators as Mikis Theodorakis, the genial composer of the music score and Walter Lassally, who photographed the barren area where most of the action takes place. Viewing the film on cable recently, shows Lassally's crisp black and white photography in mint condition. The film is totally dominated by Zorba, who is a figure larger than life, as he takes Basil under his wing from the start. Anthony Quinn was a perfect choice for playing the title character. Mr. Quinn had worked with other brilliant directors, Federico Fellini, being one of them. It's almost impossible to think of Mr. Quinn as being an American because the magnificent transformation he undergoes here to portray Zorba. Alan Bates, who is seen as Basil, the Englishman of Greek descent, who is going to Crete to see the family's land and mine. By underplaying Basil, Mr. Bates set the right tone, in sharp contrast with Anthony Quinn's exuberance. Alan Bates, in the end, made perfect sense with the way he played Basil. Lila Kedrova is another surprise in the film. She is the tragic Madame Hortense, who has lived in the island for quite a while. It's ironic that love always eluded her until she finds in Zorba a reason for keep on living. Irene Papas is equally intense as the widow who is haunted by all the men in town. She has little to say, but just a look from her smolders the screen, be it, for the lust she felt for Basil, or the hatred for the town male population. Michael Cacoyannis uses these men, as a sort of Greek Chorus, so important in Greek tragedies. The same could be said of the older women of the town who resent the arrivals of strangers. The Greek cast one sees is quite effective in the context of the movie. \"Alexis Zorbas\", or \"Zorba, the Greek\", is a film that will stay with the viewer for quite a while because of what the director accomplished with it.",
         "OK, I admit I've seen this movie a dozen times. But it never fails to inspire. Was there ever a man who lived life as fully as Alexis Zorba? Was there ever a character who understood so much about living and dying, women and men? Zorba ripping a piece of lamb from the spit and biting into it with joy and verve, dancing in pain or dancing from joy, expressing his wonderment at the sight of a dolphin, gives this character a special place in movie history. If the rich storytelling and great Quinn performance were not enough, we get the young Alan Bates in a fine part doing a fine piece of acting, and the extraordinary pair of performances by Lila Kedrova and, especially, Irene Pappas, who need not speak a word to convey an entire menu of emotions. The final scenes are among the best in movies. The music is among the best. Indeed, the MOVIE is among the best. A GREAT movie.",
         "What an exuberant film - not to be missed! It chronicles sadness and joy so beautifully that one can't help but want to weep, laugh, and dance along. There are four wonderful performances, led by Anthony Quinn, whose enthusiam for life almost leaps from the screen, giving rise to an almost sacrilegious thought: How could Rex Harrison's stuffy, embalmed Professor Henry Higgins have won the Best Actor Oscar over Quinn as Zorba? Lila Kedrova is heartbreaking as Madame Hortense, the dying prostitute with a colorful past. The always-enjoyable Alan Bates, and the striking Irene Papas as the Widow. Like Anna Magnani, Papas was an actress who transcended any language barrier, who didn't need dialogue at all - her face and body said everything she needed to. For the most part the film looks great on DVD, with crisp, clear black-and-white photography. But I have one quibble: the transfer seems to have been made from the same source as the videotape prints in circulation, because there are a couple of instances of obvious post-production looping (possibly for prime-time television broadcasts), changing 'goddam' to 'old damn,' for instance - they even do this in the English subtitles. But read Quinn's lips - there's no mistaking what the original lines were! I'd expected that the original unedited soundtrack would have been restored.",
         "A young Englishman is writing on a manuscript about the Buddha. He meets Alexis Zorba who greatly influences his outlook on life. The narrator, whose name is not revealed, hires Zorba to superintend the workmen in his lignite mine in Crete. Zorba the Greek is a book and a movie by nature on the contrast between the Apollonian and the Dionysian outlook on life. Apollo/the boss(Alan Bates) represents the spirit of order and rationality, while Dionysus/Zorba(Anthony Quinn) represents the spirit of ecstatic, spontaneous will to life. Anthony Quinn's performance is really great. I read the book about a month ago and I guess I couldn't visualize the Zorba image in my mind that well. His looks,one-liners,his dancing sirtaki on the beach,his harmony with Madame Hortense(Lila Kedrova)just looks so nice.It is really surprising that Lila Kedrova got \"Academy Award for Best Supporting Actress\" while Anthony Quinn just got the nomination for best actor in a leading role.(Such a pity that he didn't get it.) Well that work of art is not so great as \"Jesus Re-crucified\" or \"The Last Temptation of Christ \" but is a still great Kazanthakis art.And the adapted movie is a really good one coz given that the whole book is based on a contrast introduced by Friedrich Nietzsche and it is not supposed to be easy to cinematize a philosophical book.Great Quinn! Great movie!(But I Don't THINK LILA KEDROVA DESERVES THAT AWARD) If you have ever read Kazanthakis you should absolutely see this movie!",
         "When I first saw Zorba the Greek 4 years ago, I inwardly thanked my philosophy teacher for having us watch this masterpiece. Today, I am still greatful to him. This movie is definetely one of my all time favorite. The whole cast is great, the story is really close from the book (except for some details that an author can write in a book, but a director can't put easily in a film), images are wonderful, Crete is.perfect. If you have never seen this movie, I recommend it to you.",
         "Anthony Quinn's performance is phenomenal. In a world filled with ignorance, lack of vision, hate, and the most shameful examples of human depravity, Zorba provides beautifully imperfect goodness. There is no pretense about who Zorba is. Despite his imperfections (and there are so many), he is genuine love, kindness and passion. The scene where Zorba remains by his dying wife's (Madame Hortense) side is pure and sweet and extremely moving. While the greedy masses, like vultures, swoop in to steal any possible item from this woman's home, Zorba provides profound comfort, while most others would have reacted differently. I can't believe it took me 40 years to see this movie. Gracias, Señor Quinn!",
         "Zorba ranks in my lifetime top 10. Fabulous that it is finally available on DVD for new generations. Few films today are willing to breathe like this one does on the island of Crete; few films today understand how to blend great heart with the glories and terrors of life. Zorba lives with his guts and his nose. Basil \"Boss\" filters his life through his intellectualism, afraid to let his soul dance. The influence of the two upon each other illustrates so much about the human condition in ways both inspiring and sometimes unbearable. Truly one of the best blends of direction, screen writing, acting, and photography I have ever seen.",
         "This seems to be the best part of Anthony Quinn ever. The exuberance of Zorba, the character's capacity of seeing only the bright side of life and of transferring this optimistic attitude to the others and the metaphor of dance on the deserted beach, after the failure - some of the things that make a masterpiece of this movie. Also, actors like Irene Papas and Alan Bates play their parts with great professionalism, creating strong characters and giving them a real authenticity. This film is a must-see for all those who think defeats are only simple obstacles that we all have to pass beyond by smiling and, why not, dancing in the sun.",
         "I just saw Zorba again today on TCM, 40 years after first seeing it as a young teenager. I was again entranced by the characters and the cinematography. In fact, I had forgotten that it was shot in black and white but imagined it had been shot in vibrant color! I also have read the novel, and while there is of course more detail and perhaps more depth in it, the movie is one of the best adaptations of a book I have ever seen. I feel I must take issue with some reviewers who watched this movie through the lenses of 2006 and evidently did not understand the world described in Zorba. First of all, even though the movie was shot in 1964, it takes place in the 20's from the look of the cars, etc. The people and events on the island of Crete thus are what we, today, might see as \"primitive\" but nevertheless that was how things worked at that time and in that place. To label him \"Zorba the Creep\" is cute but only shows that reviewer's lack of historical understanding and possibly her lack of travel. A woman's place was indeed ruled by men and tribal justice was swift and often cruel. Therefore the movie may have seemed \"depressing, misogynistic and unpleasant\" to you. Zorba was not a perfect person; he could be mean as well as kind. But he had also experienced a lot in life, including going to war and the death of his young son, and he had learned how to pick himself up and go on despite great hardships. Thus Zorba embodied an instinctive and life-affirming principle never before seen by the uptight Englishman and this was something that moved and changed him, even if he also was not perfect and did not react as we would have expected him to act today. The movie does not glorify or justify what happens but simply presents the facts and lets us draw our own lessons from them. Moreover, the comment \"Threadbare plot and tiresome stereotypes abound in this movie...The story is sluggishly paced and rather tedious, without a single line of fresh, original dialogue\" really shows this reviewer's total lack of knowledge of film history. Rather than being \"Quinn's usual schtick,\" this was the origination of a character that he then went on to play, perhaps overplay, in many subsequent movies. The dialogue is so beautiful that it has been copied to the degree that these reviewers found it derivative, rather than realizing this movie is the template for the others that followed!! Lastly, the novel and the screenplay were written by Greeks, and the director was Greek. Therefore I hardly think they were being condescending or \"laying on the local color\" too thickly. These scenes and events had deep significance for them and from the tenor of the majority of reviews, it meant something to others as well. Maybe it's that there can be beauty in life even though there is also great injustice; that some people can be tolerant to some degree; that there are moments that call for something non-analytical like dancing in order to express the mix and chaos of our emotions.... One of the greatest things in this movie as I watched it for the second time was the moments of silence; the lack of music bombastically intruding on the love scene; the many communications carried by a look and no words. WHAT A GEM!!",
         "I can't decide which was Anthony Quinn's best performance ever: \"La strada\" or \"Zorba the Greek\". In the latter, he plays Alexis Zorba, a fun-loving Cretan* who befriends bored Englishman Basil (Alan Bates), who has come to Crete to inherit a mine. As the movie progresses, we see Zorba's penchant for living life to its fullest. By the end, you'll probably wish that you could be in the movie dancing with him. \"Zorba the Greek\" is quite literally a flawless movie. Virtually anything that you've ever wished that you could do but never had the chance, you can bet money that Zorba does. As he reminds Basil in one scene, \"You will live a thousand years.\" *Yes, a person from Crete is called a Cretan."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "An aimless Englishman finds he has a small inheritance on a Greek island. His joyless existence is disturbed when he meets Zorba, a middle aged Greek with a real lust for life. As he discovers the earthy pleasures of Greece, the Englishman finds his view on life changing.",
         "An uptight English writer traveling to Crete on a matter of business finds his life changed forever when he meets the gregarious Alexis Zorba."
      ],
      "budget": 783000
   },
   "movielensId": 7771,
   "movielens": {
      "languages": [
         "English",
         "ελληνικά"
      ],
      "releaseDate": "1964-12-14",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Mihalis Kakogiannis"],
      "runtime": 142,
      "movieId": 7771,
      "title": "Zorba the Greek",
      "mpaa": "NR",
      "actors": [
         "Anthony Quinn",
         "Alan Bates",
         "Irene Papas",
         "Lila Kedrova",
         "Sotiris Moustakas",
         "Anna Kyriakou",
         "Takis Emmanuel",
         "Eleni Anousaki",
         "George Foundas",
         "George P. Cosmatos",
         "Yorgo Voyagis"
      ],
      "imdbMovieId": "0057831",
      "originalTitle": "Αλέξης Ζορμπάς",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["A7m5BwSKdS4"],
      "plotSummary": "An uptight English writer traveling to Crete on a matter of business finds his life changed forever when he meets the gregarious Alexis Zorba.",
      "tmdbMovieId": 10604,
      "avgRating": 3.75105,
      "releaseYear": "1964",
      "numRatings": 478,
      "posterPath": "/uGKStnYfgUoyLc5kpTzOmHBbxBa.jpg"
   }
}