{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vin Diesel"],
      "runtime": 20,
      "synopsis": null,
      "writers": [
         "Vin Diesel",
         "T.J. Mancini"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1538503/",
      "coverLink": null,
      "actors": ["Stars: Vin Diesel, Michelle Rodriguez, Sung Kang | See full cast and crew »"],
      "reviews": [
         "No spoilers cause this just sets up the beginning of the next movie. This short story sets up the heist that is at the beginning of Fast and Furious, the one where they hijack the fuel tankers in the Dominican Republic. Dom is working with his new partners Tego and Leo, you might remember them more from Fast5. First Dom calls upon the assistance of Han. Next they have to break Leo out of prison. There is a gas shortage in the Dominican Republic and they meet with a politician that is going to make it possible to obtain the gas the town needs. Then comes Letty, she finds Dom surrounded by \"skanks\", apparently this is the first time since episode 1, since at the end of 1 Dom is shown driving through Mexico alone. Dom leaves with Letty of course. The next day they take a romantic drive to the beach and re kindle their romance. You get to see a very tender part of Dom and Letty's relationship. Very good setup, I always wondered what happened in the big gap between 1 and 4. Honestly after seeing 2fast and parts of Tokyo drift I was ready to call this franchise a dud, but Vin Diesels return resurrected it, Fast 5 being my favorite.",
         "Maybe you have to be a great fan of the \"Fast&Furious\" franchise in order to appreciate this 20-minute short movie. I am certainly not one of these, so possibly that's why I saw nothing memorable at all in this one here. The interactions are forgettable, action is non-existent and same goes for character development. I guess there is a reason why Vin Diesel has not written and directed more films. The only slightly positive thing in here was the music and the general Caribbean atmosphere all in all. Still that is of course not enough to make for a great movie, not even at such a short runtime. And this also does not make me curious about any of the F&F films. Not recommended.",
         "It was hard after watching this 20-minute movie to rate it. I rated 4 out of 10, but I am really not sure about it. The whole 18 minutes the movie takes, I was wondering why a person should watch this video. It has not to do with fast cars running, people chasing, gunshots or any other kind of action. I mean that this film is not for the fans of Fast and the Furious. What you see in this video is a typical day of Dom and his fellas in a village. Although I like the characters of this movie series, this wasn't satisfying. I have to admit that there was a quite beautiful landscape, but that's all. Nothing more. I appreciate Vin Diesel as an action actor and I am a fan of some of his movies, especially Fast and the Furious, but he should not writing and directing movies. He is good enough at playing the guy that tears other people down."
      ],
      "genres": [
         "Short",
         "Drama"
      ],
      "productionCompanies": [
         "One Race Productions",
         "Terrero Films"
      ],
      "summaries": ["This is a short film that is included as a bonus on the Blu-ray and Special Edition DVD releases of Fast & Furious (2009)."],
      "budget": 0
   },
   "movielensId": 77770,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "2009-07-28",
      "dvdReleaseDate": null,
      "directors": ["Vin Diesel"],
      "runtime": 20,
      "movieId": 77770,
      "title": "The Outlaws",
      "mpaa": "NR",
      "actors": [
         "Vin Diesel",
         "Michelle Rodriguez",
         "Sung Kang",
         "Tego Calderón",
         "Don Omar",
         "Juan Fernández",
         "Mirtha Michelle",
         "F. Valentino Morales",
         "Adria Carrasco",
         "Celines Toribio"
      ],
      "imdbMovieId": "1538503",
      "originalTitle": "Los Bandoleros",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["f0O_nohVDtE"],
      "plotSummary": "The film tells the back story about the characters and events leading up to the explosive oil truck heist in Fast &amp; Furious.",
      "tmdbMovieId": 211877,
      "avgRating": 3.28261,
      "releaseYear": "2009",
      "numRatings": 23,
      "posterPath": "/iYe00vDJMUxSaJEydyC5n4R5Uil.jpg"
   }
}