{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shop",
            "id": 1998
         },
         {
            "name": "undercover agent",
            "id": 4654
         },
         {
            "name": "illegality",
            "id": 6523
         },
         {
            "name": "internal affairs",
            "id": 11730
         }
      ],
      "imdb_id": "tt0099850",
      "video": false,
      "title": "Internal Affairs",
      "recommendations": [
         10859,
         2990,
         12150,
         24249,
         11092,
         10083,
         10551,
         6723,
         31618,
         11062,
         12235,
         9941,
         2768,
         9409,
         9491,
         10675,
         9057,
         9458,
         12395,
         4954
      ],
      "backdrop_path": "/mGxlhHbtI6FZJxvhcBBBnHsfxuB.jpg",
      "revenue": 27734391,
      "reviews": [{
         "author": "John Chard",
         "id": "5467473ceaeb81726e001ce2",
         "content": "Like a big baby with buttons all over. I push the buttons.\r\n\r\nInternal Affairs is directed by Mike Figgis and written by Henry Bean. It stars Richard Gere, Andy Garcia, Nancy Travis, William Baldwin and Laurie Metcalf. Music is jointly produced by Figgis, Brian Banks and Anthony Marinelli and cinematography is by John A. Alonzo.\r\n\r\nStylish neo-noir that has Gere as Dennis Peck, a crooked cop under investigation by IAD operatives Garcia and Metcalf.\r\n\r\nPeck is a master manipulator, a devious bastard who has his fingers in so many mud pies he could start his own bakery. Gere is on fire with the role, imbuing Peck with a menacing nastiness that’s a constant throughout the entire play. \r\n\r\nOnce Figgis and Bean have laid the character foundations, the plot turns into a psychological battle of wills and skills between Peck and Raymond Avila (Garcia), with Peck always one step ahead because he knows where Avila’s weakness is.\r\n\r\nFiggis slow burns the tension with great aplomb, then unleashes the beasts for the thriller aspects of Bean’s screenplay. The look and feel of the piece is that of doom, deftly positing Peck’s vileness within a city awash with crooks, hookers and hitmen for hire. 8/10",
         "url": "https://www.themoviedb.org/review/5467473ceaeb81726e001ce2"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dennis Peck",
               "gender": 2,
               "credit_id": "52fe43ee9251416c7502367f",
               "name": "Richard Gere",
               "profile_path": "/hqMhNyTqIStibnhBh8SjyfpU665.jpg",
               "id": 1205,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Raymond Avila",
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023683",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amy Wallace",
               "gender": 1,
               "credit_id": "52fe43ee9251416c75023687",
               "name": "Laurie Metcalf",
               "profile_path": "/oHhTbuv9eNJV4YlgizhCkZsPV0N.jpg",
               "id": 12133,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kathleen Avila",
               "gender": 1,
               "credit_id": "52fe43ee9251416c7502368b",
               "name": "Nancy Travis",
               "profile_path": "/5galk3XJxxlIEmrnAQBuJsY1AaD.jpg",
               "id": 18331,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Sean Stretch",
               "gender": 2,
               "credit_id": "52fe43ee9251416c750236b3",
               "name": "Elijah Wood",
               "profile_path": "/hHzLAVspGGuPg1KW5JAEsyRvnUT.jpg",
               "id": 109,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Grieb",
               "gender": 2,
               "credit_id": "5680052bc3a368227b003403",
               "name": "Richard Bradford",
               "profile_path": "/fGMexQI7Po1AuHO7masqwUWId1P.jpg",
               "id": 1272,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Van Stretch",
               "gender": 2,
               "credit_id": "56800537c3a36860e900ccb8",
               "name": "William Baldwin",
               "profile_path": "/1G9Y076nnZaobTAtzRefZd8rFNN.jpg",
               "id": 13021,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Dorian Fletcher",
               "gender": 2,
               "credit_id": "568005499251412e5200b478",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Penny Stretch",
               "gender": 1,
               "credit_id": "56800559c3a36860e900ccbd",
               "name": "Faye Grant",
               "profile_path": "/3p9JwBPtOptm6kb6tV7QaBQKvyF.jpg",
               "id": 70830,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Steven Arrocas",
               "gender": 2,
               "credit_id": "56800567c3a3684be300d93a",
               "name": "John Kapelos",
               "profile_path": "/5s1r2lu8l1iODlmCf75hBhtxBoU.jpg",
               "id": 55554,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Tova Arrocas",
               "gender": 1,
               "credit_id": "5680057f9251414f6300652d",
               "name": "Katherine Borowitz",
               "profile_path": "/fMcvD70ptN96CZo0JJmxEx4BNg0.jpg",
               "id": 171379,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Heather Peck",
               "gender": 1,
               "credit_id": "5680058ac3a3682abc006281",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Lolly",
               "gender": 1,
               "credit_id": "56e7935dc3a36840940014c0",
               "name": "Susan Forristal",
               "profile_path": "/A8Dh5EKIjaRUqGmpY8GdIAW9pJY.jpg",
               "id": 21620,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023691",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c75023697",
               "name": "Frank Mancuso Jr.",
               "profile_path": null,
               "id": 49284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c7502369d",
               "name": "Brian Banks",
               "profile_path": null,
               "id": 53558,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c750236a3",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c750236a9",
               "name": "Robert Estrin",
               "profile_path": null,
               "id": 4141,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c750236af",
               "name": "John A. Alonzo",
               "profile_path": "/7HN8Ifyp5hNBhBurx0q3rlsQX8r.jpg",
               "id": 1153,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ee9251416c750236b9",
               "name": "Henry Bean",
               "profile_path": null,
               "id": 30458,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.416234,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11060,
      "vote_count": 97,
      "budget": 0,
      "overview": "Keen young Raymold Avila joins the Internal Affairs Department of the Los Angeles police. He and partner Amy Wallace are soon looking closely at the activities of cop Dennis Peck whose financial holdings start to suggest something shady. Indeed Peck is involved in any number of dubious or downright criminal activities. He is also devious, a womaniser, and a clever manipulator, and he starts to turn his attention on Avila.",
      "similar": [
         9737,
         10775,
         136400,
         1051,
         1493,
         9504,
         37710,
         9502,
         341013,
         2142,
         257088,
         11384,
         20048,
         11081,
         9040,
         11022,
         15794,
         11062,
         3132,
         11565
      ],
      "original_title": "Internal Affairs",
      "runtime": 114,
      "poster_path": "/j3Lk53GMp0EH9jFBrjd6Y04yyAO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1990-01-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Trust him... he's a cop.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Figgis"],
      "runtime": 115,
      "synopsis": "Ambitious LA cop with Latin temper moves to Internal Affairs department where he's paired up with lesbian superior. Immediately involved in police brutality case, his pursuit of the young police officer leads him to cross swords with an amoral, possibly sociopathic police sergeant who controls a seemingly department wide network of corruption. Physical and pychological battle between them involving violence, murder and some, occasionally rough, sex ends in triumph for the good guys as usual but with some thought provoking character exploration along the way as the film develops. Sympathethic treatment of the gay female IA officer ahead of its time.",
      "writers": ["Henry Bean"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099850/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNDI1NzU0M15BMl5BanBnXkFtZTcwMTc4ODkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Gere, Andy Garcia, Nancy Travis | See full cast and crew »"],
      "reviews": [
         "I have never quite seen a movie like this before. In it, Richard Gere plays his most sinister role and I think his best character in years. There are many disturbing elements in this film and most of them are perpetrated by Richard Gere's Dennis Peck. He knows how to manipulate people to get what he wants and if that doesn't work he uses other measures. The story goes like this: Richard Gere plays a cop that everyone owes a favour to. He is everyone's friend and everyone's silent worst enemy. He also lives a little above his income should allow him too and this is why he is being investigated by internal affairs. Enter Andy Garcia as Raymond, in a mesmerizing performance. These two know they are going to square off in the film and Peck has fun tormenting him. Peck is a charismatic, good looking, wealthy play boy. He knows how to use what he has to his advantage, and that eventually means playing with Raymond's head to make him think that he is sleeping with his wife. Did I mention that he is intuitive? And this is established so brilliantly in one of their first meetings together that it makes you cringe. Peck introduces himself to Raymond and at first he seems very co-operative assuring Raymond that he realizes Ray has a job to do just like he does. But the conversation takes an abrupt turn when Peck begins to hit too close to home when he begins to question how good Raymond's love life is right now. He knows he spends too much time at the office and that he has a beautiful, young wife that may be neglected. The scene works beautifully and sets up the psychological battle that takes place between the two as the film goes on. The next scene they have with each other is enough to make every man cringe at the cruelty of it. Internal Affairs is a character study at it's finest. There are few films out there that can compare to this one and that can be attributed to the director, Mike Figgis. He hits every note perfectly and the performances he gets from his cast is such a joy to watch. I am surprised that Andy Garcia hasn't gone on to be bigger than he is because he was outstanding here. This is an absolute must see for anyone that hasn't had the pleasure of doing so yet. But beware, there are some scenes that will get under your skin, especially if you spend too much time at the office and you have a beautiful woman waiting for you at home. What is she doing right now? Who is she with? Are you paranoid or are your concerns real? This film has fun with that paranoia.",
         "Dennis Peck is a street cop who seems happy to stay at that level, and yet he spends significantly more money than he makes on his cops' pay. When IA officers investigate Peck's partner Van Stretch for planting drugs on a suspect and using unnecessary force, they decide to look into Peck more. However Peck knows how to exploit weakness in those around him and begins to clear up the loose links around him while pushing all Raymond Avila's buttons. This was Figgis' first American film and he made an excellent start. The dark plot is pretty simple in terms of beginning, middle, start. What makes it so much more than that is the characters are so well drawn. Peck and Avila both become like each other the more we know about them, their methods, their thoughts and their weaknesses are all similar. It makes it harder to fit everyone into the mould of good guys and bad guys and keeps everything more interesting. The various twists don't always make sense but the film is forceful enough to keep everything moving. Gere is on best form here, playing a character against type he is the embodiment of corruption, deceit and murder. Garcia is also excellent as Raymond, who blends his actions well from good into bad. Metcalfe is excellent as Garcia's partner who may or may not be motivated by the hatred of Gere's macho personae. It's also good to see Baldwin, Travis and Xander Berkley have good roles. Overall this is a dark thriller that blends characters into one mess of corruption in the police. It is an excellent film with great characters.",
         "Richard Gere and Andy Garcia are the two conflicting lead characters in this superlative cop thriller. Garcia plays Raymond Avilla, an Internal Affairs officer who has just started in a new precinct to work with his new partner, Amy Wallace (Laurie Metcalf). His first case leads him to suspect another officer, Dennis Peck (a committed, nasty and brilliant performance form Gere, who has never been better), is involved in illegal activities. Soon after, Peck realises that Avilla is on his trail, and starts to confront him with boasts of how he his going to take his wife, and Avilla punches him. These scenes are great. Avilla is the clean-cut guy and Peck is immoral without any remorse. You really get to despise Peck in the film, he even kills people on the side for money and protects hookers. The film rolls along with a seductive and sensuous flair as Peck meets Avilla's beautiful wife, Kathleen (Nancy Travis), and Avilla thinks she has slept with him. The scene after this where Avilla confronts her in the restaurant is a classic. The film then builds to a gripping final showdown scene. The motif on the video for this movie is ''charming, seductive and deadly'', and I have to agree. It is a gripping, classy and entertaining thriller.",
         "Atmospheric drama about a good cop (Andy Garcia) going after a bad cop (Richard Gere). What sets it apart is the interplay between the two leads. My girlfriend's ex-husband worked on the set during production and she told me that the fight scenes in the film were real. Andy Garcia and Richard Gere really went at it in the elevator. The wounds they had were real, not fake. After filming had been completed, Garcia refused to attend the post-production party. Knowing this, watch the film again. The tension between the two is palpable in just about every scene they're in together. Which makes for a pretty decent movie.",
         "Internal Affairs is a thriller with a lot of nerve. It takes risks, presenting the audience with a grim and violent story of police corruption. It doesn't care if you like it or hate it, just that it does its job of getting under your skin. The main reason the movie is so effective is because of Richard Gere's powerhouse performance. It caught me off guard, since before I saw it I'd always seen him as the hero or love interest, far from the territory he's in here. I'll get more into Gere's performance later, just let me clear up the plot. Gere is Dennis Peck, respected vice cop, father and husband, determined to do the job. Oh, he's also the dirtiest cop on the force. He plants evidence, shoots suspects, sets up his fellow officers, doing it all without a shed of remorse. The hero of the movie is Raymond Avila (Andy Garcia), newly assigned to the Internal Affairs division of the LAPD and a friend of Peck's partner, Van Stretch (Stephen Baldwin). When Stretch introduces Peck and Avila it's obvious they don't like each other. Not getting along becomes an understatement as Avila starts to uncover Peck's corrupt behavior and looks to put a stop to it. But Peck won't go down without a fight, and he'll do whatever he can to keep Internal Affairs off his back. As far as police thrillers go, Internal Affairs is one of the meaner kind. Rather than put us into the normal day of a cop it decides to put us into the normal day of bad cop, a really bad cop. This is a guy who would kill a man for stepping on his shoe. He'd probably kill his family too, and laugh while he was doing it. Think I'm exaggerating? Not so much. Peck is the embodiment of all the bad guys in police thrillers and none of the cops in them. Of all of the actors you could find to play a guy like this, who would have guessed that a likable actor like Richard Gere would ever fit the bill. Does he ever. He gives that kind of against type performance we see a lot from normally good guy actors. We've seen it from Denzel Washington (Training Day), Tom Cruise (Collateral), and Robin Williams (Insomnia) in the past few years. Each of these guys have given performances that have altogether changed how we see them as actors. Gere is no exception here. He seems to be having a blast too, chewing the scenery every chance he gets. He's surrounded by some good supporting work. Andy Garcia gives Avila a kind of determination you'd expect from a guy who's life has been wrecked by a guy like Peck. As his partner, Laurie Metcalf is likable and isn't as wasted as she could have been. But when it all comes down to it, this is Gere's show, and he shines in his only truly villainous role to date. He probably had enough of playing the villain by the time he was done with this movie. That would make sense. After playing a guy like Dennis Peck, any actor would need time off from playing the bad guy. I'd like to see Gere play the bad guy again though, and give us another surprising and terrifically evil performance.",
         "This intelligent and well-directed thriller has some brutal, extremely violent scenes, but what makes you really come closer to the tension created by this original and realistic plot is the psychological confrontation among the two main characters, and Mike Figgis works out on it,settling the battle in the sexual and physical aspects,what is evident in the second meeting of Garcia and Gere:Raymond Avila (Andy Garcia, who develops his role in a silent, but extremely lowering form) is a correct, honest Internal Affairs' agent, and he receives the mission to investigate Dennis Peck (Richard Gere, in what can be easily pointed as his best career's performance), a corrupt,charming and cruel cop who has a lot of ex-wives and sons.The moment in which Peck and Avila are together breaks out an explosive hostility: Peck starts to talk about family, and suddenly touches in a sensitive issue, Avila's wife.Avila doesn't like Peck's provocation, and hits him.The battle is set.This scene is very thrilling and memorable.The sound track and the photography contribute to build a hot and agile rhythm. Internal Affairs is an entertaining and interesting movie, and if you liked Q&A and The French Connection, you will enjoy it!",
         "This is sort of a slow starter, but once moving it goes quite nicely. Wouldn't matter anyway, I'm not really that impatient when it comes to a story I want to see. Figgis, directs this internal-power struggle police story, with a candid view. Mike does a good job of building suspense, then,\"BOOM!\" It explodes in your face. This was also, between the actors, Garcia,(Raymond Avilla) and Gear's Officer Dennis Peck, an odd but interesting match-up. I think that the perfect cat and mouse game was this stories 'pearl'. These two shined along with others that rounded out the casting. There was a certain hatred between both characters that was just right, for the story-liner. It shows, in the story cops relating to spouses and family in stress produced situations as well as the other civil servants that we don't see on a public basis. I thought that the way, this was set and brought to a scorching climax was well met by those that saw the movie. I think that Figgis set out and accomplished what he was looking for here. (***) Well Done.",
         "This movie is one of the most tightly packed white-knuckle nail-biting suspense-thriller I have ever seen. The script and the background music are excellent. Richard Gere is in his top form as the cool-headed negative-lead in this movie. Andy Garcia always surprises me being such a little man in size but having such a heavy screen-personality (not to mention his penetrating eyes). Think of the difference between his roles in \"Ocean's Eleven\" and \"The Untouchables\". I personally admire Nancy Travis not only for her being a stunningly beautiful smart woman (she has the loveliest hair too) but also for her natural gift of acting ability, her throw of words, expression on her face, her movements, the way she carries herself (\"Three Men and a Baby\", \"Three Men and a Little Lady\", \"Running Mates\"). I don't know why she has never been the \"most-demanded\" actress in Hollywood! Laurie Metcalf was a perfect selection as Amy Wallace in this movie. The movie winds up to become a sharp quadruple in the end with these four people. I rate it 9 and ½ out of 10.",
         "The subject here (police corruption) is banal, but it gains extra value and weight by Figgis' atmospheric direction and, especially, by Richard Gere's powerful performance in perhaps his most atypical role (and as far as I know, his only truly villainous one). After watching him in this film, I don't know how some people can still doubt that he's a talented actor as well an attractive star. The rest of the cast is also good. The finale, however, is somewhat disappointing. (**1/2)",
         "A pretty good, early feature from Figgis. It's a thriller but with a unique strain already showing - it's more a war of character and attrition between Garcia and Gere than a straight chase number and broken up with a notable dream sequence (in fact, with this shot in a monochromatic blue and the nature of the film leaning towards existential examination of the leads I can't help but think of the Michael Mann of Manhunter and Heat respectively). Garcia gives a good performance, if perhaps a touch excessively 'Latin' in its swinging between inscrutable and violent. He's well supported by Nancy Travis and particularly Lauire Metcalf - playing a unfussy, unostentatious but unequivocal lesbian. The treat of the show though is Gere. A true A-list performance here, powerfully masculine in its self-assurance, sexual charisma and violence in various states of disguise. A stock film lifted by the agenda of a developing director and a matinée idol. Unsurprising, occasionally laboured but always watchable. 6/10"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Image Organization",
         "Malofilm"
      ],
      "summaries": ["Keen young Raymond Avila joins the Internal Affairs Department of the Los Angeles police. He and partner Amy Wallace are soon looking closely at the activities of cop Dennis Peck whose financial holdings start to suggest something shady. Indeed Peck is involved in any number of dubious or downright criminal activities. He is also devious, a womaniser, and a clever manipulator, and he starts to turn his attention on Avila."],
      "budget": 0
   },
   "movielensId": 7791,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1990-01-12",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Mike Figgis"],
      "runtime": 114,
      "movieId": 7791,
      "title": "Internal Affairs",
      "mpaa": "R",
      "actors": [
         "Richard Gere",
         "Andy García",
         "Laurie Metcalf",
         "Nancy Travis",
         "Elijah Wood",
         "Richard Bradford",
         "William Baldwin",
         "Michael Beach",
         "Faye Grant",
         "John Kapelos",
         "Katherine Borowitz",
         "Annabella Sciorra",
         "Susan Forristal"
      ],
      "imdbMovieId": "0099850",
      "originalTitle": "Internal Affairs",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["tWMzNDEZWgU"],
      "plotSummary": "Keen young Raymold Avila joins the Internal Affairs Department of the Los Angeles police. He and partner Amy Wallace are soon looking closely at the activities of cop Dennis Peck whose financial holdings start to suggest something shady. Indeed Peck is involved in any number of dubious or downright criminal activities. He is also devious, a womaniser, and a clever manipulator, and he starts to turn his attention on Avila.",
      "tmdbMovieId": 11060,
      "avgRating": 3.34945,
      "releaseYear": "1990",
      "numRatings": 362,
      "posterPath": "/j3Lk53GMp0EH9jFBrjd6Y04yyAO.jpg"
   }
}