{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117737",
      "video": false,
      "title": "Stealing Beauty",
      "recommendations": [
         11012,
         23570,
         10497,
         26890,
         24016,
         12723,
         9466,
         24073,
         13241,
         17362,
         41659,
         25636,
         9280,
         62842,
         134413,
         127083,
         98914,
         42595,
         198318,
         40562
      ],
      "backdrop_path": "/tVNupakMv3DjfNfPzn4HLOB72xA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lucy Harmon",
               "gender": 1,
               "credit_id": "52fe45ff9251416c75069a65",
               "name": "Liv Tyler",
               "profile_path": "/jDxaBShnipKE2wvRaHavTtZb0qk.jpg",
               "id": 882,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Diana Grayson",
               "gender": 1,
               "credit_id": "52fe45ff9251416c75069a69",
               "name": "Sinéad Cusack",
               "profile_path": "/r9eWOKN1WtE7RMDAwIhOpMRh3wL.jpg",
               "id": 11281,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alex Parrish",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a6d",
               "name": "Jeremy Irons",
               "profile_path": "/9AWphjIgGX7JjTrwrx3tsTZlUgv.jpg",
               "id": 16940,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Gregory",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a8b",
               "name": "Jason Flemyng",
               "profile_path": "/kzzQoiO3bbi2UeDJL9QtBT5jaQn.jpg",
               "id": 973,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Christopher Fox",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a87",
               "name": "Joseph Fiennes",
               "profile_path": "/qbGRmhRN3f2prrgcTDmBGAa46Qd.jpg",
               "id": 12763,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Carlo Lisca",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a77",
               "name": "Carlo Cecchi",
               "profile_path": "/oIOFKqLJVpE6FFlcYyDOur1HxGl.jpg",
               "id": 96974,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Ian Grayson",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a7b",
               "name": "Donal McCann",
               "profile_path": "/xGjV73QUTFPvNwWSv6R1dNqsMt.jpg",
               "id": 87435,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "M. Guillaume",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a7f",
               "name": "Jean Marais",
               "profile_path": "/2zxltyxOiLDU7p6zgeotMgLV9V2.jpg",
               "id": 9741,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Miranda Fox",
               "gender": 1,
               "credit_id": "52fe45ff9251416c75069a83",
               "name": "Rachel Weisz",
               "profile_path": "/3QbFXeiUzXUVUrJ7fdiCn7A7ReW.jpg",
               "id": 3293,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Chiarella Donati",
               "gender": 0,
               "credit_id": "52fe45ff9251416c75069a8f",
               "name": "Anna Maria Gherardi",
               "profile_path": null,
               "id": 582128,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a93",
               "name": "D.W. Moffett",
               "profile_path": "/l2IZeyX8WrG2SINrXaA1ibQfLLn.jpg",
               "id": 87956,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Osvaldo Donati",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a97",
               "name": "Ignazio Oliva",
               "profile_path": "/6ew2L7cFXwoSFOLOZuNTjcLWr63.jpg",
               "id": 81512,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Noemi",
               "gender": 1,
               "credit_id": "52fe45ff9251416c75069a9b",
               "name": "Stefania Sandrelli",
               "profile_path": "/8KHaSvJ1mwBFMQ4J6r9h3FC4dSU.jpg",
               "id": 34027,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Niccolò Donati",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a9f",
               "name": "Roberto Zibetti",
               "profile_path": "/xoLiBGPduhBJRKAW174r39UDbwT.jpg",
               "id": 263002,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Michele Lisca",
               "gender": 0,
               "credit_id": "52fe45ff9251416c75069aa3",
               "name": "Francesco Siciliano",
               "profile_path": "/nrS0HGtH0j5LRuiQAGH7E9dDqrz.jpg",
               "id": 27203,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Maria",
               "gender": 0,
               "credit_id": "52fe45ff9251416c75069aa7",
               "name": "Mary Jo Sorgani",
               "profile_path": null,
               "id": 582129,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "le Lieutenant",
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069aab",
               "name": "Leonardo Treviglio",
               "profile_path": "/pxpVIWDX7PtClAu7bp6U2nit299.jpg",
               "id": 103181,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Marta",
               "gender": 1,
               "credit_id": "5a9c8f0792514128cc03911c",
               "name": "Alessandra Vanzi",
               "profile_path": "/dqLIO9071mudiYFjKzIUaSaIeMY.jpg",
               "id": 1173638,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069a73",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ff9251416c75069ab1",
               "name": "Susan Minot",
               "profile_path": null,
               "id": 47276,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ff9251416c75069ab7",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55970f649251413d93000259",
               "name": "Darius Khondji",
               "profile_path": "/4UEPDPLbcvpkY2xG6PZM9D149dA.jpg",
               "id": 2240,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.465155,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 14553,
      "vote_count": 138,
      "budget": 0,
      "overview": "Lucy Harmon, an American teenager is arriving in the lush Tuscan countryside to be sculpted by a family friend who lives in a beautiful villa. Lucy visited there four years earlier and exchanged a kiss with an Italian boy with whom she hopes to become reacquainted.",
      "similar": [],
      "original_title": "Stealing Beauty",
      "runtime": 116,
      "poster_path": "/dPaadTDj3OKAQrGZSitnLlWpaUv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
            "name": "Fox Searchlight Pictures",
            "id": 43,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Recorded Picture Company (RPC)",
            "id": 11561,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jeremy Thomas Productions",
            "id": 14698,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fiction Films",
            "id": 20783,
            "origin_country": ""
         }
      ],
      "release_date": "1996-03-29",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The most beautiful place to be is in love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bernardo Bertolucci"],
      "runtime": 118,
      "synopsis": "This is the summer when young Lucy, a 19-year-old American, has decided to lose her virginity. For the summer holidays, she arrives in a beautiful place in Tuscany, a villa on a hilltop owned by an English artist, where she discovers different interesting people of different age at different stages of life, of different commitment, understanding, and sexuality. Her dead mother left Lucy her diary which points out she was conceived on this very hilltop, but doesnt say who her father is; Lucy has to find out. Lucy also wants to give herself to the young Italian, Nicolo, who kissed her four years ago, but she discovers that life is not always what you have decided, especialy when love is concerned, it is not that simple, but it is beautiful. She takes in all this beauty. We all steal beauty from the world. We need it as we live, as we create (the object of the artist, or creating life), as we comply to life, as one's loses one's virginity. Life feeds on stealing beauty, before becoming beauty itself. Lucy has grown up.",
      "writers": [
         "Bernardo Bertolucci",
         "Susan Minot"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117737/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2MTI0MjkwOV5BMl5BanBnXkFtZTcwMDcxMTU1MQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeremy Irons, Liv Tyler, Carlo Cecchi | See full cast and crew »"],
      "reviews": [
         "While Liv Tyler is the \"star\" of this film she is only one facet of a beautiful film. While many comments focus on the coming of age plot line. This film not only presents a sexual beginning, but also an emotional journey. With the death of her poet laureate mother, Lucy (Liv Tyler) must find her way to emotional and sexual adulthood. Fortunately, the film never gets bogged down, or depressing. Set in the lovely Tuscany province, Lucy's father sends her to spend time with friends of her mother and pose for an artist. Several of the characters are transparent, and easily understood, others are far more complex. Like life not all the answers are give, but the film rewards the viewer on multiple levels. Enjoy watching the secondary characters grow in their own ways as well. I hope this helps you.",
         "This is my favorite film. I first saw it in 1996 at the age of 16, and have been relentlessly teased ever since for enjoying it as much as I do. True film buffs, I am told, walked out on this one. I insist though that I don't have bad taste; the film simply struck a chord in me early on, and yes, it was probably because its was such a pretty film. Beauty can be quite a hook. Since then I have watched Stealing Beauty no less than a hundred times, studied Bertolucci's other films, and - of course - listened to the soundtrack, and the Mozart Concerti, so much that I have been known to hum them in my sleep. Now, I know why I love it so much. Every time I watch Stealing Beauty, there is more to discover. The premise - looking for her father/true love - and the apparent conclusion seem no more than a frame work for a hundred different leitmotifs that Bertolucci seems strangely familiar with, fascinated by, and adept at expressing in all of his films.",
         "Some of the most memorable sequences in Stealing Beauty occur in group situations. In one scene, a troupe of family members chat, sketch, and lounge in a sun drenched backyard while the camera follows each member of the family, capturing glimpses of their facial expression and bits of their conversations in what seems to be one endless take. In another scene, the camera pulls a similar track at a large outdoor celebration, this time using a few virtually seamless cuts to cover more territory and more people. These sequences, more than any other in the film, are representative of the essence of Stealing Beauty. The camera flows like a warm summer breeze, blowing through the trees and people, taking us back to your youth while rejuvenating a love for life in the moment. Stealing Beauty is about as solidly structured as such a movement; it has no finite beginning, no middle, and an abrupt end. Like so many great Italian films, it merely flows from one scene to another, defying genre or perhaps even storyline. Few films of the 1990s were so richly cinematic, and it's unlikely that Stealing Beauty would have achieved such a feat had it originated from any other country. With all that having been said, the plot of the movie would seem rather incidental, but it obviously does set up the events of the proceedings. Lucy (Liv Tyler) is an American who travels abroad to Italy to spend the summer with the friends of her recently deceased mother and their own extended family. She houses at their exotic country villa, where the virginal nineteen year old is secretly on a quest to find the identity of her father, convinced that her `father' back home is not a biological parent. While staying in Italy, she comes of age, learning the hard truths about first love, fidelity, innocence, and her budding sexuality. Of course such a succinct plot description lends the impression that this is an American-style loss of innocence drama, and this could not be further from the truth. The film never fully establishes itself in any genre. It is at once a drama, a comedy, a mystery, and a sex film. It is this element that adds to the film's distinctly cinematic flair, a trait that defines Italian cinema. With notable exceptions, Italian films are often (rightly or wrongly) criticized for their emphasis on the role of the director over the importance of actor and screenplay. In the case of Stealing Beauty, the latter is true but the former is not. In what had been heavily hyped as her star-making performance (the film's disappointing critical and commercial reception hampered this prospect), Liv Tyler delivers what thus far remains the finest work of her career. With her pouty lips, big blue eyes and long legs, her unconventional beauty stems from her appearance as a perennial adolescent on the verge of womanhood. Never before-and presumably never again-had this feature about her been so thoroughly exploited by a director. As Lucy, she brings to the screen the perfect mix of gawkiness and confidence, naïveté and overwhelming sexuality; she carries the presence of a femme fatale, full of mystery and fascinating to look at, and yet her heart is always planted firmly on her sleeve. She achieves that rare feat of not simply reciting lines, but speaking them; it's a performance so clearly personal and passionate that one might think we were watching a wholly improvisational film. Yet perhaps the real star of Stealing Beauty is Bernardo Bertolucci. Best known to American audiences for his 1987 epic blockbuster The Last Emperor, Stealing Beauty gave him a chance to go back to his smaller, more intimate roots (previously his best known film was the 1972 soft-core masterpiece Last Tango in Paris) while applying his epic sensibility. He lenses the film in the Cinemascope ratio, but he does not use the frame to capture grand Italian vistas (though several are on display) or masses of people. Instead he frames, in grand style, such tender moments as Lucy's bereavement over the true identity of her first love, or the sun lit walk home from losing her virginity. The film was photographed by Darius Khondji, whose visual sensibility was arguably the most recognizable and influential throughout the late 1990s, and few times in Khondji's career has a director's style worked so beautifully with his images. Much of the action takes place under the golden rays of a burning sun, showcasing a vivid color palette as rich as the fabric of the film itself. Though it takes place in present day, the look of the film lends a distinctly nostalgic overtone to the proceedings, perhaps reminding one of a contemporary, European take on Summer of '42. When released in the summer of 1996, Stealing Beauty was among the most highly anticipated films of the year for fans of art house cinema. There was a tremendous amount of hype surrounding Liv Tyler's \"racy\" lead role. It was believed, at the time, that the film could do for her Tyler in the summer of 96 what Clueless had done for Alicia Silverstone in the summer of 1995 (both had rocketed to fame as a homoerotic duo in the Aerosmith video \"Crazy\"). It was also expected to resuscitate the career of legendary Italian director Bertolucci after the failure of his recent films. Alas, when the film was released it drew mixed reviews and failed to appeal to mainstream filmgoers. Bertolucci's subsequent films were never even released in the United States, and aside from supporting roles in the blockbusters Armageddon and Lord of the Rings: The Fellowship of the Ring, Tyler never jelled into the movie star the way most industry pundits predicted. Nonetheless, the film remains one of the most extraordinary Italian films of the 1990s. Both Bertolucci and Tyler are in top form here, and the film's unique success as a coming-of-age film despite completely defying the mechanics of the genre is an accomplishment in and of itself. Many of the best Italian films demand that you submit yourself completely to the vision of its director for the movie's duration, putting aside whatever standards or prejudices you have previously held true. Make such a commitment to Stealing Beauty, and the film is a smashingly effective work. My Grade : A-",
         "I am a Bertolucci fan, and this film is one of the reasons why. I watch it again and again and never get tired of it. Don't be fooled by the 'losing virginity' theme; this film is about life, and death, and everything that happens in between. It's about what you seek and what you're willing to give up to get it. One of the best things about this film is that every character has a story, and an arc in the film, most of which is given by just one or two lines or shots in the film. For example, near the end of the film, Sinead Cusack's character slumps at the table after having taken an old friend to the hospital, probably for the last time. She says she misses England \"and rain, and milk that goes off\", and says that she's tired of looking after people. Then everyone starts coming in and asking about dinner, and she just gets up and opens the fridge. In less than a minute, we see into her life and character in a way that most films would take at least an act to explore. We even learn a lot about Lucy's mother (Lucy is played by a young Liv Tyler), even though she has died before the beginning of the film and never appears in it except in a photograph (also of Tyler). There is not a flaw in any of the performances. Never do we feel that these are people acting. They just feel like people, interacting, and we always have a feeling of their life leading up to the moments we see them, and they are interesting lives. The location itself is one of the characters, and it is beautifully shot, the colours saturated and rich. It feels like you can touch the stones, smell the air, feel the grass and flagstones beneath your bare feet. If you don't want to go to Tuscany after seeing this film, you are ill or on the wrong medication. The beauty that is being stolen, or that people want to steal, is not just the beauty of the young virgin on the hill, it is the beauty of life, of living, of learning, of looking back and finally giving it all up, knowing it cannot be stolen. I know that some people criticize Bertolucci for his aesthetic, for bringing the beauty out of every moment, even the horrible ones, and I say to those people that they live the life they choose. Finally, there is the soundtrack, which runs from alt-pop to classical to everything in between and works perfectly. It illuminates Lucy's internal reality and is true to the music that a girl of her age would have been listening to at that time, and it also helps set the scene and smooth transitions between scenes. This is a master work by a master director, and one of my favourite films of all time.",
         "When this filmed first came on the scene, there was a lot of critics that downed the intensity of this film... of course their favorite words were pseudoartistic crap. America is not ready for this film. Look at what we embrace in our films: blood, sex, nudity, shock value. America is not ready for a film that sees the attraction towards a 19 year-old as a natural thing. American normalcy sees this as wrong, deceitful, and impure. Bertolucci did not make a film, he reflected humanity through a camera. This film dives into our own psyche seeking the desires to be pure and innocent. Only America would see this as a piece of psycho sexual fantasy into our own pedophiliac desires. Watch it people, there's a substance that you're not used to seeing in everyday flicks.",
         "I just saw this for the first time a little while ago and I thought it was one of the most beautiful films I have seen in a long time. It captures all the aspects of life, the anger, elation, pain, and just being. Liv Tyler was perfect for this movie because she can reach into her soul and bring out this perfect, virginal girl. As I watched the first time, I did not pick up on everything, but the second time around, it was all rising action, leading to the end that amazed me in the innocence and beauty portrayed in the love between two people. I found myself wishing that I was that beautiful girl on a trip to Italy, figuring out my past and controlling my sexuality. I view this film as a work of art because of its perfect portrayal of love and the way it can sneak up behind us when it is standing right in front of us.",
         "This film blew me away. The hurt, love and pain expressed in this movie through the most simple forms of cinematography are amazing. A classical film of life and death, of love and pain. One of Liv Lylers best acting jobs. Again I agree that this is a film that maybe Americans won't really understand. Its very European in the way the individual characters interact. A must see for anyone who demands detail in a film. Its not just a love or romance film. Its about life in its purest form, about peoples imperfections and their desires. It brings out human nature as its over all theme. Once again, it blew me away. I haven't seen a film like this before.",
         "1st watched 10/15/2005, 9 out of 10(Dir-Bernardo Bertolucci): Marvelous coming-of-age story about a young woman named Lucy(played by Liv Tyler), returning to a place where her deceased mother spent a lot of time and rejuvenates some of the relationships she had four years prior while her mother was still alive. Bernardo Bertolucci again masterfully weaves this story in his usual poetically-visual style of directing. You feel like he's given everything he has and more to tell this story. It's told mainly from the main character's point of view, which is amazing in itself, but is possibly why the screenplay was written by a woman, Susan Minot. The story begins as Lucy arrives at her destination with a diary of her late mother's in hand. She reads thru this as a means to get to know her mother better(we get the feeling that she was not as close to her as she would have liked to be). The trip is also a way to explore this by getting to know her from the people who were close to her. The trip was the gift from her father, whom she has never met, and thus begins another search for her. Her virginity is also a hot topic, but mostly from those around her. She had only kissed a boy five years prior when she visited before and is still infatuated with him and hopes he will be the one(if you know what I mean). Since her mother's death she has closed herself up in many ways, and this has been one of them(although she denies this). Every character in this story is full of life in one way or another and seems to know their place in it except Lucy. And that's basically what this story is about. Her self discovery and her finding her place in the history of her family. The Italian landscape provides breathtaking views that Bertolucci takes great advantage of, the modern music blended with classical makes for an awesome soundtrack, and of course the storytelling plays it's way to a wonderful ending that leaves you again wanting to know these people more and more. This is where Bertolucci succeeds so well. His characters are rich and full of stories like real people who are merely here to enjoy their life. What a concept and what a film from a masterful director!!",
         "The movie seemed mostly a brilliant portrayal of director and writer Bertolucci's erotic imagination, expressed in a highly artistic manner though. The picture was somehow very, very soothing towards our eyes and our minds. Lucy, a 19-year-old visits to the country house of Tuscany and becomes enough to light everyone's fire on, be it old writer Alex or young jerk Niccolo. The story centered around everyone's experiences and dreams around her, during her short visit. The ending was expected, but quite enjoyable. It was not the director's intention to offer any surprise. Rather he was to show us a much-known story, described slowly and only told in a different way. Liv Tyler as Lucy was ravishingly beautiful, and Bertolucci used her right. It was basically only her movie, everyone else is minor. Jeremy Irons also acted quite well. Rest of the cast wasn't bad either, except Rachel Weisz. Somehow she didn't quite fit into the whole thing. I would give it 7/10.",
         "The first twenty minutes of this movie had me riveted. The Italian landscape was incredible and upon meeting all the diverse characters, one would think this was the perfect stage for a fine film. But it wasn't. Lucy's search for her father is first pushed on the back burner then brought miraculously to life near the end of the movie. Meanwhile the plot involves the entire house buzzing like old maids about the poor girl's virginity, as if the topic were front page news. But then again Jeremy Irons character said it best: \"Up here on this hill, the only thing we have to talk about is each other\". Hm, maybe so, but the idea quickly becomes dull. Instead of becoming interested in Lucy, the only scenes I found enjoyable involved Miranda and her dim-witted \"boyfriend\". Richard made me laugh so much that I nearly forgave the pointless plot. And I would've been very disappointed were it not for Jeremy Irons and his wonderful character of Alex. Alex's musing, thoughts and expressions made me smile and made me think. (\" 'The incredible frivolity of the dying' You have to allow me a little frivolity\") As far as what Lucy sees in Nicholo or what made her take the plunge with someone she barely knew, baffles me. Take the beautiful cinemetography, interesting characters and mold them in an entirely different way and you've got yourself a much better movie than what was presented. Such potential..wasted *sigh*"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fiction Films",
         "France 2 Cinéma",
         "Jeremy Thomas Productions"
      ],
      "summaries": [
         "After her mother commits suicide, nineteen year old Lucy Harmon travels to Italy to have her picture painted. However, she has other reasons for wanting to go. She wants to renew her acquaintance with Nicolo Donati, a young boy with whom she fell in love on her last visit four years ago. She also is trying tosolve the riddle left in a diary written by her dead mother, Sara.",
         "For 20 years many visitors have come to the villa on an Italian hilltop owned by an English artist. Lucy, a 19-year-old American, was last there four years ago and wants to meet up again with the young Italian who kissed her and corresponded for a while. And she has brought the diary of her late mother filled with enigmatic poems that suggest Lucy was conceived on that hilltop. Lucy wants to find out if Daddy is the Italian war correspondent who wrote to her mother for 20 years. Then again Daddy could be the dying English playwright in residence or the artist who uses a chainsaw on tree trunks for his sculptures. The three, of course, have no idea that Lucy is there to solve a mystery. They, the artist's wife, daughter of that wife and the daughter's American lover are most intrigued by Lucy's virginity.",
         "Lucy Harmon is a 19-year old American girl who is the daughter of poet Sara Harmon. After Sara commits suicide, Lucy travels to Italty and visits her mother's friends, Diana and her husband, Irish artist Ian, where Lucy wants a picture of her painted. Lucy decided to return to Italy to reunite with Nicolo Donati, a Italian boy she once fell in love with four years ago, when she last visited Italy. But reuniting with Nicolo isn't the only reason why Lucy decided to return to Italy, Lucy is on a personal journey, as she sets out to solve a mystery in her Mother's diary and discover who her father is who conceived her 20 years ago. Lucy's journey leads her to befriend Alex, a play-writer who is dying of cancer whom Lucy thinks may be her father or her father could be the artist who makes statutes from trees and sets out to loose her virginity as Diana and her daughter Miranda's boyfriend Richard become intrigued by her."
      ],
      "budget": 0
   },
   "movielensId": 781,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-03-29",
      "dvdReleaseDate": "2002-01-08",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 116,
      "movieId": 781,
      "title": "Stealing Beauty",
      "mpaa": "R",
      "actors": [
         "Liv Tyler",
         "Sinéad Cusack",
         "Jeremy Irons",
         "Jason Flemyng",
         "Joseph Fiennes",
         "Carlo Cecchi",
         "Donal McCann",
         "Jean Marais",
         "Rachel Weisz",
         "Anna Maria Gherardi",
         "D.W. Moffett",
         "Ignazio Oliva",
         "Stefania Sandrelli",
         "Roberto Zibetti",
         "Francesco Siciliano",
         "Mary Jo Sorgani",
         "Leonardo Treviglio"
      ],
      "imdbMovieId": "0117737",
      "originalTitle": "Stealing Beauty",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["SStzlZz6lxc"],
      "plotSummary": "Lucy Harmon, an American teenager is arriving in the lush Tuscan countryside to be sculpted by a family friend who lives in a beautiful villa. Lucy visited there four years earlier and exchanged a kiss with an Italian boy with whom she hopes to become reacquainted.",
      "tmdbMovieId": 14553,
      "avgRating": 3.42647,
      "releaseYear": "1996",
      "numRatings": 2176,
      "posterPath": "/tPSznZ6BybcVtZdrdApVi6lgfoM.jpg"
   }
}