{
   "tmdb": {
      "original_language": "pt",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "brazilian",
            "id": 983
         },
         {
            "name": "peasant",
            "id": 4402
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0059440",
      "video": false,
      "title": "At Midnight I'll Take Your Soul",
      "recommendations": [
         30914,
         82094,
         42793,
         45133,
         31319,
         39986,
         28294,
         62932,
         180879,
         106758,
         19759,
         82576,
         115527,
         119555,
         42715,
         81472,
         38946,
         86682,
         72785,
         88176
      ],
      "backdrop_path": "/ysPdqwbOgjL9J2ayvZVOBu1beQW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Zé do Caixão",
               "gender": 2,
               "credit_id": "52fe444a9251416c9100b7b9",
               "name": "José Mojica Marins",
               "profile_path": "/xuUj0kHGLyWjTLmc7KRFDzv7Axj.jpg",
               "id": 90204,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Terezinha",
               "gender": 0,
               "credit_id": "52fe444a9251416c9100b7bd",
               "name": "Magda Mei",
               "profile_path": null,
               "id": 236269,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Antônio",
               "gender": 0,
               "credit_id": "52fe444a9251416c9100b7c1",
               "name": "Nivaldo Lima",
               "profile_path": null,
               "id": 236270,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lenita",
               "gender": 0,
               "credit_id": "52fe444a9251416c9100b7c5",
               "name": "Valéria Vasquez",
               "profile_path": null,
               "id": 236271,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Rodolfo",
               "gender": 0,
               "credit_id": "52fe444a9251416c9100b7c9",
               "name": "Ilídio Martins Simões",
               "profile_path": null,
               "id": 236272,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "53a7312b0e0a26144200440c",
               "name": "Mario Lima",
               "profile_path": "/zZV1h3JsOXGlvrdDYV5kIVTY3p1.jpg",
               "id": 979037,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444a9251416c9100b7af",
               "name": "José Mojica Marins",
               "profile_path": "/xuUj0kHGLyWjTLmc7KRFDzv7Axj.jpg",
               "id": 90204,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444a9251416c9100b7b5",
               "name": "José Mojica Marins",
               "profile_path": "/xuUj0kHGLyWjTLmc7KRFDzv7Axj.jpg",
               "id": 90204,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a91730dc3a36824f900af5e",
               "name": "Magda Mei",
               "profile_path": null,
               "id": 236269,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a91731b925141417d00a56a",
               "name": "Arildo Iruam",
               "profile_path": null,
               "id": 1984305,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a9173240e0a2616c600b3b0",
               "name": "Geraldo Martins Simões",
               "profile_path": null,
               "id": 1984307,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a91732e0e0a2616c600b3b9",
               "name": "Ilídio Martins Simões",
               "profile_path": null,
               "id": 236272,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a9173370e0a2616cf00aa87",
               "name": "Salatiel Coelho",
               "profile_path": null,
               "id": 1984309,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a917341c3a368251d00a6d8",
               "name": "Herminio Giménez",
               "profile_path": null,
               "id": 1789890,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a91734d925141417a00a65d",
               "name": "Giorgio Attili",
               "profile_path": null,
               "id": 1328530,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a917356c3a368250200adca",
               "name": "Luiz Elias",
               "profile_path": null,
               "id": 1120137,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a917360c3a368251700a422",
               "name": "José Vedovato",
               "profile_path": null,
               "id": 1415441,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a91737ec3a368250200adea",
               "name": "Gilberto Marques",
               "profile_path": null,
               "id": 230270,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a917397925141417d00a5da",
               "name": "Antonio Smith Gomes",
               "profile_path": null,
               "id": 1984312,
               "department": "Sound",
               "job": "Sound Engineer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.309519,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 30913,
      "vote_count": 24,
      "budget": 0,
      "overview": "Coffin Joe terrorizes a small peasant community in his search for the perfect woman to bear him a child.",
      "similar": [
         948,
         60304,
         298312,
         8810,
         10285,
         170,
         2667,
         238636,
         1696,
         24124,
         25155,
         168098,
         2142,
         4771,
         4638,
         769,
         185,
         949,
         205,
         241
      ],
      "original_title": "À Meia Noite Levarei Sua Alma",
      "runtime": 84,
      "poster_path": "/aMdwdEKbHaMQja0nVyFeXRjxnj1.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [],
      "release_date": "1964-11-09",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Trilogia Zé do Caixão",
         "id": 429234,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["José Mojica Marins"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "José Mojica Marins",
         "José Mojica Marins"
      ],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0059440/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0NjgxMzI0N15BMl5BanBnXkFtZTcwNTE1NjEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: José Mojica Marins, Magda Mei, Nivaldo Lima | See full cast and crew »"],
      "reviews": [
         "Ladies and gentlemen, I have the honor to present to you the film debut of Ze de Caixao, better known to his small stateside cult as Coffin Joe. Featuring surprisingly vivid gore, bizarre Nietzschian philosophy, and a budget that would make Roger Corman go \"I can't work with this\", Jose Mojica Marins manages to create an unpolished but memorable cinema experience. He stars as Coffin Joe, an all around jerk who enjoys eating lamb on Good Friday and chopping the hands off folks at the local pub. However, he is going through some personal struggles, as he prowls the city looking for a woman to bear his children. After he kills a girl and than finds out she was pregnant with his child, he really starts to lose it. He curses the heavens and dares them to raise the dead from their graves to enact revenge on him. Bad move. This was the first of the Coffin Joe films, followed by the good but inconsistent \"This Night I Will Possess Your Corpse\" and Marins' masterpiece, the psychedelic \"Awakening of the Beast\". Keep in mind, while some may find the Coffin Joe films fascinating, they are certainly not for everybody. Many will find them slowly paced, boring, and confusing, even if they are fans of Cult / Psychotronic cinema. For the rest of us, he's one of cinema's most fascinating auteurs. With much censorship problems regarding both gore and blasphemous subtexts and budget limitations, its amazing that he managed to get his films made. They are pure guerrilla film-making brilliance. Throughout cinema, there has never been anyone quite like him. He is a mixture between Luis Bunuel, Frederich Neitschze, Alejandro Jodorowsky (who reportedly became inspired to make \"The Holy Mountain\" because of Marins' \"Awakening of the Beast\"), and Roger Cormon. Those interested in his films should definitely start here, as it is his most accessible film. With many b-films and cult films, they're actually not bad films, but in reality they are good films with bad production values. Marins supports this theory completely. (7/10)",
         "I love the idea of Coffin Joe (\"Joseph The Grave\"). I love his output. I love that he has channeled his obsessions into movies about deranged, obsessive characters. I can only admire and respect him. I don't care that his movies are cheap. I don't care that they are slightly inept at times. Ed Wood's movies were cheap and inept, but they were also filled with passion and a neatly formed world view. They are also rich in texture, designed with love and passion, self-contained and mostly set-bound like early Universal and PRC horror films (STRANGLER IN THE SWAMP, for example). Jose Majica Marens is a true original and his movies are like nothing else you have ever seen. He enjoys hurling blasphemy at the Catholic church, he likes beating up hypocrites and his Coffin Joe indulges in random violence, rape, scaring women with spiders and general debauchery. AT MIDNIGHT I'LL TAKE YOUR SOUL has a single-mindedness about it that makes it lovable. Joe wants only one thing -- to find a woman who will bear him a son. Since he's a brutal, loud, angry man, women aren't returning his calls, so he's frustrated. This frustration fuels virtually all of his movies. Meeting Coffin Joe for the first time can be either a confusing, bewildering experience or the start of a beautiful relationship. It was the latter for me.",
         "It's very impressive and ambitious for Jose Mojica Marins to get this project done when he had only 15 cans of negative film stock to start with, 2 of which got stolen leaving him only 13, and not having a main actor so having to play the part himself. Most of locations were indoor sets, except for one outdoor location. Although it may seem like the lack of planning and abrupt decisions could have affected the outcome, it in fact did not. This film has some great work, starting from Jose's performance with his monologues and single take unedited continuous scenes, all the way through the very impressive set and production design and special effects. They actually manually glued glitter on the negative to get that cheap effect of halo around the spirits. I always give credit to people who are willing to get things done no matter what the budget or circumstances. Several hair raising moments make me think that this film must have been really scary for it's time 40 years ago. Overall, this is a brilliant film that is very cinematic and relies on traditional but very effective tricks of the trade to make it work. Almost like a \"the seventh seal\" for horror films.",
         "The Brazilian film \"At Midnight I'll Take Your Soul\" (1963) features a character who is a strong contender for the most hateful, obnoxious, despicable, slimy and loathsome creature in horror movie history. He is Ze do Caixao, a name that, loosely translated from the Portuguese, means Coffin Joe, and he would go on to become a wildly popular figure in Brazilian culture over the years; kind of like an amalgam of Baron Samedi and Freddy Krueger. As played by the film's director, Jose Mojica Marins, Ze is quite unforgettable. Bearded, caped and top hatted, he bullies and browbeats the inhabitants of his small village, and does away with those closest to him, all in his sick pursuit to father a son and continue his bloodline. Perhaps most shocking, in the largely Catholic country of Brazil, he is a taunting atheist, who eats meat on Good Friday and even forces others to do the same! No living person seems able to stand up to Ze. But the unliving...ah, perhaps that's another story.... Filmed on the cheap, this picture still works marvelously, featuring as it does many scenes of casual and brutal violence (wait'll you see what Ze does to his barren mistress), some interesting FX (I love that glittery ghost!), fairly intense acting (especially by Marins and that gypsy witch), and a very freaky score (wails, screams, echo effects, etc.). One scene in particular is very fine; the one in which Ze rails against heaven and hell during a thunderstorm and drunkenly demands that God and all spirits do him harm. Pretty intense stuff. Anyway, that gypsy woman, at the film's beginning, warns us NOT to watch this picture, as it will make us suffer, but I'm glad that I stayed with it. And oh...a modern-day interview with Marins is included on this DVD. If you want to see something REALLY scary, take a look at his fingernails!",
         "In a small town, the creepy and violent gravedigger Zé do Caixão (José Mojica Marins) is feared by the locals. Zé do Caixão lives with Lenita (Valeria Vasquez), who can not deliver a son to him. Obsessed to have a son, Zé do Caixão harasses Terezinha de Oliveira (Magda Mei), who is the fiancée of his friend Antônio de Andrade (Nivaldo Lima) and kills Lenita with a spider simulating an accident. Then he drowns Antônio and rapes Terezinha expecting to have a baby with her. Terezinha commits suicide but does not accuse Zé do Caixão in his letter. When Dr. Rodolfo (Ilídio Martins) decides to request another autopsy of Antônio, Zé do Caixão burns him to death. The inspector Barretos can not prove that Zé do Caixão is the killer, but on the Day of the Dead, the local gypsy warns him that the dead will take his soul to hell. \"À Meia-Noite Levarei Sua Alma\" is a great cult horror movie from the also cult-director José Mojica Marins, a.k.a. Zé do Caixão in Brazil and Coffin Joe overseas. This is a low-budget rough film supported by a good story and performances with passion, dialogs with blasphemy and lots of gore. Further, this film is ahead of time with a very disturbing story for 1964, but recommended only to very specific audience. My vote is eight. Title (Brazil): \"À Meia-Noite Levarei Sua Alma\" (\"At Midnight I Will Take Your Soul\")",
         "This is my first forray into the wonderful world of Coffin Joe, and having read about Marins and his films was still not enough to prepare me. Not because \"At Midnight...\" is a great film by any set of conventional standards; it's a low-budget affair and it looks like it. What really makes it compelling is how passionate it is in all its blackly surreal glory. Coffin Joe (Ze Do Caixao) is the atheist, unscrupulous undertaker of a small, religious community somewhere in Brazil. This set-bound place is more of a (at times too) convenient playground for Marins to explore his dark fantasies than any sort of realistic community. Its inhabitants are mere props to be abused, scoffed and laughed at. A sizeable guy who dares to stand up to him gets whipped in the face. His sole preoccupation is to find a woman worthy to bear him a son and thus \"continue his bloodline\". Coffin Joe strides through this fictional (and perhaps symbolic in Marin's mind) world, mocking the superstitious villagers, defying god, Satan and the dead, sometimes all of them together in a matter of minutes. If \"At Midnight...\" is set apart from every other horror movie of its time, it's because the morbid, macabre imagery (skulls, plastic bats, cobwebs, tarantulas; you know the drill) is undercut by a Nietzche-esquire atheism that bites. At times it's as if the whole movie serves as nothing more than Marins' soapbox, his way of venting against the conservative and religious. How much of what Coffin Joe declares in the film are meant to be serious is anyone's guess. However it's exactly the fact that it works so well on a camp level (like a blasphemous Ed Wood flick) that redeems the film from all heavy-handedness. In that aspect, and as far as what one would expect from an early 60's horror movie, \"At Midnight...\" is both avant-garde in its own micro-budget, often crude but unashamedly enthusiastic way and surrealistic. Mandatory viewing for fans of cult movies and I hear the sequels are better which I'll have to see for myself.",
         "***MAY CONTAIN SPOILERS***(Mild) I saw \"Coffin Joe: At Midnight I'll Take Your Soul\" last Friday (1/12/07) on IFC's new \"Grindhouse\". I have to say that I laughed my ass off through the whole picture. Notbecause it was dumb or not an authentic horror film, I'm sure is was quite frightening in 1964 and probably the first horror film made in Brazil. What was so amusing to me was the character of Coffin Joe,known to the townspeople as \"Ze do Caixao\". Director, writer and star Jose Mojica Marins created one of the most memorable characters that I've ever seen in horror films, or any films for that matter. At the beginning of the film, we are warned by a gypsy fortune teller to leave the theater if you are not sure of your courage, after 2 minutes she says \"too late! it's midnight! stay if you think you are brave!\" The story opens on a Friday night when the Catholic tradition is to abstain from meat, I believe that Brazil is almost exclusively Catholic. So, Coffin Joe being an atheist, sits at his window eating a leg of lamb and laughing as he watches the Catholic precession go by, SO EVIL! Later at the local tavern he forces a local to eat from another leg of lamb. Soon his sins become much larger and murder is just one of them. I loved the camera work, especially the close ups of Joe's eyes with one eyebrow raised. Joe is the town's undertaker, funeral director, and gravedigger all in one, and dresses in a black suit with a cape and a top-hat. Joe/Jose's long curled fingernails (real), complete the picture! I recommend this film to anyone who loves camp or open to the bizarre!",
         "I was scouring the local mass media a/v store when on a cart I saw a title that caught my eye. Shaped like a coffin was this box set sitting with one of his twins. Being a horror fan I couldn't help but be interested (It looked very similar to a Misfits box set some moons ago).The title of this set was simply \"The Coffin Joe Trilogy\". My mind raced back to all those years of Fangoria stockpiled in the back of my mind. I grabbed, I bought and I loved every minute of the set. The first film which ,according to the notes on the inside, is a phenomena in Brazil. The character Coffin Joe is the local cinema boogeyman (ala Fred Krueger)and yet again teaches us that the lack of a budget only stimulates creativity. 8/10",
         "Jose Mojica Marins \"At Midnight I'll Take Your Soul\" is the first horror film shot in Brazil.Coffin Joe(Ze Do Caixao)quickly became a kind of national hero and a star of screen and television.The plot is simple:Marins plays an unholy undertaker who terrorizes a small,religious and conservative Brazilian village.He scoffs at their religion and superstitions and threatens them physically as well.The film is truly atmospheric-there are skeletons,candles,bats,spiders etc.There is also plenty of mildly shocking violence to satisfy fans of grisly horror.Coffin Joe looks very creepy-he dresses in a black suit,black cloak,and black top hat.This wondefully mean and hateful character provided what,at the same time,was the most blasphemous,ugly and sinful motion picture the people of Brazil had ever experienced.So if you're a fan of Mario Bava's Gothic shockers give this film a look.10 out of 10.",
         "(warning - possible spoilers ahead!) I've heard about Coffin Joe (Jose Mojica Marins) for quite some time, but actually getting to SEE his movies hasn't been all that easy. Anyway, I've finally managed to see one, 'At Midnight I'll Take Your Soul', and what a strange movie it is! It might not actually work as horror, but it's fascinating to watch just the same. It appears to have been made on an extremely small budget, and that combined with Marins' twisted worldview makes it quite unlike anything else I've seen. Marins not only directs but stars as Ze, a sadistic gravedigger who is obsessed with having a woman bear his son. He's a violent bully who terrorizes the townsfolk in a small village, and scoffs at religion, even taunting them by the blasphemous act of eating meat on their Holy day. Ze's mistress is barren, so he murders her (using a spider!). He then kills his only friend and rapes his fiancee when she won't comply with his wishes. The sheer nastiness of the Coffin Joe character is unusual. He really is an utter bastard! A local gypsy woman warns him that he will be punished for his sins at midnight. He laughs it off but eventually comes to worry that there might be some truth in her predictions. As it begins to get closer to 12 Ze becomes increasingly agitated. The closing sequences of the movie are striking and extremely memorable. 'At Midnight I'll Take Your Soul' might have been designed as \"just\" a horror movie but its startling imagery pushes it into even weirder territory. Like 'Glen Or Glenda', 'The Tingler' and 'Carnival Of Souls' it's a fantastic exercise in bargain basement surrealism. If you like odd and strange movies you'll love Coffin Joe!"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Indústria Cinematográfica Apolo"],
      "summaries": [
         "In a small town, the creepy and violent gravedigger Zé do Caixão is feared by the locals. Zé do Caixão lives with Lenita, who can not deliver a son to him. Obsessed to have a son, Zé do Caixão harasses Terezinha de Oliveira, who is the fiancée of his friend Antônio de Andrade, and kills Lenita with a spider simulating an accident. Then he drowns Antônio and rapes Terezinha expecting to have a baby with her. Terezinha commits suicide but does not accuse Zé do Caixão in his letter. When Dr. Rodolfo decides to request another autopsy of Antônio, Zé do Caixão burns him to death. The inspector Barretos can not prove that Zé do Caixão is the killer, but on the Day of the Dead, the local gypsy warns him that the dead will take his soul to hell.",
         "A gravedigger prowls the city in search of a female to bear him a son."
      ],
      "budget": 0
   },
   "movielensId": 78157,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "1964-11-09",
      "dvdReleaseDate": "2001-04-03",
      "directors": ["José Mojica Marins"],
      "runtime": 84,
      "movieId": 78157,
      "title": "At Midnight I'll Take Your Soul",
      "mpaa": null,
      "actors": [
         "José Mojica Marins",
         "Magda Mei",
         "Nivaldo Lima",
         "Valéria Vasquez",
         "Ilídio Martins Simões",
         "Mario Lima"
      ],
      "imdbMovieId": "0059440",
      "originalTitle": "À Meia Noite Levarei Sua Alma",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["A78PxCLzv1g"],
      "plotSummary": "Coffin Joe terrorizes a small peasant community in his search for the perfect woman to bear him a child.",
      "tmdbMovieId": 30913,
      "avgRating": 3.1129,
      "releaseYear": "1964",
      "numRatings": 31,
      "posterPath": "/aMdwdEKbHaMQja0nVyFeXRjxnj1.jpg"
   }
}