{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "thin man",
         "id": 173685
      }],
      "imdb_id": "tt0039853",
      "video": false,
      "title": "Song of the Thin Man",
      "recommendations": [
         14594,
         14590,
         14589,
         14588,
         3529,
         26319,
         39871,
         48375,
         82105,
         154877,
         38713,
         20644,
         54494,
         52270,
         55152,
         33049,
         22924,
         43514,
         38721,
         54182
      ],
      "backdrop_path": "/365q5tFlvzT8NaDP4KcWzI66uTM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Nick Charles",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a679",
               "name": "William Powell",
               "profile_path": "/p9RKEHo2m3VPoYPejwFkI7PwqZY.jpg",
               "id": 32428,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nora Charles",
               "gender": 1,
               "credit_id": "52fe46059251416c7506a67d",
               "name": "Myrna Loy",
               "profile_path": "/2CR0ZjUmMWU5F03EVN32vnxkNvB.jpg",
               "id": 13577,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Clarence 'Clinker' Krause",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a6a5",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Nick Charles Jr.",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a6a9",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Tommy Edlon Drake",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a6ad",
               "name": "Phillip Reed",
               "profile_path": "/nLnUY15rwRakxcQVclDwL9Fzg50.jpg",
               "id": 52756,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Phyllis Talbin",
               "gender": 1,
               "credit_id": "52fe46059251416c7506a6b1",
               "name": "Patricia Morison",
               "profile_path": "/2kwmorLL8r59NM7iAkjtcb33zGD.jpg",
               "id": 86104,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mitchell Talbin",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a6b5",
               "name": "Leon Ames",
               "profile_path": "/g9jmaTeVjRlrGEO1MefnoS3uVRK.jpg",
               "id": 13994,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Fran Ledue Page",
               "gender": 1,
               "credit_id": "52fe46059251416c7506a6b9",
               "name": "Gloria Grahame",
               "profile_path": "/f4Y0WcGs4UDwRVFD9XYoDg5pclS.jpg",
               "id": 77081,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Janet Thayar",
               "gender": 1,
               "credit_id": "52fe46059251416c7506a6bd",
               "name": "Jayne Meadows",
               "profile_path": "/ksojQpBzxwfMgrPCZGhMZcBriF.jpg",
               "id": 19415,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "David I. Thayar",
               "gender": 2,
               "credit_id": "52fe46059251416c7506a6c1",
               "name": "Ralph Morgan",
               "profile_path": "/5By4MqjMaQY7aOx1kninnw5331N.jpg",
               "id": 103449,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Jessica Thayar",
               "gender": 1,
               "credit_id": "52fe46059251416c7506a6c5",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Helen Amboy",
               "gender": 1,
               "credit_id": "54155e1a0e0a261c2e0014bd",
               "name": "Marie Windsor",
               "profile_path": "/dy2787JbnskmAt2vjYTjYfFOYRx.jpg",
               "id": 3340,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Buddy Hollis",
               "gender": 2,
               "credit_id": "54155e4f0e0a261c2a00157b",
               "name": "Don Taylor",
               "profile_path": "/ozLWbvtjxMhthQZQpGwpJ5UgZf5.jpg",
               "id": 9108,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Dr. Monolaw",
               "gender": 2,
               "credit_id": "54155e610e0a261c2000155b",
               "name": "Warner Anderson",
               "profile_path": "/qGIbWqzL2cy9RXMIaWwrGi9re86.jpg",
               "id": 89525,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Phil Orval Brant",
               "gender": 2,
               "credit_id": "54155e730e0a261c38001438",
               "name": "Bruce Cowling",
               "profile_path": "/Ag1Gmxb4B2HThp2grId06LIPKn0.jpg",
               "id": 105018,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Bertha",
               "gender": 1,
               "credit_id": "54155e88c3a3684cec00146b",
               "name": "Connie Gilchrist",
               "profile_path": "/hUQSAnW63H5MJDv92YOXRZKmdJw.jpg",
               "id": 87519,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "The Neem",
               "gender": 0,
               "credit_id": "54155e9fc3a3684cf30015b0",
               "name": "Henry Nemo",
               "profile_path": null,
               "id": 1363815,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Al Amboy",
               "gender": 0,
               "credit_id": "54155eafc3a3684d0a0015a9",
               "name": "William Bishop",
               "profile_path": "/8BbUbzAF1gSj4uLF86nBcNNGbWp.jpg",
               "id": 108992,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Mr. Purdy, Hotel Vesta Desk Clerk (uncredited)",
               "gender": 2,
               "credit_id": "54155ec9c3a3684d0a0015ac",
               "name": "Clinton Sundberg",
               "profile_path": "/ird4IaorvWN07a4CBQmy6Xl7oL.jpg",
               "id": 94112,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46059251416c7506a675",
               "name": "Edward Buzzell",
               "profile_path": "/rJIp8s3dQfosC3m8KGzJEhRvLd3.jpg",
               "id": 77101,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46059251416c7506a683",
               "name": "Stanley Roberts",
               "profile_path": null,
               "id": 64116,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe46059251416c7506a689",
               "name": "Dashiell Hammett",
               "profile_path": "/xA6j1V2pVYuO2Wf38FyxIDNNKM4.jpg",
               "id": 5165,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe46059251416c7506a68f",
               "name": "Steve Fisher",
               "profile_path": "/5MXMFUeRZIA98NzDxmBOrDMJlSy.jpg",
               "id": 19408,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46059251416c7506a695",
               "name": "Nat Perrin",
               "profile_path": null,
               "id": 30011,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46059251416c7506a69b",
               "name": "James O'Hanlon",
               "profile_path": null,
               "id": 93689,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe46059251416c7506a6a1",
               "name": "Harry Crane",
               "profile_path": null,
               "id": 149073,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "582931d6c3a368360b0369cd",
               "name": "Charles Rosher",
               "profile_path": null,
               "id": 9080,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ab84c16c3a368179d0032c1",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.801106,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14595,
      "vote_count": 26,
      "budget": 0,
      "overview": "Society sleuths Nick and Nora Charles investigate a murder in a jazz club.",
      "similar": [
         3529,
         14589,
         14588,
         14590,
         14594,
         356835
      ],
      "original_title": "Song of the Thin Man",
      "runtime": 86,
      "poster_path": "/lPHB8erOgYVlUeLBr33ttAtw5H1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1947-08-28",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/2yt8EpI4lobOqyANq9jN6b585zZ.jpg",
         "name": "The Thin Man Collection",
         "id": 47814,
         "poster_path": "/ro4YziSxDdrfON4CDHwNXvblCD1.jpg"
      },
      "tagline": "WILLIAM POWELL and MYRNA LOY and me too. We're all together again in a NEW MGM mystery comedy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edward Buzzell"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Steve Fisher",
         "Nat Perrin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039853/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3MjkxMDU1NF5BMl5BanBnXkFtZTcwNTIxMzE2MQ@@._V1._CR12,19,309,448_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: William Powell, Myrna Loy, Keenan Wynn | See full cast and crew »"],
      "reviews": [
         "Did Nick and Nora's swan song, \"Song Of The Thin Man,\" tries too hard to be hip and cool? Yep. Are some of the bits a tad forced? Yep. Is this, the sixth adventure of Mr. & Mrs. Charles, the worst in the series? Yep. You know what that means? Yes, it means that the worst Thin Man movie is still better than most. For Nick and Nora's final bit of sleuthing and their first in a couple years (since the wonderful Thin Man Goes Home), they enter the ultra-hip, ultra-cool, slanged-out world of jazz, courtesy of their tour guide, reed-man Keenan Wynn, who couldn't put together a sentence of straight Queen's English to save his shoe bottom (soul). Who killed the band leader? All I can say is, it wasn't Nick or Nora or Asta. By 1947, William Powell's waistline has expanded and Myrna Loy long ago gave up the sheer, slinky gowns that had us all drooling, but they can still cut it, rug and all. Were six Thin Man movies enough? Not for me.",
         "While it probably doesn't offer as much as most of the earlier movies in the series, \"Song Of the Thin Man\" is nevertheless a pleasant finale to the classic series. It has the usual blend of wit, oddly assorted characters, and mystery, with a solid supporting cast led by Keenan Wynn. The story uses the now-familiar setup of Nick getting drawn into a mystery against his will. This time, it uses the jazz scene as the backdrop, and while the setting is not always used to its potential, it does allow Wynn some good moments that he makes use of. Wynn usually plays off of Powell and Loy rather well. Most of the rest of the cast does well when they get the chance, and Don Taylor works as a more serious, troubled character who is important to the story. You can tell that they were running out of truly new ideas for the series, yet in another sense the series got an impressive amount of mileage from the format. This last movie may offer little that is new, but it is enjoyable as light entertainment.",
         "Song of the Thin Man is a sad-sweet experience, something like meeting a good friend you haven't seen in years and realizing how much affection you still have for him... but also how much you both have aged. It's been 13 years since The Thin Man appeared in 1934. We have to stop and remember that Nick Charles wasn't the thin man back then; that particular thin man was just one of the many murder victims Nick and Nora came across in their six movies. We remember the sophistication and insouciance of this affectionate and clever couple. They were never at a loss for a quick come-back or to shake a cold, gin martini. Even Nick's modus operandi to bring all the suspects together at the conclusion and pick apart the case until he has the murderer squirming never quite got stale. Alas, with Song of the Thin Man we have the MGM factory squeezing out one more film to try to wring a profit from it, this time attempting to make it \"contemporary\" by setting the story in the post-WWII social world of after-hours jazz clubs, bebop musicians and hep cat dialogue. Nick and Nora never looked uncomfortable anywhere their adventures took them in the past. They look at times now as out of place as salesmen from Peru, Indiana, at a Linda and Cole Porter party. Gone is the sophisticated world of white sofas and polished black floors, of naughty Porter lyrics and earnestly sophisticated Gershwin tunes. Martinis seem oddly old fashioned now (and so do Old Fashioneds) as Nick drinks high balls and Nora sips sherry. And instead of clever repartee, Song of the Thin Man gives us the kind of dialogue only studio journeymen can write. Says one character, \"I must have blown my top, kicking Buddy over for a road company Casanova like you!\" The solution depends on the kind of half-baked, melodramatic psychology popular at the time. To make it even more tedious, there are no characters except Nick and Nora to care about. The movie is peopled with crooks, opportunists, gold- diggers, scat-talking musicians and the unattractive rich. The acting is so variable that it doesn't take long to realize we're watching the kind of movie that MGM did not waste much effort on. Why spend time on it? Two names: William Powell and Myrna Loy. Even though 13 years have elapsed, even though, at 55, Powell is a little fuller around the face (Loy at 42 doesn't seem to have changed a bit) and even though WWII altered decisively the world of films, they remain one of the most refreshing, attractive and delightful movie pairs in screen history. They raise the movie, if at least not to their level, to a level of enduring affection for their style, their warmth, their intelligence and, that word again, their insouciance. So three stars is too much for the movie but five stars is too little for them.",
         "This is not quite a great movie,perhaps; but of all the \"Thin Man\" series'entries that starred capable William Powell and mature and lovely Myrna Loy, arguably this is the best mystery of all. It is also unfortunately true that having saddled the fun-loving Charleses, Nick and Nora, with Little Nicky, the same error committed in the Tarzan series, this series' executives discovered the young fellow, admirably played by Dean Stockwell, was crimping the thirties' breezy and boozy style of their very stylish duo. So this was the final entry of a long-lasting and frequently delightful set of entries. The storyline for this one is particularly strong, as are the dialogue and characters, in my judgment. Steve Fisher and Nat Perrin wrote the strong screenplay with additional dialogue by James O'Hanlon and Harry Crane. The story was by Stanley Roberts. The main narrative concerns musicians and socialites, and how badly they mix in this 'case'. The corpse is an obnoxious bandleader, who is killed while leading his aggregation aboard a gambling ship that operates outside the 'three-mile limit\". Nick Charles, retired New York detective refuses to become involved here; then he is shot at, involved in the case up to his ears, menaced, lied to, frustrated by police, instructed in bee bop music, and finally left alone and also aided by his wife long enough to solve the murder and clear the innocent. In this excellent cast along with Powell and Loy are Keenan Wynn as a likable musician nicknamed \"Clinker\", Don Taylor as a lovesick musician with mental problems, Leon Ames and Patricia Morison as dynamic and mismatched couple, Jayne Meadows and William Bishop, Gloria Grahame, Ralph Morgan, Warner Anderson, Connie Gilchrist, Marie Windsor. Bess Flowers who is somewhat inadequate both as a singer and an actress is also featured. The best scenes in this directorial effort by Edward Buzzell are Nick's evading of police surveillance to row out and search the gambling ship with his dog Asta after the murder, the early shipboard scenes, the visits Nick and later Nora and Nick make to various locales to question people and the final showdown scene. In this one, Patricia Morison wears a stunning black evening gown, and is given something important to do in the events at last--as she shoots the man who was the murderer of the heel bandleader that she really loved, and not just another plausible suspect... This is a very attractive MGM film to boot. The sets by Edwin Willis, art direction by Cedric Gibbons and Randall Duell, Sydney Guilaroff's hairstyles and Irene's gowns are major assets to a creation of the the \"look\" of a good 1940s mystery entry. Exceptional for its characters, and for its band, its wealthy folk, and its shady gambling circles' setting.",
         "Good mystery comedy movie that was certainly carried by the lead stars.The production was average and the script was not as good as the previous THIN MAN films.Still delivers the basics of the genre though so if you are a fan of the THIN MAN films or a big fan of comedy mysteries or a big fan of the lead stars here,you will like this movie......",
         "It may be mediocre, small-time fare, but it's also an excellent example of studio filmmaking from the 40s. In the last of the Thin Man movies, Nick (William Powell) and Nora (Myrna Loy) solve a murder (again), this time concerning a jazz bandleader (I think; the plot was kind of confusing). The dialogue isn't as sharp as in the other movies, and Dean Stockwell as Nick Jr. is cloying (although he was far worse in Anchors Aweigh). Keenan Wynn is fun as a jazz \"insider\" who \"jams\"; the outdated language in this movie is unbelievable. This is also wholesale propaganda: all the jazz players in the movie are either drunk or unpleasant, or both, thereby reinforcing the wholesome American family. As Janet, Jayne Meadows looks EXACTLY like Donna on Twin Peaks. Intentional or not? Compelling enough reason to watch this movie (the other reason is a bizarre sequence in which William Powell remembers his son growing up while his memories are projected onto the boy's butt).",
         "William Powell and Myrna Loy conclude an entertaining series with a so-so film that just happens to be packed with some great 1940's jazz. Much of the quick wit we've come to expect from Nick and Nora just isn't here with the exception of Nora's \"Mr. Charles is a bit of a schmoe\" remark. In many of the earlier Thin Mans, Nick and Nora both seemed to thrive when they encountered a murder mystery and when they drank quite a bit, which became less and less as the series continued. Unfortunately, the humor which had centered around their (especially Nick's) vices, drinking, gambling, flirting, etc., was replaced with parental humor. The scene where Nora becomes a disciplinarian and insists that a reluctant Nick give a spanking to Nick, Jr. just wasn't the humor we'd become accustomed to and was difficult to observe. It was obvious that Nick and Nora had entered a more mature phase of life, but in the movies that doesn't usually make for better comedy. POSSIBLE SPOILER: It is also hard to believe that someone who had been committed because he had been made to believe that he was the killer, and rehabilitated by being made to believe that the murder never happened was brought back to give a concert and then announce who the killer was after the concert. Despite all of this, I did enjoy the film. I think it was mainly because of the jazz (in the words of Klinker \"Love it! Love it!)and the nightclub and jam scenes. I wish I had been around when that music was popular. I also liked the fact that there weren't any stereotypical pathetically helpless female characters in the supporting cast, unlike the first four Thin Mans. While this is one of the weaker Thin Mans(this and Another Thin Man, while After the Thin Man and the original Thin Man are the best), I cannot imagine that this series would have been like without William Powell, Myrna Loy, and Asta (I think there was a new Asta for this last film). No one today could even come close. In honor of Nick and Nora, 6 martinis out 10 for Song of the Thin Man.",
         "It was inevitable that \"The Thin Man\" series would run out of steam eventually and this last entry is probably why both Powell and Loy never made another one. The background for this mystery is a gambling boat with jazz musicians giving the film a very dated look because of all the jive talk, circa 1940s. And as usual, there are more suspects than there are murders, with Asta and Mrs. Charles trying to help Nick solve the crime. MGM spared no expense in giving the film a glossy, polished look and a sparkling supporting cast--PATRICIA MORISON, LEON AMES, GLORIA GRAHAME, KEENAN WYNN, DEAN STOCKWELL (then 11) and PHILIP REED. The problem is the usual flaw in these Nick and Nora mysteries--the viewer never gets enough clues to solve the crime along with the two sleuths. You're just along for the ride as the two deal with a host of unpleasant characters, among whom is a murderer who invariably slips up in time for Nick to solve the crime. Summing up: Good chemistry between Loy and Powell is still there, but they get little help from a tiresome script.",
         "What started with a bang in The Thin Man sadly ends in something of a whimper in Song of the Thin Man. By 1947, William Powell and Myrna Loy had become a little too long in the tooth to portray the dashing, urbane mystery solving couple. Both still do a good job, but I always picture Nick and Nora a little younger. The writing is not up to the standard set by the first three Thin Man films. It often seems more like what you would find in a cheap Monogram Charlie Chan film. I'll always argue that the writing in this series as a whole really suffered with the departure of Dashiell Hammett. And, with a child at home, the jokes centered on Nick's drinking seem out of place and not as funny. So how can I rate a movie a 6/10 if I see so many problems with it? The faults I point out are found when comparing Song of the Thin Man with the other movies in the series. On it's own, it's an enjoyable enough movie, just not the best I've ever seen. But when compared with the previous five films, it fails. Still, we're talking Powell and Loy, my all-time favorite movie couple, so a 6/10 seems about right.",
         "William Powell was 55 and Myrna Loy 42 when Song of the Thin Man came out to box office that was not as good as the previous five entries. MGM thought they were getting too old for the roles and they and the stars called a halt to this most acclaimed of film series. I think they carried their parts off well myself. I think the problem was that this last one was too violent. Myrna Loy is almost killed by one of the suspects and the final unmasking of the villain was very violent, not at all in keeping with the usual lightheartedness that characterized the Thin Man series. I think the audience rejected it for that reason. A bandleader, Phillip Reed, is murdered on board a gambling ship and later on the band's vocalist Gloria Grahame is also killed. The usual array of suspects is on hand for Bill Powell to sift through and expose. Song of the Thin Man has Dean Stockwell as their young son, Nick Charles, Jr. and Powell and Loy get a sidekick in the form of sideman saxophonist Keenan Wynn. If the series had kept going, Wynn might have become a regular. Though it's not as good as the five previous entries, Song of the Thin Man is good one for this series to go out on."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Musical",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Nick and Nora Charles are asked by Phil Brant and Janet Thayar, who have just eloped, to help them after band leader Tommy Drake is killed at a society dance which Nick and Nora also attended. The police are looking to arrest Brant for the murder and while he claims he's innocent, Nick isn't too keen on having him in the house and turns him over to the police. As they look into the case, Nick and Nora learn that Drake wasn't very well liked and there are actually several people who benefited from his death. Drake owed money to loan shark Al Amboy, and Janet's father disliked Brant and may have set him up. Drake's girlfriend may have been having a fling with clarinetist Buddy Hollis, and he and Drake had a fist fight on stage during the festivities. Nick arranges for another party on the same boat where Nora notices something quite peculiar about one of the guest's jewelry.",
         "Nick and Nora Charles are attending a charity benefit aboard a gambling ship. The festive atmosphere conceals many tensions among those connected with the ship, with most of the friction centering around Tommy Drake, its unpopular, spiteful band-leader. When he is murdered later that night, suspicion falls on Phil Brant, who had argued with Drake earlier in the evening. When Phil and his wife seek help from Nick and Nora, Nick refuses to get involved. But when shots are fired outside his own apartment, Nick begins to investigate, and he soon finds himself in a confusing case with numerous suspects.",
         "Nick, Nora, and Nick Jr. investigate the murder of a band leader in New York."
      ],
      "budget": 0
   },
   "movielensId": 7835,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-08-28",
      "dvdReleaseDate": "2005-08-02",
      "directors": ["Edward Buzzell"],
      "runtime": 86,
      "movieId": 7835,
      "title": "Song of the Thin Man",
      "mpaa": "",
      "actors": [
         "William Powell",
         "Myrna Loy",
         "Keenan Wynn",
         "Dean Stockwell",
         "Phillip Reed",
         "Patricia Morison",
         "Leon Ames",
         "Gloria Grahame",
         "Jayne Meadows",
         "Ralph Morgan",
         "Bess Flowers",
         "Marie Windsor",
         "Don Taylor",
         "Warner Anderson",
         "Bruce Cowling",
         "Connie Gilchrist",
         "Henry Nemo",
         "William Bishop",
         "Clinton Sundberg"
      ],
      "imdbMovieId": "0039853",
      "originalTitle": "Song of the Thin Man",
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["9dvYCDEV2SI"],
      "plotSummary": "Society sleuths Nick and Nora Charles investigate a murder in a jazz club.",
      "tmdbMovieId": 14595,
      "avgRating": 3.75648,
      "releaseYear": "1947",
      "numRatings": 193,
      "posterPath": "/lPHB8erOgYVlUeLBr33ttAtw5H1.jpg"
   }
}