{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0887745",
      "video": false,
      "title": "How About You...",
      "recommendations": [
         76996,
         4820,
         11910
      ],
      "backdrop_path": "/5qylKMx5V0htX18lZQEKdOlAuup.jpg",
      "revenue": 706000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Georgia Platts",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1dd",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Heather Nightingale",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1e1",
               "name": "Brenda Fricker",
               "profile_path": "/z2ARJBvxE1mCwQ6XARTKvvPQySu.jpg",
               "id": 18345,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Donald Vanston",
               "gender": 2,
               "credit_id": "52fe45b8c3a368484e06b1eb",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Ellie Harris",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1ef",
               "name": "Hayley Atwell",
               "profile_path": "/mUp8PkCiIvtiFb4tOzMVtowEJBt.jpg",
               "id": 39459,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Kate Harris",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1f3",
               "name": "Orla Brady",
               "profile_path": "/3vZtTc5wlM23ClWKuPvaYS3DVj7.jpg",
               "id": 107734,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "William",
               "gender": 0,
               "credit_id": "52fe45b8c3a368484e06b1f7",
               "name": "Kevin Flood",
               "profile_path": null,
               "id": 189385,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Alice Peterson",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1fb",
               "name": "Joan O'Hara",
               "profile_path": null,
               "id": 560121,
               "order": 6
            },
            {
               "cast_id": 1009,
               "character": "Hazel Nightingale",
               "gender": 1,
               "credit_id": "52fe45b8c3a368484e06b1ff",
               "name": "Imelda Staunton",
               "profile_path": "/mKlkh0AuYPD5HjmnlrW0uPm5QvJ.jpg",
               "id": 11356,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45b8c3a368484e06b1d9",
               "name": "Anthony Byrne",
               "profile_path": null,
               "id": 233263,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b8c3a368484e06b1e7",
               "name": "Maeve Binchy",
               "profile_path": null,
               "id": 33387,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.084499,
      "production_countries": [{
         "iso_3166_1": "IE",
         "name": "Ireland"
      }],
      "id": 28871,
      "vote_count": 16,
      "budget": 9000000,
      "overview": "The story of Ellie, a young woman left in charge of the residential home run by her older sister, over the Christmas period. Whilst most of the residents have left to spend the festive period with their families, four residents, known as 'the hardcore' remain. Their behavior is so terrible that the home faces closure as potential new residents are put off by their appalling ant",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         4638,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241
      ],
      "original_title": "How About You...",
      "runtime": 100,
      "poster_path": "/ifgotVkxST5iZIqTtlQTDHG2O7v.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-11-16",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Anthony Byrne"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Maeve Binchy",
         "Jean Pasley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0887745/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2NjI2MjgwMl5BMl5BanBnXkFtZTcwMjMyNTY1Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joss Ackland, Hayley Atwell, Orla Brady | See full cast and crew »"],
      "reviews": [
         "The lonely souls that are forced to live in places like Woodlands, one imagines would be more attuned to bonding with peers and form long time friendships with similar folks in their own circumstances. Alas, the people in this lovely Irish senior center appear to be mean spirited individuals at the end of their lives. The lead bitter existences as they have no interest in mingling with people they clearly abhor. We come into this milieu where a four of the residents don't have a place where to spend Christmas. It is Ellie, the young sister of the woman that runs the place to stay behind to take care of this quartet. When she doesn't get anywhere with them, she lets them all know how she feels about their rudeness and ill manners. Instead of angering them, she rouses them up and make them come to their senses. The foursome consists of Donald, the retired judge, who must have things his way. Georgia, the former showgirl who loves her martinis in a certain way. The bickering sisters Heather and Hazel Nightingale complete the group. When Ellie explodes and tells them truths they haven't heard in a while, they wake up to reality. Thus, for the Christmas dinner, Ellie decides to take the residents to a nearby town to get the ingredients. Together, they will have a great time and come together in ways no one even thought possible. Anthony Byrne directed the film, which is based on a Mave Benchley short story. He couldn't have asked for a better cast, Vanessa Redgrave, Joss Ackland, Imelda Staunton and Brenda Flicker are seen in the major parts. They are joined by Hayley Atwell who is perfect for the role of Ellie. This film will appeal to audiences of a certain age who will appreciate the nuances in the story and will certainly enjoy the magnificent cast chosen to bring it to life.",
         "'How About You' is one of those \"feel good\" films from Ireland (just to let everybody know that we're not just a bunch of gloomy,depressed sods that like a good cry). Anthony Byrne directs a crackerjack cast of seasoned veterans,including Vanessa Redgrave as an over the hill actress (or so she claims),Joss Ackland as a retired judge who's chronic alcoholism brought his career crashing down early,and a cast of other fine actors & actresses playing the residents of a nursing home in the beautiful Irish countryside (filmed mostly in County Wicklow). The story concerns a young woman,who arrives at her older sister's nursing home in need of a place to live & work. As she arrives around Christmas time,most of the residents have already gone home to family, except for a scant handful miserable,cranky residents,who are nick named by the staff as \"the hard core\". Hayley Atwell shines as Ellie, the obviously pretty,young face,among the resident batch of sour balls, who refuses to put up with their b.s. This film reminded me a lot of the British comedy,'Experience Preferred,But Not Necessary' (which was also about a young lass who goes to work for a Summer holiday resort in the English seaside coast). If you like a light,refreshing,breezy comedy that will make you smile as you exit,then 'How About You',from 2007 may just be your cup of tea. Not rated,but contains profanity & drug humour.",
         "I saw this last month at the 2008 Palm Springs International Film Festival where it was among the 10 films selected as Audience Favorites. It features a great cast of seasoned stage and film veterans as a group of nursing home residents not fondly referred to as \"The Hardcore.\" Well, it isn't actually a nursing home but a posh assisted living retirement home in Ireland's lovely Wicklow area. Kate Harris (Orla Brady) runs the retirement home that she started out of an old estate she bought. Her younger college dropout sister Ellie (Hayley Atwell) needs a place to live for a while so she has moved in to work as a staff member. Christmas is a time where most of the residents leave to spend time at the homes of family members except for a group of four. This dysfunctional bunch cause a lot of problems and keep the home from full residency because potential residents refuse to live under the same roof as them. Donald Vanston (Joss Ackland) was a judge whose alcoholic lifestyle forced him off the bench. Georgia Platts (Vanessa Redgrave) was once a glamorous stage and screen star who has chosen to drop out of society. Hazel Nightengale (Imelda Staunton) and her sister Heather (Brenda Fricker) are two spinster sisters who can't cope with life. Hazel is only 50 and doesn't even belong in a retirement home but can't live away from her domineering older sister Heather. Kate is suddenly called away as Christmas approaches and Ellie is left in charge of the gang of four as all the other residents and staff have left for their Christmas vacations. Additional supporting roles are the late Joan O'Hara in her final screen role as Alice Peterson, Elizabeth Moynihan as the stern Nurse Healey and Darragh Kelly as Mr. Evans, the government's mean retirement home inspector who would like to see the home shut down. Anthony Byrne directs. Jean Pasley adapts the screenplay from a short story by popular Irish writer Maeve Binchy. Veteran cameraman Des Whelan is cinematographer. Nial Byrne provided the music score. This is a good film and it's premise and cast naturally appeals to an older audience but the role of Ellie keeps things pretty hip. I would give this an 8.5 out of 10 and recommend it.",
         "A story of four spiteful nursing home residents spending Christmas with a young hippie type of girl as their caregiver. This overlooked holiday movie gives us some fairly memorable characters, sort of like Grumpy Old People who are stuck in a nursing home during Christmas. The young, pothead caregiver watching over them goes from apathetic to ticked off when they pull their curmudgeon routines on her. The acting is good, atmosphere and cinematography are spot on, the whole production is as good as any large budget feature. The characters get developed during the movie, from the young girl learning to live her own life and accept some responsibility, to the old folks who learn that they can live a little while they are waiting to die. There's a lot to like in this movie. It has some genuine holiday spirit and a decent ending. It's hard to say why more people haven't seen it because it is worth watching.",
         "I really found this story touching and heart warming; every actor is confident and seems to be suitable for the setting and ambiance. Joan O'Hara's role, as Alice - a woman on the verge of death - is probably the more moving but Hayley Atwell as well is truly confident and easy going. Overall the mood and atmosphere are lighter than expected, with humor and also some energetic parts. The beauty of the countryside and an intelligent music choice add a gentle touch to the earnestness of the characters; there are also many lyrical moments and a lively ending. Nevertheless I'd say that heartfelt performances are the best of the movie.",
         "Grand, luxurious country squire manor turned into ritzy nursing home. Beautiful gardens, pristine river, chintzy comfortable rooms, and yet not much peace nor content. The old age is hard enough without endless regrets, ruminations on missed opportunities, and so many memories colored with dark tinges of grief. So, in this pleasant, overly sweet, albeit very enjoyable truffle of a movie, comes young rebellious women and with a bit of attention, a dollop of booze and an occasional joint, turns around few difficult residents played by masters of British acting. Of course, none of this makes any sense. But, we don't always need to be hit on a head with the truncheon of reality. It is nice to, for a split second, believe in a possibility of redemption.",
         "Greetings again from the darkness. Based on a short story by Maeve Binchy, this film is prevented from going too deeply thanks to the TV direction of Anthony Byrne. This one really has the feel and pace of a Hallmark Movie of the Week ... only with a really nice cast. Hayley Atwell (The Duchess) plays Elle, the black sheep of the family, who shows up unannounced at the private retirement center her big sis owns. The home is struggling due to the rude behavior exhibited by four of the residents played by Brenda Fricker and Imelda Staunton (as sisters), Vanessa Redgrave (a former performer who longs for the spotlight again) and grumpy, lonely widower Joss Ackland (from the EverReady Bunny commercials, and for his line \"Diplomatic Immunity\" in Lethal Weapon 2). These four don't much like each other and certainly don't care for any others. Until ... you guessed it ... Elle reminds them what living is all about. Must also mention a terrific supporting turn by Joan O'Hara, who brings a little wisdom and a twinkle in the eye to Elle. Sadly Ms. O'Hara passed not long after filming. I really thought Ms. Staunton stood out for her interesting portrayal of the co-dependent sister with a dark family secret. Well, at least it is dark for this film, which again, just doesn't dig too deeply into anything. A message film with the simple message that loneliness should be avoided and don't stop living until you have taken your last breath. The title song is played at least 3 different ways in the film.",
         "How About You is an uplifting little film about human interaction, but shouldn't be taken too seriously. The film centres on the relationship between a young girl left in charge of an old people's home run by her sister. Sweet, funny moments occur, although many are predictable and overdone. The characters transform themselves far too swiftly, so the film loses in credibility. It is, nonetheless, a pleasant watch and an agreeable alternative to typical American romantic comedies. Redgrave and Staunton deliver excellent performances as usual, but this film definitely wasn't a challenge to either. Atwell (the younger sister) was very much lacking in subtlety, although the fault may lie with the director or writer rather than the actress. How About You should be watched as a fun way to wind down the day, but not as an example of Vanessa Redgrave and Imelda Staunton showing what they're truly capable of. (Please take the time to say whether or not you found this review useful. Thanks.)",
         "\"How About You...\" brings together some brilliant actors to perform in a movie that is unworthy of any of them -- a Christmas fantasy about a group of ill-natured and demanding residents of a nursing home who are transformed into a loving family by a young woman who is left in charge of the place when her older sister makes an emergency trip to take care of their mother. Vanessa Redgrave and Imelda Staunton are the best known of the featured players in this movie: Redgrave as Georgia, an elderly but still beautiful former stage star, and Staunton as Hazel Nightingale, a talented artist living under the loving but oppressive supervision of her older sister. But that isn't the end of the talent. Hayley Atwell as Ellie, the trans-formative sister, and Orla Brady as Kate, the careworn elder sister, Joss Ackland as a former judge with demanding ways and a nasty temperament, and Brenda Fricker as Heather Nightingale, Hazel's older sister, all display considerable talent. But the plot is treacly and the execution is worse. I really felt sorry for the actors who deserved a lot better from the scriptwriter and the director. I haven't read the original short story by Maeve Binchy, but having seen the movie I certainly don't want to.",
         "This was one of those stories where you got a hunch about the direction in which it was heading within 10 minutes of the start, and your hunch was never proved wrong. Maybe a few wobbles, but nevertheless, it remained on track throughout. So this was why I could sit back and notice every tiny detail cropping up, and I can very well claim that the execution was near faultless. So, what the hell if the story's predictable ? There's something beyond plot that impresses you in a movie and this one came out in flying colors there. The lines were perfect and they were delivered with just the right punch. The four \"hardcores\" let their character transformation seep in, in just the right measures, and hence the ride never seemed jerky. The editing was so crisp that just when you started seeing the danger signal and was anxious lest the movie might start dragging, the story went on to the next step. At just the right time. The tears and sentiments just stopped short at the point where you might feel it might overflow. In all, I think they ran the risk of boring the audience by taking on a story that went on a monotonic path and being well aware of this, they left nothing unturned to nullify that risk. But, it's the message behind the movie that moved me the most. For those who dread the days when they would grow old and begin to drag their dysfunctional existence, this was the movie to watch. Life does not give us the cold shoulders once we start aging, it's we who choose to go into a selfish cocoon at this time of the day ---this was a message that could do with a lot of repeating. Thus, to conclude, the bottom line is that ---Dear Mr. Prospective Viewer, please do not go into this movie expecting something vigorously original, just sit back and try to listen to what the movie has to offer: there's pieces of information there that might just come out handy."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Beyond Films",
         "Ferndale Films",
         "Head Gear Films"
      ],
      "summaries": ["HOW ABOUT YOU tells the story of Ellie, a young woman left in charge of the residential home run by her older sister, over the Christmas period. Whilst most of the residents have left to spend the festive period with their families, four residents, known as 'the hardcore' remain. Their behavior is so terrible that the home faces closure as potential new residents are put off by their appalling antics."],
      "budget": 9000000
   },
   "movielensId": 78422,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-11-16",
      "dvdReleaseDate": "2008-12-02",
      "directors": ["Anthony Byrne"],
      "runtime": 100,
      "movieId": 78422,
      "title": "How About You...",
      "mpaa": "",
      "actors": [
         "Vanessa Redgrave",
         "Brenda Fricker",
         "Joss Ackland",
         "Hayley Atwell",
         "Orla Brady",
         "Kevin Flood",
         "Joan O'Hara",
         "Imelda Staunton"
      ],
      "imdbMovieId": "0887745",
      "originalTitle": "How About You...",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["bsYjorAb5gk"],
      "plotSummary": "The story of Ellie, a young woman left in charge of the residential home run by her older sister, over the Christmas period. Whilst most of the residents have left to spend the festive period with their families, four residents, known as 'the hardcore' remain. Their behavior is so terrible that the home faces closure as potential new residents are put off by their appalling ant",
      "tmdbMovieId": 28871,
      "avgRating": 3.40909,
      "releaseYear": "2007",
      "numRatings": 11,
      "posterPath": "/ifgotVkxST5iZIqTtlQTDHG2O7v.jpg"
   }
}