{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fraud",
            "id": 4373
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "online lying",
            "id": 220698
         },
         {
            "name": "connect to real life",
            "id": 220699
         }
      ],
      "imdb_id": "tt1370889",
      "video": false,
      "title": "Talhotblond",
      "recommendations": [
         192738,
         26336,
         115189,
         45115,
         62800,
         238997,
         30817,
         124067,
         68363,
         241619,
         287940,
         302694,
         69480,
         191137,
         9695,
         13574,
         42918,
         25690,
         46222,
         211952
      ],
      "backdrop_path": "/x3AfU6egsEHYPdqQ7yOa4nY0nE1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47079251416c91067cd3",
               "name": "Barbara Schroeder",
               "profile_path": null,
               "id": 1037122,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "551c1259c3a3681f390000f5",
               "name": "Barbara Schroeder",
               "profile_path": null,
               "id": 1037122,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "551c128292514146b10000a9",
               "name": "Pat Lalama",
               "profile_path": null,
               "id": 179953,
               "department": "Crew",
               "job": "Additional Writing"
            },
            {
               "gender": 0,
               "credit_id": "551c128e92514146b50000cc",
               "name": "Glenn Boozan",
               "profile_path": null,
               "id": 1040746,
               "department": "Crew",
               "job": "Additional Writing"
            },
            {
               "gender": 0,
               "credit_id": "551c12adc3a3681f430000cf",
               "name": "Barbara Schroeder",
               "profile_path": null,
               "id": 1037122,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.574685,
      "production_countries": [],
      "id": 39246,
      "vote_count": 28,
      "budget": 0,
      "overview": "This is the true story of a love triangle that takes place entirely online. Lies lead to murder in real life, as a teenage vixen (screen name 'talhotblond') lures men into her web. Revealing a shocking true crime story that shows the Internet's power to unleash our most dangerous fantasies.",
      "similar": [
         258480,
         244772,
         401898,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         297762,
         242224,
         27586,
         370663,
         43923,
         540,
         152532,
         40807,
         4995
      ],
      "original_title": "Talhotblond",
      "runtime": 83,
      "poster_path": "/kHi03CxFAfmYE0wsZJMVgWQzU0G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2009-02-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barbara Schroeder"],
      "runtime": 83,
      "synopsis": "When upstate NY, married factory worker Thomas Montgomery started playing games online, he got a lot more than he signed up for. A beautiful 18-year-old teenager named Jessica, screen name talhotblond, texted him hello, and he was hooked. But in order to keep her attention, he lied and pretended to be a buff, brave 18 year old soldier, screen name marinesniper. The online romance was epic, but the fantasy blew up when the teenager found out who Montgomery really was. For revenge, she starts up an online affair with one of Montgomery's co-workers, who's 22 and telling the truth about who he is. The teenage vixen pits both men against each other, plays wicked mind games with them, and raises the levels of desire and deceit until the games escalate into real life murder. But even then, the story is not yet over, as the truth about talhotblond herself starts to come out... Talhotblond is a documentary about the real life murder of 22-year-old Brian Barrett and contains interviews with the actual people involved: Montgomery himself, the lead prosecutor at his trial, a clinical psychologist who testified as an expert witness, Barrett's parents and Jessica's father. The only actor in the documentary is Steve Clement, who narrates a fictionalized dialogue from the deceased Barrett's point of view.",
      "writers": [
         "Barbara Schroeder",
         "Pat Lalama"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1370889/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwMzUyNDYzNl5BMl5BanBnXkFtZTcwNzUxMjM1Mg@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Clement, Thomas Montgomery, Ken Case | See full cast and crew »"],
      "reviews": [
         "Love it or hate it, this documentary holds a mirror up to a dark, disturbing side of humanity. Of course you can choose to accept or reject that this lies within us collectively, but make no mistake, the director artfully tells a story that rates as one of \"strangest but true\" ever. The kind of story that evokes such emotion from the user who called this movie \"awful\" ... it's that good. On the technical side, the music selected for the soundtrack fits well. The narrator's POV is very effective, and the pacing has the gradual build up that makes the climactic point that much stronger. The story itself is the find of a lifetime for a writer. It could easily have been mistreated, but in the director's hands, comes out as a documentary masterpiece.",
         "Barbara Shroeder's Talhotblond is a flawed documentary about an internet love triangle leading to a crime of passion. The three individuals involved all deceive each others at one point or another and just when you think the documentary has run its course and revealed everything, the story takes a new shocking turn. Shroeder does a good job of pacing this captivating story and presenting it almost like a thriller. Where she absolutely fails is when she injects subjectivity with a heavy-handed analysis of who exactly is responsible for the crime. What should have been an eye-opening cautionary tale about potential online traps becomes a muddled affair. On the surface, the story is about Thomas, an impotent family man in his 40s striking an online romance with Jessi, an 18 year old girl on the internet by pretending to be a young US marine. Eventually, Thomas is unmasked and Jessi gets a new, younger online boyfriend called Brian. Problem is, the world is a small place and both Brian and Thomas in real life actually work for the same company. There is a copious use of quotes of instant messages by all three of them, the story is both pathetic and dramatic but there are many flaws. The most obvious flaw is that the entire story is narrated by the murdered character, Brian. (This is not a spoiler, we learn in the first minute of the documentary that he is killed by Thomas). This extremely subjective attempt by Shroeder to make us sympathize with Brian is unnecessary, manipulative and actually prevents the documentary from ever reaching its true potential. Some of \"Fake Brian\"'s narration is worse than nails on a chalkboard. You really wonder what Shroeder was thinking when she wrote this and it detracts from the reality of the case and blurs facts with fiction. But the real pervasive flaw is with an analysis provided by an \"expert\" who had nothing to do with the case. Rex Beaber, a clinical psychologist, offers his insight on the case, the motivations of all three persons involved as well as his own subjective views on morality. At no point in time was Beaber actually involved in the case, nor has he ever met any member of the infamous trio involved in this tragedy. He just offers us a mix of speculation on the case, pseudo-scientific psychology views reminiscent of a college student having attended psychology 101 as well as awkward and subjective views on his own morality code. This decision by Shroeder absolutely destroys the credibility of Talhotblond as a classic documentary and veers it toward the growing trend of documentaries-turned-spectacle that have become prevalent. Here, it seems just reporting objective facts would be boring, and people could not make up their mind themselves. No, Shroeder has to use cheap narrative tricks and pseudo-experts to drive her own (rather unbelievable) take on the case. It's really too bad. With the ever growing popularity of Facebook, another generation of middle aged people are migrating online. Many of them, much like the three characters in this story, are lonely, gullible and looking for hope, friendship or more online. This documentary should have been the dangers of trusting online, the ease with which one can embellish or hide. I wonder if Shroeder is aware of the irony of having a fake Brian narrating a documentary about fake identities. Talhotblond becomes about who is truly responsible for Brian's death and that is just a shame. Still recommended for people who tend to be believe everything they read online.",
         "I rarely see thrillers told as a documentary, or at least good documentaries, but that's what \"Talhotblond\" is. And it's done well. It opens with a young man telling us that he was murdered - all because of lies told in a sexually-charged online chat room. Early on it seems we know the whole story of what happens, so I wasn't sure how they planned on keeping the film going. But there is so much more to this story. More than you could ever believe. They kept me watching because I wanted to try and solve the case, see how it all plays out. Although it may seem like they tell us the ending at the very beginning, they really didn't. The story is paced well. We find out what we need to, when we need to, to keep watching, but never revealing all of the shocking secrets. It is hard to make a documentary about things said in an online chat room. I'm not sure if text across the screen is a good way, but I haven't thought of a better way. I found that it dragged a bit at the end, but that's probably just because I didn't feel that much justice was served to \"Talhotblond\".",
         "Anybody who loves lurid, real-life homicide cases with mind boggling revelations will crave this skillfully made documentary about a cyberspace femme fatale who turned two grown men against one another. These two guys participated in Internet chat room sessions with an 18-year old hottie. Forty-seven year old factory worker Thomas Montgomery, currently serving a 20-year stretch in Attica Correctional Facility in New York, was an unhappily married man with two daughters aged 12 and 14-years old. Montgomery was suffering from impotence when he met Jessi in an Internet chat room purely by accident. Montgomery masqueraded as an 18-year old battle scarred Marine sniper named Tommy when he learned that Jessi was a West Virginia high school senior. He fooled the poor teenager into believing that he had deep feelings of love for her. Jessi reciprocated similar feelings of affection. The web-based romance began in May 2005. Jessi sent him photos of herself in a bathing suit, videos of herself set to a ballad, red-lace panties, and a sterling silver \"key to my heart\" chain. Their chat sessions degenerated into pornographic prattle. Meanwhile, Montgomery's suspicious wife Cindy discovered her husband's perfidy and contacted Jessi with the truth about Montgomery. Before long Jessi hooked up with a college student named Brian. Eventually, this twisted relationship incorporated all three and Montgomery learned that Brian worked part-time at the same factory, the tool plant, Dynabrade in Clarence, New York, where he had been working for 12 years. One evening while 22-year old Brian sat in his truck in the factory parking lot, Montgomery approached the vehicle without warning and fired three shots from a .30-caliber gun into the driver's side door, killing Brian. The jealous older man was stunned when he learned the truth about sexy young Jessi and how she had lead him on in a bizarre love triangle. This is a chilling cautionary tale of what can occur when you chat will the wrong folks in cyberspace. First-time writer & director Barbara Schroeder does a splendid job of assembling the facts in a piecemeal fashion with the actual participants, including candid, on-camera interviews with convicted killer Thomas Montgomery, clinical psychologist and attorney Dr. Rex Julian Beaber, Erie County prosecutor Ken Case, Erie County Sheriff Ron Kenyon, Oak Hill, West Virginia Sgt. Lee Kirk, Tim Shieler, and the father of the Internet teen vixen. The revelations here will curl your toe-nails and make you think twice about entering an Internet chat room. Indeed, truth is again stranger than fiction! \"Talhotblond\" received the Best Documentary award at the 2009 Seattle International Film Festival. Incidentally, the title refers to the screen name that Jessi used in Internet chat rooms.",
         "The best documentaries seek to teach us something about the human condition and Barbara Schroeder's TALLHOTBLOND does just that. Like the similar CATFISH, it explores the pitfalls of internet dating and the many lies and deceit behind the typical cyber relationship. TALLHOTBLOND plays a lot like a Hollywood thriller: it's lean and terse, never outstaying its welcome, and it packs a number of twists worthy of M. Night Shyamalan. Sure, some of the editing decisions are a little odd - not least the 'beyond the grave' narration - but there's no denying the shocking, sad and disturbing events of the tale. Most people see this as a simple documentary about murder, but they're missing the point entirely. It's a lesson in culpability.",
         "I truly do not understand the hate and hyper criticism this stunning documentary has received. I cannot imagine how it could have been made better. I thought the film was outstanding (and I have pretty much seen them all). Among many positives, it contained one of the Top 10 OMG moments in the history of film. People need to stop trying to be the next Roger Ebert and be thankful you are treated with cinematic gifts like this from time to time. They are so rare. The music was great. The narration was unique and very effective. The voice over actors were high caliber. The interviews where compelling. The story was astonishing (yet deeply sad of course).",
         "There is nothing I enjoy more than compelling real life stories, and this is certainly one. The story is disturbing and fascinating in equal measure. It details an almost unbelievable chain of events, which results in one man (Thomas Montgomery) carrying out a brutal and unforgivable act, fuelled by obsession and temporary madness. The film tells us how he got to that stage, in his own words. As well as interviews with him, there are insights from clinical psychologists, attorneys, and various law enforcement officials, and the other key figures in the story. (I will not say more about who these 'key figures' are as I do not wish to give it away.) But their honesty during their interviews is commendable and very much adds to the credibility of the film. To my mind, this is clearly what inspired the fake \"real life\" documentary 'Catfish'. In fact I would go so far as to say Catfish totally ripped this off, and threw in a few elements of 'My Kid Could Paint That' for good measure. Anyway, this film is definitely one to watch. It is a stark warning of the perils of the online world and is also of interest to people who enjoy learning about the human psyche and criminal psychology. Highly recommended.",
         "Thomas Montgomery is a middle aged father of two who lives and works in Western New York, near Buffalo. He is in a job where he has hit the advancement ceiling. His middle aged body trends into impotence, and he starts looking for satisfaction elsewhere than with his wife. He meets in a chat room a girl named Jessi, from West Virginia, whose online handle is talhotblond. Montgomery's handle is marinesniper. Montgomery was a Marine, but not one who saw combat. Still, he makes up all sorts of nonsensical lies for his online encounters with Jessi. Montgomery's wife catches wind of what he is doing; she confronts him and writes Jessi a letter, telling her a number of pertinent truths. A co-worker Brian also learns of Montgomery's foolishness, and enters the fray. Jessi and Brian flame Montgomery and get him suspended from the online chats. Montgomery stays away from it a while, but later he comes back in. Montgomery manipulates things to get Brian (handle beefcake), off the game; he quits associating with Brian in the real world, and online. That does not last forever, and Jessi pulls Montgomery back in again. She convinces Montgomery that she is back together with Brian. In a small surprise, 'Jessi' is not 18; she also is a deep liar like Montgomery. Also, she is Mary, the real Jessi's mother. So two middle aged, unattractive adults keep this storm of lies going via their totally false online characters. How does this play out in real life? Very badly, as it turns out. Who gets to walk away from this? ------Scores------- Cinematography: 8/10 Mostly good. Sound: 10/10 OK. Screenplay: 8/10 Tells the real-life and online stories fairly well. Some of the character studies are good for depth.",
         "This documentary proves that love, or a twisted version of love, can lead to horrible things. This is not a simple case of online fraud. From the title and plot you can guess the true story is not going to end happy. People who say this is brilliant obviously don't see its flaws. The POV fake narrator (which to me I would kinda find insulting) or the cross fade cuts to edit out the interviewees blabbering just looks bad. But this story is explained very well, the pace is brilliant, the twists just make you as a very feel interested. Its a budget documentary that presented well. They did their research. If you keep with it it gets very interesting and shocking! Stayed up late, watching this on ABC iView as an online \"catch-up TV\" documentary. I couldn't help but think how much the world depends on the internet. I could lost my job on Monday for complaining about work on Facebook. But then I have a network of contacts to email my resume to find another one on LinkedIn. I have meet people of the internet too. Luckily I said who I was truthfully. But what if I lied? To me this documentary hits home. People live out their lives over the internet now. Its a fact and its sad. The internet has private information about everyone for anyone to seek. But you can also fake your life over the internet. Start chatting with people who are lonely and love hungry, its a recipe for disaster. This documentary will clearly show just that. You never know who your talking too. The ending so worth the boring parts.",
         "i enjoyed the first half, before it spirals into a moralising tale in which the woman is blamed, analysed, and targeted as the culprit of many deceits, despite the participation, stupidity, and violence of men. i liked how the voice of a dead man was used as narration, until this voice (of a man who said and did some horrible things) comes to set the moral tone of the film. the events point to larger social systems of gender and sexuality, yet seems to not only ignore these, but reinforces damaging gender stereotypes through which women are more harshly viewed and blamed for violence they did not commit. an alternative title for this film is \"a man kills a man and it's all the woman's fault\". this film fails to see the broader social context of the story it tells. hence, fail."
      ],
      "genres": [
         "Documentary",
         "Thriller"
      ],
      "productionCompanies": ["Answers Productions"],
      "summaries": ["This is the true story of a love triangle that takes place entirely online. Lies lead to murder in real life, as a teenage vixen (screen name 'talhotblond') lures men into her web. Revealing a shocking true crime story that shows the Internet's power to unleash our most dangerous fantasies."],
      "budget": 75000
   },
   "movielensId": 78459,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-02-01",
      "dvdReleaseDate": "2010-03-23",
      "directors": ["Barbara Schroeder"],
      "runtime": 83,
      "movieId": 78459,
      "title": "Talhotblond",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "1370889",
      "originalTitle": "Talhotblond",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "This is the true story of a love triangle that takes place entirely online. Lies lead to murder in real life, as a teenage vixen (screen name 'talhotblond') lures men into her web. Revealing a shocking true crime story that shows the Internet's power to unleash our most dangerous fantasies.",
      "tmdbMovieId": 39246,
      "avgRating": 3.02273,
      "releaseYear": "2009",
      "numRatings": 22,
      "posterPath": "/kHi03CxFAfmYE0wsZJMVgWQzU0G.jpg"
   }
}