{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mute",
            "id": 10392
         },
         {
            "name": "eiffel tower paris",
            "id": 164889
         }
      ],
      "imdb_id": "tt0056017",
      "video": false,
      "title": "Gigot",
      "recommendations": [],
      "backdrop_path": "/1Ne8MXxH5uYCw73AOcd15qpKP3L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Gigot",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f433",
               "name": "Jackie Gleason",
               "profile_path": "/3iYcY3jE5QYQ6LQWuzkOdXfS5Ds.jpg",
               "id": 14882,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Collette",
               "gender": 1,
               "credit_id": "52fe4752c3a36847f812f437",
               "name": "Katherine Kath",
               "profile_path": "/9kdBp2G5qsGCu2NgI13rZtNVsu6.jpg",
               "id": 67445,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Madame Brigitte",
               "gender": 1,
               "credit_id": "53023b4e925141218f33a76b",
               "name": "Gabrielle Dorziat",
               "profile_path": "/2BvO754Wtp1LYPJTYKPD4o62HOy.jpg",
               "id": 37444,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Gaston",
               "gender": 2,
               "credit_id": "53023b5d92514121a434cf8c",
               "name": "Jean Lefebvre",
               "profile_path": "/bSvA4RWoxV9sK8CrR24sGSrWMYc.jpg",
               "id": 37457,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jean",
               "gender": 2,
               "credit_id": "53023b67925141219b304b1f",
               "name": "Jacques Marin",
               "profile_path": "/vDHb0ktErwMAmdYzSW7o5rsfnZE.jpg",
               "id": 26890,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f41d",
               "name": "Gene Kelly",
               "profile_path": "/xbQZidMyhviuLmI1h8cJoJ7F1LV.jpg",
               "id": 13294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f423",
               "name": "Jackie Gleason",
               "profile_path": "/3iYcY3jE5QYQ6LQWuzkOdXfS5Ds.jpg",
               "id": 14882,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f429",
               "name": "John Patrick",
               "profile_path": null,
               "id": 69393,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4752c3a36847f812f42f",
               "name": "A.J. Russell",
               "profile_path": null,
               "id": 40188,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.210427,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48003,
      "vote_count": 4,
      "budget": 0,
      "overview": "A poignant comedy about a mute who befriends Nicole, the little daughter of a prostitute. Gleason shows his considerable talents as an actor without uttering a sound as he plays the bumbling, kind-hearted janitor, Gigot. Gleason wrote the original story and music for this film.",
      "similar": [
         655,
         37861,
         255,
         95,
         401371,
         342473,
         266285,
         74997,
         24679,
         3989,
         376570,
         15058,
         11418,
         11326,
         16328,
         10464,
         17965,
         22171,
         35113,
         81446
      ],
      "original_title": "Gigot",
      "runtime": 104,
      "poster_path": "/rv2ANeMf8IUUAlNvSWqPmBcUBn3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Seven Arts Productions",
         "id": 516,
         "origin_country": ""
      }],
      "release_date": "1962-11-01",
      "vote_average": 8.9,
      "belongs_to_collection": null,
      "tagline": "A new joy has come to the screen... and the world is a happier place to live in!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gene Kelly"],
      "runtime": 104,
      "synopsis": "We begin with a cat on the streets of Paris who,after hearing the milk truck pass by, heads down to a basement apartment through a pet door and licks the face of the sleeping Gigot (Jackie Gleason), the poor mute janitor who lives there. He gets up, gives the cat some milk and then does his morning ritual of prayers, eating some bread and washing his face from water draining from a pipe. Two investigators from the Department of Complaints visit an old woman who called them. She complains that Madame Brigitte next door has hired a simpleminded janitor who steals her milk and ash can and sweeps leaves in front of her residence. She wants him committed. Gigot steps out and indeed sweeps up some leaves, careful to get each one and deposit them in the trash. He even stops to pluck dead leaves off the tree. The investigators nod and go in to start the paperwork. Gigot goes to Madame Brigitte (Gabrielle Dorziat) for his salary. She complains he hasn't earned it, but set the coins out for him then takes deductions for a broken window, messed up commode and even for replacing his worn-out broom. He leaves with just a few coins. Outside, mischievous men distract him so a kid can attach a tail to his back. The neighborhood laughs until a kind policeman removes it. Gigot goes to a pastry shop admiring the cakes, but just buys some stale, broken cookies. He mostly shares them with friendly dogs who follow him, and even gives some to a cat and a horse. Madame Brigitte tells the investigators that Gigot is as sound-minded as anyone else. She does admit he has a habit of attending other peoples funerals, helping the mourners mourn. Shortly after that, Gigot sees a funeral procession going down the street. He follows them and attends the service, comforting the bereaved and behaving reverently the entire time. That night, the same mischief-makers from before are at a bar. They see Gigot coming and decide to have some fun. They offer to feed him on the house, but first he must have a drink. Then one bets 5 francs he can't down a large glass of pernod without taking a breath. Gigot manages to drink the entire glass down. Then the bettor's friend insists he must have a chance to win back his money. So Gigot is conned into drinking a glass of eau de vie this time. When he finishes, he is drunk and loses interest in eating. Instead he pantomimes some of the people he saw at the funeral, and then stumbles into the next room where he begins to dance with a pretty girl. But the alcohol hits him and causes him to collapse against the wall. He gets up and humbly exits the bar. The patrons all feel bad for a few long seconds, and then go back to drinking and dancing. Gigot wakes up on the street in the rain hours later and begins to walk home. On the way, he spots a little girl Nicole (Diane Gardner) about 5 years old hiding under an archway. She backs away from him to another archway where her mother Colette (Katherine Kath) is also hiding from the rain. He takes them both to his apartment, sets out their wet coats to dry and gives them each a place to sleep. The next morning, the cat-waking cycle repeats itself, only the cat ends up licking Colette's face. She screams and scares the cat away. She tells Nicole they are leaving, but Gigot offers them some bread so they stay for breakfast. Brigitte comes down the stairs and finds them all, asking Gigot when he got married and telling him to get to work to feed his new family. Colette again says they must go, but finds herself still coughing from the effects of last nights rain and weakly crawls back into bed. Gigot is clearly enchanted with little Nicole and tries to amuse her with some sleight of hand tricks. When none of them work, he cuts a small piece of cheese and gives it to her. He then shows her a secret door leading down a corridor to another room. There he acts like a waiter, sets a table, and then has her put the piece of cheese on it. A mouse crawls from a hole next to the table and slowly eats the cheese. Nicole laughs uproariously and kisses Gigot on the cheek. Later he plays some records for her on an old gramophone, and dances to them. That afternoon, he takes her on a ride in a wagon. He is distracted by a passing funeral parade, and when he looks back Nicole is gone. Fortunately, she has just gone into the church next door. He goes in and tries to answer her questions about who the statues represent. Eventually, he is frustrated with his inability to speak to her and starts to hit himself. But she makes him stop and they walk off together. He takes Colette and Nicole to the amusement park. Colette stays on a park bench while they go on ahead. Nicole wants to ride the carousel. Gigot sets her on the horse, but he only has enough for one fare so he is not allowed to hold her as she rides. Instead he runs around the outside of the carousel to keep an eye on her, bumping into people and falling over hurdles as spectators laugh. She finally emerges from the carousel unharmed and asks to ride again. Meanwhile Colette, who is a prostitute, is approached by a customer. She pretends to be there alone and lets him make advances to her. When Gigot returns, he thinks she is being attacked and runs to defend her. He ends up being beaten up by the man and his friend until a policeman arrives to break it up. Colette tells the policeman Gigot is not her husband and she takes Nicole and runs off. When the policeman finds out Gigot is mute, he just sends them all on their way. When Gigot returns home, Nicole and her mother are still there, but preparing to leave. He indicates he is willing to pay them to stay (by pantomiming handing out money.) She gives him one hour to produce some money, or they will leave. He wanders the street and sees that the baker and his wife are distracted watching a painter. He sneaks in the bakery and steals a bag of money from the money box. He also takes some stale cookies, but leaves a couple of coins in payment. He returns to the apartment and shows Colette the money. She is impressed and declares they are going shopping. They buy Nicole some dresses, a new outfit for Colette and even a new hat and coat for Gigot. As they walk down the street in their fancy clothes, people speculate that he has a rich relative or won the lottery. They go to a restaurant and he flashes his money. They are given the best table in the house. Colette orders champagne and Gigot indicates champagne for all. The patrons are delighted. But later as Gigot dances with Nicole, Colette is approached by her former lover. He sneaks her outside and declares he is willing to take both her and Nicole back, despite claiming before that Nicole was a burden. She agrees to meet with him after Gigot falls asleep. Later, Gigot pays the bill and leaves the change as a tip. He takes his two guests home. Late that night, Colettes lover whistles for her. She comes out, planning to sneak back in and get Nicole. But he tells her tonight is just for them; let Nicole stay \"with the dummy\". From a distance, Gigot sadly watches them sneak away. The next morning, we again see the cat going to Gigot's apartment. But this time, no one is there. Outside, the two investigators arrive declaring they are going to have Gigot committed. Suddenly, Colette comes out of the apartment screaming that her child is gone and Gigot must have kidnapped her. The townspeople enter into the apartment and the baker finds his money bag and realizes Gigot is the one who robbed him. Meanwhile, Gigot and Nicole are actually safe in the secret room, where he is playing records on the gramophone and dancing. Suddenly, the ceiling collapses on them. Gigot emerges from the rubble and finds Nicole unconscious with a gash on the side of her head. He clears the rubble away and carries her out the back way unseen by any of the townspeople. He takes her to the church, where the priest sends for a doctor. The doctor treats the gash and says she is just shaken up. She murmurs \"Play the music, Gigot,\" over and over. Gigot rushes back to the room and retrieves the gramophone. Some townspeople see him and give chase. Eventually, he ends up near a coal refinery where he accidentally drops the gramophone onto a conveyor belt. He climbs on the conveyor belt to retrieve it, riding it up and then sliding down a coal chute into the river. Just then, a tugboat sails by right over the spot where he had fallen in. After it passes, only Gigot's hat floats to the surface. A townsman grabs the hat and declares that is all that is left of the man. Unbeknownst to him, Gigot is hiding in the water almost at his feet. The townspeople gather with Colette, Nicole and the priest and learn the whole story behind Gigot's theft and the apparent kidnapping. The priest assures Nicole that Gigot died trying to save her. Everyone feels guilty about how they treated the poor janitor. They decide since he liked funerals so much, they will throw him the biggest funeral the town has ever had. Later, they townspeople all gather for the funeral with lots of flowers, a hearse, and even a small band. Gigot sees the procession and follows at a distance, later hiding in a tree at the cemetery. It is not until the mourners start to speak that Gigot realizes the funeral is for him. Brigitte says he was a treasure who did the work of three men. The townsmen praise his drinking ability and the investigators claim they were always on his side. Everyone throws flowers on his grave, beginning with little Nicole. Then they slowly walk away. He climbs down from the tree and tries to signal them, but of course cannot. Just as he is turning to leave, one of the townspeople sees him and calls out to the others. Instinctively, Gigot flees. The movie ends with the whole town pursuing Gigot, who is unaware that now they all just want to be his friends.",
      "writers": [
         "Jackie Gleason",
         "John Patrick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056017/",
      "coverLink": null,
      "actors": ["Stars: Jackie Gleason, Katherine Kath, Gabrielle Dorziat | See full cast and crew »"],
      "reviews": [
         "I was looking at the Emmy nominations for 2005 and saw The Wool Cap and the name Gigot. I had to look it up to see if it was the same story - because although I haven't seen this movie since I was probably 10 or even younger, it remains one of my favorite films. I am moved to tears at the memory of this film. Jackie Gleason as the gentle giant Gigot - one of the best performances I've ever seen. His relationship with the little girl is lush and expressive without words. He loves her so much your heart aches watching it. Someone wrote \"You HAVE to see this movie!\" Agreed. And I HAVE to see it again. That I can remember this film from so long ago is a testament to its emotional punch. It's a sweet and touching film.",
         "This precious movie, Gigot, was made by Jackie Gleason as a tribute to his love for Charles Chaplin and his classic silent film The Kid (1921). Gleason's character Gigot is poor, basically a tramp, and mute, the muteness a plot device to emphasize that communication in film is all the more profound and emotional when the actor does not speak, but has to communicate to the audience through facial expressions and pantomime alone. Jackie Gleason would have been a WONDERFUL actor in the silent era. He is outstanding in Gigot. I'll bet Chaplin loved this film. Even the lovely French style music reminded me of similar music in Chaplin's silent classic City Lights (1931). Instead of a little boy (Jackie Coogan in the original), Gleason makes the little child a girl, one who is so traumatized by life and living with a prostitute mother that she rarely speaks either. These two souls don't need words to communicate their love for one another. One of the most powerful scenes in the film, almost painful to watch, is when Gigot takes little Nicole (the winsome Diane Gardner, whatever happened to her?) to a church. Of course she has been raised without faith, and Gigot yearns to teach the child about Christ's sacrifice on the cross, but he can't tell her in words. He starts hitting himself in frustration, but the love of the little girl rescues him from his torment. They'd never put a scene like that in a modern mainstream film in Hollywood today. Not politically correct. Just like with Chaplin films, there are mixtures of pathos and comedy. These juxtapositions are timeless and still effective, as long as the human heart remains sensitive to others besides itself. Often broadcast on the Fox Movie Channel, but unfortunately in pan and scan. This film needs a remastering and an official DVD release in its original widescreen. 10 out of 10.",
         "When I first viewed this film I was only 8 years old. Even at such a young age I was completely moved. The surprising thing is that even now I remember those feelings. For the last few years I have been searching for this film on video, but unable to find it. Whenever I see a movie with Jackie Gleason in it I am always reminded of his character in Gigot, and how I long to see this character again. To some, the film may not have touched their souls, but to me I was totally drawn to this character. To this day I remember the part where Gigot tried to save the child; how much he cared and the risks he took because of his unselfish love. You don't see these kind of films today. It's a shame that inner emotions are no longer captured but over shadowed by destruction and the almighty dollar.",
         "Jackie Gleason may have been the greatest entertainer of all time. This movie shows that he wasn't all \"booze, broads, cigarettes, and showgirls.\" When I first saw that this movie had Jackie in it, I thought it was a \"vanity film\" (sometimes stars take movies to satisfy large egos) but I sure was wrong. This is a wonderful movie full of heart and love. Only people with good souls could make a movie like this. I highly recommend this movie and once you see this movie you'll see that Jackie Gleason was a big man with a big heart.",
         "Gleason was at his best in this drama. Never before or since have I found a movie so charming and well done. Virtually \"talk free\" I was captivated by Gleasons' portrayal. No other actor comes close to his caliber.",
         "if this movie isn't a 10, then there isn't a 10 anywhere. jackie gleason plays this character so beautifully, juxtaposed against the ruthless street-walking mother of the sweet young nicole. also the settings show a dichotomy of character with his poor-man surroundings, and the rich-man place he takes himself to........all the impress collette so that he can spend time with young nicole. gleason was nominated for an academy award for his portrayal of gigot, but was lost in a very strong cadre of contenders. does anyone know why this film has not been released on VHS or DVD? certainly it would sell. this film is a keeper. i watch hundreds of movies but refuse to buy only the absolute best. wish i could buy gigot.",
         "This splendid film is a lost masterpiece. Most everyone I talk to that has seen it, saw it on a local television matinée. So far as I can tell it is not available on video. This wonderful film has fallen between the cracks somehow but the discovery of it only adds to it's charm. Like a rare natural wonder hidden far off the beaten path some afternoon, you may be trudging through your day and stumble onto this film, a beautiful sentimental picture. If you like Capra, you will love Gigot. Not for the dark of heart or impatient, this film will move you to tears. It has the feel of a small foreign film, but has the heart as big as any film ever made. Directed by Gene Kelly, the set's are wonderful, the acting subtle and superb, the music perfect and most important of all \"The Great One\" Jackie Gleason's performance as the mute Gigot has a depth and pathos that few actors have ever achieved. I wonder if John Candy wasn't partially reflecting on 'Gigot' when he played his Del Griffeth character in 'Planes, Trains...' There is something behind these actors performances that could not have been acting. Like Buster Keaton, one gets the sense that deep down, the character is a reflection of the pain the actor truly feels. Check your local listings to see if this is playing and record it. A 10 out of 10.",
         "I don't think that there's much to add that hasn't already been said. I first saw this movie when I was about 7 and never forgot it. I recently was lucky enough to see it again, nearly 35 years later and still marveled at it's emotional depth and breadth. I was amazed at how well I remembered details, especially the scene where he gets frusrated and begins to strike himself. It's amazing that he not only brilliantly played the character without dialogue, but he also wrote the movie and the music. How much talent can one person have? A pity it's not available on VHS or DVD.",
         "I have seen this movie a few times, and it just grows on you. Gleason shows how powerful a performance one can do without uttering one word. Many have described this film well. It is a great performance by Gleason, and yes the little girl isn't the cutest, but she wasn't meant to be. It makes his love for her and the mother all the more powerful. The SADDEST part of this film is that it has never been released on Video or DVD yet. Perhaps someday Hollywood will catch up with the people's hearts.",
         "Affected, slightly overblown and mawkish, Gene Kelly's sentimental comedy \"Gigot\" manages to hit most of its funny/weepy targets due to a wordlessly wonderful leading performance by Jackie Gleason. Playing a mute caretaker in Paris, child-like Gleason befriends a prostitute and her young daughter (Katherine Kath, displaying lovely, solemn grace). Filmed in beautifully saturated colors, \"Gigot\" isn't immediately thought of as a natural fit for its star, and indeed many professional critics lambasted Gleason on the attempt alone, but The Great One is a marvel to watch. His sensitivity to this character seems quite heartfelt and, while director Kelly isn't really interested in subtleties, Gleason isn't the over-the-top comedian here; he's eager to please, but also gentle when it's called for, and--standing in the rain with the water running off his cherubic face--tender. If it's every comedian's dream to be taken seriously as a dramatic kingpin, Gleason is quietly pleased to be the acting prince. The movie doesn't come to much (it's just a doodle), but there are beautiful moments spread about which are immensely successful, and added up they make quite a pleasant, memorable vehicle. *** from ****"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Seven Arts Pictures"],
      "summaries": [
         "A poignant comedy about a mute who befriends Nicole, the little daughter of a prostitute. Gleason shows his considerable talents as an actor without uttering a sound as he plays the bumbling, kind-hearted janitor, Gigot. Gleason wrote the original story and music for this film.",
         "Jackie Gleason plays a mute janitor who befriends Nicole, the little daughter of a prostitute."
      ],
      "budget": 0
   },
   "movielensId": 78483,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-11-01",
      "dvdReleaseDate": null,
      "directors": ["Gene Kelly"],
      "runtime": 104,
      "movieId": 78483,
      "title": "Gigot",
      "mpaa": "",
      "actors": [
         "Jackie Gleason",
         "Katherine Kath",
         "Gabrielle Dorziat",
         "Jean Lefebvre",
         "Jacques Marin"
      ],
      "imdbMovieId": "0056017",
      "originalTitle": "Gigot",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A poignant comedy about a mute who befriends Nicole, the little daughter of a prostitute. Gleason shows his considerable talents as an actor without uttering a sound as he plays the bumbling, kind-hearted janitor, Gigot. Gleason wrote the original story and music for this film.",
      "tmdbMovieId": 48003,
      "avgRating": 2.66667,
      "releaseYear": "1962",
      "numRatings": 6,
      "posterPath": "/rv2ANeMf8IUUAlNvSWqPmBcUBn3.jpg"
   }
}