{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0057078",
      "video": false,
      "title": "The Whip and the Body",
      "recommendations": [
         28050,
         5483,
         28055,
         40141,
         44102,
         52203,
         5485,
         83519,
         27405,
         28049,
         28058,
         38946,
         28061,
         29394,
         39986,
         5481,
         21955,
         61904,
         43248,
         29049
      ],
      "backdrop_path": "/zAZGsPKFP9XJm03EF2xeqQ61ptv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Nevenka Menliff",
               "gender": 1,
               "credit_id": "52fe455cc3a368484e0557f1",
               "name": "Daliah Lavi",
               "profile_path": "/xWEOf7X6vovLk05YT14xeZrwv9W.jpg",
               "id": 39754,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Kurt Menliff",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557f5",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Christian Menliff",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557f9",
               "name": "Tony Kendall",
               "profile_path": "/1N9ZCQi9HkKjDwG57JIJsiYM9wP.jpg",
               "id": 37745,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Katia",
               "gender": 1,
               "credit_id": "52fe455cc3a368484e0557fd",
               "name": "Ida Galli",
               "profile_path": "/tJoAf0TJgQhXXfDkJaHcWlSj7uX.jpg",
               "id": 5969,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Giorgia",
               "gender": 1,
               "credit_id": "52fe455cc3a368484e055801",
               "name": "Harriet Medin",
               "profile_path": null,
               "id": 54941,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Count Menliff",
               "gender": 0,
               "credit_id": "52fe455cc3a368484e055805",
               "name": "Gustavo De Nardo",
               "profile_path": "/2TUeATCid0ET1TaXPi9e5dai5QD.jpg",
               "id": 98509,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Losat",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e055809",
               "name": "Luciano Pigozzi",
               "profile_path": "/iSitmgdtPylwSkX9efVaTJLVfSa.jpg",
               "id": 30900,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe455cc3a368484e05580d",
               "name": "Jacques Herlin",
               "profile_path": "/ztGRlFmz3GEIWpNb9uIX7TtAiFF.jpg",
               "id": 6784,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557b1",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557b7",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557bd",
               "name": "Ernesto Gastaldi",
               "profile_path": null,
               "id": 50818,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557c3",
               "name": "Ugo Guerra",
               "profile_path": null,
               "id": 50819,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557c9",
               "name": "Luciano Martino",
               "profile_path": null,
               "id": 21230,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557cf",
               "name": "Ubaldo Terzano",
               "profile_path": null,
               "id": 98483,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557db",
               "name": "Federico Magnaghi",
               "profile_path": null,
               "id": 98507,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455cc3a368484e0557e1",
               "name": "Carlo Rustichelli",
               "profile_path": "/3LOPAqzUlWbyjzxYXMlJpJDrrrE.jpg",
               "id": 29500,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557e7",
               "name": "Elio Scardamaglia",
               "profile_path": null,
               "id": 25320,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe455cc3a368484e0557ed",
               "name": "Ottavio Scotti",
               "profile_path": null,
               "id": 98508,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "53d5b62d0e0a262844005acc",
               "name": "Renato Cinquini",
               "profile_path": null,
               "id": 31985,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53d5b63d0e0a26283b005a68",
               "name": "Priscilla Contardi",
               "profile_path": null,
               "id": 1346861,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.752545,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 27636,
      "vote_count": 30,
      "budget": 66500,
      "overview": "In the 19th century, a sadistic nobleman terrorizes the members of his family. He is found dead, but his ghost soon returns to haunt the residents of his castle.",
      "similar": [],
      "original_title": "La frusta e il corpo",
      "runtime": 87,
      "poster_path": "/ojUTNoYuYEdYktI04UedwWE7cmT.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Titanus",
            "id": 641,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Leone Film",
            "id": 3920,
            "origin_country": ""
         }
      ],
      "release_date": "1963-08-29",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "The most deliriously romantic horror picture ever made!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mario Bava"],
      "runtime": 86,
      "synopsis": "In a nameless Baltic country in the 19th Century, Kurt Menliff (Christopher Lee) arrives at his seaside castle after many years of wondering through Europe. But he is not warmly received for everyone knows that he is a sadist who gets sexual gratification from whipping his lovers. His former lover is Nevenka Menliff (Daliah Lavi), who is now married to Kurt's spineless younger brother Christian (Luciano Stella). Kurt and Christian's father, an invalid Count (Gustavo De Nardo) has never forgiven Kurt for leaving in the first place. The maid, Giorgia (Harriet White Medin) is anxious to get back at him for causing the suicide of her daughter who stabbed herself in the throat after Kurt walked out on her years ago. Nevertheless, Kurt is allowed to stay because he is family. The following morning, Kurt confronts his other cousin Katia (Ida Galli) whom he knows to be secretly in love with Christian. He smugly assures her that he feels her pain, as he is interested in Nevenka. Katia flees from this unwanted revelation. Kurt next enters the large, cavernous living room where his father spends most of the time. Kurt explains that now he has returned home, he feels that he deserves to be next in line to inherit the family estate. But the Count assures him that there is no chance of that happening. \"Everything you were to inherit, you forfeited forever\", he tells Kurt. \"You did it yourself, with your infamy!\" Angered, Kurt storms out of the living room. Embittered by this personal defeat, Kurt goes to the beach where he sees Nevenka sitting pensively by the water. He approaches her, and reminds her their past liaisons. They kiss, and then Nevenka recoils, striking Kurt across the face wit her riding crop. He then calmly takes it out of her hand and pushes her to the ground. Cracking the riding crop across her back, he sneers: \"You haven't changed, I see. You've always loved violence\". He then proceeds to strike her again and again. Nevenka's reactions to being beaten are very subdued and the expression her face suggests sexual excitement. After striking her several more times, Kurt tosses the riding crop aside and proceeds to rape her. After finishing with Nevenka, Kurt returns to the castle where he is confronted by Katia and Christian who ask him where Nevenka is, to which Kurt replies that he has no idea. They immediately know that Kurt is lying when they see him holding Nevenka's riding crop. As it is getting dark, Katia and Christian head out to look for Nevenka, as Kurt retires to his bedroom. Soon after, he is killed when an unseen person stabs him in the throat with a dagger. Meanwhile, Christian discovers Nevenka on the beach, her back covered with welts. After putting Nevenka to bed, Christian sends out for Kurt. The family butler, Losat (Luciano Pigozzi), goes to fetch Kurt, only to discover his dead body on the floor, with the dagger lying beside him. Losat's screams bring the others into the room, where Giorgia is hysterical with joy to see him dead, killed by the same dagger her daughter used to commit suicide. After Kurt's funeral, Christian timidly asks his father if he was responsible for the killing. The Count is enraged by these accusations, and tells his son to leave the living room. Soon after, the entire family unit begins to unravel. The marriage between Christian and Nevenka becomes more strained. Nevenka starts to see visions of Kurt. At one point, his ghost visits her in the middle of the night, whipping her more ferocious than ever. Soon afterwards, the Count is found murdered in the living room in the same fashion as Kurt, with the same weapon. Christian vows to find the killer, and Katia accuses Giorgia, pointing out that she had every motive to kill Kurt. Giorgia admits that she wanted to kill Kurt, but assures everybody that her love for the Count would have made it impossible for her to kill him. Elsewhere, Nevenka's mind becomes more unhinged and each nightmarish vision of Kurt unsettles her ever further. After explaining everything to Christian, even he comes to believe that Kurt may have been behind the murder of their father, and that his ghost is doing all the killing. Christian and Loast unearth Kurt's decaying dead body from the family crypt and burn the remains to try to put Kurt to rest. As they watch Kurt's remains burn, the dead man's sinister laughter rings out. Following a cloaked figured dressed as Kurt, Christian and Loast follow it to the castle where Christian pulls off the hood to reveals none other than Nevenka. At last the terrible truth comes out: Nevenka was the one who murdered Kurt after sneaking back into the castle and sneaking out through hidden passageways. But at her remorse over the crime, coupled by the realization that she really did love Kurt, compelled her to act out as if he is still alive, by dressing in his clothes to complement the illusion. Nevenka even went as far as to whip her self during those nights, and murdered her father as revenge for his ostracizing her love. Nevenka escapes from her husband, stabbing him in the arm in the process, and makes her way back to the crypt. Now really believing that Kurt is alive, Nevenka decides to put a stop to it all by killing him again. Kurt appears to her for a final time where in their final 'embrace' she stabs him, but instead stabs herself in the chest with the dagger, and she falls dead.",
      "writers": [
         "Ernesto Gastaldi",
         "Ugo Guerra"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0057078/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNzA3Njc3N15BMl5BanBnXkFtZTcwNjY3MDgyMQ@@._V1._CR2,20,305,426_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Daliah Lavi, Christopher Lee, Tony Kendall | See full cast and crew »"],
      "reviews": [
         "Irresistible and genuine Gothic scares, combined with atmospheric camera-work and breath-taking scenery\u0085 Welcome to yet another visual masterpiece directed by the greatest horror genius of all time: Mario Bava! \"The Whip and the Body\" isn't the man's most mentioned achievement, it's not even in my personal Bava-top 3 and yet I still rated it a solid 9 out of 10. That should give you somewhat an idea of how excellent his total repertoire in fact is. \"The Whip and the Body\" is a unique film in many ways, but particularly because of the controversial substance it dared to bring forward. Don't forget that the year of release was 1963 and Mario Bava unscrupulously introduces characters with taboo-fetishes like S & M. The story is terrifically set in the 19th century, where Kurt Menliff returns to his eminent family after being banished for several years. The family's hate towards Kurt's vile behavior is only surpassed by their fear and only the gorgeous Nevenka has a secret desire towards his wicked sexual preferences. In a particularly astonishing sequence, he whips her repeatedly (and roughly...) before continuing with making love. Terror overcomes the Menliff family when Kurt is found murdered in his room and when the tormented Nevenka begins to see his appearance in nearly every chamber of the castle. As it usually is the case in Bava's films, the plot contains quite a few holes and illogical moments, but they're totally forgivable if you acknowledge the intensity and power of the wholesome. Especially praiseworthy is Mario Bava's unequaled talent to turn totally natural things into terrifying atmosphere-elements\u0085 Blowing wind, pouring rain, footprints covered in mud...all these ordinary things turn into suspicious omens in the hands of this masterful filmmaker. With his skilled cinematographic eye, Bava perfectly knows how to raise an unbearable tension that grabs you by the neck immediately and it doesn't let go until the very last scene fades away. All the other typical Bava-trademarks are clearly present as well, namely an authentically creepy score, a minimum of stylish gore (burning, rotting corpses!!) and \u0096 last but not least \u0096 a stunning use of color shades. Mario plays with colors like he invented them and this emphasizes the spook-effect even more. \"The Whip and the Body\" is a more than just a shocking horror film. It's an offbeat love-story, a Gothic poem AND an unsettling horror tale all in one! If you love beautiful cinema, don't miss \"The Whip and the Body\".",
         "Kurt Menliff (Cristopher Lee) returns home to his ancestral castle which he was forced to leave after he whipped a village girl nearly to death. He finds that his fiance (Daliah Lavi) has married his brother, as well as having become the mistress of his father. (Don't panic, there's worse to come). He follows her to the beach and whips her savagely. She loves it and they end the session making love. The next day Kurt is found dead and Daliah soon begins experiencing nightly flagellations at the hands of his ghost. Christopher Lee has stated that this is one of his best films. It is certainly one of the most brilliantly bizarre horror films ever made. Directed by cult icon Mario Bava, Italy's finest cinematographer (if not one of their finest directors), it rises as far above an S & M fantasy as can be imagined. It was censored in every country in the world for its sexual violence and what remained was almost incoherent for most audiences and re-released under various titles: WHAT! in the US; NIGHT IS THE PHANTOM in the UK, etc. Until video (with somewhat faded color) it was impossible to see in its original form. Even now it remains a profoundly misunderstood film and should be seen in a theater in its complete form instead of on video. J.F.",
         "After the announcement of the servant Losat (Alan Collins), the nobleman Kurt Menliff (Christopher Lee) returns to the castle of his family at the seaside to congratulate his brother Christian Menliff (Tony Kendall) for his marriage with his former lover Nevenka (Daliah Lavi). Kurt feels the hatred and the fear of his father Count Menliff (Dean Ardow) and the servant Giorgia (Harriet White), who blames him for seducing and killing her daughter, and indifference from his cousin Katia (Isli Oberon). On the next afternoon, the sadistic Kurt meets Nevenka riding a horse alone on the beach and whips the masochistic woman and makes love with her. Late night, Nevenka is missing and everybody is seeking her while Kurt is stabbed in the neck with the same dagger that Giorgia's daughter was murdered. On the next days, the members of the family suspects of each other while Nevenka is haunted by the ghost of Kurt. \"The Whip and the Body\" is a stylish and one of the best features of Mario Bava that uses a magnificent cinematography, lighting and shadows and a classy soundtrack. The acting is great and the only problem is that the Ámerican DVD is awfully dubbed in English, without the synchrony of the movements of the lips with the speech. However, I have just watched this movie again in a Brazilian DVD spoken in Italian. The truth about the supernatural story is not difficult to be guessed what is happening by an attentive viewer. My vote is eight. Title (Brazil): \"O Chicote e o Corpo\" (\"The Whip and the Body\") Note: On 01 October 2014 I saw this movie again.",
         "Made around the same time as Mario's classic horror anthology BLACK SABBATH, this deserves the same accolades as his other more famous work. Upon release, WHIP was unfairly neglected, hacked up, censored and critically frowned upon for the subject matter (sexual violence). Next to RABID DOGS (1974), it was also the most difficult of Bava's genre films to acquire in America; I'm not even aware of an accessible home video release until just recently. All but forgotten for decades, but now finally available in a gorgeous restored cut on DVD from Sinister Cinema, WHIP is an absolute must see for Bava fans and very highly recommended for aficionados of Gothic horror. It is also a film that demands to be seen by any person interested in film-making as art - in set design, costume design, lighting schemes, color, shadow and music used for the creation of atmosphere and mood. Every single frame is composed with the utmost care and every inch of the screen exhibits such astonishing attention to detail that it almost begs to be watched in slow motion to soak it all in. Bava is a rare cinematic artist; a true visionary who uses celluloid as his palate; painting all the colors of the dark on drab, dank and dreary castle walls and corridors. Even though the story slips into the routine at times, it also is above average; progressive, serious, entertaining and even extremely ballsy for the 1960s in that it dares to romanticize sexual violence and sadomasochism. Christopher Lee (who considers this one of his best films) is perfectly hateful as Kurt Menliff, a cold-eyed sadist who returns home to his family's seaside castle after being banished years earlier. His ailing father (Gustavo De Nardo as \"Dean Ardow\") calls him a serpent, his brother Christian (Tony Kendall aka Luciano Stella) has since married Kurt's beautiful raven-haired ex-fiancé Nevenka (Daliah Lavi) and the loyal housekeeper Giorgia (Harriet Medin), whose daughter, Tanya, had taken her own life after being seduced and abandoned by Kurt, quietly plots her revenge. Also in the house is a pretty, but plain, young cousin named Katya (Ida Galli as \"Isli Oberon\"), who is actually in love with Christian and would undoubtedly make a much better mate for him. No one exactly welcomes Kurt home with open arms, so when he's found dead with a dagger driven into his neck (the same fashion Tanya ended her life) it isn't a surprise, though it does create a shroud of suspicion over every person in the castle. Even worse, Kurt seems to have returned from the dead to haunt, terrorize and inflict damage via the lash on poor, emotionally fragile Nevenka. The most interesting and complex character in the film turns out to be Nevenka herself. Her love-hate relationship with Kurt is unique and memorable. Though Christian is handsome, gentle and devoted to his bride, she obviously has the strongest passion (and love) for the cruel Kurt, who claims the reason he came back to the castle in the first place was that he heard his brother had married his former lover. Kurt's return has nothing to do with guilt over his immoral actions, but everything to do with control over Nevenka. It is made very clear during a beach love scene right before Kurt is murdered that the two do share a deep personal bond and a sexual secret. Right before his death, Nevenka is reminded by her former lover, \"You haven't changed... You always loved violence!\" before he alternates viciously whipping her with his passionate kisses. And she likes it so much you get the strong feeling that her 'straight' life with Christian was miserable for her. Kurt and Nevenka's love is a love of pain and mutual violence, but also of understanding that their mutual love for the sadism is a hard thing to come by. Their love is forbidden, but it is still distinctly, uniquely theirs... even into the grave. As he proved in THE HORROR OF Dracula (1958) and other horror films, Lee is a tall, towering, menacing figure, even when given little to no dialog. He's killed off fairly early here and appears sporadically throughout the film as a silent 'ghost,' but is all the more effective in his elusiveness. Dark beauty Daliah Lavi, who was a former Miss Iran, is excellent in the role and should have gone on to a career similar to that of Barbara Steele, who in many ways she resembles. Both ladies are able to embody Gothic horror to a T. The entire supporting cast, especially Medin, is very good. And Bava's mastery of the medium, like I said, really make the film incomparably intoxicating. He offers up twisting doorknobs, disembodied voices, creaking floorboards, secret passageways, muddy footprints, hands reaching out at you from the darkness, horse rides along the beach and other Gothic trappings with his exquisite flair for the visual, making this a painfully underrated gem of Euro-shock cinema. Some notes: * Bava used aliases all around - \"John M. Old\" for director and \"Dick Grey\" and \"David Hamilton\" for his cinematography. * A scene of Lavi moaning in ecstasy as she's being whipped by Lee was so controversial that it was excised from most prints when originally released * It was filmed on location in France * Co-writer Ernesto Gastaldi also wrote THE HORRIBLE DR. HICHCOCK, THE SCORPION'S TAIL, TORSO and many other notable Italian horror films from the 60s, 70s and 80s. The DVD comes with a few trailers for Bava films (including the French version of WHIP), four bios, photo and lobby card gallery, soundtrack access and the original U.S. main titles (under the name WHAT!).",
         "As I slowly get to watch more Mario Bava movies my enthusiasm for his extraordinary body of work grows and grows. I was already hooked after watching 'Black Sunday' for the first time, but after subsequently seeing 'Kill, Baby...Kill!', 'Planet Of The Vampires', 'Black Sabbath', 'Diabolik' and 'Lisa And The Devil' (and others) I was convinced that he's THE most underrated director of the Fantastic. Now I've watched 'The Whip And The Body' three times and listened to Tim Lucas' informative DVD commentary I'm almost ready to bow down and worship Bava like a god! This is such a fascinating movie... Visually it's stunning, as to be expected, Bava being a top cinematographer before turning to directing. The subject matter is still provocative, but forty years ago it must have been scandalous! In fact the movie was heavily censored and when eventually released in America given the lousy title 'What'. Christopher Lee counts this among his favourite roles and it is essential viewing for his fans. He plays Kurt Menliff, an evil sadistic nobleman returning to his family home after hearing his younger brother has wed. Lee's family has disowned him after a scandal concerning a servant girl he seduced who subsequently suicided. His father the Count despises him, the dead girl's mother, who still works for the Count, curses him, and his brother's new bride Nevenka (Daliah Lavi) fears him. Kurt and Nevenka have a past, not only that, a complicated sadomasochistic relationship. The whipping scenes between the two actors were a bit too much for the censors to handle back in the day, and while they aren't all that explicit, they are still unsettling even today. Lee and the stunning Lavi (best know to most people for her later appearance in the star-studded Bond spoof 'Casino Royale') make a truly unforgettable couple. Many people regard 'The Whip And The Body' as Bava's single best movie. I wouldn't go that far myself, but it's definitely one of his very best films, and is sure to impress anyone who has enjoyed his other pictures. Ghost story, murder mystery, psychosexual character study, whatever you want to call it, it's a highly original movie that will stay with you for a long time. Newcomers to Bava are still best to start with 'Black Sunday' in my opinion, but this movie comes with my highest recommendation.",
         "Mario Bava is often hailed as one of the true gods of horror cinema, and for good reason. His influence extends his filmography, and many Mario Bava films have gone on to have a big effect on the horror genre on the whole. Films such as Bay of Blood and Black Sunday are well known and have been seen by many serious film fanatics, but when you delve deeper into the man's list of directorial credits, his lesser known films tend to be just as good as his major hits. The Whip and the Body is one such film, and after viewing it; I rate it among the very top of the man's movies. This Gothic horror romance features many of Mario Bava's trademarks, which are the things that have won him such high praise from a number of well-informed sources. The story follows Nevenka, a young woman who is married to Christian, son of the lord of the castle in which the film takes place. However, things aren't so simple as Christian's brother, Kurt, a sadistic nobleman is still in love with his brother's bride and has returned to the castle to reclaim his girl. Things really get interesting when he is found dead, only for his ghost to reappear inside the castle walls. One of things that Mario Bava is often highly praised for is his use of lighting, and this film features what is probably the best use of lighting ever seen in a Bava film. The lights give flair to the scenery, and help to give the film that picturesque cinematography that the former cinematographer creates so well. Despite being excellent, however, it's not the lighting that is the main standout in this movie; it's the soundtrack. Giving the film a tragic love story atmosphere, the powerful theme bodes with the lighting to help create a tense and powerful atmosphere, in which Bava allows his actors to inhabit. This film represents the only pairing of Bava with British horror icon Christopher Lee, and as usual Lee lights up the screen with his persona and screen presence. The whipping scenes are what made this film notorious in the first place, and seeing Lee enjoying delivering the lashing is haunting and even quite frightening! The romance element of the story is wonderfully done, and it offsets the horror of the story well, which ultimately brings the film into balance. I rate this Bava film as one of the best the great Italian ever made and it therefore comes with a soaring recommendation.",
         "Whip and the Body, The (1963) ** 1/2 (out of 4) Christopher Lee plays a sadistic nobleman who returns home to terrorize his family after leaving home years earlier after forcing his girlfriend to commit suicide. Soon he is found dead with his throat slit and soon after he ghost begins to appear as more bodies start to pile up. All the praise thrown on director Bava is certainly needed because it's obvious he could take some mud and make it look wonderful but that doesn't mean all his films turn out great. I think the biggest flaw with this film is the rather weak story, which doesn't really contain any shocks and it's fairly simple to figure out what's going on so in the end, when the climax happens, there's no real shocks. Christopher Lee turns in a terrific performance, even though, for some reason, his voice is dubbed in the English language version. That fantastic look that Lee brings says all we need to know about his character. The supporting cast isn't as impressive but they fit their roles just fine. The cinematography is top notch and the use of lighting is also what makes this film stand apart from others in this era.",
         "\"The Whip and the Body\" is an amazingly kinky film--and it surprised me a bit in this regard. It has scenes of sado-masochism, as a female character in the film likes to be beaten before having sex. Because of this you MIGHT wanna think twice before showing this to your kids or grandma. This is a Gothic horror film with a nice ambiance and excellent music--though the same tune is overused a bit through the course of the film. The fun begins when the long-disgraced older son (Christopher Lee) arrives after a long absence. Exactly what he'd done isn't spelled out all that clearly, but you know it resulted in the death of a servant and that he's been disinherited. Soon, Lee is off having fun, beating a member of the family and making love to her...and she likes it! Now you THINK Lee has returned to get some sort of revenge on his family, so I was surprised he took out time for this kinky tryst. And, surprise, surprise, before he can start his plans of revenge, he's stabbed to death! But, through the course of the film, it seems as if he's returned from the dead, and very bad things start to happen...along with some more kinky whippings. The payoff for this tale is pretty good and it's a good film with a nice print. But, it's also a bit uncomfortable watching the kinky stuff, so I certainly can't recommend it without some reservations. By the way, the DVD for this Italian film is dubbed, not subtitled. And, oddly, although you can tell that Lee was speaking English, it's NOT his voice--it, along with the rest, have been dubbed. As for me, I always prefer subtitled.",
         "They say that the most timeless cinema is that of the heart, and here, Italian horror maestro Mario Bava; a director famed for the elements of Gothic romance seen in his work; has crafted one of the world's most strange and terrifying love stories. Yes, for that is what this film, so often called a horror film is at it's core: A love story. But that does not mean for a second that the 'love' it conveys is not a terrifying one. In fact, it may be the most disturbingly poignant of all of Bava's films, as even today it recounts a lifestyle that puts to shame anything that can be accomplished in a giallo film in sending a chill down one's spine, mostly because, it happens every day in real life in some shape or form. Only the era is different. A film that describes something like that is truly timeless. But that doesn't mean it's touching like other love stories you see in heartbreak magazines, no, it's not touching; but it definitely is heartbreaking. On an eerie twilight-lit coast somewhere in Italy, estranged aristocrat Kurt Menliff(Christopher Lee) returns to the family castle, where several years earlier, he drove the daughter of the family maid; Tania, to suicide with a dagger. The details are never explicitly explained on how Kurt's treatment drove her to suicide, but they become chillingly clear quite soon. Of course, it's not just the maid who bears a grudge against Kurt, but his entire family, his father has disowned him, his brother Christian despises him and his former betrothed can't wait to dismiss him. However, his father agrees to let him stay, grudgingly. The Waltons they are not. However, when away from prying eyes, it turns out that family member Nevenka(Dahlia Lavi, playing pretty much the same type of role you'd expect to see Barbara Steele in)is still very much in love with Kurt, so, alone on the beach, he expresses his gratitude the only way he can: He savagely attacks her and starts beating her senseless with a whip!!!!! This would be disturbing enough, except for the fact that, and this becomes clear quicker than you'd think; Nevenka LOVES it. And as Kurt says 'You've always loved violence', it becomes clear this is something Nevenka has had a fetish for for a long time and not just tolerance for an abusive man she thinks she can change; this is how she gets off, and Nevenka continues to fantasize about Kurt day and night. Even after he turns up dead with the same dagger Tania killed herself with jammed in his throat. Kurt's beatings were an addiction she can't live without, what will she do now that he's dead? This is where the film's horror element comes into play: What if Kurt isn't dead? And if he is, who stabbed him? Everyone in the household is a suspect. And things begin to get even more complicated when more and more members of the household turn up dead. Is it Kurt? Tania's ghost? As Christian investigates, the answers begin to grow more and more disturbing. 'The Whip & The Body' is on the whole, a rather grim affair, with the truly sordid subject matter contrasted with the beautiful coastal setting and fairy tale castle. The fact that a truly beautiful romantic tune(later re-used in several Bava films)plays during Nevenka's fantasies makes for a morbid bit of humor. The film will also likely bore many viewers expecting a giallo-type of film(as I've seen this referred to as a giallo or proto-slasher in some circles since it involves a hidden killer using a knife) with it's long passages of silence and talkiness(not to mention that Christian is the blandest hero in a Bava film I've ever seen). Still, typical top-notch direction from Bava, the usual gorgeous cinematography and use of color, along with a moving performance by Lavi and a brief, but unforgettable turn by Lee as Kurt(dubbed in some scenes and not in others) make this more than worth your time. But what gives the film it's lasting power is the disturbing fact that there are men like Kurt, and many women in positions like Nevenka(willingly or unwillingly)in real life who suffer and inflict suffering daily, many of whom cannot even get out of the web of abuse they are in if they have the chance, and some of whom cling to it. And knowing this goes on is more horrifying than anything in any of Bava's more straightforward horror films. Truly ahead of it's time and certainly not for everyone, 'Whip' is a great exploration of many of Bava's recurring themes like the destruction of a family, deceptive appearances(Christopher Lee has never been more handsome), obsession, and ultimately, what Bava called his greatest fear: That of someone alone in a room confronting the darkest aspects of themselves. It may not scare you, it may not even grab your attention, but this film is one of the most haunting pieces of celluloid you will ever see. It's a strange mix of 'Psycho', 'Wuthering Heights' and the relationship between Kurt & Nevenka feels like a prequel to 'The Innocents'. All in all, it's worth seeing. Enjoy, if you can.~",
         "La Frusta E Il Corpo/The Whip & The Body(1963) is an excellent gothic masterpiece that was ahead of its time in 1963 due to the strong imagery of erotic violence. Christopher Lee plays his most evil and sadistic character up to date(I have not seen his film, The Bloody Judge(1969)). His performance proves that he had an awesome presence within him. One theme that regularly occurs in many of Bava's films is the notion of the double that is present in movies like The Mask of Satan(1960), Kill Baby Kill(1967), and The Hatchet for the Honeymoon(1969). This is a great film that is overlooked by many Mario Bava supporters as it is also his best. The best parts of the film was the use of color and how he utizied color in the beautiful film. This movie is one that hopefully in the near future will get the video treatment that it deserves."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Francinor-PIP",
         "Leone Film",
         "Titanus"
      ],
      "summaries": [
         "After the announcement of the servant Losat, the nobleman Kurt Menliff returns to the castle of his family at the seaside to congratulate his brother Christian Menliff for his marriage with his former lover Nevenka. Kurt feels the hatred and the fear of his father Count Menliff and the servant Giorgia, who blames him for seducing and killing her daughter, and indifference from his cousin Katia. On the next afternoon, the sadistic Kurt meets Nevenka riding a horse alone on the beach and whips the masochistic woman and makes love with her. Late night, Nevenka is missing and everybody is seeking her while Kurt is stabbed in the neck with the same dagger that Giorgia's daughter was murdered. On the next days, the members of the family suspects of each other while Nevenka is haunted by the ghost of Kurt.",
         "Kurt Menliff is a ruthless and sadistic 19th Century nobleman who returns to his seafront castle home after years of wondering. He finds himself immediately at odds with his invalid father, a Count, as well as Kurt's spineless younger brother Christian, whom is married to Kurt's cousin and former lover Nevenka. When Kurt is found in his room on the next night, murdered, suspicion falls on everyone which gets more complicated when Nevenka begins seeing his ghost (real or imaginary?) haunting the castle supposedly wanting revenge against his killers.",
         "In the 19th century, a sadistic nobleman terrorizes the members of his family. He is found dead, but his ghost soon returns to haunt the residents of his castle."
      ],
      "budget": 66500
   },
   "movielensId": 7913,
   "movielens": {
      "languages": [""],
      "releaseDate": "1963-08-29",
      "dvdReleaseDate": "2000-10-24",
      "directors": ["Mario Bava"],
      "runtime": 87,
      "movieId": 7913,
      "title": "The Whip and the Body",
      "mpaa": "",
      "actors": [
         "Daliah Lavi",
         "Christopher Lee",
         "Tony Kendall",
         "Ida Galli",
         "Harriet Medin",
         "Gustavo De Nardo",
         "Luciano Pigozzi",
         "Jacques Herlin"
      ],
      "imdbMovieId": "0057078",
      "originalTitle": "La frusta e il corpo",
      "genres": [
         "Mystery",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the 19th century, a sadistic nobleman terrorizes the members of his family. He is found dead, but his ghost soon returns to haunt the residents of his castle.",
      "tmdbMovieId": 27636,
      "avgRating": 2.8875,
      "releaseYear": "1963",
      "numRatings": 40,
      "posterPath": "/ojUTNoYuYEdYktI04UedwWE7cmT.jpg"
   }
}