{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1101048",
      "video": false,
      "title": "Thirst",
      "recommendations": [],
      "backdrop_path": "/x677VDkrQg1zZytCVAzyZDPxme1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Noelle",
               "gender": 1,
               "credit_id": "52fe46eec3a368484e0abba3",
               "name": "Lacey Chabert",
               "profile_path": "/s4gEejBUkJPwdSezGlIpFXeidKD.jpg",
               "id": 22082,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Bryan",
               "gender": 2,
               "credit_id": "52fe46eec3a368484e0abba7",
               "name": "Tygh Runyan",
               "profile_path": "/vHlo0lwXAHGzCBEL6mrum39exdO.jpg",
               "id": 55591,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Atheria",
               "gender": 1,
               "credit_id": "52fe46eec3a368484e0abbab",
               "name": "Mercedes McNab",
               "profile_path": "/6lZx80GFjfkBbjeKEZoe1261uNs.jpg",
               "id": 123149,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Tyson",
               "gender": 2,
               "credit_id": "52fe46eec3a368484e0abbaf",
               "name": "Brandon Quinn",
               "profile_path": "/j3mvjDLe7Hvg3hBkEfpsLB0XBeE.jpg",
               "id": 123148,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46eec3a368484e0abb93",
               "name": "Jeffery Scott Lando",
               "profile_path": null,
               "id": 95407,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46eec3a368484e0abb99",
               "name": "Kurt Volkan",
               "profile_path": null,
               "id": 239993,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46eec3a368484e0abb9f",
               "name": "Joel Newman",
               "profile_path": null,
               "id": 92232,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.506444,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 64861,
      "vote_count": 5,
      "budget": 0,
      "overview": "After wrecking their car in the middle of the desert, two couples find themselves stranded with few supplies. When the heat intensifies and their precious water supply dwindles, the frantic friends begin betraying each other in the hopes of survival. Their civility rapidly deteriorates as they begin to experience overwhelming fear and desperation in this tense drama starring Lacey Chabert, Tygh Runyan, Brandon Quinn and Mercedes McNab.",
      "similar": [],
      "original_title": "Thirst",
      "runtime": 91,
      "poster_path": "/kXh6X6iu2HOstD7Qscnto6Qrqd9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-06-22",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "Open Water in the desert.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeffery Scott Lando"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Kurt Volkan",
         "Joel Newman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1101048/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDE1OTAwMDM3N15BMl5BanBnXkFtZTcwMDkyMTQ3Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Lacey Chabert, Tygh Runyan, Mercedes McNab | See full cast and crew »"],
      "reviews": [
         "This is a well done independent film that has it's weak spots but overall is very good. The cinematography is beautiful in this film and the acting is well done by the four principles. I do wish that the Tyson and Jennifer characters had been flushed out more, their back-story was just not there and it made it harder for me to care about them, the married couple was played out very well and the ending was very heart wrenching. There are of course the \"how could these people be so stupid\" moments, but they are few and the film really does its job in showing how dangerous it is to be in any isolated area with out adequate supplies and ALWAYS let people know where you are. But I remember doing stupid things when I was young so you just have to get past those some points and take in the movie as a whole. Good weekend afternoon flick.",
         "Watch this if...there are no other viable options for a struggle and survival movie. They are many better crafted and acted movies surrounding this theme available before you get to this point. Acting/Casting: 3* - This grade should be expected considering Chabert is your headliner. She is a beautiful specimen and that is her strongest/carrying asset. Brandon Quinn is downright aggravating at times and difficult to watch. Again, this is no surprise going into the movie. Directing/Cinematography/Technical: 5* - The setting is nice and the desert is convincing. While the overall directing isn't great, I feel that you do actually get a bit of the despair that these individuals are experiencing. This is also no surprise considering Lando is an aspiring B-movie director. Plot/Characters: 5* - The plot is nothing new, but survival is always an intriguing theme. If you watch the movie, you will note that there are a few questionable areas in the film. With a plot like this one, you really have to have some solid acting and directing to make it worthwhile. Entertainment Value: 3* - The acting coupled with the fact that there are a few moments that noticeably drag, really diminish the entertainment value of the movie. I have seen worse, but I have seen many better. One watch is enough and probably too much. My Score: 3+5+5+3 = 16/4 = 4.0 Email your thoughts to filmwatchinfool@gmail.com",
         "Despite relying on atmosphere rather than blood and gore, this film does not quench my thirst for a good horror/suspense movie. There may be fine acting, but the film's prone to horriblathermia: Stage 1 - poor characterization; Stage 2 - bland chemistry; Stage 3 - its inability to scare or create feelings of unease; Stage 4 - complete boredom (this is also known as the stage in where there's no hope for this movie now); Stage 5 - predictable ending. The music failed to make it any better. Instead of trying to find a plot (or watch this movie), actually hike through the desert, but bring a lot more water than the idiots in this film did (They only brought 2 bottles, which wasn't very smart).",
         "I found \"Thirst\" to be a lovely little film that I doubt most people will see. Flipping through Jeffery Scott Lando's other films, I'm afraid I haven't seen any of his previous work, but being a fan of all things Buffy-related when I saw Mercedes McNab was in the cast I scooped it up without a second thought. I wasn't disappointed. With breathtaking, oppressive scenery the movie creates a sense of despair mingling nicely the backdrop of the film with the inner turmoil of the lead couple's relationship. The movie reminded of films like \"Open Water\" and other man vs. the natural world themed films. I liked three out of four of the cast. Mercedes McNab did a good job with a relatively standard character in Jennifer. Lacey Chabert seemed well suited to the roll of Noelle, and ultimately showed the most emotion in the film. Bandon Quinn seemed to suit his character of Tyson quite well alternately making me dislike and root for him and wasn't bad to look at either. However, Tygh Runyan's portrayal of Bryon seemed emotionless and out of sync with the rest of the cast. Whether this was due to a character I genuinely didn't like or to the actor's performance I'm not sure, since I haven't seen Runyan in any other roles. As the four, two couples, struggle onward through the desert the plot increasingly revolves less around the characters interactions and more around the dangers that the desert presents. I would have liked to see a bit less of people protesting that they couldn't go onward and a bit more desert danger. Lacey Charbert's character came off as a bit of a know it all, a limitless source of information and the hero of near every scene while the men came off as a bit whiny and rather useless and the ending hit full throttle suddenly and just slammed through a scene that could have built a good long bit of hopelessness. On the whole though, if you like the 'stranded and must survive' style films you'll probably like it, if you don't it'll probably drag.",
         "Oh, my. Where to begin? Lacey Chabert is not only the star of this movie but is listed as one of the executive producers as well. That leads me to surmise that this film was intended, at least in part, to showcase Lacey's talents and get Hollywood to view her as a serious actress. If so, the effort backfires. In order for this premise (stuck in the middle of a desert with very few provisions) to work at all the characters have to make some pretty stupid mistakes. And our characters do. Driving 80 miles into the desert without any sort of backup plan in case of car trouble is, in fact, beyond stupid. As the movie and the stupid decisions continue it becomes increasingly hard to either believe the story or feel any sympathy for the characters. Thank God for Noelle (the lovely Lacey)! She is cast as a Captain Kirk here, keeping her cool while the others around her are losing theirs. But her hero status is all too clearly a plot device, again, to showcase her \"talents.\" At one point Lacey performs emergency brain surgery using s screwdriver and a rock. I kid you not! She can do this, but she isn't smart enough to realize they should travel at night and stick to the road! As a person who rarely laughs out loud even at things that are supposed to be funny, I actually found myself laughing out loud at some of the plot twists. (Did someone mention breast implants?) Of course, the movie also has to show us several \"gross out\" scenes for seemingly no other purpose than to get some junior high viewers to say \"Oh! Gross!\" Not only do we get to watch characters drink their own urine, we have to watch them take in every last drop. \"Ewwww! Gross!\" Need I say more? This is a really bad movie with only one redeeming feature: The lovely Lacey Chabert who I have always liked in the past. \"Thirst\", however, is probably the biggest misstep in Lacey's career.",
         "Thirst is a truly embarrassing film, a genuine waste of footage that falls short in virtually every way. It has bad acting, bad characterization, and even bad camera work. It is a debacle. The film follows four people who get stranded in the desert after a minor accident. Four of the most annoying people you will ever see on a film screen. Only the Lacey Chabert character is even vaguely intelligent. Her husband is too stupid to pick up on the fact she is pregnant after she starts having morning sickness and avoiding alcoholic drinks. The model played by Mercedes McNab is so stereotypical and stupid you practically root for a coyote to come eat her. These characters fail to use even common sense desert survival techniques such as traveling at night. Similarly, the best way to deal with an angry rattlesnake is not to stand still within striking distance. I've never even been to a desert and I know this. Furthermore, the camera work borders on the disgraceful. Although there are a few nice shots of sunsets, the scenes filmed at night seem murky, as if they left on the lens made for bright light. Many of the day scenes seem bleached out, although that could be a result of the geography. Avoid this film at all costs.",
         "at the time of writing this has a 4.5 rating from 141 reviews, thats misleading from such a small number of reviews. The stuck in the middle of nowhere/survival movie has been done a hundred times, its normally down to the director if the movie is worth seeing. Director Jeffery Scott does a good job here, not having too long of an intro to the characters at the start which some films make a meal of and then once they get into trouble, he builds the suspense and the angst slowly. The cast of almost unknowns do fairly well here, and the beautiful lacey chabert should go on to do better stuff. There are some plot holes and eyebrow raising scenes here which you'd expect from a low budget film but on the whole, this kept my interest throughout and is a good edition to the genre.",
         "Based on the average review of 4.5 stars, I was really hesitant to even watch this, but I like this kind of movie, and have always thought Lacey Chabert was a pretty decent actress. I'm glad I gave it a chance. I thought the character development was nicely done. It wasn't just a survivalist movie with a cast of people you could care less about. I thought it seemed pretty realistic overall, except there were a few obvious errors, such as the lack of sunburn that would have definitely been there after so many days in the hot sun. The twist towards the end, not really a twist, but something I didn't pick up on until it actually presented itself, was genius. Not sure that it is that believable tho, probably the coyote would have gotten to it first. I won't say what it is because I don't want to ruin it for anyone. I would recommend this to anyone, and even say it is probably one of the very best of this type of \"stranded in the desert with not enough supplies etc.\" movies out there.",
         "Noelle (Lacey Chabert) thinks she may be pregnant with her boyfriend Bryan (Tygh Runyan). Tyson (Brandon Quinn) leads them and Atheria (Mercedes McNab) to Devil's Children in the middle of nowhere to shoot some pictures. They swerve to avoid a wolf in the road and drive off the trail. Neither guys are likable although Tyson is a deliberate choice. Bryan isn't much better despite probably suppose to be the nicer guy. He's not a good boyfriend. Atheria is the classic superficial blonde. Noelle played by Chabert is closest to a likable human being although her relationship is more annoying than anything. This is a boring survival movie for a long time. Some guys may be bowled over by Lacey in a bikini but there is nothing here. The only interesting thing is where Noelle finds water. I can honestly say that I have never seen that before.",
         "The right decision would have been to backtrack at the point where the vehicle left the road. Why head elsewhere to unknown territory when all they had to do was keep walking on the road until hopefully a vehicle would show up? Then again, there would be no movie and all the suspense. I watched the movie and did enjoy it but after even one day hunger starts to set in and with the intense heat and no proper attire e.g. the women then would have been sunburned and totally exhausted. Doubt that the baby would have survived under those conditions. Where was the movie filmed as the area was so desolate and scary? It was risky for Noelle to attempt what she did on Jennifer when there was no medicine or sanitary conditions available. That was not believable."
      ],
      "genres": [
         "Drama",
         "Horror"
      ],
      "productionCompanies": [
         "Insight Film Studios",
         "Canadian Film or Video Production Tax Credit (CPTC)",
         "Province of British Columbia Film Incentive BC"
      ],
      "summaries": ["Two couples roll their truck in the desert 80 miles away from anywhere."],
      "budget": 0
   },
   "movielensId": 79136,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-06-22",
      "dvdReleaseDate": "2010-06-22",
      "directors": ["Jeffery Scott Lando"],
      "runtime": 91,
      "movieId": 79136,
      "title": "Thirst",
      "mpaa": "R",
      "actors": [
         "Lacey Chabert",
         "Tygh Runyan",
         "Mercedes McNab",
         "Brandon Quinn"
      ],
      "imdbMovieId": "1101048",
      "originalTitle": "Thirst",
      "genres": [
         "Drama",
         "Foreign",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["YTT_EmF9Bas"],
      "plotSummary": "After wrecking their car in the middle of the desert, two couples find themselves stranded with few supplies. When the heat intensifies and their precious water supply dwindles, the frantic friends begin betraying each other in the hopes of survival. Their civility rapidly deteriorates as they begin to experience overwhelming fear and desperation in this tense drama starring Lacey Chabert, Tygh Runyan, Brandon Quinn and Mercedes McNab.",
      "tmdbMovieId": 64861,
      "avgRating": 3.30769,
      "releaseYear": "2010",
      "numRatings": 13,
      "posterPath": "/kXh6X6iu2HOstD7Qscnto6Qrqd9.jpg"
   }
}