{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "theatre play",
         "id": 4326
      }],
      "imdb_id": "tt3962302",
      "video": false,
      "title": "Passing Strange",
      "recommendations": [],
      "backdrop_path": "/W5v0iTTrh4EU5jNIBwOTajrNaD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Edwina / Marianna / Sudabey",
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bc3f",
               "name": "De'Adre Aziza",
               "profile_path": null,
               "id": 91668,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Youth",
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bc43",
               "name": "Daniel Breaker",
               "profile_path": null,
               "id": 91669,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe4498c3a368484e02bc47",
               "name": "Eisa Davis",
               "profile_path": "/lZ4gwL2vGQQ0twUzxOOVmK3EKmV.jpg",
               "id": 91670,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr.Franklin / Joop / Mr. Venus",
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bc4b",
               "name": "Colman Domingo",
               "profile_path": "/otQg0XX0fSnnOHZphdWwwjJc8lA.jpg",
               "id": 91671,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rev. Jones / Terry / Christophe / Hugo",
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bc4f",
               "name": "Chad Goodridge",
               "profile_path": null,
               "id": 91672,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sherry / Renata / Desi",
               "gender": 1,
               "credit_id": "52fe4498c3a368484e02bc53",
               "name": "Rebecca Naomi Jones",
               "profile_path": "/yZVyqJ4LrhChkuK2bzJR0gYSZ3c.jpg",
               "id": 91673,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bc59",
               "name": "Butch Robinson",
               "profile_path": null,
               "id": 69618,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bc65",
               "name": "Barry Alexander Brown",
               "profile_path": null,
               "id": 5289,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bc6b",
               "name": "Barry Alexander Brown",
               "profile_path": null,
               "id": 5289,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4498c3a368484e02bc71",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4498c3a368484e02bc77",
               "name": "Steve Klein",
               "profile_path": null,
               "id": 56986,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5710c4f7c3a368412200358b",
               "name": "Matthew Libatique",
               "profile_path": "/wUnEHGYRQRa459aGoTZpqYRwAIK.jpg",
               "id": 4867,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a195f06c3a3680b9a02be16",
               "name": "Stew",
               "profile_path": null,
               "id": 1929296,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.484743,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24487,
      "vote_count": 6,
      "budget": 0,
      "overview": "A young black artist leaves his Los Angeles digs and travels to Europe to find himself. A theatrical stage production of the original Broadway musical",
      "similar": [
         11545,
         866,
         1934,
         253299,
         4951,
         207,
         10229,
         810,
         45772,
         375315,
         61891,
         11971,
         10050,
         1716,
         12524,
         225728,
         197082,
         10549,
         10210,
         91745
      ],
      "original_title": "Passing Strange",
      "runtime": 135,
      "poster_path": "/hYyhhd15LVTPUSWFpMYbebyV1t5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "40 Acres & A Mule Filmworks",
            "id": 4319,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Apple Core Holdings",
            "id": 4320,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shubert Organization",
            "id": 4321,
            "origin_country": ""
         }
      ],
      "release_date": "2009-08-21",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Spike Lee"],
      "runtime": 135,
      "synopsis": "A young black musician travels on a picaresque journey to rebel against his mother and his upbringing in a church-going, middle-class, late 1970's South Central Los Angeles neighborhood in order to find \"the real\". He finds new experiences in promiscuous Amsterdam, with its easy access to drugs and sex, and in artistic, chaotic, political Berlin, where he struggles with ethics and integrity when he misrepresents his background as poor to get ahead. Along with his \"passing\" from place to place and from lover to lover, the young musician moves through a number of musical styles from a background of gospel to punk, and then blues, jazz, and rock. He finally returns home to meet his mother to find she has passed away. This based on the life of Stew who is also the Narrator. This is a film of the stage show not a full out Movie like Sweeney Todd or Hairspary But still I think one of the greatest pieces of theater in the last ten years.",
      "writers": ["Stew"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1259583/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1OTg1NjI5OF5BMl5BanBnXkFtZTgwMTY0ODExMzE@._V1_SY259_CR33,0,214,259_AL_.jpg",
      "actors": ["Stars: De'Adre Aziza, Daniel Breaker, Eisa Davis | See full cast and crew »"],
      "reviews": [
         "As a fan and five time repeat visitor to the magical experience that was \"Passing Strange\" on Broadway, I will reticent to see the experience moved into the world of film. The play achieved such a delicate balance of beauty, art, and reality that I was terrified that a film was going to upset the balance. I could not have been more worried for naught. Spike Lee's film opened Friday, and at the time of this writing it is early Sunday morning, and I have now seen the film 3 times in the sole theatre it is playing in here in NYC. The magic of this exquisite piece of theatre encompasses brilliance in direction, acting, singing, and writing in both the script and the music and translates BEAUTIFULLY to the screen. Spike Lee manages to lightly and expertly place his own fingerprints on an already marvelous piece without upsetting the delicate balance director Annie Dorsen achieved with the live show. He captures a subtlety in the performances in the filmed version that was evident but not as crystalline clear in the theatre from 30 feet away. Every subtle moment registers in closely framed film in a way that manages to not only capture the electricity of the performances, but the subtlety of being in very close proximity to the actors. And the acting is nothing short of brilliant. All of the original cast is present in the film and this wonderful ensemble cast is one of the most attuned ensembles i have ever had the privilege to see. From Daniel Breaker's nuanced and wonderfully ranged performance as the everyman character \"Youth\" to Eisa Davis' heartbreaking performance as his mother to Stew's incredible turn as the narrator of the story of his own life, there is enough rawness and reality to turn even the hardest of hearts. This is without even having thus far mentioned the brilliant range of performances that Colman Domingo, De'Adre Aziza, Chad Goodridge and Rebecca Davis (in no particular order) bring as no fewer than 16 different characters ranging from constricted upper-middle class California residents to free-thinking freedom experts in Amsterdam to self-tortured artists and revolutionaries in riot-torn Berlin. Singling out individual characters or performances among this delightful cast of roles and actors is impossible as there aren't any among them that don't deserve mentioning in great detail. And the music... good lord: the music. From blues to pop, from punk to funk, this score has it ALL. The band, always present on the stage, is just as much a part of the show as the singer/actors. Band members Heidi Rodewald (who co-wrote), Christian Cassan, Christian Gibbs, and Jon Purney perform in a way that makes them almost akin to a Greek chorus, providing the instrumentation, commenting and interacting with the story as it unfolds. This show was a very rare show indeed. An everyman's' tale of self-discovery that is relatable to anyone with any intelligence. The movie only manages to improve on an already wonderful experience. Do yourself a favor: see this now. As for me, I have to sleep now so I can get up and experience this film again tomorrow and see where \"Passing Strange\" takes me today.",
         "\"All this might seem obscure, that would depend on who you are.\" Stew's line that is easy to miss is a good tagline for Passing Strange. I had been waiting over a year to see Spike Lee's filmed version of the Broadway musical. I was lucky enough to see it during its too brief run at the Belasco Theater and it really changed my life. Its corny to say it, but Passing Strange of art really did affect me like no other work of art ever has. It really spoke to where I was at in my life at the time when I saw it. So Passing Strange was filmed by Spike Lee to preserve the show forever and from the moment a director was announced, I became unbearably eager to see the finished product. It got shown on the film festival circuit to nearly universal rave reviews which intensified my desire to see the film. I finally got to catch the film on Pay-Per-View at my girlfriend's parents' house. The verdict? It was truly amazing and just as touching, but very different. Seeing a show live and seeing something filmed are very different experiences because in seeing live theater, your eyes can wander to whatever actor you so desire. In a film, the camera tells you what to look at. So in that regard, the show was different. Also, since a camera can get very close to the actor's face, the emotional impact of the actors was much stronger. One of the aspects that I really picked up on during this viewing was how connected every aspect of this show is. Everything you see and hear happens for a reason and each interaction furthers the main character's story bit by bit. I was also taken by the poetry that is Stew's script. So many portions of the script just flow because of the lyrical quality of his writing. My girlfriend watched the film with me because I have been raving about PS for as long as I've known her. She owed it to me because she made me sit through Legally Blonde the Musical. She did not get into the show or follow it very easily both because of the way the story was presented (the plot jumps in and out a bit) and because she didn't get into some of the more performance art elements of the movie. So for this reason, I will say that Passing Strange is not for everyone. Passing Strange is not your typical musical. It is experimental. It will make you think. It is full of pop culture references. It expresses truths about life. It is a heavy piece of musical drama, but it is also highly entertaining if you can get into it. Needless to say, I highly recommend this movie and, honestly, I'm so attached to the show at this point that if you've seen it, no matter your opinion of the film actually is, I will respect you. I just hope that it does well in Pay-Per-View and on DVD eventually because, like the Broadway show, they don't seem to be advertising this film very well...",
         "Thanks to Spike Lee, we are finally able to experience one of the very best musicals of the last few years on screen and what a helluva of experience this is. Tony-winning Passing Strange is not your ordinary rock musical as it uses a wide variety of music styles exploring such genres as soulful blues, energetic punk rock, brutal new wave, gospel and cabaret. The force behind this spectacle is Stew, the musician who wrote and co-arranged the whole performance. He is also the narrator displaying his impressive skills especially in singing. Overall, what an amazing guy he is! His partly autobiographical story is universally relatable depicting a young man's struggle for artistic fulfillment. As the main character travels to Europe, Stew spices it with brilliant cultural satire deeply ingrained in history. He steers clear of being oversentimental and often provides us with auto-irony, which is crucial when you want to make people laugh. He even goes as far as to comment on his role as an artist/creator and nails it perfectly building to an ecstatic finale filled with uncontrolled joy. Besides, Passing Strange features superb performances from every single member of the extremely talented cast. Some of them had a difficult task channeling many characters like Colman Domingo, particularly incredible as controversial musician Mr. Venus. I couldn't resist the charms of De'Adre Aziza and Rebecca Jones who appeared to be extremely versatile actresses as well as fabulous singers. Daniel Breaker in a leading role also delivered top-notch performance encompassing the whole range of emotions. Spike Lee's cutting is fast, dynamic and hyper-kinetic to the point that the filmed performance resembles an actual movie. The camera is always in the right place frequently showing sweat on the faces of ideally synchronized performers. To conclude, Passing Strange ranks among the most unforgettable movies I've ever seen. It's refreshing, exhilarating and very special for me.",
         "The answer is most certainly Yes! Passing Strange is a rock concert, a play, a musical, a movie, a fable, real life. There is so much completely appropriate about how this is portrayed. Completely understanding of the same struggle and questions so many \"artists\"(including myself) go through combined with the stubborn ignorance of youth(including myself), this is a show that is so much more than a show. It's a feeling, a truth, an epiphany, a love letter, an explanation, a question. To categorize it into one single thing would be a disservice to this piece of art. Many people may not empathize with it, and that's fine because many people do not go through these feelings the same, but there is a vast group of people who this show will hit home to. Spike Lee did a flawless job in maintaining the values of a stage production while adding in some artistic twinges to make a clever translation to film. Everyone who has ever wondered what the \"real\" is should see this movie. Everyone who has ever felt like Love isn't Love if it's not understood should see this movie. Everyone who has ever had to learn what \"truth\" is should see this movie.",
         "Passing Strange is a powerful rock musical/opera/Greek tragedy that plays out like few rock musical/opera/Greek tragedies I can think of. Maybe Tommy comes to mind, but in this case the writer of the book and the songs, Stew, is concerned with someone who knows well enough about the life being led, and about finding what is \"real\" about it. It's a profound story, but not simply for the actual story being told. We've seen this before, sure. It's the combination of the elements, of making the songs and music integral with the character himself and the places he tries to find and live in. It's about love and loss, being lost and unsure of the direction of one's life, the paramount nature (and lack thereof) of family, of the consequences that come with a life without any accountability, and what music and songs do to it (one such scene, for example, is when Daniel Breaker's 'Youth' plays a song about losing a girl, and the song keeps going on as there's nothing else around him to stop him). It's a brilliant and audacious production, full of true variety in musical tastes and styles. It has a few quasi-typical 'musical' songs, sure, the kind of songs you probably wouldn't listen to outside of the context of watching the show live or watching this concert movie unless you're a die-hard musical fan. But most of them are catchy, and all of them have lyrical integrity and work fully as part of telling a story and revealing character and theme. In fact, I can't really think of a single song or moment of musical inspiration that disappointed me; only the first couple minutes of the 'Berlin' musical number threw me for a loop, but then again it's unlike anything else in the show - until one gets acclimated to its amazement and its warped sense of humor. Another great thing too, I should add, is Stew's sense of exuberance of life, its humor coming out of the ordinary (nagging mother) or the referential (\"What about the Clash?\" one of the band members asks about the validity of social-conscious punk). What makes this live-shot concert movie so engaging (not so much documentary, although Spike Lee throws in a few moments with the cast backstage in the intermission it's nothing substantial to make it a real documentary) are two things really. First, of course, is the outstanding nature of the content: all of the first-rate performances, mostly by actors playing multiple characters based on the setting (from LA to Amsterdam to Berlin, with Stew and his band members as a Greek chorus commenting and providing juxtaposition), all of the energy and force of the music that is perfect for a full audience to experience, and how the author's own life experience ultimately informs the material (I loved Stew's little story about a pretzel vendor laying it down for him about reality being a construct for one's self, which leads into the end of the show). Secondly though is the quality of the film-making. And this is where Passing Strange succeeds wonderfully as 'taped' theater. It's like Lee took all of the practice he's had filming live before (i.e. Original Kings of Comedy, Kobe Doin' Work) and helped elevate live theater for cinematic expression. Some of this, to be sure, should be attributed to Matthew Libatique, a sublime cinematographer (how much he had to do with the actual lighting of the show itself or how the camera got it I don't know) who incorporates some 16mm footage at times in the show, but at only the right moments based on the scene or song like the acid trip or Breaker's intentionally pretentious monologue while in Berlin. But as well it's the editing; Lee has so much coverage here that he can create scenes out of just actors on a stage, and incorporates the band members who are often supposed to be out of view, and as well Stew's facial reactions that the audience in the theater might not see all the time. You can lose yourself in just watching it as a 'movie' instead of being reminded it's live theater, and as kinetic as it can get (it is Spike Lee after all) it compliments the material. Go see it, either on a big screen (which if you're in the NYC area is highly advisable) or, if not, with a bunch of friends or family around a good-sized TV. It's beautiful work all around, for Stew on his closing night of the show and for the director filming it who has one of his best works in years by just keeping right up with everybody else. Sensational is the word for it.",
         "I had the opportunity to see \"Passing Strange\" on Broadway twice. The second time was the night before the Tony Awards, when it was a co-favorite to win Best Musical. I have seen countless Broadway shows, but that night was one of my top 3 Broadway experiences ever. The cast and the audience were completely electric and I left the theater breathless. This show is so open and honest about its emotions, the cast is amazingly versatile, with exceptional talent, and the music is quite memorable. Also, when I least expected it, there was an emotional component that reduced me to tears, as it caused me to draw parallels to my own life. Great theater can do that. I was disappointed at how the show segment came across on the Tony telecast, because the show was far better than what was shown that night, so I was thrilled when I heard that Spike Lee made a lasting record of this, to reach the audience it deserved. My biggest fear was that it was going to be more documentary than a staging of the show. So, naturally, I was overjoyed when I realized that the only documentary aspect of Passing Strange was the backstage snippets slipped in at the musical's intermission. It was an interesting addition to the experience. Anyone who loves the stage and wants to see an amazing, original musical, should really check this out. It is one of those unexpected delights...not overly hyped...but thoroughly satisfying. I must say I am mystified by the rating system on here. When I last checked it had a weighted rating of only 6.6. When one looks at the actual breakout of votes, this is almost incomprehensible. The vast majority give it a 10 (or 8 and 9). There was a much smaller amount that give it a 0 or 1, but if you average things out even a little, there is no way this is lower than an 8, by any measure. Unless one hates Broadway musicals it is a little obscene to give this film that low of a vote. In the interest of disclosure, I work in media, and interviewed Daniel Breaker between the first and second time I saw \"Passing Strange.\" But I have interviewed many performers and watched many Broadway shows. I had no stake in this show and was probably even more impressed by it, considering all the shows I have seen. I cannot recommend \"Passing Strange\" more highly. It is unlike anything I have seen on Broadway and I would hope that Stew continues to create memorable, life-affirming experiences.",
         "Two of my favorite scenes in movie history in the same movie: Arlington Hill, where the Rev. Franklin's son talks about experiencing Europe through the eyes of films (Bergman's Persona, Fellini's La Dolce Vita, Godard's Band of Outsiders), and then his rather frank discussion of slaves, cowards, and black people passing for black. Slaves have options - escape, revolt, death. Cowards have... consequences. Keys, when Marianna sings about giving him the keys to her Amsterdam apartment and opening up her world to him. We're your new family, man. I think I could watch these scenes everyday of my life and not get tired of them.",
         "I stumbled on this as part of the 'Showtime' cable offering in 2014. The description was: \"A young African-American travels to Europe on a journey of self-discovery in order to explore music and become a successful artist\" Seriously. Not: \"The Tony award winning Broadway musical that uses styles from Gospel to Punk Rock to illustrate the globe-trotting soul searching journey of a young man searching for \"The Real\" of life. Directed by Spike Lee and featuring the music of Mark Stewart ('The Negro Problem').\" I am a huge fan of 'The Negro Problem' and recognized Mark Stewart's voice instantly. I would rate this up with 'Jesus Christ Superstar' as an epic musical. See it.",
         "I found Spike Lee's filming of this musical to be extraordinary because I felt like I was in the audience and on stage at the same time. The music is good and the plot stays interesting. The great thing this play expresses is how an individual tries to escape the confines placed on his existence by virtue of his race. Many people can relate to taking the journey to self discovery. As an African-American, it was interesting to see how the \"Youth\" wanted to escape from his confines by heading to Europe where there didn't seem to be any confines. There tension of this escape is illustrated between the scenes between the Youth and his Mother, and at one point she asks him why can't you be comfortable with your own? This musical is funny, religious, and international at the same time. All of the actors were great. The music was fantastic. All hail Stew!",
         "It's difficult to imagine what the few \"taste makers\" who flogged this lame ego piece to a failed Broadway run saw in the performances they saw Off-Broadway to try and make it the darling of the artistic set or what anyone other than a press agent or Spike Lee sycophant sees in this problematic DVD previously shown on the \"festival circuit\" and (on the release date of the DVD) on PBS. Welcoming \"rock\" musicians back to theatre writing is an admirable, even essential idea, but it's best done when the artist in question has a basic love for the theatre - as in Cyndi Lauper's Tony winning score for the 2013 KINKY BOOTS - or is persuaded to work with those who who know what they are doing. Try it with a self indulgent \"talent\" like Stew with a contempt for the genre (expressed explicitly at the cast album recording session and in this filmed performance where he makes it clear that he doesn't like being locked into a fixed \"book\" and the show will never be revived - even if its lack of commercial success had not assured that already) and it's a recipe for disaster - which is what the Broadway run, recorded here at the closing performance, was. As with any fiasco from BUTTRIO SQUARE to CARRIE, there were a vocal few transported by things that seemed fresh to them, but not enough to keep the show or the film alive in any commercial sense. Sadly, sometimes the verdict of commerce is correct. During the run of what is essentially a narrated rock concert with second or third tier \"rock\" music (there are three or four interesting \"character\" songs and the young Stew's sojourn in Amsterdam *almost* catches fire) hung on the barest of frameworks of Stew's reminiscences of parts of his life (for which he won an indefensible Tony Award for \"Best Book\" - the show's only, but few seriously expected it to win more - some feared the show's noisy exponents might lift it to one for Stew himself for what amounted to a \"personal appearance\"), we were told by many friends that Stew's cast album (recorded excerpts done in a fairly normal recording session but, for publicity reasons, in the theatre where the show played, before a live audience who paid for the privilege of observing - Stew narrated for the first few numbers until he got bored and told the audience \"you don't need this ****\" - the four letter euphemism for excrement is a prohibited word on IBDB, but Stew's own referring to his book!) would have a virtual lock on the Grammy Award because \"everyone in the music business\" knew and loved Stew. That claim turned out to be a press agent's (or Stew's) fantasy - the album wasn't even nominated! With the death of the \"brick and mortar\" record and CD store where we could actually SEE who was selling \"in the bins\", skeptics were left wondering if Stew WAS even a successful rock artist as the show and its hype claimed, or just another \"wanna-be\" jazz musician with a good press agent. This messily packaged DVD was made because Stew WAS able to persuade genius film maker Spike Lee that he (Stew) was another self made genius, and throw his name and money behind the project. Before seeing the result, there was considerable concern that the result might be just a documentary on the show without really SHOWING much of it. That fear at least was allayed. All that's here (other than the usual backstage features as \"extras\") is a filming of the closing performance - although it's an open question how much a new viewer - even one who might have enjoyed the show - will GET it, given the WAY it's filmed. It's hard to determine from the finished product how much film maker Spike Lee was actually allowed to do. Rather than elevating the project to Lee's level of inventiveness, we're left with a bad concert badly filmed with madly illogical, unilluminating camera angles frequently blocking the story or the person actually singing, and close-ups which make 1950's television look sensitive and rarely adding any style or point of view to the event being filmed. Any Broadway \"completist\" will have to have this disc anyway - it was filmed in the beautiful Belasco Theatre with the cast that actually played the show for its 165 somewhat forced performances (Feb 28 - July 20, 2008), and the supporting cast at least is fully professional - even admirable. Daniel Breaker is particularly good as \"Youth\" (the Young Stew), although the close-ups and camera angles do him no favors. It just isn't a very good show to begin with, and very poorly filmed. What a pity."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Musical"
      ],
      "productionCompanies": [
         "40 Acres & A Mule Filmworks",
         "Apple Core Holdings",
         "KQED"
      ],
      "summaries": ["A young black artist leaves his Los Angeles digs and travels to Europe to find himself. A theatrical stage production of the original Broadway musical."],
      "budget": 0
   },
   "movielensId": 79329,
   "movielens": {
      "languages": [""],
      "releaseDate": "2009-01-16",
      "dvdReleaseDate": null,
      "directors": ["Spike Lee"],
      "runtime": 135,
      "movieId": 79329,
      "title": "Passing Strange",
      "mpaa": "",
      "actors": [
         "Daniel Breaker",
         "De'Adre Aziza",
         "Eisa Davis",
         "Colman Domingo",
         "Chad Goodridge"
      ],
      "imdbMovieId": "1259583",
      "originalTitle": "Passing Strange",
      "genres": [
         "Romance",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young black artist leaves his Los Angeles digs and travels to Europe to find himself. A theatrical stage production of the original Broadway musical.",
      "tmdbMovieId": 24487,
      "avgRating": 3.4,
      "releaseYear": "2009",
      "numRatings": 15,
      "posterPath": "/d6J7AZoTnxEpDYIfphek5AZU5s3.jpg"
   }
}