{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "car",
            "id": 33885
         },
         {
            "name": "trolley",
            "id": 155428
         },
         {
            "name": "stealing car",
            "id": 155430
         }
      ],
      "imdb_id": "tt0060161",
      "video": false,
      "title": "Beware of the Car!",
      "recommendations": [
         57778,
         20871,
         45210,
         20886,
         116733,
         37175,
         84254,
         70966,
         63304,
         77294,
         270393,
         31648,
         77759,
         27940,
         31139,
         43680,
         67467,
         213321,
         145760,
         20878
      ],
      "backdrop_path": "/A5WX4U8thQYroOzQ5kS910Jq45p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Yury Detochkin",
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc89",
               "name": "Innokentiy Smoktunovskiy",
               "profile_path": "/v2SZCr0QLYU9kYrkEIZqXFVaiRf.jpg",
               "id": 1119000,
               "order": 0
            },
            {
               "cast_id": 20,
               "character": "Maxim Podberezovikov",
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc95",
               "name": "Oleg Efremov",
               "profile_path": "/mGU458mKY7bQvXjb4oZb3z0BQPi.jpg",
               "id": 1190216,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Officer",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc6d",
               "name": "Georgi Zhzhyonov",
               "profile_path": "/zJm4Gk6gOs1U0P6GvbrnMaosRjW.jpg",
               "id": 115541,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Lyuba",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc8d",
               "name": "Olga Aroseva",
               "profile_path": "/qskVFl7T7eRxLS0czD3TkkQYTNx.jpg",
               "id": 1190205,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Detochkin's Mother",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc69",
               "name": "Lyubov Dobrzhanskaya",
               "profile_path": "/4UbhDaEcNk33vdjdp6jOrs0E7YI.jpg",
               "id": 544513,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Dima Semitsvetov",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc9d",
               "name": "Andrey Mironov",
               "profile_path": "/dRzRnMbhkhZJAQwaeaSJqap8fBv.jpg",
               "id": 1190345,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Sokol-Kruzhkin",
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cca1",
               "name": "Anatoli Papanov",
               "profile_path": "/dTRITR6bcr9DCtlmIsRJju2Xafm.jpg",
               "id": 1189304,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Acting coach",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cca5",
               "name": "Evgeniy Evstigneev",
               "profile_path": "/wj96pIpQfj7VBHSBsLfSsNsxwd9.jpg",
               "id": 1190350,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Judge",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc71",
               "name": "Lyubov Sokolova",
               "profile_path": "/xUkKV4oSY0PQxwVLoSnzhzCAf2z.jpg",
               "id": 86676,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Car mechanic",
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc75",
               "name": "Vyacheslav Nevinnyy",
               "profile_path": "/eFlOfi0BotFk8SZ2NfZb9uXX0j5.jpg",
               "id": 86752,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Senior Insurer",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc79",
               "name": "Gotlib Roninson",
               "profile_path": "/xq3pajXZobK2idOXRVIdiH5vsDO.jpg",
               "id": 544511,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc91",
               "name": "Donatas Banionis",
               "profile_path": "/hbeqbytpzJ99rQwhcYipwVq4qJS.jpg",
               "id": 1190206,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Customer",
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc99",
               "name": "Galina Volchek",
               "profile_path": "/pR55uBTlVkiE14jnBX0LKL0PYPM.jpg",
               "id": 1190261,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Inga Semitsvetova",
               "gender": 0,
               "credit_id": "575c694b9251415a0a001a81",
               "name": "Tatyana Gavrilova",
               "profile_path": null,
               "id": 1581647,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc65",
               "name": "Eldar Ryazanov",
               "profile_path": "/vYBfLeUqqmknPtTSyv70uwcWLDI.jpg",
               "id": 107669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe472f9251416c9106cc7f",
               "name": "Emil Braginskiy",
               "profile_path": "/oZpfdA84lGI5iWV4UGqTNrIx0ne.jpg",
               "id": 107670,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472f9251416c9106cc85",
               "name": "Eldar Ryazanov",
               "profile_path": "/vYBfLeUqqmknPtTSyv70uwcWLDI.jpg",
               "id": 107669,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "575c6991925141786f000459",
               "name": "Yekaterina Ovsyannikova",
               "profile_path": null,
               "id": 1633894,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57648254925141129a00002c",
               "name": "Anatoliy Mukasey",
               "profile_path": null,
               "id": 1130360,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5764825bc3a368279f00002e",
               "name": "Vladimir Nakhabtsev Ml.",
               "profile_path": null,
               "id": 238685,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59402d1d9251414aee012c21",
               "name": "Andrei Petrov",
               "profile_path": null,
               "id": 549138,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.806658,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 39768,
      "vote_count": 29,
      "budget": 0,
      "overview": "An insurance agent who moonlights as a carthief steals cars various crooks and never from the common people. He sells the stolen cars and gives the money to charity. His best friend, a cop, is assigned to bring in this modern robin hood.",
      "similar": [
         920,
         14136,
         817,
         818,
         4108,
         924,
         168259,
         158,
         49013,
         19912,
         105,
         165,
         11451,
         9679,
         10483,
         13223,
         275,
         621,
         955,
         7461
      ],
      "original_title": "Берегись автомобиля",
      "runtime": 94,
      "poster_path": "/2xuOwMDDk4gs6knZ4xZdjolMHib.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1966-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Eldar Ryazanov"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Emil Braginskiy",
         "Eldar Ryazanov"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0060161/",
      "coverLink": null,
      "actors": ["Stars: Innokentiy Smoktunovskiy, Oleg Efremov, Lyubov Dobrzhanskaya | See full cast and crew »"],
      "reviews": [
         "The absence of reviews here prompts me to say a few words. I saw this in a cinema in Moscow in 1966 [despite date above], a popular film there at the time. I couldn't follow all the dialogue at the time, but I recall being struck by the believability and humanity of the whole thing. Russian public were right on the side of the anti-hero, though he was no swashbuckler and the ending is dispassionate. This was still during the time of the Soviet thaw, and Moscow was heaving with American tourists. Life was better for Russians and things were looking up. The old gallant Soviet war heros had become less interesting, and the time was right for someone more complex, surfacing, perhaps, from the rich literary tradition. A perfect Geroi nasha vremeno - my theory anyway. I'd just like to see it again before giving it a rating!",
         "Beware of the Automobile. What would a Russian say when you mentioned it in front of him? I'm a Russian myself and I know. When someone mentions the movie's name, the other person would go babbling on about the storyline, every single detail from start to end. He would imitate highly enjoyed moments in the highly enjoyed film. He would repeat memorable quotes (which sound funnier in Russian). And he would go asking everyone if they knew interesting facts about the interesting film. With non-Russians, however... well, to be honest I don't know. I have this movie on VHS in Russian and I never showed to an English speaking person before, but I think that even some non-Russian people will be fascinated by this film. I certainly am. I watch this movie whenever I get the chance. And I always love it, no matter how many times I've watched it. The director, Eldar Ryazanov is a highly-loved Russian director and has directed a lot of classical Russian films, not one which I don't like. Go Ryazanov! Go Beware of the Automobile! Go whoever watched this film! Go whoever enjoyed it! Rating: 10/10",
         "\"Beware of the Car\" aka \"Uncommon Thief\" or \"Watch Out for the Automobile\" is the comedy directed by one of the most famous and talented Soviet directors Edgar Ryazanov in 1966. Eldar Ryazanov, the master of the comedies, one of the most beloved Soviet and Russian directors, had directed many masterpieces, and I am not afraid to say so. I've seen his films when they were first released, and I've seen them many times since and they just don't get old or outdated. They are brilliant, they are sparkling, they are not slapstick laugh-out-loudly comedies, they are rather lyrical delicate dramedies and they are fabulous. The writing is always first class. Ryazanov often wrote the screenplays for his movies, and his best ones were the result of his cooperation with Emil Braginskiy - just like in \"Beregis' avtomobilya\". One of the most talented Russian film composers, Andrei Petrov who had written music scores for over 80 films and worked with Georgi Daneliya, George Cukor, Daniil Khrabrovitsky, Leonid Menaker, and Aleksei German among many others, had written his most beautiful melodious and recognizable scores and songs for Edgar Ryazanov. If I start talking about the actors who played in Ryazanov's B/W early comedy, \"Beregis' Avtomobilya\", someone would have to stop me. Who is who of the Soviet big screen and drama stage took the roles, even the small cameos in his funny and sad comedy/mystery/satire/crime/romance and every actor/actress is perfect. The timid, shy, modest and sweet insurance agent, the loving son and diligent employee of an insurance company, the actor of amateur theater (where his next role will be a coveted Hamlet in Shakespeare's tragedy) Jury Detochkin (the genius Innokenty Smoktunovsky. If you don't believe me, watch any of his movies, just the one. \"Hamlet\" aka \"Gamlet\",1964 would be more than enough to convince you) has a hidden site nobody is aware of. He is an irreconcilable fighter for justice who proves to be a clever, creative and mysterious car thief that steals the personal automobiles from those whom he considers as dishonest people. He sells the cars, and donated the money to his favorite charity, the children's homes. Detochkin never takes any money for himself and acts like a modern Robin Hood. However, for the justice represented by his good friend, the actor of the same theater, and in the real life - police inspector Podberezovikov (Oleg Efremov), this Robin Hood is nothing but the dangerous, smart, inventive and imperceptible criminal who has to be stopped, brought to justice, and put to jail. In this film Detochkin (Smoktunovsky) plays Hamlet in amateur performance. It is remarkable, that Innokenty Smoktunovsky by then had already played brilliantly Hamlet in the film directed by Grigoriy Kozintzev in 1964 that was based on the translation by Boris Pasternak with the music written by Dmitriy Shostakovich. Smoktunovsky's Hamlet is considered one of the best interpretations of the tragic Prince ever made.",
         "This is one of my favourite comedies, and it's a real shame that as I write this there is no version with English subtitles available. This is truly one of the funniest movies that I've ever seen, especially the hilarious narrated car chase sequence. This is quite a well-known movie in Russia so it seems strange that there is no English version yet. We can only hope that RusCiCo or KINO will eventually release something. The movie's humour is gentle, ironic, and just plain wacky at times, and the main character is easy to identify with, even if he is technically a criminal (though not a criminal at heart); there are no actual \"bad people\" in the movie, and there are some pretty funny situations when the protagonist reveals through his own honesty how the morals of other people can be much more crooked than his (for example, the guy who desperately needs a ride and isn't at all put off after being told that the guy he's asking for a ride is about to steal the car). Highly recommended (if you can understand Russian).",
         "this is my favourite russian comedy it's not like Gaiday films, which are ment to be funny and which are considered to be funny only because Nikulin stars in them. This unique film is by far the funniest nad the most interesting movie of soviet moviemaking. Rjazanov gives us a superb picture, from which come quotes are still remembered and became classic. for example, do u remember :\"Who is a witness?!\" --\"I'm, what happened?\", or a monologue of Estigneev about Shakespeare? that's hilarious i think! this is a real must see, and it is a movie i want to own on dvd. It also has a outrageous cast topped by Efremov and Smoktunovski and with nice small roles by Estegneev,Papanov,Aroseva,Zhzhyonov,Mironov and a small role by Donatas Banionis whose role was a big but nice surprise for me:) watch it. but only if u are russian, coz unless you are not, u won't be able to understand all the greatness.",
         "This has been called a \"black comedy,\" but for all the cynicism that may or may not be read into it, it comes off with an enormous amount of charm. I love the premise -- a man goes around stealing cars so that he can sell them and give the profits to orphanages. A previous reviewer compares it in this regard to Lermontov's \"Hero of Our Time,\" but the concept puts me in mind theatrically much more of another classic nineteenth- century Russian novel -- Dostoevsky's \"The Idiot.\" Like Prince Myshkin, Detochkin is a completely honest man (and Innokentiy Smoktunovskiy plays him wonderfully, with an in-the-moment innocence that makes it possible to buy the whole thing). And, following completely honest principles, he ends up a car-their on the run from the police. The possibly-somewhat-bitter subtext being that to exist as a truly honest man is incompatible with modern lawful society -- a conclusion only bolstered when we learn at the end from Detochkin's shaved head -- even though it is accompanied by happy music in celebration of his reunion with Luba -- that he has done time for his right- though-illegal actions. The court scene is adorned by a speech from the villain Dima, pointing out how Detochkin's unacceptably kindly actions were against the rights to property and money guaranteed by the Soviet constitution, and there lies satire for those who choose to see it. The narration rarely breaks in, and when it does it seems to perform the rather postmodern function of explicitly contextualizing the film with relation to audience expectations of detective movies, so that it will be clear how those expectations will be deliberately turned on their heads. It's my second Eldar Ryazanov film and I look forward to more; this was delight, and one that I felt could be enjoyed on a few different levels.",
         "Russian film \"Watch Out for the Automobile\" is about the role of cars in people's lives. It was made at a time when it was not possible for everybody to afford cars. This is one reason why dishonest people were able to buy cars without great difficulty. It is in such an unethical climate that this film's hero decides to steal cars which acquired through illegal money. Director Eldar Ryazanov has directed his film in such a manner that viewers get the feeling that there is nothing extraordinary about this car thief and the cars stolen by him. This effect is created by portraying the hero as an ordinary man who has nothing to do with crime. The film begins with tightly constructed scenes of a heavily guarded car being stolen.This leads viewers to ask what would really happen when the thief is not recognized by other people ? On his part,the car thief is able to fulfill his wishes as he wants to make a wise use of money for poor people. Apart from drama about incidents of car theft,genuine comedy can also be found in form of comical situations witnessed during a Shakespearean play's rehearsal by the hero and his nemesis.Lastly,this film's moral message is conveyed immediately after a truly mind boggling car chase sequence.",
         "\"Beregis avtomobilya\" in Russian means \"look out for the car\". It seems that the title actually implies that cars become sort of a metaphor for our lives. The protagonist Detochkin (his surname implies \"child\" in Russian) is an insurance agent who steals cars from thieves and gives the money to charity. But then there's a surprise. What I mean about the title as a metaphor for our lives. Some people put all their money into their cars; they're complete losers, but at least they have cool cars. Moreover, it's often said that a person is his/her own worst enemy. In this sense, the danger to Detochkin posed by the average vehicle is nothing compared to what his own actions can do. Anyway, this is a pretty funny movie, a look at the Soviet Union in the mid-'60s. We even get to hear an American song in one scene! I suspect that they had fun making the movie. Worth seeing.",
         "Just a great movie portraying the genres most often used in movies at that time: love, light humour. Smoktynovsky is perhaps not the ideal choice for the role (Ryzanov originally wanted Nikylin for this role, but the latter was currently in the also great comedy - Diamond Arm), yet he is very good. There are many funny quotes in this film, better understood if you understand Russian, a ton of small funny moments which just make you grin. The cast gives an outstanding performance. Back to Smoktynovsky again, I'll describe the movie for you a bit. He is an honest insurance agent who steals and sells cars from unfairly rich people, and gives the money to foster homes. His best friend is a detective trying to find the thief. After he learns the shocking truth, he obviously does not want Detochkin (Smoktynocsky's hero) to be punished severely.",
         "\"Beware of the Car\" is one of the icons of the old Soviet cinema. (Note: there will be spoilers because it seems that the viewers not familiar with the Soviet culture struggle to understand what the movie is about.) The film is both a comedy and an over-the-top thriller parody. It follows a modest insurance agent Detochkin who uses the insider knowledge about his clients to hijack their cars. Incidentally, Detochkin befriends the police detective who is leading the investigation of his cases. The twist is that Detochkin does not steal to profit, but donates all the proceeds to the orphanages, and his victims are only crooks and corrupt officials. So Detochkin is essentially a vigilante. The idea of an honest vigilante thief was unusual and original enough to carry the plot for most Soviet viewers. Otherwise, it is a light comedy, in the sweetly naive spirit of the times as expressed by a supporting character, Detochkin's fiancée: \"You're thinking like a five-years-old child!\" Much of the film is carried by mostly untranslatable jokes and comedic performances of the stars of the golden age of the Soviet cinema: Papanov, Mironov, Efremov, Aroseva. Smoktunovsky was undoubtedly one of the greatest actors who ever lived but seems to be miscast here: I will always remember him as Hamlet; he always carries this drama with him. A classic comedy, but sadly, I think most of it will be lost to the uninitiated. Hollywood could make a dumbed-down remake though, that might work."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": ["Mosfilm"],
      "summaries": [
         "The hero of the film is an insurance agent who is also a car thief. He steals cars only from various crooks and never from the good people. Then he sells those stolen cars and gives all the money to charity. His best friend is a cop who is working on this case.",
         "The story of a Soviet \"Robin Hood\", who works as an insurance agent. Due to access to financial data, he can recognize some of his customers as the corrupt or fraudsters. Working 9-to-5 as an insurance agent, at night he becomes a car thief. He hijacks the cars of \"bad guys\" anonymously committing all money to charity. But the situation becomes complicated: his best friend is a cop who is trying to catch the serial car thief."
      ],
      "budget": 0
   },
   "movielensId": 79333,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1966-01-01",
      "dvdReleaseDate": null,
      "directors": ["Eldar Ryazanov"],
      "runtime": 94,
      "movieId": 79333,
      "title": "Beware of the Car!",
      "mpaa": "",
      "actors": [
         "Innokentiy Smoktunovskiy",
         "Oleg Efremov",
         "Georgi Zhzhyonov",
         "Olga Aroseva",
         "Lyubov Dobrzhanskaya",
         "Andrey Mironov",
         "Anatoli Papanov",
         "Evgeniy Evstigneev",
         "Lyubov Sokolova",
         "Vyacheslav Nevinnyy",
         "Gotlib Roninson",
         "Donatas Banionis",
         "Galina Volchek",
         "Tatyana Gavrilova"
      ],
      "imdbMovieId": "0060161",
      "originalTitle": "Берегись автомобиля",
      "genres": [
         "Mystery",
         "Comedy"
      ],
      "youtubeTrailerIds": ["GT4o3i5H_ow"],
      "plotSummary": "An insurance agent who moonlights as a carthief steals cars various crooks and never from the common people. He sells the stolen cars and gives the money to charity. His best friend, a cop, is assigned to bring in this modern robin hood.",
      "tmdbMovieId": 39768,
      "avgRating": 3.85,
      "releaseYear": "1966",
      "numRatings": 70,
      "posterPath": "/2xuOwMDDk4gs6knZ4xZdjolMHib.jpg"
   }
}