{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0066466",
      "video": false,
      "title": "The Man Who Left His Will on Film",
      "recommendations": [
         147306,
         76388,
         269969,
         202768,
         203226,
         134220,
         88302,
         237957,
         49479,
         83229,
         194602,
         148118,
         104317,
         50106,
         42206,
         42238,
         147312,
         148050,
         147159,
         148068
      ],
      "backdrop_path": "/c70XpB8ks7TLUyEVB3eAyttRqqp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Akiko",
               "gender": 0,
               "credit_id": "52fe4a33c3a36847f81c053f",
               "name": "大島 ともよ",
               "profile_path": null,
               "id": 71015,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a33c3a36847f81c0543",
               "name": "白石 奈緒美",
               "profile_path": null,
               "id": 1270263,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a33c3a36847f81c0547",
               "name": "Kenji Shiiya",
               "profile_path": null,
               "id": 1119508,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a33c3a36847f81c054b",
               "name": "Kiyoko Tsuji",
               "profile_path": null,
               "id": 134401,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "58092790c3a368664b00c9aa",
               "name": "Kazuo Goto",
               "profile_path": null,
               "id": 1697246,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "58092798c3a368672f00b647",
               "name": "Sukio Fukuoka",
               "profile_path": null,
               "id": 1697247,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "5809279fc3a368733200b889",
               "name": "Kenichi Fukuda",
               "profile_path": null,
               "id": 1697248,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "580927a7925141102800c322",
               "name": "Hiroshi Isogai",
               "profile_path": null,
               "id": 1697249,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "580927b4c3a368733200b89b",
               "name": "Kazuo Hashimoto",
               "profile_path": null,
               "id": 1697250,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "580927bc9251410f9d00cdb7",
               "name": "Kazuya Horikoshi",
               "profile_path": null,
               "id": 1697251,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "580927c4c3a36874ea00b55c",
               "name": "Emiko Iwasaki",
               "profile_path": null,
               "id": 1697252,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "580927e2c3a36872d600b7fb",
               "name": "Kenji Yoshino",
               "profile_path": null,
               "id": 1697253,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "580927efc3a368733200b8bd",
               "name": "Tetsuro Tsuno",
               "profile_path": null,
               "id": 1697254,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c0523",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c0529",
               "name": "Nagisa Ōshima",
               "profile_path": "/4ipOYgv1UB99mvob5WDmIbaxdMV.jpg",
               "id": 46230,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c052f",
               "name": "Masato Harada",
               "profile_path": "/1hoOz8hAKe5U01SHn9YLzW7dVtG.jpg",
               "id": 52909,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c0535",
               "name": "Mamoru Sasaki",
               "profile_path": null,
               "id": 140623,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a33c3a36847f81c053b",
               "name": "Tsutomu Tamura",
               "profile_path": null,
               "id": 140624,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5809280e9251410d8e00cc4a",
               "name": "Taguchi Yamaguchi",
               "profile_path": null,
               "id": 1697255,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58092840925141438f002c8a",
               "name": "Toru Takemitsu",
               "profile_path": "/zarE9jriPIK3UnK52ySb2UeUJ6O.jpg",
               "id": 51808,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "581087acc3a3687a8d006c8f",
               "name": "Tôichirô Narushima",
               "profile_path": null,
               "id": 1449599,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.686154,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 104343,
      "vote_count": 6,
      "budget": 0,
      "overview": "A metaphysical mystery involving a university student's camera getting stolen, and the thief then committing suicide. Looking back upon the event, the situation comes to be questioned if it happened at all.",
      "similar": [],
      "original_title": "東京战争戦後秘話",
      "runtime": 94,
      "poster_path": "/6fbPKRYay5KE25AGq12xlESmDSm.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sozosha",
            "id": 9182,
            "origin_country": ""
         },
         {
            "logo_path": "/hObQEBMY8Es6ajSlVeBEIdqbuSK.png",
            "name": "Art Theatre Guild",
            "id": 9181,
            "origin_country": ""
         }
      ],
      "release_date": "1970-06-27",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Nagisa Ôshima"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Nagisa Ôshima",
         "Tsutomu Tamura"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0066466/",
      "coverLink": null,
      "actors": ["Stars: Kazuo Goto, Sukio Fukuoka, Kenichi Fukuda | See full cast and crew »"],
      "reviews": [
         "How many names is Tokyo Sense Sengo Hiwa known by? I count at least five. The Japanese title, previously mentioned, it's direct translation, A Secret History of the Post-Tokyo War, it's initial US exhibition title He Died After the War, The Battle of Tokyo (or The Battle of Landscapes, though I'm not sure where exactly those came from) and the subtitle (also paraphrasing the name of the film it's loosely based on) The Man Who Left His Will On Film (which Oshima said described the film perfectly.) It's entirely appropriate that this film have so many names, as it's so many *things* at once. A lament for the decline in activism (or more aptly, activism that really means something), a film about film, and a film about the director (these three *at least*, though more meanings about self-expression, political affiliations, personal relationships, perception, death, and who knows what could also be equally true.) The first two times I viewed it, I appreciated on the level of Film about Film (self referentiality needing the least amount of context, just the film itself.) The film begins with an act of filming, who is filming is left open (and becomes a key component of the story arc, only to be altered and left open to question throughout). Borrowing cameras, filming, viewing films, and contemplating cinema art dominate the dialogue. There is a narrative structure, but it is changed, manipulated, and experimented with so often and at such levels that its constantly thrown into question. This is a film about film which operates only on \"dream logic\", and in this way also repeats itself without answering important questions. It would be a waste of space to recount the plot details as whether or not what's happening is *really* happening, doesn't matter (again though, part of what makes it fascinating is the confusion built by the details). The film says much about the pointlessness of filming landscapes, but in the end *its* a landscape all the same, with no real action. Hard to explain, and much better \"said\" by the film. Gorgeous full frame, flattened black and white cinematography. Whatever you have to do to see this, do it.",
         "When I saw this movie, it was called \"The Man Who Put His Will on Film\". The title sounded interesting and the movie did not disappoint me. First off, this is a movie about movies. It centers around a student who is part of a young filmmakers organization. They are often discussing the value and techniques of film. Most of them are quite Marxist, and there is this proletarian side-theme going on during the movie. But the primary storyline follows the film student mentioned above (I cannot remember his name). One day, he is out filming, and someone grabs his Bolex film camera. He chases after him, trying to get it back, but he turns a corner and sees the person that he was pursuing on the rooftop of a building, holding his camera. He blinks for a second and the person has jumped off of the building, and the police have started to gather around him. The film student grabs his camera from next to the dead thief and starts to run away from the police. They capture him, beat him and he wakes up at his friends' house wondering where the camera is. He tries to describe what happened to one of his closest friends, who says that his story could not have happened because she was with him the whole day. In any case they somehow acquire the film that was shot by the person who committed suicide and the movie is about understanding this person's last film, which is said to be his \"last will and testament\". There are some parts that are pretty funny in the movie, too. There is the radical Marxist in the group who is always accusing the others of funny things, there are the funny intellectual film student debates about abstract concepts, and there is this strange relationship between the two main characters (the primary film student and his friend), which I would not call a love affair, but it figures into the story somehow. The movie deals with alternate realities and \"captured life vs. real life\" and all sort of art-arguments like that. I liked this movie.",
         "The late 1960's/early 1970's film output of Japan's Art Theater Guild recently got a showing at the Japan Society in New York. The films are great examples of sponsored experimental narrative cinema something that rarely gets this sort of concentrated effort anywhere in the world. Oshima who already had a long career in cinema used this opportunity to try something unusual as he did a few years earlier with Double Suicide. The film opens from the perspective of a Bolex 16mm camera as a college student argues with the holder of camera, another student. The person holding the camera runs away film still rolling. We cut to the student chasing after the camera thief who is finally discovered on the edge of a tall parking garage's roof. The thief jumps to his death holding the camera. The police show up but the student grabs the camera which he claims is his. The police give chase and get the camera back. The student chases, on foot, after the police car that has the camera but loses it in a long dark traffic tunnel. The student wakes up surrounded by his friends, all members of a communist protest group devoted to filming the upcoming revolution. They recount a very different story than what we have just seen. They and the student were all at a massive street protest when suddenly the police charged and in the mêlée confiscated all cameras from the protesters. The student chased after the police after they knocked down one of the group's cameramen and took the camera in a police car. The student can't believe this story despite the fact that the person he saw jump off the garage roof is sitting right in front of him! The group, ignoring the student's strange story, starts to plan the next protest which is to get the police to release the confiscated camera and film. The student get fixated on the \"dead\" man's girlfriend and tries to solve the mystery which he is convinced can be solved by watching the film in the confiscated camera. Oshima who was a bit older than the characters portrayed in this film clearly has some things to say about the turbulent youth protest movements of the time. That makes the film interesting and perplexing at the same time. There are certainly things going on in this film that don't travel well across culture and time. The dialog between the revolutionary group is funny and insightful about people with big plans for society but no means to actually implement the sweeping changes they propose. In a way this is the problem with the film for this viewer. There seems to be three films going on here, one a sort of metaphysical mystery film, another a commentary about the student protest movement and third, the standard ATG nudity and sexual violence art drivel. I have now seen enough of the ATG output to know that they frequently required their film makers to cram in at least two rape scenes per movie. Besides the repulsiveness of such scenes, here they serve little real purpose that I can discern except to titillate the frustrated Japanese male audience. The end result is a fascinating, really well photographed, interesting movie that ends up a bit unfocused. Maybe that was part of the point. Unfortunately the ending telegraphed itself to me but I was captivated to the end.",
         "The Man Who Left His Will on Film, aka The Man Who Put His Will on Film, aka He Died After the War, aka The Battle of Tokyo, aka The Battle of Landscapes (nice going with the alternative titles), is one of the most baffling films directed by Nagisa Oshima, and one of the most \"radical\" entries into the imaginary movement of the Japanese New Wave. It's original title translates to A Secret History of the Post-Tokyo War, referring to the post-WW2 period called \"Tokyo War\", signified by mass student protests against the prime minister's visit to the US. The failure of these movements are put into question in Oshima's puzzling meta-film, which sets out to answer whether or not film can be used as a means of revolution. What starts out as a particularly artsy Twilight Zone episode soon turns into a Godardian mish-mash of avant-garde imagery and students philosophizing, as the mystery regarding the stolen camera and the dead thief's final footage gets investigated by a small group of students/film preservationists. It's important to note that the Japanese spoken in this movie sounds nothing alike the Japanese spoken in any other movie. I don't understand the language, but for some reason every character here puts an inflection on the final syllable in the sentence, which makes every sentence sound strange and artificial. The acting in this movie is so awful and fake that it was probably done on purpose, for whatever reason. The film was co-produced by the Art Theatre Guild, which means that it had a super low budget (it was allegedly shot in 60 days, which sounds like way too much time for a movie like this) and it has some inexplicable nudity/rape scenes which were I guess the norm for ATG productions so that artsy films would sell well. Much like most of the film though, these scenes come off like cheap filler, the only one sticking in mind being the scene where a girl gets a film projected all over her nude body, which not only looks beautiful in the aesthetic way, but also underlines one of movie's themes; the one of how film as an art form can influence people or project itself over reality. Unfortunately, this movie came across as a big mess to me. Apart from Toru Takemitsu's beautiful soundtrack, nothing here was really memorable or thought-provoking. It also has the most hilariously obnoxious shaky cam scene I've ever seen (the final scene), but apart from all that, the best part of the film is when Oshima's characters casually mention other Japanese New Wave directors (Oshima and the others never actually thought of it as a movement). Not only is this the first time I've seen Tai Kato and Kiriro Urayama mentioned among the New Wave greats, but I also love how Yoshida was addressed by surname only, presumably because Oshima didn't know whether his first name was Kiju or Yoshishige, heh.",
         "This is a movie that was made in the late '60s, early '70s period of Japan when Japan influenced by the Hippie culture was experimenting with their own brand of Avant Garde. These were experimental non-mainstream production that explored much about free sex, and anti establishment view of the world. Director Nagisa Ooshima always had Avant Garde taste to his movies. He was one of the directors that were part of movement called Nuberu bagu ( from the French nouvelle vague) or Japanese New Wave. The movie were made employing all non-experienced actors. This was the first Ooshima film that didn't use any known actors, and his last black and white movie. Due to the lack of experience of the actors, acting is wooden, and dialogs are totally \"read\" from the script. The movie was completed from start to the theaters in exactly 60 days (April 28 1970 to June 27 1970). Even for the fast shooting Ooshima, this was exceptionally fast production. The movie was targeted for the college students of that time, but poor acting, and somewhat documentary style didn't get support from its intended audiences. But maybe Ooshima and the producers knew that the intended audience weren't worth making lavishly produced movie, because they are (were) youth just like the people who were in this movie, who were rather shallow but opinionated about their world view. Looking back with 20/20 hind sight, this movie is rated high for it's accurate portrayal of the society of the time, and Ooshima might have had exceptional foresight to focus his attention on the subject the way he did in this movie. Not for nothing is he a medal of honor winner from both the Japanese and French government where he's directed many excellent movies. Ooshima is probably the most talented of the director from the Japanese New Wave period, and certainly one of the most talented director to come out of Japan. He's like a mixture of Federico Fellini, and Roger Corman with crisp visual style all his own. For most of the actors, this was their first and last film they appeared in. The actor who played the main character Kazuo Gotoh became a journalist, and his girlfriend Emiko Iwasaki appeared in few minor roles before she retired completely from the film business."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Art Theatre Guild",
         "Sozosha"
      ],
      "summaries": ["A metaphysical mystery involving a university student's camera getting stolen, and the thief then committing suicide. Looking back upon the event, the situation comes to be questioned if it happened at all."],
      "budget": 0
   },
   "movielensId": 79458,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1970-06-27",
      "dvdReleaseDate": null,
      "directors": ["Nagisa Ōshima"],
      "runtime": 94,
      "movieId": 79458,
      "title": "The Man Who Left His Will on Film",
      "mpaa": null,
      "actors": [
         "大島 ともよ",
         "白石 奈緒美",
         "Kenji Shiiya",
         "Kiyoko Tsuji",
         "Kazuo Goto",
         "Sukio Fukuoka",
         "Kenichi Fukuda",
         "Hiroshi Isogai",
         "Kazuo Hashimoto",
         "Kazuya Horikoshi",
         "Emiko Iwasaki",
         "Kenji Yoshino",
         "Tetsuro Tsuno"
      ],
      "imdbMovieId": "0066466",
      "originalTitle": "東京戰争戦後秘話",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ZAArbVN5Cf4"],
      "plotSummary": "A metaphysical mystery involving a university student's camera getting stolen, and the thief then committing suicide. Looking back upon the event, the situation comes to be questioned if it happened at all.",
      "tmdbMovieId": 104343,
      "avgRating": 3.3125,
      "releaseYear": "1970",
      "numRatings": 8,
      "posterPath": "/6fbPKRYay5KE25AGq12xlESmDSm.jpg"
   }
}