{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "gothic horror",
            "id": 15032
         },
         {
            "name": "witchcraft",
            "id": 40931
         },
         {
            "name": "supernatural horror",
            "id": 185408
         }
      ],
      "imdb_id": "tt0069048",
      "video": false,
      "title": "Baron Blood",
      "recommendations": [
         28050,
         5483,
         28051,
         64528,
         27636,
         5481,
         65899,
         2993,
         5486,
         42676,
         24777,
         42591,
         28061,
         20945,
         63025,
         30901,
         53184,
         83519,
         30559,
         27703
      ],
      "backdrop_path": "/9qKtWni6x1AGxUYF6mIecC1ozJf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Baron Otto von Kleist / Alfred Becker",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e519",
               "name": "Joseph Cotten",
               "profile_path": "/bTUTrTnzacCQV4F0rs1xH4QaETf.jpg",
               "id": 7664,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Eva Arnold",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e51d",
               "name": "Elke Sommer",
               "profile_path": "/eVx7RyK6FCBb1HZEdyx5UacL0Df.jpg",
               "id": 17844,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Dr. Karl Hummel",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e521",
               "name": "Massimo Girotti",
               "profile_path": "/bz4jZxPSe00wKze4vF6aGpIcKn6.jpg",
               "id": 18340,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Peter Kleist",
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e529",
               "name": "Antonio Cantafora",
               "profile_path": "/1rRt5Z0SVXTszJNhukJ1ToZKWfo.jpg",
               "id": 44980,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Inspector",
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e531",
               "name": "Umberto Raho",
               "profile_path": "/iD9wuNlT1Do5FjTsJpVW6K41Z4B.jpg",
               "id": 25816,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Fritz",
               "gender": 2,
               "credit_id": "597780aec3a3684a30009724",
               "name": "Luciano Pigozzi",
               "profile_path": "/iSitmgdtPylwSkX9efVaTJLVfSa.jpg",
               "id": 30900,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Gretchen Hummel",
               "gender": 0,
               "credit_id": "597780ccc3a3684a52009880",
               "name": "Nicoletta Elmi",
               "profile_path": "/zWYK5425ecjzwkA7mmJHA6A6Z8E.jpg",
               "id": 29920,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Mayor Dortmundt",
               "gender": 0,
               "credit_id": "597780fcc3a3684af6009186",
               "name": "Dieter Tressler",
               "profile_path": null,
               "id": 1529416,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Auctioner",
               "gender": 0,
               "credit_id": "5977810d9251413ae2008fc2",
               "name": "Rolf Halwich",
               "profile_path": null,
               "id": 1857919,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Dr. Werner Hesse",
               "gender": 0,
               "credit_id": "59778121c3a3684af60091b0",
               "name": "Gustavo De Nardo",
               "profile_path": "/2TUeATCid0ET1TaXPi9e5dai5QD.jpg",
               "id": 98509,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Martha Hummel",
               "gender": 0,
               "credit_id": "597781309251413ae2009008",
               "name": "Valeria Sabel",
               "profile_path": "/2KwT7qsdky73wt8rMPYHGvmrd87.jpg",
               "id": 44977,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Christina Hoffmann",
               "gender": 1,
               "credit_id": "52fe4408c3a36847f807e525",
               "name": "Rada Rassimov",
               "profile_path": "/beRCYALnzPi2AJwZSHUyTsLjoi.jpg",
               "id": 5815,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e4eb",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e4f1",
               "name": "Vincent Fotre",
               "profile_path": null,
               "id": 44979,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e4f7",
               "name": "Samuel Z. Arkoff",
               "profile_path": null,
               "id": 30904,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e4fd",
               "name": "Alfredo Leone",
               "profile_path": null,
               "id": 44965,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e503",
               "name": "Stelvio Cipriani",
               "profile_path": "/lMk2Iwbq2RcvCZd9UJw0QtT74VZ.jpg",
               "id": 29501,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e509",
               "name": "Carlo Reali",
               "profile_path": "/fc5LTUaduPG1U24UB7jqQgg12j6.jpg",
               "id": 44967,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4408c3a36847f807e50f",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4408c3a36847f807e515",
               "name": "Enzo Bulgarelli",
               "profile_path": null,
               "id": 26712,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5977815dc3a3684ae40084e7",
               "name": "Vincent Fotre",
               "profile_path": null,
               "id": 44979,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5977816b9251413b08008c50",
               "name": "Willibald Eser",
               "profile_path": null,
               "id": 44438,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59778178c3a3684a84008c24",
               "name": "Mario Bava",
               "profile_path": "/7IAC3ab2HeveW537a3bymiDrVce.jpg",
               "id": 25826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5977818a9251413ae2009082",
               "name": "J. Arthur Elliot",
               "profile_path": null,
               "id": 1555601,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5977819b9251413b08008c89",
               "name": "James H. Nicholson",
               "profile_path": null,
               "id": 51730,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "597781ad9251413ae20090c2",
               "name": "Rossana Gigante",
               "profile_path": null,
               "id": 1857922,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "597781b99251413b13008561",
               "name": "Silvana Petri",
               "profile_path": null,
               "id": 1856587,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "597781c49251413ae20090e9",
               "name": "Carlo Rambaldi",
               "profile_path": null,
               "id": 20504,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.23823,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 5485,
      "vote_count": 30,
      "budget": 0,
      "overview": "A young man, Peter, returns to Austria in search of his heritage. There he visits the castle of an ancestor, a sadistic Baron who was cursed to a violent death by a witch whom the Baron had burned at the stake. Peter reads aloud the incantation that causes Baron Blood to return and continue his murderous tortures.",
      "similar": [
         74997,
         2652,
         22033,
         15356,
         10781,
         60304,
         588,
         5336,
         1696,
         1991,
         979,
         37430,
         13492,
         17609,
         1690,
         176,
         2667,
         310131,
         298250,
         242512
      ],
      "original_title": "Gli orrori del castello di Norimberga",
      "runtime": 98,
      "poster_path": "/uUMlFRYyb1ohjxtMunG7kNjXeJ1.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dieter Geissler Filmproduktion",
            "id": 1766,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Euro America Produzioni Cinematografiche",
            "id": 1919,
            "origin_country": ""
         }
      ],
      "release_date": "1972-02-25",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "He sought the ultimate in HUMAN AGONY... with instruments of TORTURE ghastly beyond belief!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mario Bava"],
      "runtime": 98,
      "synopsis": "Peter Kleist (Antonio Cantafore) is an American college student who arrives in Vienna, Austria to take a break from his college studies and to look up his family's history. At the airport, he is greeted by his uncle, Karl Hummel (Massimo Girott), who invites him to stay at his house. Peter asks Karl about his great-grandfather, Baron Otto Von Kleist. Karl explains that the Baron's name still spreads fear among the local people for he was a notorious sadist who tortured and murdered over 100 of the villagers for the sole purpose of watching them die. Karl also tells Peter that the Baron's old castle and former residence is being remodeled into a hotel for tourists. Peter persuades his uncle to take him to the castle. After a long drive through the countryside, they arrive at the ominous castle on a hill, where they meet with Herr Dortmund (Dieter Tressler) the entrepreneur responsible for the current hotel project. Peter is particularly interested in Dortmundt's beautiful assistant Eva (Elke Sommer), a former college student of Karl's whose job is to ensure that Dortmundt does not make any lasting changes to the castle's architectures. After a brief tour of the castle, Karl invites Eva to his house for dinner. During the course of the meal at Karl's house, Peter brings up the subject of Baron Von Kleist, much to the consternation of his aunt (Valeria Sabel). Gretchen (Nicoletta Elmi), Karl's young daughter, claims to have actually seen the Baron in the woods near the castle, but nobody listens to her. Peter then produces an ancient document he claims to have found at his grandfather's house back in America. It is an incantation which, if read in the castle bell tower at midnight, will supposedly bring the Baron back to life. Karl warns him off of trying the ritual for a man's obsession with the occult could lead to danger. Despite this warning, Peter and Eva go to the castle and read the incantation inside the bell tower. Although it is midnight, the bell tolls two o'clock, the same time Baron Von Kleist was murdered by his victims. Heavy footsteps approach from the outside. A terrified Eva tries to convince Peter to recant the incantation, using the alternate spell on the same document. But before Peter can do so, the doors fling open, and the wind blows the parchment out of his hands and into a fireplace. Peter goes outside to investigate, but there is no one there. Eva knows the consequences of what they have done. Meanwhile, in the deep woods surrounding the castle, the reincarnated Baron emerges from his grave where he was buried there hundreds of years before. The Baron stumbles into the night and pays a visit to a local doctor's office for medical attention. Just as the legend as foretold, he has risen with the same bloody scars that were inflicted on him when he was killed so many years ago. The doctor (Gustavo De Nardo) dresses his strange patient's wounds and is understandably concerned by the terrible condition he is in, When the doctor insists on calling an ambulance, the Baron grabs a scalpel and stabs the doctor to death. Fleeing into the night, the Baron encounters a drunken grave digger, who is also killed. The next morning, Peter and Eva admit what they've done. Karl insists to them that they are just imaging things and tells them to forget about it. But the Baron secretly enters his castle and kills Dortmundt by hanging him from the castle ceiling. When the body is found by Fritz (Luciano Pigozzi) the caretaker of the castle, the Baron grabs him and takes him down to the dungeon where he kills Fritz by throwing him into a spike-lined coffin. When Dortmundt is found dead, the plans for restoring the castle fall through and the property goes up for auction. The next day, the castle is quickly purchased by Alfred Becker (Joseph Cotton), a wheelchair-bound millionaire. Despite the fact that nobody knows anything about him or his past, Becker seems amiable enough and offers Eva a job in assisting him to restore the castle to its original condition. She gladly accepts. Later, Eva is attacked in one of the castle corridors by the Baron, only to be saved by the intrusion of Peter. Eve quits her job and decides to make a fresh start elsewhere. That evening, Eva returns to her apartment in town, only to find the disfigured, black-cloaked Baron waiting for her. Eva escapes out a window and runs through the fog-shrouded streets of the town, playing cat-and-mouse with the pursuing Baron. Eva manages to outsmart her pursuer by seeking shelter at Karl's home. Finally convinced that the Baron is alive, Karl agrees to help Eva and Peter find a way to destroy him. The visit a local medium, named Christine (Rada Rassimov) who conjurs up a spirit from the netherworld for information about the Baron and his resurrection. Christine gives them a magic amulet which will help them, and she tells them that Peter and Eva are the only ones with the power to destroy the Baron for the ones who raised him are the ones who can destroy him. She also informs them that the Baron knows that Peter and Eva have the power to kill him, so he will do everything in his power to kill them before they can do so. After Peter, Eva, and Karl leave, Christine is attacked and killed by the Baron. Later that day, on her way home from school Gretchen is terrorized by the Baron, who chases her though the woods. But for some reason, the Baron does not kill Gretchen and lets her get away. After taking her to the castle, Gretchen meets with Becker for the first time. Afterwards, she tells her father that Becker is the same man who chased her in the woods. Karl asks how can she know and Gretchen replies that she recognized him by his eyes, which \"burn like fire.\" Realizing that any man who has the ability to rise from the dead might also have the power to alter his appearance, Karl, Peter and Eva go to the castle to confront Becker, who denies knowing what they are talking about. When he shows them the castle which is now restored, complete with dummies impaled on wooden stakes, the appearance gives the trio the impression that Becker really is the Baron. As Karl, Peter and Eva secretly debate what do to, Becker, no longer pretending to be crippled, rises from his wheelchair and advances towards them. Peter tries to reason with Becker, but he only knocks him out. Karl pulls out a gun and tries shooting at Becker/the Baron, but he keeps on advancing and also knocks Karl out. Eva holds up the magic amulet to try to use against him, but Becker only flings her aside against a wall, knocking her out. The Baron/Becker then takes the three down to his torture chamber. When the blooded and battered Eva wakes up, she is tied up to a chair and is startled to see Fritz's dead body in the open spike-lined coffin beside her. Becker ties up Karl to a rack to be slowly stretched to death while he ties up Peter and begins torturing him with red-hot pokers. As Eva struggles to untie herself, she accidentally drops the amulet onto Fritz's dead body. A few drops of Eva's blood from her wounds lands on Fritz's body and the amulet itself. Suddenly, the Baron starts to suffer terrible pains as Fritz rises out of his coffin. The secret of how to destroy the Baron finally comes to light: the Barons victims all rise from their coffins, empowered by the magic amulet which is powered up with blood of the ones who raised him (either Eva or Peter). The undead victims whom include Fritz, Dortmundt, Christine, the doctor, grave digger, etc, all attack the Baron and literally rip him limb from limb. Eva manages to untie both Peter and Karl, and the wounded, blood-covered trio flee from the dungeon, and into Karl's car where they drive away from the castle, while the sounds of the Baron's dying screams echo into the night air.",
      "writers": [
         "Vincent Fotre",
         "Vincent Fotre"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0069048/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMjA3Nzc0OV5BMl5BanBnXkFtZTcwMjIyNDMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Cotten, Elke Sommer, Massimo Girotti | See full cast and crew »"],
      "reviews": [
         "Mario Bava is one of the greats of horror cinema, but I wouldn't judge his importance by 'Baron Blood'. It isn't close to his best work. While stylishly directed (to be expected being Bava) and with plenty of atmosphere, it is low on both suspense and gore, and sets up a potentially dynamite premise (the resurrection of an evil Vlad The Impaler-like maniac hell bent on revenge), then goes nowhere much with it. One or two sequences are outstanding, but overall it's a major disappointment, and the usually excellent Joseph Cotton (who did some strong genre work in movies like 'The Abominable Dr Phibes' and 'Soylent Green') is a bit of a let down in the title role. Even so, no Mario Bava movie can be dismissed entirely, and for all its flaws it's still worth watching more than almost all of Hollywood's recent puerile and uninspired horror output.",
         "Baron Blood is one of my favourite Mario Bava films. As usual, Bava seems dismissive of things like story, character and acting, and concentrates on creating a memorable mise-en-scene, which makes a lot of the juxtaposition of the old and the contemporary: an ancient castle with a Coke machine, Elke Sommer in a miniskirt running through old fog-shrouded streets, etc. Immediately after Baron Blood, Bava filmed what I consider his masterpiece, Lisa and the Devil (also with Sommer) which was sacrificed by its producers to splice with new footage for an Exorcist ripoff called House of Exorcism. Baron Blood fared much better, suffering only from being rescored and cut by eight minutes. If you want to know where Dario Argento learned his tricks, look at Bava.",
         "Mario Bava's BARON BLOOD is a fine a tribute to the monster movies of Hollywood's golden age. So evocative of that period is this film that it takes not even a moment's thought to mentally recast Boris Karloff as the Baron, Nan Grey as his intended victim and to tune away the vivid Technicolor into haunting black and white. As in FRANKENSTIEN or THE MUMMY, the evil in the film is unwittingly unleashed upon the world by the film's hero. In this case it is American Peter Kleist, who returns to the German castle of his ancestor Baron Otto Von Kleist. Even though he is aware that his ancestor, nicknamed \"Baron Blood\" was a sadistic monster who butchered and tortured the people of the countryside, Peter foolishly recites an ancient spell capable of resurrecting the Baron. The restored Von Kleist immediately resumes his homicidal ways, and now Peter, assisted by the beautiful Elke Sommer as a local historian, must find a way to undo what he has thoughtlessly wrought. In the classic horror films of the 1930's the monsters were iconic and unforgettable, while the heroes were bland and almost entirely irrelevant. After all, who remembers who played the \"hero\" opposite Lugosi in Dracula or Karloff in THE MUMMY? (For trivia's sake it was David Manners in both films.) No, the villain/monster may have spent much of the picture lurking about off screen, or skulking in the shadows, but nevertheless he was always indisputably the star of the show. BARON BLOOD maintains this link to its cinematic forbearers. Antonio Cantafora's Peter Kleist is satisfactory, but eminently forgettable, while Joseph Cotton, obviously having a ball, is terrific in his villainous role. Cotton's performance as the resurrected Von Kleist is spot on perfect, filled with evil charm and malevolent glee. He dominates the screen in the best tradition of the movie monsters of old. In fact, there is only one significant departure from the classic monster films. Even in the days before the Hayes Commission, blood and gore were rarely seen and usually only suggested in Hollywood motion pictures. BARON BLOOD was produced without such restrictions and, though mild when compared to more recent horror films, it does contain some explicit moments that would have been completely unacceptable in the 1930's. Even as a tribute to the grand old days, it must remembered that BARON BLOOD was produced to appeal to a contemporary 1970's audience. Bava however realized that things modern will inevitably intrude upon the classic, and made light of this by placing soda pop machines in the halls of the Gothic Von Kleist castle and having prerecorded screams available in the Baron's torture chamber at the flip of a switch. Not as arty as LISA AND THE DEVIL, not as graphic as BAY OF BLOOD, BARON BLOOD is often unjustly overlooked, or simply dismissed as a minor effort of Mario Bava's later period. Such hasty judgments do the film a great disservice. If BARON BLOOD has less of the striking cinematography of Bava's best films, it must be argued that such innovation would be out of place in a film striving to recapture the look and atmosphere of the original Hollywood horror movies. If one accepts the movie for what it is, a fine tribute to the genre's past, then BARON BLOOD is a great success, both as a homage and as work unto itself. BARON BLOOD has been released in numerous VHS and laserdisc editions. The DVD release from Image Entertainment is probably the best example of the film currently available, featuring an uncut 1.85:1 widescreen presentation of the film, complete with the original European musical score, which was replaced when the film was released theatrically in North America.",
         "The closet thing to a remake of Mask of Satan(1960) that Mario Bava ever did was this film. The plotline is the opposite of Mask of Satan(1960) where in this film the witch is not evil. Gli Orrori del Castello di Norimberga/Baron Blood(1972) is an atmospheric supernatural thriller with marvelous cinematography and some good scare scenes. The main source of inspiriation for Baron Blood(1972) is Antonio Margheriti's The Virgin of Nuremberg(1963). Its interesting that Baron Blood(1972) takes place in the birth country of Adolph Hitler. Baron Otto Von Kleist seems to symbolize the atrocities committed by the nazis during the mid 1930s to mid 1940s. Mario Bava did Baron Blood(1972) right after the controversial blood letting of A Bay of Blood(1971). Baron Blood has some gore scenes but without frequency and show stopping manner of Mario Bava's previous film. Baron Blood was the first and only time that Mario Bava did a film away from home as he didn't like to leave Italy. The music by Stelvio Cipriani is very good. The chase scenes in the film are some of Baron Blood's most exciting scenes. The death of Fritz is a reference to La Maschera del Demonio(1960) and Sei Donne Per L'Assassino(1964). Elke Sommer doesn't do much in the role of Eva but she does look arousing in short dresses and mini skirts. Elke Sommer would give a much better performance in her next film for Mario Bava called Lisa E il Diavolo/Lisa & the Devil(1974). Joseph Cotten's performance as the evil Baron Otto Von Kleist brings to mind his role as the \"Merry Widow Murderer\" in Alfred Hitchcock's Shadow of a Doubt(1943). Baron Blood(1972) is not in the same league as the best of Bava's supernatural films such as La Maschera del Demonio/Mask of Satan(1960), La Frusta E il Corpo/Whip & the Body(1963), Operazione Paura/Kill Baby Kill!(1968), and Lisa E il Diavolo/Lisa and the Devil(1974) but is still better than any horror film from Hollywood from the 1990s til now. The set designs for the castle are excellent. The mysterious figure that appears on top of the castle at the end of the film gives me chills everytime I watch this movie.",
         "Mario Bava was above any star he could ever put into a film for he was the star of the film behind the camera. With the possible exception of Barbara Steele in Black Sunday, Bava's films are noted mostly for Bava's direction and Baron Blood is no exception. The acting in the film is competent, but what makes this a great horror film is the visual landscapes Bava paints for us, whether it is a sadistic caped killer rampaging the tiny streets of a dark European night filled with fog or the stately grandeur of the animated dead within the confines of the castle, Bava is an artist using colours like a Rembrandt or Picasso. Baron Blood is a gruesome film filled with genuine terror and it will scare because it is scary in both content and with its heavy mood looming throughout.",
         "A young man travels to Europe and visits the ancient castle of a rather notorious ancestor called Baron Blood, a man whose name is still not very popular in the surrounding villages. Seems the Baron was a bit of a sadist, just in case the \"Baron Blood\" title didn't give it away already. Our young hero, Peter, meets Elke Sommer, and instead of breaking into the castles dungeon in the middle of the night and having sex like any normal hot young couple in the early 70s, these two brilliantly decide instead to perform a centuries old ritual designed to raise the dead. When will these people learn? The Baron rises, seen first as a Phantom-of-the-Opera type guy with a face like a spoiled casserole, and later as a wheelchair bound and Maybelline dependent Joseph Cotton. This really isn't a bad little film. There's some great spooky lighting techniques, some even better funky music and some gorgeous shots of the European countryside. The ancient, crumbling castle is a wonderful set and the death scenes are quite gruesome, especially the one featuring an Iron Maiden-ish casket and a guy who looks a LOT like the late great Peter Lorre. In a nice twist, there's even a centuries-dead witch who turns out to be the GOOD guy! (Or girl, as the case may be) The acting isn't that great, but it doesn't make this an unwatchable film by any means. The story seems loosely based on the life of Vlad the Impaler, but still manages to be original and interesting. A nice feeling of dread permeates the entire film. One of Bava's best efforts.",
         "This glorious Italian horror film made by Mario Bava concerns a young couple(Antonio Cantafora,Elke Sommer)who manage to revive a cruel sorcerer-Baron Otto Von Kleist(Joseph Cotten)from the 1500s.Posing as a cripple,the Baron assimilates back into society and buys back his old castle,where he begins torturing and murdering innocent locals in his dungeon.It takes an enchanted amulet to defeat him,as all his victims rise from the grave for revenge.Veteran filmmaker Mario Bava's direction is truly splendid,the cast features plenty of Euro-horror regulars including Massimo Girotti,Luciano Pigozzi and young Nicoletta Elmi and there are some memorable horror set-pieces for example we see scenes containing:disfigured characters,hanged people,characters locked inside of a torture device and a couple of crusty zombies.The film is stylish and offers plenty of wonderful Gothic atmosphere.The use of lighting is especially notable.\"Baron Blood\" is definitely not the best Mario Bava's horror film,but if you are a fan of Italian genre movies or Hammer productions you can't miss it.9 out of 10.",
         "Mario Bava is one of the best Italian horror directors, his name is synonymous with terror! He influenced the \"Friday the 13th\" series, \"Halloween\", and countless other films, inside and outside of the genre. \"Baron Blood\" is a lesser-known opus from Bava and is one of his least watchable. Bava regular Elke Sommer is top-billed with Joseph Cotton, who are both usually great, but Sommer overacts in her hysterics and Cotton isn't very sinister. None of the acting of the film is very good except underrated child actress Nicoletta Elmi. The real stars of the film are Bava's cinematography, set (a real Austrian castle), and lighting techniques. The highlight of the film is a chase scene in a courtyard maze lit by blue and yellow lights, simply breathtaking! Other scenes worthy of note include a coffin lined with nails, the final (rather tame) scenes in the baron's torture chamber, dead bodies impaled on the castle's towers, a witch feeling the wraith of the Baron, Elmi being chased by the Baron in the woods, and a chase scene through the halls of the crumbling castle. Fabulous! But, it is too tame for Bava, holds very little actual intelligent in the plotline and execution, and is too tedious, grabbing little attention for the entire film. Budding Bava fans should be steered towards \"Black Sunday\", \"Bay of Blood\", or \"Lisa and the Devil\"; \"Baron Blood\" should be a last resort to new and old Bava fans.",
         "This 1972 film is the best film Mario Bava ever made if you ask me (and I like most of his films). I first saw it on TV when I was 10 years old and got lost in the parts about the witch but don't worry, those parts don't take up much of the film and it gets itself back on track quickly for a really great, cool climax that was truly ahead of it's time. Best of all, it is SCARY! Scenes of the heroine being hunted by the living dead Baron Von Kleist still make me nervous and I must've seen this film 20 times ( I own a VHS and a laserdisc copy of it if that shows how much I enjoy it). Joseph Cotton gives a really fine performance as Mr. Becker, the man who wishes to restore the Baron's castle, and the other main characters are likeable (important if you are to care whether or not they die). Bava is in top form here with some of the best horror film lighting ever done and builds suspense time and again. Don't watch it if you are going to be distracted because you do have to pay attention if you don't want to get lost but if you watch it closely, it's pretty easy to follow. Recent copies of the film are widescreen which is good, but have the original Italian score. The earlier pan and scan tapes are the American International Pictures version which contains a much scarier score by Les Baxter. The widescreen copy is supposedly uncut but I can't tell any difference other than the framing and the score. Either way though, it is a scary, fun horror masterpiece that I always enjoy watching again and again. If you've never seen it before, I dare you to watch it alone late at night.",
         "(Small spoilers included) This is a brilliant film\u0085I'm getting rather monotonous when reviewing Mario Bava films, but I can't help it. The man just made nothing but masterpieces and cult-highlights! Perhaps not the most genius film to state Bava's importance, Baron Blood still remains a stylish gothic wholesome that destroys practically all American horror movies. Baron Blood contains a lot of suspense and a rather fair amount of gore and maniacal slaughters. Other than that, all the usual Bava characteristics are present such as beautiful music, breath-taking locations and top-scenery (Von Kleist's torture chamber!!!). I just love the basic plot of Baron Blood! The key figure is a bloodthirsty madman, who was cursed to suffer eternally in hell back in the 17th century. A direct ascendant of his found a parchment, containing a formula to bring him back. Driven by curiosity he and a female architecture student (Elke Sommer \u0096 who already worked with Bava in the sublime \u0091Lisa and the Devil') speak the words and true terror is resurrected once more. Innocent inhabitants of the small Austrian town start to die in horrible ways again. Meanwhile, a mysterious and lonely millionaire comes to town and buys the Baron's castle\u0085 Could there be a relation between the dwelling maniac and this man? There are some serious plot holes in Baron Blood \u0096 almost the size of a melon - and the acting performances in this film surely are below standards. The constant screaming of Elke Sommer might become annoying after a while and especially Joseph Cotton disappoints with his uninspired performance. Cotton is best known for his role as Vincent Price's opponent in `The Abominable Dr. Phibes'. In spite of these few negative aspects, Baron Blood still is a MUST for Italian horror lovers and fans of horror cinema in general. If it were only for the haunting sequence in which Elke Sommer is being chased through the dark and foggy small streets of the village. Like none other, this scene proves that Bava is a master in creating a claustrophobic atmosphere."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Dieter Geissler Filmproduktion",
         "Euro America Produzioni Cinematografiche"
      ],
      "summaries": ["A young man, Peter, returns to Austria in search of his heritage. There he visits the castle of an ancestor, a sadistic Baron who was cursed to a violent death by a witch whom the Baron had burned at the stake. Peter reads aloud the incantation that causes Baron Blood to return and continue his murderous tortures."],
      "budget": 0
   },
   "movielensId": 7954,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1972-02-25",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Mario Bava"],
      "runtime": 98,
      "movieId": 7954,
      "title": "Baron Blood",
      "mpaa": "PG",
      "actors": [
         "Joseph Cotten",
         "Elke Sommer",
         "Massimo Girotti",
         "Antonio Cantafora",
         "Umberto Raho",
         "Luciano Pigozzi",
         "Nicoletta Elmi",
         "Dieter Tressler",
         "Rolf Halwich",
         "Gustavo De Nardo",
         "Valeria Sabel",
         "Rada Rassimov"
      ],
      "imdbMovieId": "0069048",
      "originalTitle": "Gli orrori del castello di Norimberga",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "32mBxMYA_s0",
         "tMYVXwtJwdU"
      ],
      "plotSummary": "A young man, Peter, returns to Austria in search of his heritage. There he visits the castle of an ancestor, a sadistic Baron who was cursed to a violent death by a witch whom the Baron had burned at the stake. Peter reads aloud the incantation that causes Baron Blood to return and continue his murderous tortures.",
      "tmdbMovieId": 5485,
      "avgRating": 2.91803,
      "releaseYear": "1972",
      "numRatings": 61,
      "posterPath": "/uUMlFRYyb1ohjxtMunG7kNjXeJ1.jpg"
   }
}