{
   "tmdb": {
      "original_language": "da",
      "keywords": [
         {
            "name": "denmark",
            "id": 509
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "cheating wife",
            "id": 11501
         }
      ],
      "imdb_id": "tt1087890",
      "video": false,
      "title": "Terribly Happy",
      "recommendations": [
         79835,
         15828,
         16015,
         33294,
         8930,
         50656,
         60484,
         124501,
         39241,
         118257,
         117595,
         117594,
         163146,
         152948,
         131792,
         49829,
         207441,
         15930,
         21279,
         381712
      ],
      "backdrop_path": "/41BcjZLxosI7IM11tXGi1AcAFgk.jpg",
      "revenue": 179943,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Robert Hansen",
               "gender": 2,
               "credit_id": "52fe468f9251416c7507c25f",
               "name": "Jakob Cedergren",
               "profile_path": "/lW6EcEvYUccsIfiwYh89M3dZa9c.jpg",
               "id": 41903,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ingerlise",
               "gender": 1,
               "credit_id": "52fe468f9251416c7507c263",
               "name": "Lene Maria Christensen",
               "profile_path": "/xkuhoYUtTxIKMa2xgbdeqj0z5RW.jpg",
               "id": 82352,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jørgen",
               "gender": 2,
               "credit_id": "52fe468f9251416c7507c267",
               "name": "Kim Bodnia",
               "profile_path": "/koWU6vb82cuCDLeYE1erqnQ39cW.jpg",
               "id": 3398,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Doktor Zerlang",
               "gender": 2,
               "credit_id": "52fe468f9251416c7507c26b",
               "name": "Lars Brygmann",
               "profile_path": "/6M8ZHAmLSkUCgkW3j5Dtr6IjfzJ.jpg",
               "id": 4467,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "5509e32992514110ca004194",
               "name": "Anders Hove",
               "profile_path": "/m9UAUhR7CzC376jy9dV9HGctqSV.jpg",
               "id": 1566,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "5509e336c3a3682b40003da6",
               "name": "Mathilde Maack",
               "profile_path": null,
               "id": 1441943,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "5509e35192514110da0040e9",
               "name": "Anh Le",
               "profile_path": null,
               "id": 1441944,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5509e35ec3a3685393003fd0",
               "name": "Jens Jørn Spottag",
               "profile_path": "/cU5mgaK1GrewoPLfxvHDnMYXDNb.jpg",
               "id": 6134,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "5509e36f92514122d2000cf4",
               "name": "Henrik Lykkegaard",
               "profile_path": "/kvnq23dSFhwkq06Gxt8SSrAyBcu.jpg",
               "id": 107557,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "5509e38592514122d2000cf8",
               "name": "Peter Hesse Overgaard",
               "profile_path": null,
               "id": 119412,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "5509e38e92514110ca00419c",
               "name": "Niels Skousen",
               "profile_path": null,
               "id": 121522,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "5509e39892514110ca00419f",
               "name": "Lars Lunøe",
               "profile_path": null,
               "id": 1025546,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3a0c3a3682b4e004096",
               "name": "Sune Geertsen",
               "profile_path": null,
               "id": 1441945,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 1,
               "credit_id": "5509e3aac3a3682b4c00422c",
               "name": "Bodil Jørgensen",
               "profile_path": "/yu2e7EE9LPpKwYEZp16mKGplv9p.jpg",
               "id": 6120,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3b49251413c710023fc",
               "name": "Taina Anneli R. Berg",
               "profile_path": null,
               "id": 1439301,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3bec3a3682b4e00409c",
               "name": "Kenn Bruun",
               "profile_path": null,
               "id": 1441946,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3c8c3a3685393003fd8",
               "name": "Mads Ole Langelund Larsen",
               "profile_path": null,
               "id": 1441947,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3d1c3a3682b4e0040a2",
               "name": "Joakim Schierning",
               "profile_path": null,
               "id": 1441948,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "5509e3ddc3a3682b43003cc4",
               "name": "Bent Larsen",
               "profile_path": null,
               "id": 1441949,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 2,
               "credit_id": "5509e3e8c3a3685393003fdc",
               "name": "Thorkild Demuth",
               "profile_path": null,
               "id": 1098511,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe468f9251416c7507c25b",
               "name": "Henrik Ruben Genz",
               "profile_path": null,
               "id": 82351,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe468f9251416c7507c271",
               "name": "Henrik Ruben Genz",
               "profile_path": null,
               "id": 82351,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe468f9251416c7507c277",
               "name": "Dunja Gry Jensen",
               "profile_path": null,
               "id": 202586,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe468f9251416c7507c27d",
               "name": "Erling Jepsen",
               "profile_path": null,
               "id": 937649,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.811371,
      "production_countries": [{
         "iso_3166_1": "DK",
         "name": "Denmark"
      }],
      "id": 15952,
      "vote_count": 28,
      "budget": 0,
      "overview": "Robert Hansen, 34, a young police officer from Copenhagen, is transferred against his will to the small town of Skarrild in Southern Jutland as a substitute Marshall. The transfer is Robert’s chance to start over. Whether he is allowed to return to his job in Copenhagen, all depends on how well he performs in this frontier town.",
      "similar": [
         9362,
         10829,
         196024,
         306819,
         11069,
         262841,
         1427,
         59,
         1585,
         793,
         162,
         65057,
         296096,
         339967,
         76640,
         359940,
         472805,
         346364,
         10891,
         1547
      ],
      "original_title": "Frygtelig lykkelig",
      "runtime": 90,
      "poster_path": "/uxsYNU26eVIqhPVKmLfXyxni7Ms.jpg",
      "spoken_languages": [{
         "name": "Dansk",
         "iso_639_1": "da"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fine & Mellow Productions",
         "id": 2761,
         "origin_country": ""
      }],
      "release_date": "2008-07-15",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henrik Ruben Genz"],
      "runtime": 99,
      "synopsis": "Robert Hansen is a cop in Copenhagen who makes a mistake, is remanded for therapy, then assigned to a small town in South Jutland, where cows and problems disappear into the mud. He quickly learns that the town bully, Jørgen, beats his wife, an outsider like Robert. He tries to get her to swear out a complaint against Jørgen; she flirts with Robert. When someone dies and Robert knows the prime suspect is innocent, he halts vigilante justice and things get complicated. He wants to protect himself and the daughter of Jørgen, and he wants to reconnect with his own daughter back home. Is rural justice his ticket back to Copenhagen? Is there any chance at happiness? Written by <jhailey@hotmail.com>",
      "writers": [
         "Henrik Ruben Genz",
         "Dunja Gry Jensen"
      ],
      "originalLanguage": "Danish",
      "imdbLink": "http://www.imdb.com/title/tt1087890/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4ODYwNTg3M15BMl5BanBnXkFtZTcwMDIyOTYwMw@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jakob Cedergren, Lene Maria Christensen, Kim Bodnia | See full cast and crew »"],
      "reviews": [
         "Terribly Happy is a stylish Danish noir based on actual events. It's a classic \"fish out of water\" story. Robert (Jakob Cedergren ),a police officer is sent from Copenhagen to a small Danish village as its new Marshall. He soon finds that the village people have their own set of rules and laws and are not ready to accept outside interference with their coda of justice. Although at first Robert tries to play everything by the book, he is soon drawn deeply into the villagers' web of deceit and corruption. The director Henrik Ruben Genz creates a very bleak atmosphere set against the Danish countryside. The film is full of black humor, reminiscent of Coen Brothers, specially Fargo. The casting is particularly good, with Kim Bodnia outstanding as a wife beating lout. Terribly Happy is tightly directed and is gripping from start to finish. Recommended.",
         "This was one of my top 5 films at the 33rd Cleveland International Film Festival. In the introductory narrative we are told that \"all the events are true\". A short story is told of how a cow was stuck in the bog, dug out 6 months later and gave birth to a two-headed calf (one human, one bovine). This sad animal causes distress to the town and is put back into the bog. Well. We may not know where this is going, but it's sure to be interesting. Robert (Jakob Cedergren) has a troubled past in Copenhagen and is re-assigned to a remote Danish town, where he is quickly embroiled in its odd business. Does Jorgen (Kim Bodnia), the local force to be reckoned with, actually beat his wife Ingerlise (Lene Maria Christensen)? Is that why their daughter takes her dolly for a walk in the evening, with the squeaky wheel heard by all in the village? Why is the bicycle shop deserted, but the music blaring? And what is in the bog? The theme of the small town that runs by its own rules is well presented here. No one wants to get the \"big city\" involved. Abuse is known but ignored. The Marshall fits in in that everyone seems to have a secret in this town. A twisted ethic exists in just what needs to be done, whether the Marshall is supposed to punch out a pre-teen shoplifter (if he doesn't, Dad Jorgen will), you are supposed to say \"mohn\" instead of the usual Danish word for hello, the doctor supplies narcotics to the hairdresser/call-girl, and your clothes need to be put on the line to dry in a just-so order. And what do you do about the abused wife, who may just be playing her version of crazy with the newest Marshall? The various plot twists, the machinations of the local card-playing cabal looking for a new fourth, the (lovely) cat who says \"mohn\": all provide fit companions to the Bog. The Bog is metaphor here as a place where secrets reside, the past sometimes remains hidden and the future lies in wait. The bog is as much a character as the townspeople and the townspeople are the bog. The film alternates between disquieting views of the flat fields and frenetic twists (big and small) in the plot. I could not imagine a single scene being left out. Lovely and tense, this Euro-Noir film is well acted and well filmed; a good bet for those who like quirky and creepy.",
         "Nicely done. I am glad I picked this one out. Kind of movie you'd like to watch on a lazy moody afternoon. It will perk up your interest and will get you ready for the evening! Trust me you won't get bogged down! The film is set in a bleak Fargoesque landscape and begins to build up slowly. I found a couple of situations in the plot that could be a bit far-fetched and probably could have been done better but this doesn't affect the overall quality of the film. Even with a low budget the director has come up with a remarkable suspenseful and to an extent, a film with a moral. So go on, get some pop-corn on and get settled in your favorite spot. Go out for a beer later - preferably the local beer joint!",
         "I recently saw this at the 2009 Palm Springs International Film Festival. from writer/director Henrik Ruben Genze based on the novel by Erling Jepsen is a dark and quirky crime story set in a small rural Danish village where everybody knows everything about everyone and they live and die by their own unique code of justice. Robert (Jakob Cedergren) is a cop from the city who has been reassigned as the town marshall because of a mental breakdown he suffered and he has to stay in the demotion until he can work his way back onto the force back in the the city. He immediately discovers the odd and unwelcome clannish ways of border town community and meets Ingerlise (Lena Maria Christiansen), the abused wife of the town bully Jorgen (Kim Bodnia). This is a psychological thriller with suspense and dark comedy woven together in a story that is almost Stephen King-like. The moody cinematography from Jorgen Johansson is excellent and the film moves at a slow pace but never drags down and keeps your interest throughout. I would give this an 8.5 out of 10 and recommend it.",
         "Did I say comedy? You certainly wouldn't feel that it is until you walk out of the theater and just might break into a smile, realizing how funny 'Terribly Happy' it all is. That's rather brilliant of the screenplay and direction. It's 'Fine & Mellow' productions, ha, indeed. This Danish dark comedy may not be everyone's cup of tea - there are terrible things happening throughout the movie that are not pleasing by normal social standards: mysterious disappearance of persons, deaths (or murders?), battered wife, neglected child, child striker and wife beater, imposing town bully, neighbors who are in the know and do nothing to help (so it seems). It's an uncomfortable community of a small rural town to find oneself in. Well, that's where Robert got dropped off at the beginning of the story. The plot thickens as you watch our central character, Robert Hanson (played by Jakob Cedergren, convincingly deadpan), a city cop from Copenhagen 'banished for atonement' to Skarrild, a small provincial town with an ill-fated cow with two-heads legend as we, the viewers, are informed at the very onset of the film. \"The following is based on a true story\" flashed on screen in passing. We're introduced to our town flirt furtively disturbed, Mrs. Ingelise Buhl (played by Lene Maria Christensen, appealingly oversexed). The town bully and constant drunk in his cowboy hat, Jørgen Buhl (played by Kim Bodnia, menacingly ill-natured). And the cast of the key townsfolk: the doctor - Dr. Zerlang (played by Lars Brygmann, calculatingly all-knowing), the card game players including the general store owner, and the bar regulars, the lady bartender, not forgetting the lady hairdresser, and little Dorthe, Ingelise's daughter (played by Mathilde Maack in silent plight), who often pushes her pram with squeaky foreboding noise on the streets of Skarrild. Yes, all sorts of predicament and dilemma Robert very soon discovers, yet half-truth, never fully revealed by the townsfolk or party involved, let alone the doctor, who may very well be the town mayor discreet, holding all the cards (a literal pun). Secrets, more back-story continuously unraveling. Writer-director Henrik Ruben Genz, based on the novel by his childhood friend, Erling Jepsen (a best-selling Danish author), delivered a noir thriller in dark comedy form all at once. Sheer talent! The film title is unquestionably befitting. It could be: How to deal with a town bully? Or: How to get your ideal town marshal? 'Terribly Happy' - the two choice words together simply take the cake. (A climatic sequence definitely did justice to the 'happy' and the 'terrifyingly tense' moments simultaneously experienced). \"Terribly Happy\" indisputably worth your while. Hopelessly helplessly with quiet glee. After all, it's a fine and mellow Skarrild community, why wouldn't Robert want to hang around and be their perfect marshal? Note: Director Genz's statement and interview, author Jepsen's statement, can be viewed from the Press Kit accessible online at \"oscilloscope.net/shop/view_film.php?ID=18&r=gallery\"",
         "The ironically titled Danish film 'Terribly Happy' is the tale of a cop sent to serve as local Marshall in a remote border town in South Jutland called Skarrild that doesn't need cops or have much use for them. It's a place where nothing much happens. Ha! Well -- that's what they say. This part of the country, you don't know if you're coming or going. People use the same monosyllable, \"Mojn\" (pronounced \"moyn\") to say both \"hello\" and \"goodbye.\" Men of few words, they are, these boozy locals, who like to settle scores their way, not \"by the book.\" Klepto kids are just boxed brutally on the ears and sent packing. There's a bog that swallows up junk, sometimes a cow, maybe some darker secrets. This place is insular, mysterious, and weird. And a bog, like a pistol, once introduced, must be used. 'Frygtelig lykkelig' (it sounds funnier in Danish) has its own rhythm and momentum, and a snappy style including a sound design that's sometimes explosive, sometimes ironic. The film's consistently effective, and has a unique feel, though at times its hodgepodge of genres and stylistic borrowings evokes Coen brothers (especially 'Blood Simple') and David Lynch work as it would be if the American auteurs had filmed in Danish in consultation with Aki Kaurismaki. A mix of psychological thriller, horror story, and neo-noir, it moves fast but also manages to take the time necessary to also be a mood piece in which the town vies with the cop for the role of protagonist. Here are the outlines, but the details have to be omitted because it's all in the surprises and twists. Robert Hansen (Jakob Cedergren) is the policeman from Copenhagen sent out here because he's had a mental breakdown some time ago. He has, shall we say, anger issues. \"You're working your way up?\" somebody says. Again: ha! He's in serious limbo. He looks convincing in his police uniform and has a modicum of leading man looks. But then again there's something a bit fuzzy about him too -- something a bit lost. He misses an estranged or divorced wife back home, and repeatedly tries to call her and a little daughter, but without results. He has messed up in some way, and this is a punishment assignment. Like many noir heroes, Robert comes on the scene already in trouble and immediately gets into more. A pretty but dicey blond called Ingerlise Buhl (Lene Maria Christensen), appears, saying her husband Jørgen (Kim Bodnia) has beaten her. She barges in on Robert the way many a dubious babe has appeared on a hapless noir detective's doorstep. It's not so much a domestic squabble complaint as an attempted seduction -- and instant jeopardy for Robert. He can't ignore Ingerlise but there's no safe way to deal with her. The local rule against outside \"by the book\" punishments is compounded by the fact that Jørgen turns out to be a scary dude, the town bully; also a man said to have fathered a number of children around town. The only kids we see are shoplifters corralled by the local grocer, whom Robert learns to smack as instructed rather than book (the kids, that is, not the grocer). And then there's the well-dressed Dorothe (Mathilde Maack), Ingerlise and Jørgen's little girl, who's often seen creepily pushing a big baby carriage around the town's empty, haunted streets with her teddy bear inside. It seems when bad stuff begins at home, she escapes by pushing the carriage. Funnily enough rumor has it she's not Jørgen's. You just don't know, around here. Genz toys with the unexpected in ways that transcend the film's various genres. These include the Western too, since Jørgen wears a ten-gallon hat and, as odd and menacing at times as Dennis Hopper's bad guy in 'Blue Velvet,' he winds up in a \"shoot out\" against Robert. Only, in truly Danish style, the shots exchanged are of whiskey, alternating with chugged bottles of beer. (Another bar regular's face is a dead ringer for Hopper's.) Robert's an outsider but it's never fully clear whether Skarrild wants to exclude him or lock him in forever as one of theirs. His tarnished rep appeals to them because the town's own morals are generally shaky. There's a running card game of the self-declared \"quack\" Dr. Zerlang (Lars Brygmann) and other local fixtures want Robert for a fourth at the card table. \"Everyone knows everything but says nothing\" about you in this town, is the rule, and so they know Robert's secrets when he arrives and soon know more in the nightmare Ingerlise and Jørgen force upon him, which he may eventually resolve, or make worse; he must let the town decide. The town has the last laugh, but so do we. Adapted from a novel by Erling Jepsen,'Terribly Happy' has been richly rewarded in Denmark for its skillful direction, cinematography, writing, and acting. Henrik Ruben Genz obviously had fun making this. It probably didn't hurt much that both he and Erling Jepsen are from the South Jutland region.",
         "........................................................from Pasto,Colombia...Via: L.A. CA...and ORLANDO, FL NO SPOILERS HERE! My wife, Carmen, and I saw 11 films at the 2009 Orlando Film Festival. Three TITLES were truly exceptional: HERE and THERE, The CRIMSON MASK and TERRIBLY HAPPY. This Danish film noir/psychological thriller deftly redefines Creepy. Others have compared HAPPY to several films. From the depths of the ID comes this relatively obscure comparative reference: Think DEAD and BURIED(1981)...sans Zombies! If you like predictable, you most definitely don't want to watch HAPPY. Each and every time HAPPY comes to an A) B) C) or D) multiple-choice crossroads juncture pivotal point, it consistently offers the viewer NONE Of The ABOVE as the appropriate thread option! At the heart of HAPPYs appeal: A deliciously intriguing and universally cross-cultural screenplay/story by Director Henrik Ruben Genz and Dunja Gry Jensen. Hearsay has it Copenhagen cop Robert (Jakob Cedergren, in an amazing but tautly low-key characterization) completely lost it a few months back when he caught his wife in bed with his partner/best friend. He drew his service hand-gun, waved it around threateningly at the philandering pair, but never really got beyond a little saber-rattling...Except for firing off a round into the ceiling. This was enough for 3 months treatment in a loony bin. Upon release, the force prudently decided it best to send Robert to the apparently idyllic small, out of the way, town of Skarrild, far from the Capital, where Nothing ever happens! A bit slow-moving at the onset, HAPPY soon dishes out one plot twist after another. When it isn't creeping you out...Happy is busy pulling the rug out from under your proverbials! With great ensemble performances, this little Danish film comes highly recommended...Just be forewarned: The ONLY TERRIBLY HAPPY people associated with this production are the viewers! 9*.....ENJOY/DISFRUTELA! Any comments, questions or observations, in English o en Español, are most welcome! KissEnglishPasto@Yahoo.com",
         "This is a well-done and enjoyable neo-noir. A city cop attempts to do his job according to his reasonable moral standards in a tiny village. This proves to be well-nigh impossible. Once he falls, his own amorality and survival instinct surface, whereupon he falls deeper and deeper into the quicksand. This is not an overtly (nor even covertly) friendly town. The people all snicker as if they have their own private jokes at the expense of the outsider. The poor man thinks he's covering up his indiscretions and worse, but in such a tiny place, there are no secrets. The townspeople are just as adept as the police are at avoiding the scales of justice. They need no prison or jail. They have a convenient bog nearby. Our Danish hero is like many noir heroes, wriggling on a hook, trapped. The village becomes for him a jail from which there is no escape. The unusually stark and dour surroundings complement the bleak few buildings in which people congregate to drink and play cards. The Danish artistic temperament comes across in this movie: gloomy, silent, deep unstated undercurrents, mysterious, complex, severe. The humor is sly and quiet. Quietness and understatement tend to pervade the atmosphere, but it is broken by very emotional outbursts that cannot humanly be contained.",
         "How would you like to watch a Danish film noir/classic western with some elements of a good twilight zone episode tossed in for good measure? Intrigued yet? Well you should be, director Genz's film Terribly Happy is such a fun watch, it will almost make you forget your reading subtitles. While part of the wave of Scandinavian imports to resonate with American Audiences recently, like the films Troll Hunter, Let the Right One In and the Girl With the Dragon Tattoo, Terribly Happy is its own unique beast. Robert (Jakob Cedergren) is a police officer from Denmark, that has been reassigned to a small Danish hamlet. Robert is sent to serve a penance after making some mistakes in Copenhagen. South Jutland where Robert finds himself is a spartan land, filled with bogs, mud, cows and rubber boots. The local townspeople welcome Robert with less than open arms. It appears South Jutland is a town where people take care of their own, it's a rural one bar, one shop, one doctor place where everyone knows everyone elses business yet keeps to themselves. The first friendly face Robert sees is that of Ingerlise (Lene Maria Christensen), the wife of the local bully Jorgen (Kim Bodnia). Ingerlise confides in Robert that she is being abused, but she is reluctant to do anything about her situation. The townspeople are well aware what is going on in town, but have their own views of both Ingerlise and Jorgen. Will Robert compromise his own moral compass to fit in with the town provincial societal norms? Director Genz creates a dark intimidating atmosphere that permeates every inch of the screen. The characters are multidimensional leaving you to question and reassess their motivations and actions as the film progresses. The blending of several classic genres, western, noir and dark comedy, is achieved in no small part to the wonderful dialogue, and cinematography in the film. The characters seem real, albeit exceedingly creepy and your sense of right and wrong will be put to the test. There has been a lot of talk of remaking this film in the United States. Director Genz has signed on for the project, however details about the project seems to have dried up since early in 2010. It's interesting to note that Terribly Happy is supposedly based on a true story. Novel writer, and eccentric Erling Jepsen claims the story is based on a distant aunt and uncle. If you get a chance check out the bonus features, to watch an amazing interview with Genz and Jespen, where Jespen slaps Genz several times causing him to walk out of the interview. Fans of the Coen Brothers films, David Lynch, and modern film noir in general will find a lot to enjoy about Terribly Happy. The film is a dark and memorable addition to the fine films that have been coming from Scandinavia in recent years. Upon viewing its easy to see why the film was nominated for, and claimed so many international film festival awards. Head on down to South Jutland and give Terribly Happy a watch just don't forget to bring your rubber boots and a loaded pistol. Like what you see here? Then check out our full site at 3guys1movie.com",
         "It is happening again. A film is a hit and Hollywood remakes it. Watch the original before they do that. Henrik Ruben Genz directs this film (and will direct the remake) that has been compared to a Coen brothers film. The synopsis is simple - Hot Fuzz in Danish, but a noir, not a comedy, even though it is funny at times. Jakob Cedergren was great as the cop sent to a small town for his transgressions, and who got himself into a bigger mess with Lene Maria Christensen. She was also extremely good, as was her husband, played by Kim Bodnia. What a great ending!"
      ],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": ["Fine & Mellow Productions"],
      "summaries": [
         "Robert Hansen is a cop in Copenhagen who makes a mistake, is remanded for therapy, then assigned to a small town in South Jutland, where cows and problems disappear into the mud. He quickly learns that the town bully, Jørgen, beats his wife, an outsider like Robert. He tries to get her to swear out a complaint against Jørgen; she flirts with Robert. When someone dies and Robert knows the prime suspect is innocent, he halts vigilante justice and things get complicated. He wants to protect himself and the daughter of Jørgen, and he wants to reconnect with his own daughter back home. Is rural justice his ticket back to Copenhagen? Is there any chance at happiness?",
         "A thriller about a Copenhagen cop who moves to a small town after having a nervous breakdown."
      ],
      "budget": 0
   },
   "movielensId": 79927,
   "movielens": {
      "languages": ["Dansk"],
      "releaseDate": "2008-07-15",
      "dvdReleaseDate": null,
      "directors": ["Henrik Ruben Genz"],
      "runtime": 90,
      "movieId": 79927,
      "title": "Terribly Happy",
      "mpaa": "",
      "actors": [
         "Jakob Cedergren",
         "Lene Maria Christensen",
         "Kim Bodnia",
         "Lars Brygmann",
         "Anders Hove",
         "Mathilde Maack",
         "Anh Le",
         "Jens Jørn Spottag",
         "Henrik Lykkegaard",
         "Peter Hesse Overgaard",
         "Niels Skousen",
         "Lars Lunøe",
         "Sune Geertsen",
         "Bodil Jørgensen",
         "Taina Anneli R. Berg",
         "Kenn Bruun",
         "Mads Ole Langelund Larsen",
         "Joakim Schierning",
         "Bent Larsen",
         "Thorkild Demuth"
      ],
      "imdbMovieId": "1087890",
      "originalTitle": "Frygtelig lykkelig",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "qkOUtxgwJJ8",
         "qsslA308XV8"
      ],
      "plotSummary": "Robert Hansen, 34, a young police officer from Copenhagen, is transferred against his will to the small town of Skarrild in Southern Jutland as a substitute Marshall. The transfer is Robert’s chance to start over. Whether he is allowed to return to his job in Copenhagen, all depends on how well he performs in this frontier town.",
      "tmdbMovieId": 15952,
      "avgRating": 3.26471,
      "releaseYear": "2008",
      "numRatings": 51,
      "posterPath": "/uxsYNU26eVIqhPVKmLfXyxni7Ms.jpg"
   }
}