{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "possession",
            "id": 9712
         }
      ],
      "imdb_id": "tt0055153",
      "video": false,
      "title": "Mother Joan of the Angels",
      "recommendations": [
         46799,
         185579,
         129933,
         57969,
         36226,
         217411,
         49695,
         263197,
         109380,
         141906,
         281122,
         53016,
         32609,
         42631,
         85692,
         104549,
         47721,
         116370,
         355505,
         151730
      ],
      "backdrop_path": "/6tTASCDn8ioMCnbRPOxgdqv1Psf.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Milo_Jeeder",
         "id": "58a2506cc3a3682962000633",
         "content": "Directed by Jerzy Kawalerowicz and inspired by the (presumably) real case of the \"Loudun Possessions\", the story of \"Mother Joan of the Angels\" is set on the seventeenth century, in a small village in Poland. There, a priest known as Jozef Suryn (Mieczyslaw Voit ) is sent to a convent, to help a group of nuns, who have been suffering from demonic possessions, especially Mother Joan (Lucyna Winnicka). As soon as Jozef meets Mother Joan, she threatens him with her diabolic voice and tells him that it won't be easy to cast the demons away and that she's not afraid of him. From that moment on, Father Jozef finds himself fighting and struggling to help the poor Mother Joan and cast the evil forces away.\r\n\r\nThis films offers the classic \"good vs. evil\" battle, by showing common places, such as the evil woman and the courageous man who fights against all odds, risking his own life, because he's so kind-hearted that he feels compelled to save the ill-fated woman. These archetypes are mostly shown in the two main characters (Jozef and Mother Joan), although these two are not the only ones. The rest of the nuns, for example, look eerie and unsettling throughout most of the film. There's something strangely disturbing about the nuns in this film, something about the way they move and the look in their eyes, which combines numbness and malevolence at the same time.\r\n\r\n\"Mother Joan of the Angels\" is a film that probably doesn't have much of a scare value compared to the newer films, but I would like to think that anyone who has a little bit of patience and doesn't expect gore and explicit violence, will be able to appreciate it for what it is. This type of horror is not for everybody but there's a lot of things that make this film very dark and powerful. While the new audiences would probably disagree with me, I think this film is not as slow-paced as it looks, judging by the first minutes. As I mentioned before, the key is to have a little patience, allow the character development, until reaching the well-awaited climax.\r\n\r\nVisually speaking, \"Mother Joan of the Angels\" is pretty much flawless. Thought there aren't any amazing special effects, the shots, the setting and the contrasting photography create a very dark atmosphere, which is reminiscent of a dream-like sequence. There's something strange about this film: on the one hand, it is unsettling and dark, but there's also something very soothing about it. I'm not sure if it's the beautiful landscapes, the fact that it is black and white, the long philosophical dialogs or maybe all of those things combined.\r\n\r\nThe acting is mostly perfect, especially the main actress, Lucyna Winnicka, who manages to convey the poor innocent woman and the evil woman at the same time, without looking campy. Her expressions, her body language, her voice and the way she moves is impressive. I am not easily scared, but I will say that I was very impressed with the scenes involving \"evil\" Mother Joan. As for the male lead, there's really nothing to complain, as he delivers a perfectly believable character, but simply not as memorable as his female counterpart. As a matter of fact, I was pleasantly surprised by how good were most of the actors, as I was expecting something overly histrionic and more campy.",
         "url": "https://www.themoviedb.org/review/58a2506cc3a3682962000633"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mother Joan of the Angels",
               "gender": 1,
               "credit_id": "52fe4b37c3a36847f81f8371",
               "name": "Lucyna Winnicka",
               "profile_path": "/gJEqrdmVEwnWqKQZallsLiToHPf.jpg",
               "id": 114424,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Father Jozef Suryn / Rabbi",
               "gender": 0,
               "credit_id": "52fe4b37c3a36847f81f8375",
               "name": "Mieczysław Voit",
               "profile_path": "/k7MwnH981jVMKctdVkGbsrxeVLw.jpg",
               "id": 1096333,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sister Malgorzata (Margareth)",
               "gender": 0,
               "credit_id": "52fe4b37c3a36847f81f8379",
               "name": "Anna Ciepielewska",
               "profile_path": null,
               "id": 1096334,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Antosia",
               "gender": 1,
               "credit_id": "52fe4b37c3a36847f81f837d",
               "name": "Maria Chwalibóg",
               "profile_path": "/9YwysWQ4sNhOsBy7naF0eSsTM4V.jpg",
               "id": 136734,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Father Brym",
               "gender": 2,
               "credit_id": "52fe4b37c3a36847f81f8381",
               "name": "Kazimierz Fabisiak",
               "profile_path": "/bvkmUjqtiMUNN6WAgC1zrEBxj5f.jpg",
               "id": 930833,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Chrzaszczewski (Squire)",
               "gender": 0,
               "credit_id": "52fe4b37c3a36847f81f8385",
               "name": "Stanislaw Jasiukiewicz",
               "profile_path": "/bOKGOxg4dMOFZYDqVhBU4srJtq6.jpg",
               "id": 1096335,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b37c3a36847f81f836d",
               "name": "Jerzy Kawalerowicz",
               "profile_path": "/eExOF0HkGm41HTXSP8zj4r3XncI.jpg",
               "id": 40615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b37c3a36847f81f838b",
               "name": "Tadeusz Konwicki",
               "profile_path": null,
               "id": 1062920,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b37c3a36847f81f8391",
               "name": "Jerzy Kawalerowicz",
               "profile_path": "/eExOF0HkGm41HTXSP8zj4r3XncI.jpg",
               "id": 40615,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "571c9f6992514115e2002732",
               "name": "Jaroslaw Iwaszkiewicz",
               "profile_path": null,
               "id": 1065678,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "543d2a31c3a36815f0001c17",
               "name": "Jerzy Wójcik",
               "profile_path": null,
               "id": 40913,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "571c9faec3a368197c005cf0",
               "name": "Wieslawa Otocka",
               "profile_path": null,
               "id": 41401,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "571c9fbec3a368197c005cf5",
               "name": "Tadeusz Borowczyk",
               "profile_path": null,
               "id": 1610081,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "571c9fcfc3a3684e98000f3f",
               "name": "Roman Mann",
               "profile_path": null,
               "id": 1536612,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "571c9fe3c3a36838cd000fe4",
               "name": "Felicja Rogowska",
               "profile_path": null,
               "id": 1610082,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "59021f0d9251410aa80011af",
               "name": "Adam Walacinski",
               "profile_path": null,
               "id": 1373877,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.549467,
      "production_countries": [{
         "iso_3166_1": "PL",
         "name": "Poland"
      }],
      "id": 113458,
      "vote_count": 26,
      "budget": 0,
      "overview": "A priest is sent to a small parish in the Polish countryside which is believed to be under demonic possession and there he finds his own temptations awaiting.",
      "similar": [
         9552,
         293670,
         11586,
         394830,
         289416,
         184346,
         27770,
         91586,
         561,
         396422,
         259693,
         9946,
         16235,
         4497,
         109414,
         241258,
         11026,
         334536,
         250546,
         13223
      ],
      "original_title": "Matka Joanna od aniolów",
      "runtime": 110,
      "poster_path": "/pDxTXhdCMgQ2PERz1y4cxP2lQ6c.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ZRF \"Kadr\"",
            "id": 32782,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Polski Film Agency",
            "id": 52,
            "origin_country": ""
         }
      ],
      "release_date": "1961-02-09",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jerzy Kawalerowicz"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Jaroslaw Iwaszkiewicz",
         "Tadeusz Konwicki"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0055153/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MjIwNjEzN15BMl5BanBnXkFtZTgwNDUwNTIxMTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Lucyna Winnicka, Mieczyslaw Voit, Anna Ciepielewska | See full cast and crew »"],
      "reviews": [
         "Father Jozef Suryn (Mieczyslaw Voit) is the latest in a long line of priests dispatched to an isolated 17th century convent to investigate the rumours of satanic obsession and possession affecting the nuns who live there. His particular task is to exorcise Mother Joan of the Angels,(Lucyna Winnicka) the mother superior of the convent who it would seem is possessed by numerous demons. Father Josef has been in training so to speak for many weeks, through prayer, abstinence, limited fasting and self flagellation and when he arrives at a nearby inn, he is shocked at the rumours he hears from the locals,who seem to take great pleasure in telling him of his difficult task, a task it would appear his that is going to be very difficult as the previous incumbent of his job had just recently been burnt at the stake. Mother Joan of the Angels was in fact based on real events and might be considered by some as one of the earliest examples of Nunsploitation, but the film is not exploitative in any way and never resorts to nudity or explicit sex, in fact it's a beautifully filmed, superbly acted horror drama that it would seem was very influential on William Friedkin's The Exorcist(1973), in fact if I hadn't previously known of its influence I would be comparing it to that film along with perhaps Bergman's Sjunde inseglet, Det (1957)a film set in a similar time frame that also boasts many wonderful scenes of rusticity amongst the peasants and that explores their every fear, not least in the first 15 mins where Mother Joan of the Angels is, it must be said, slow to get going, but in a good way, as Kawalerowicz builds up the tension, there is much talk and speculation amongst the peasants as the demonic things that go in the convent, the viewer is left in high anticipation of the evil that lurks there. The stunning high contrast black & white photography by Jerzy Wójcik is reminiscent of many an expressionistic silent era film, in particular the first meeting between the two main characters is superb as the juxtaposition of Suryn's black hair, black beard and black robe against Mother Joan's pure white habit and headdress is very striking, mainly because the classic colours of good and evil are actually reversed, for Mother Joan is possessed by no less than eight demons which don't take long to show themselves to Suryn, his plight seems doomed to failure as he is a man unsure of his own ability, his wide eyes giving away his fear of the demons and his task ahead. On the whole the film is an very intelligent character study that also touches on some very interesting theological issues, issues that are explored when Suryn goes to a local Rabbi for help. The only negative I would say for the film concerns the DVD which had some really poor subtitles, other than that I can't recommend it highly enough.9/10",
         "This was a \"Special Jury Prize\" winner at the Cannes Film Festival in a year where the top winner, curiously enough, was another 'nun' picture - Luis Bunuel's controversial VIRIDIANA! It deals with the famous 17th century incident of devil possession at Loudon - treated in several books and at least one more time on the screen, Ken Russell's notorious THE DEVILS (1971); for this reason, ever since I first watched the latter, MOTHER JOAN OF THE ANGELS had been a sort of minor holy grail for me. Still, Kawalerowicz's approach couldn't be more different than Russell's hysterical campiness: while I admire the latter film, I seem to like it less with each viewing; this one, however, is a completely spellbinding character drama - not to mention a highly accomplished piece of film-making in its own right, with especially indelible visuals (somewhat reminiscent of Ingmar Bergman's medieval fables, namely THE SEVENTH SEAL [1957], THE MAGICIAN [1959] and THE VIRGIN SPRING [1960]): the starkness of its cinematography and sets (in contrast to the opulent exuberance of Russell's film) may also have influenced Andrei Tarkovsky's ANDREI RUBLEV (1966) - witness also the importance of the bells (as in the fantastic closing shot of them tolling silently, accompanied by the wailing nuns on the soundtrack). Interestingly, when the film starts the possession and exorcism attempts are already well under way (in fact, the events of the film take place immediately after the licentious priest who was later to be the central male character of THE DEVILS, played by Oliver Reed, has been burned at the stake as a sorcerer, denounced by the possessed nuns themselves). Given the ten-year gap between the two films (which saw a considerable loosening in censorship), the scenes here of rampaging nuns are nowhere near as explicit as in Russell's film - especially since it mainly revolves around the figure of the Mother Superior (played by the director's own wife): her numerous possession scenes are very effective, however, with the first manifestation of evil being particularly unsettling and brilliantly handled. Young Sister Margaret (ostensibly the only one not possessed) does emerge a major secondary character: seduced by a visiting squire (who, as with virtually all the other civilians, is depicted as lusty and takes a voyeuristic interest in the events at the convent), she gives up her vows for him but he eventually abandons her! This situation of 'impossible love' actually mirrors the more intense - yet repressed - central relationship between the the Mother Superior and the new priest (culminating in the scene where the Devil is literally passed from one body to the other); however, its aftermath differs strongly from the similar climactic incident in THE EXORCIST (1973): in a chilling sequence, to keep the demon from invading the woman again, here the priest goes on an irrational killing spree, finally telling Sister Margaret to inform the Mother Superior that he did it \"out of love\"! One of the most interesting sequences, too, is the one where the distraught Fr. Joseph seeks advise from a rabbi - an encounter which not only exposes the essential differences between the two faiths, but it's given an added touch of strangeness by having the same actor play both roles! The issues with the print which had kept me from ordering this earlier were exaggerated by the screen captures I saw on DVD Beaver; while certainly imperfect, the picture quality doesn't severely affect one's viewing appreciation, or dampen in any way Second Run's efforts to bring such an important masterwork to a wider audience. While not as revered as Wajda or some of the other Polish film-makers, from the two Kawalerowicz films I've watched (the other being the historical epic PHAROAH [1966]), his talent is undeniable; I'd love to catch up with his NIGHT TRAIN (1959), which the liner notes on the DVD described as the director's best work, and also the Italian-made (and reportedly disastrous) MADDALENA (1971). This was actually the first Second Run title I purchased: others I look forward to adding to my collection include THE RED AND THE WHITE (1967), THE CREMATOR (1968), THE EAR (1969), LOVE (1971) and the upcoming THE PARTY AND THE GUESTS (1966) and THE ROUND-UP (1966); I had intended to pick up KNIGHTS OF THE TEUTONIC ORDER (1960) and PASSENGER (1963) as well, but the DVD presentation of both is unfortunately compromised - the former has been censored by the BBFC for animal violence, while the latter's Aspect Ratio is incorrect.",
         "It's a pity this movie isn't available on dvd or vhs - it certainly deserves a wider audience. In my opinion it is not only Kawalerowicz's ultimate masterpiece, but one of the most profound and rewarding polish movies. Based upon a novel by a foremost polish writer Jaroslaw Iwaszkiewicz, it plunges deeply into the intricacies of human psyche and existence, touching both the philosophical and theological issues. Very good performances, especially by Voit and Winnicka, make the story even more compelling. The movie somewhat reminds me of Andriej Tarkovsky's cinematographic explorations.",
         "While not a nunsploitation film at all, it's hard not to at least consider the analogy given the content, or at least the form. Within the context of nun films, this qualifies as the best of the lot, easily surpassing even \"Flavia the Heretic\". However, there is not a hint of exploitation here - this is a highly artistic work that values subtle and minimalist approach. All the excesses take place off screen. Instead, the film concentrates on the man's inner torture and crisis of faith, delivered with stern black and white cinematography. These factors are used to a great effect and sometimes do, in fact, lead to the atmosphere of veritable horror, particularly the devastating scenes leading up to, and following the murder of the two peasants. All in all, criss cross Bergman circa his \"death of god\" trilogy with snippets of \"Incubus\" (the one with William Shatner), Czech Republic's \"Witches'Hammer\", Japan's \"School Of The Holy Beast\" and \"Excorcist\", and you will end up in the ballpark next to \"Matka Joanna...\" Made in the early 60's, the film has obviously been quite offensive to the Catholic church, which always had a huge influence in Poland, even during the communist years. The scene of the priest going to a rabbi for advise (Mieczyslaw Voit doubling in the main role of a tortured priest and a rabbi)and being accused of ignorance is unsettling enough for any good Samaritan. But in those days the church must have had less leverage if, for instance, it wanted to have the film banned, I reckon. Overall, though, the movie takes stabs at both the insular macrocosm of the church as well as the secular world. The latter, for example, with the scene of a nobleman seducing a gullible nun and then abandoning her the morning after. And the former - with the scenes of priests impotently attempting to exorcise the sinful nuns. The exorcism sequences, namely those of the nuns, are wonderful actually - once again, subtle and also theatrical and surreal, but without the silly \"Exorcist\"-type horror bombast, although there are traces of it in the scene depicting the first encounter between the priest and mother superior. But since this movie was made way before the \"Exorcist\" - you can disregard the whole thing. Anyhow, this piece is way up there in the left-field Polish pantheon along with \"Saragosa Manuscript\" and early works of Andrzej Zulawski. Highest recommendations.",
         "Another user lamented that this film was not available on VHS or DVD, but I must disagree. Polart Distribution Facets Video has come out with a DVD for Region 1 which enabled me to see this wonderful movie. It is the story of a priest-exorcist who is sent to a convent where apparently the nuns, especially the mother-superior, are demon possessed. It is the story of the struggle between good and evil, between chastity and sexuality, of confronting one's own demons. And it is well done. Lucyna Winnicka (Mother Joan of the Angels) commands attention as she provides an incredible performance. I was startled by the change in her appearance during the course of her first meeting with Mieczyslaw Voit (Father Suryn), where she changes from a meek, submissive nun to a demon-possessed soul. The abrupt and dramatic change in her facial expression was incredible. I also felt the camera work (sadly, I don't know all the technical terms) was fantastic. The angles, the contrast, what was included and excluded in the background...all of this was flawless. This story gives me a lot to think about and has left some vivid images in my head. A wonderful film that I will watch again.",
         "In what could be viewed as a sequel to Ken Russell's The Devils (1970), Jerzy Kawalerowicz's bleak but brilliant drama tells the infamous story of the so-called 'Loudon Possessions', in which a convent of nuns were said to have been possessed by a variety of demons, seducing men and indulging in sinful activities while the Church sent priests to exorcise them. It resulted in the death of French Catholic priest Urbain Grandier, who was burned at the stake after suggestions were made that he had succumbed to evil himself, forging a 'diabolical pact' that bound his soul to the Devil. It's an event that has caught the imagination of many artists, including the aforementioned Russell, as well as Aldous Huxley. but never has it been portrayed with such terrifying foreboding as in Mother Joan of the Angels. Father Suryn (Mieczyslaw Voit) is sent to a Polish convent in the seventeenth century, where talk amongst the sparse townsfolk are of the wicked acts committed by the nuns of the convent that looms over the town like a ghost. At the head of this apparent possession is Mother Joan (Lucyna Winnicka), who tells Suryn of the fate of the previous priest, whose charred remains still lie at the burning post. Suryn is so horrified by what he sees as the purest of evils that he promises to rid Joan of her affliction, even if it is at the expense of his own soul, becoming a martyr in the fight against Satan's influence. The picture is black and white and the cinematography is dark and empty, capturing the hopelessness of this small, insignificant and nameless town. It resembles the minimalistic work of Ingmar Bergman and Carl Theodor Dreyer, and shares many of the conflicted representations of religion that frequented the auteur's back catalogue. The film occasionally branches out into horror, with close-ups and shadows used to powerful effect as Satan's influence creeps into Suryn's soul, leading him to reach out in desperation to a rabbi in what is one of the film's most powerful scenes. It's also a twisted love story between Joan and Suryn, transcending mere desire into something deeper and unspoken. Complex and courageous, Kawalerowicz's film will most likely always be overshadowed by Russell's more provocative work, but this is one of the finest works to come out of 60's Poland. www.the-wrath-of-blog.blogspot.com",
         "Directed by Jerzy Kawalerowicz and inspired by the (presumably) real case of the \"Loudun Possessions\", the story of \"Mother Joan of the Angels\" is set on the seventeenth century, in a small village in Poland. There, a priest known as Jozef Suryn (Mieczyslaw Voit ) is sent to a convent, to help a group of nuns, who have been suffering from demonic possessions, especially Mother Joan (Lucyna Winnicka). As soon as Jozef meets Mother Joan, she threatens him with her diabolic voice and tells him that it won't be easy to cast the demons away and that she's not afraid of him. From that moment on, Father Jozef finds himself fighting and struggling to help the poor Mother Joan and cast the evil forces away. This films offers the classic \"good vs. evil\" battle, by showing common places, such as the evil woman and the courageous man who fights against all odds, risking his own life, because he's so kind-hearted that he feels compelled to save the ill-fated woman. These archetypes are mostly shown in the two main characters (Jozef and Mother Joan), although these two are not the only ones. The rest of the nuns, for example, look eerie and unsettling throughout most of the film. There's something strangely disturbing about the nuns in this film, something about the way they move and the look in their eyes, which combines numbness and malevolence at the same time. \"Mother Joan of the Angels\" is a film that probably doesn't have much of a scare value compared to the newer films, but I would like to think that anyone who has a little bit of patience and doesn't expect gore and explicit violence, will be able to appreciate it for what it is. This type of horror is not for everybody but there's a lot of things that make this film very dark and powerful. While the new audiences would probably disagree with me, I think this film is not as slow-paced as it looks, judging by the first minutes. As I mentioned before, the key is to have a little patience, allow the character development, until reaching the well-awaited climax. Visually speaking, \"Mother Joan of the Angels\" is pretty much flawless. Thought there aren't any amazing special effects, the shots, the setting and the contrasting photography create a very dark atmosphere, which is reminiscent of a dream-like sequence. There's something strange about this film: on the one hand, it is unsettling and dark, but there's also something very soothing about it. I'm not sure if it's the beautiful landscapes, the fact that it is black and white, the long philosophical dialogs or maybe all of those things combined. The acting is mostly perfect, especially the main actress, Lucyna Winnicka, who manages to convey the poor innocent woman and the evil woman at the same time, without looking campy. Her expressions, her body language, her voice and the way she moves is impressive. I am not easily scared, but I will say that I was very impressed with the scenes involving \"evil\" Mother Joan. As for the male lead, there's really nothing to complain, as he delivers a perfectly believable character, but simply not as memorable as his female counterpart. As a matter of fact, I was pleasantly surprised by how good were most of the actors, as I was expecting something overly histrionic and more campy.",
         "A slow-burn horror for the imagination, atmospheric and superbly acted, the players get more expression from their eyes than I've seen in any film since the silent days. Yet the voices of the 'devils' as they speak through Mother Joanna are all scarily differentiated. A great setting, empty and expressionist, which I believe was a rubbish tip or an old quarry near Lodz. The convent set was, like Black Narcissus, entirely a studio construction. I can't remember the last time I saw such crisp pellucid black and white photography. In plot terms, this is a sequel to Ken Russell's The Devils, near the beginning we see the stake where Grandier (his name changed to something a bit more Polish-sounding) had been burnt. There are no more burnings in this film, but the shadow of the stake overhangs the action, underlining that even when a story ends, the characters go on. As they will go on in your mind after you've watched this film. You'll talk about it - What will happen to them next?",
         "The subject of this film is a fascinating one and it has been portrayed in several media with great eloquence. I know nothing at all about the director of this film except that he is apparently not an experienced director at all. He might be a writer or theologian or philosopher but his field of expertise does not extend to direction. The film is poorly paced, verbose and it drags on for at least thirty minutes in excess. It repeats itself almost literally near the end to make a rather feeble point that it actually does have structure with apologies, I suppose, for the talk fest for the past two hours plus.. Frankly,I can't find anything to admire in it. Curtis Stotlar"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Film Polski Film Agency",
         "ZRF \"Kadr\""
      ],
      "summaries": [
         "Set in the 17th century. A convent in a small town is being visited by high-ranking Catholic official trying to exorcise the nun supposedly posessed by demons. A local priest have been burnt for creating this condition by sexual temptation of the nuns, especially the Mother superior who bring on the collective hysteria of the group. There is another young priest who is to help with the exorcism. His first meeting with the convent head, Mother Joanne of the Angels, has her seemingly posessed by Satan - she yells blasphemies and incites the priest. She begs the priest to save her and to help her to be a saint. To help her, he kills two innocent people to be forever a prey of the devil and thus allow her freedom.",
         "A priest is sent to a small parish in the Polish countryside which is believed to be under demonic possession and there he finds his own temptations awaiting."
      ],
      "budget": 0
   },
   "movielensId": 80097,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "1961-02-09",
      "dvdReleaseDate": "2006-04-25",
      "directors": ["Jerzy Kawalerowicz"],
      "runtime": 110,
      "movieId": 80097,
      "title": "Mother Joan of the Angels",
      "mpaa": null,
      "actors": [
         "Lucyna Winnicka",
         "Mieczysław Voit",
         "Anna Ciepielewska",
         "Maria Chwalibóg",
         "Kazimierz Fabisiak",
         "Stanislaw Jasiukiewicz"
      ],
      "imdbMovieId": "0055153",
      "originalTitle": "Matka Joanna od aniolów",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "DIAgK8575kE",
         "Fj1_dnrahhI"
      ],
      "plotSummary": "A priest is sent to a small parish in the Polish countryside which is believed to be under demonic possession and there he finds his own temptations awaiting.",
      "tmdbMovieId": 113458,
      "avgRating": 3.62,
      "releaseYear": "1961",
      "numRatings": 25,
      "posterPath": "/pDxTXhdCMgQ2PERz1y4cxP2lQ6c.jpg"
   }
}