{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "propaganda",
            "id": 2903
         },
         {
            "name": "war propaganda",
            "id": 33846
         }
      ],
      "imdb_id": "tt0036630",
      "video": false,
      "title": "San Pietro",
      "recommendations": [
         118943,
         86811,
         49470,
         87981,
         147746,
         212185,
         190694,
         195073,
         195133,
         230964,
         144442,
         143770,
         190563,
         48263,
         195960,
         195092,
         148791,
         162853,
         94732,
         191594
      ],
      "backdrop_path": "/zSGexe1bhqIxslkRQbIN05zTkjS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself - Introduction",
               "gender": 0,
               "credit_id": "5475988592514170b400106b",
               "name": "Mark W. Clark",
               "profile_path": null,
               "id": 1147600,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "54759892925141407a001350",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49089251416c910a0997",
            "name": "John Huston",
            "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
            "id": 6593,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.303577,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84701,
      "vote_count": 20,
      "budget": 0,
      "overview": "This documentary movie is about the battle of San Pietro, a small village in Italy. Over 1,100 US soldiers were killed while trying to take this location, that blocked the way for the Allied forces from the Germans.",
      "similar": [
         424,
         423,
         14574,
         228150,
         369885,
         21735,
         1771,
         637,
         289222,
         853,
         5925,
         857,
         2253,
         16869,
         613,
         339259,
         340101,
         1251,
         8056,
         351339
      ],
      "original_title": "San Pietro",
      "runtime": 40,
      "poster_path": "/wSvODkZCEn3726F1oZAOiFlX8h4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "U.S. Army Pictorial Services",
         "id": 39492,
         "origin_country": ""
      }],
      "release_date": "1945-05-03",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Huston"],
      "runtime": 32,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036630/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA1NjMxOTMxNjNeQTJeQWpwZ15BbWU3MDAxOTcwNTI@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Mark W. Clark, John Huston | See full cast and crew »"],
      "reviews": [
         "John Huston's World War II documentary on the battle of San Pietro is easily up to the high standard that he set with his numerous classic dramas. It is impressive in describing both the events and the atmosphere of a desperate and costly struggle, and it is memorable in preserving its effect on those who had to live through it. Even on a purely historical level, this would serve as a valuable description of one stage in the grueling Italian campaign, one of the war's least-remembered and least glamorous aspects. The narration is very efficient in detailing what the battle was about, what happened, and why it happened. It puts everything into the perspective of the war as a whole, and it also provides a look at the nature of the Allies' slow, grueling, costly progress up the Italian peninsula. On a dramatic level, it is even more effective and memorable. Without forcing anything, without resorting to ploys of any kind, it brings you into the world of the unfortunate foot soldiers on whose backs and blood the fate of the battle rested. Huston's narration is flawless, using evenly measured tones to describe events in such a way as to allow them and the pictures of them to speak for themselves - and they speak in a powerful way. Most of the footage must have been taken at considerable risk, and while there is nothing fancy about the techniques, it's impressive how much it captures. The soldiers slowly crawling along rocky heights, the pounding of heavy artillery, the frightened civilians hiding in caves, and much more, are all vividly captured. It's hard to think of another documentary then or now that succeeds so well at what it set out to do.",
         "This film is available on DVD -- as part of the \"Treasures from American Film Archives\" collection released this year. The collection has lots of gems on its four disks but \"The Battle of San Pietro\" alone would make it worth the price. I watched this 30-minute documentary of one of many battles in Italy shortly after having viewed \"All Quiet on the Western Front\" for the first time. I thought the Milestone film was brilliant but it was this Huston documentary that made me cry. I don't know whether it is the matter-of-fact narration (by the director), the sight of all those G.I.s, or the Italian children that got to me but the sum of it all was almost overwhelming. Very highly recommended. 10/10",
         "i recently saw the approx. 40min version of this film and i must say, knowing what is missing from the 32min version, that it is indeed far more impactful and superior. images of more fallen soldiers in white body bags appear and reappear throughout to the point of it being a reocurring theme. i'm sure it's just as brilliant without the extra footage, but if you can, try to see the extra footage. while i have not seen the true original (running approx. 50min), i'm quite positive it's even better than the one i was fortunate enough to see. a great documentary film all-around (even if some of it was staged).",
         "One reviewer commented that he didn't know how this film ever got released during World War II. It almost didn't. First, you need to know that Hollywood actors, directors and producers were heavily recruited by the War and Navy Departments (the Defense Dept. is a post war innovation). These celebrities got to know a lot of the senior military personnel through their activities in Stage Door Canteens, the USO, recruiting and bond drives. Few were closer to the military top brass than Orson Welles, a close friend of Houston's. Welles told this story on, I believe, a Dick Cavett Show in the late 1960s or very early 1970s. I repeat it as I remember it. According to Welles the War Department censors did not want San Pietro released. They felt that the film was too graphic and that it might have an adverse effect on support for the war. Through Welles' personal friendship with General George C. Marshall he and Houston arranged a private screening at the Pentagon for Marshall, his staff and the censors. Following the screening Gen. Marshall stood up and ordered that the film be released. He said that it was an accurate depiction and that war was horrible. He felt that the American people needed to know that horror lest they romanticize war and become fond of a monstrous act of inhumanity. So San Pietro was released. If Welles exaggerated his role, I can't say. Certainly Houston didn't contradict him. If I have misremembered the tale in some particular, it does not change the fact that San Pietro owed its release to the intervention of Marshall. Even today San Pietro is worth seeing. As has already been suggested, it is a good complement to Lewis Milestone's All Quiet on the Western Front. I would suggest that it also ranks with two other great movies whose subject is World War I. Those movies are Jean Renoir's Grand Illusion and Stanley Kubrick's Paths of Glory. And, although it doesn't quiet rank with the three films already mentioned, Philippe de Broca's King of Hearts belongs in the insanity of war film festival we seem to be constructing here. Finally, I would point out that earlier wars are often stand ins for the more recent one as in M.A.S.H. Korea stood in for Vietnam.",
         "I don't know how this documentary ever managed to be released in 1945 while the war was still underway. Other examples of the genre always ended in victory. Allied dead were never seen except at funeral services with flags flying and officers making speeches and a solemn narrator telling us of their brave deeds. Huston's documentary is different. The narration is by the director and is full of the logic of battle and lacks sentiment. The film is shot from ground level, the level of the foot soldier. A phosphorous shell explodes some feet away, the ground trembles, and the air is filled with bits of burning chemicals. An American soldier is shot in mid-stride and flops unceremoniously to the ground. There are multiple shots of American dead, some being bundled into mattress covers and lowered into hasty graves by the Quartermaster Corps. Only one speech is delivered, by General Mark Clark at the opening of the film. He was in charge of American forces in Italy and always saw to it that the press referred to the Fifth Army as \"General Mark Clark's Fifth Army.\" Clark points out that there was great sacrifice during the campaign and hints that it might not have been so great if the Army hadn't seen fit to rob him of resources for the invasion of France. Nevertheless, he observes, we kept many Germans pinned down in Italy. No mention of the fact that the Allies too were bottled up in Italy with the Germans acting as the cork. Huston uses a simple map and pointer to illustrate the tactical situation. And his narration is blunt. The attack on the German's right was launched and not a man got more than 300 yards beyond his starting point. All our attacks were repeatedly repulsed with heavy losses. And when at last the Germans withdrew, they did so swiftly and according to plan, and took up new defensive position five kilometers away. Five kilometers away. That meant a new battle against a new defensive line. And after that, another battle against another defensive line, with all the German artillery sighted in, and their positions camouflaged and mutually supporting. There was nothing else to be done. The Italian boot seemed made for defense, with a high mountain range forming a spine down the center, and innumerable smaller ranges to the east and west, interspersed with rivers that swelled during the winter rains. The obstacles and mud often halted operations entirely. I suppose that's one of the reasons why we don't see very much footage of combat from the Italian campaign on television. It wasn't colorful. It wasn't glamorous. It didn't end in a smashing victory. The Battle of San Pietro was an early one, and Monte Casino and the Gustav Line and other terrors still lay ahead. The closest Hollywood ever came to capturing the misery associated with the Italian campaign was in William Wellman's \"The Story of G.I. Joe\" -- and even there, the despair these men must have felt is muted by the homespun voice over of Burgess Meredith as Ernie Pyle. Huston evidently staged many of the combat scenes but I still don't know how Huston's short film managed to get past the wartime censors.",
         "The reality of the War in Europe was brought to the American people in the John Huston shocking documentary \"San Pietro\" a forgotten battle in the hills and mountains of Central Italy that ended up costing as many US military battle casualties-some 1,200-as San Pietro's own population-1,400-in the 10 days of brutal fighting it took to capture it. We see here for the first time war in the raw with real footage that make people watching it stomachs churn. The film was unlike the movies that were released by Hollywood about the war to boost moral and make us-the US-look invincible compared to those we were at war with. Released just -on May 3 1945- a week before the war in Europe ended the American people saw for the first time US servicemen in real life not in the movie killed fighting the enemy in far greater numbers then the US Government or War Department was willing to show them. Using stock footage as well as recreating the battle scenes director John Huston showed us the reality of war not at all to glorify it like the Hollywood studios did to hide it's shocking effects from the American public. New at the time the war documentary opened the door to many more documentaries as well as movies to follow over the next 70 years in showing us that war is hell and mostly to those who have to fight it. Since then war movies out of Hollywood have become far more real in their depiction of war and less patriotic which is the best thing that the war documentary achieved. And it almost landed it's director John Huston behind bars for it's anti-war message that was considered unpatriotic and defeatist at the time of its release.",
         "I saw this film while watching my copy of the 4-DVD set \"Treasures From American Film Archives\"--a set of mostly ephemeral films that would have otherwise been lost. \"San Pietro\" is a film assembled by the US War Department to chronicle one of many battles from WWII. Like so many government films made during WWII, it is narrated by a Hollywood star (director John Huston) and I assume it was made by film makers who were in military service for the war. The film's narration and images are surprisingly blunt and free from extreme patriotism--making it highly realistic and gripping. In other words, the film is not all about American victory but shows casualties and describes how difficult this battle was--not some jingoistic rant meant to glorify war and make it seem like the troops were super-human. While some might have thought this would demoralize the folks at home (hence it was held for release for two years), it was direct, informative and well-constructed. At times, it felt almost as if you were there in the action and was very compelling--and a nice tribute to real sacrifices made by some very brave soldiers as well as an important historical record.",
         "I was expecting quite a bit from this movie, as it's often being credited as being an intriguing WW II (anti)war documentary, that puts you right in the middle of things. It does feature some unique and straight-forward battle images but to me it just didn't all worked out. To me this movie looks and feels more like a news reel than an actual documentary about the accounts of the battle of San Pietro. This might sound like a compliment but it isn't really. The movie tells a story and it features lots of footage but it all feels glued together. To me it's even doubtful if the narration and images even belong together. The entire narration tells how the battle progressed but I doubted that all of the footage got shot during any of those talked about events. My suspicion got confirmed by the end of the movie, when a disclaimer got shown saying some of the footage got shot before and after the battle but were put into the movie for continuity reasons. The narration by John Huston keeps the movie going at all times but it makes things happen a bit too fast as well really. Guess this is not the creator's fault but more the war department's that heavily cut the movie down because the movie got considered to be too anti-war by them. The movie is mostly considered to be anti-war because it's being pretty straight-forward and of course honest. You'll see death bodies in this movie and allies taking some heavy blows by the Nazi-enemy. This of course however this present day only works out as realistic and more interesting as well. After watching this movie I still don't feel like I knew what happened all during the battle of San Pietro, or why this battle was considered to be such a distinctive or important one to the allied campaign. But this again is also mostly due to the movie its too high pace. WW II-buffs will still 'enjoy' this movie for what it is, due to its unique footage but don't expect to learn much or to be blown away by any of the movie its images. 6/10 http://bobafett1138.blogspot.com/",
         "These comments helped me a lot' It is impressive in describing both the events and the atmosphere of a desperate and costly struggle, and it is memorable in preserving its effect on those who had to live through it. This documentary movie is about the battle of San Pietro, a small village in Italy. Over 1,100 US soldiers were killed while trying to take this location, that blocked the way for the Allied forces from the Germans' Well i do watched film not the whole of it but i cant get the documentary devices the filmmaker used, uniqueness in the film e.g in Triumph of the Will everyman has got Hitler' s hairstyle and how the editing together with shots relate to what the film is about. Also why is that women and children are shown smiling? Which type of shots are mostly used? What causes this battle? Who won the Battle and what are the effects brought by this fighting apart from people dying? What is the filmmaker trying to explain to the world?Please anyone explain to me.I will be happy... Really want to know about this film Thanks a lot",
         "*Spoiler/plot- 1945, The Allied and US forces attack the German strong hold that is just below of the hilltop fortress a Benedictine Medieval monastery of Monte Cassino to start their march through Italy to Germany. *Special Stars- Director: John Huston *Theme- The smallest of battlegrounds illustrates to us the great bravery that won WW2 for the Allied troops. *Trivia/location/goofs- American documentary, a very famous documentary film of the time about the troops fighting in the Italian peninsula. Look for 36th Texas Infantry Division footage here along with other Allied units fighting in that battle area of the muddy Liri Valley, Po River, and Monte Casino. My father fought in this battle and lived! *Emotion- An enjoyable documentary made up of live action combat or newsreel footage. However, there are the unpleasant shots of injured Americans and killed Germans with some blatant racist language. But it is extremely educational and does what a narrative simulated war film can do."
      ],
      "genres": [
         "Documentary",
         "Short",
         "War"
      ],
      "productionCompanies": ["U.S. Army Pictorial Services"],
      "summaries": [
         "This documentary movie is about the battle of San Pietro, a small village in Italy. Over 1,100 US soldiers were killed while trying to take this location, that blocked the way for the Allied forces from the Germans.",
         "This official War Department film directed by John Huston gives an account of the 9 month battle in the area of San Pietro, Italy during World War II. The film is blunt in its presentation of the battle, including the fact that several attempts to seize control of the location failed miserably with heavy casualties. While the overall tone of the film is positive in that it praises the men who were fighting, the War Department never used the film as it believed it would have a negative effect on morale."
      ],
      "budget": 0
   },
   "movielensId": 80104,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-05-03",
      "dvdReleaseDate": "2008-10-20",
      "directors": ["John Huston"],
      "runtime": 40,
      "movieId": 80104,
      "title": "San Pietro",
      "mpaa": "",
      "actors": [
         "Mark W. Clark",
         "John Huston"
      ],
      "imdbMovieId": "0036630",
      "originalTitle": "San Pietro",
      "genres": [
         "War",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This documentary movie is about the battle of San Pietro, a small village in Italy. Over 1,100 US soldiers were killed while trying to take this location, that blocked the way for the Allied forces from the Germans.",
      "tmdbMovieId": 84701,
      "avgRating": 3.5,
      "releaseYear": "1945",
      "numRatings": 5,
      "posterPath": "/wSvODkZCEn3726F1oZAOiFlX8h4.jpg"
   }
}