{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "nightmare",
            "id": 3030
         },
         {
            "name": "water",
            "id": 4237
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "ghost child",
            "id": 172992
         },
         {
            "name": "child custody",
            "id": 178364
         },
         {
            "name": "new apartment",
            "id": 190073
         }
      ],
      "imdb_id": "tt0308379",
      "video": false,
      "title": "Dark Water",
      "recommendations": [
         11838,
         10389,
         9694,
         4552,
         2671,
         27324,
         9666,
         44203,
         32250,
         32242,
         17111,
         9669,
         37284,
         10894,
         32173,
         32170,
         33908,
         153750,
         25627,
         14217
      ],
      "backdrop_path": "/smJ6ld0eeKtU51VhHy9L4UFvJvM.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "577811f9c3a3686d920019ff",
         "content": "This was very enjoyable and I especially loved the ambience, murkiness and palpable dread that coruscated throughout. This scared my son, a budding horror-film aficionado himself, surprisingly much more than I felt more horrific films he has watched did, and gave him nightmares for a while afterwards.\r\n\r\nAs much as I love Jennifer Connelly and Walter Salles' work, I will try and avoid the English-language remake simply on general principle.",
         "url": "https://www.themoviedb.org/review/577811f9c3a3686d920019ff"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Yoshimi Matsubara",
               "gender": 1,
               "credit_id": "52fe44c99251416c75040e7f",
               "name": "Hitomi Kuroki",
               "profile_path": "/jk0sqAm1f4jvt8IjP1dfuPxbGDC.jpg",
               "id": 71641,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mitsuko Kawai",
               "gender": 0,
               "credit_id": "52fe44c99251416c75040e83",
               "name": "Mirei Oguchi",
               "profile_path": null,
               "id": 71642,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kunio Hamada",
               "gender": 2,
               "credit_id": "52fe44c99251416c75040e87",
               "name": "Fumiyo Kohinata",
               "profile_path": "/nUugr8JH1cmGRPcMFvSQibShojz.jpg",
               "id": 58449,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Ikuko Hamada (16 years old)",
               "gender": 1,
               "credit_id": "52fe44c99251416c75040e91",
               "name": "Asami Mizukawa",
               "profile_path": "/sIyRSeQUetRPuVTg3BEWdfrggCu.jpg",
               "id": 71643,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ikuko Matsubara (6 years old)",
               "gender": 0,
               "credit_id": "52fe44c99251416c75040e95",
               "name": "Rio Kanno",
               "profile_path": null,
               "id": 71644,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c99251416c75040e6f",
               "name": "Hideo Nakata",
               "profile_path": "/fQ3XJXTNpxzt6gMpMM0pJOyuibA.jpg",
               "id": 26875,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c99251416c75040e75",
               "name": "Yoshihiro Nakamura",
               "profile_path": "/thBczkN1WMvrVh9TIYyPrFO5IH2.jpg",
               "id": 71640,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c99251416c75040e7b",
               "name": "Kôji Suzuki",
               "profile_path": null,
               "id": 27786,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c99251416c75040e8d",
               "name": "Takashige Ichise",
               "profile_path": null,
               "id": 20316,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c99251416c75040e9b",
               "name": "Shikao Suga",
               "profile_path": null,
               "id": 71645,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c99251416c75040ea1",
               "name": "Kenji Kawai",
               "profile_path": "/jIhpBTVJ4JmPFUbTlXROgL6GMCT.jpg",
               "id": 57304,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c99251416c75040ea7",
               "name": "Jun'ichirô Hayashi",
               "profile_path": null,
               "id": 27794,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c99251416c75040ead",
               "name": "Nobuyuki Takahashi",
               "profile_path": null,
               "id": 58445,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5842b5179251417ec400749c",
               "name": "Katsumi Nakazawa",
               "profile_path": null,
               "id": 1124464,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5842b53d9251417ecd0075b1",
               "name": "Cesar Inserny",
               "profile_path": null,
               "id": 1094646,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5842b550c3a36876b80081b2",
               "name": "Akihiko Okase",
               "profile_path": null,
               "id": 1717783,
               "department": "Sound",
               "job": "Foley"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.182652,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 12205,
      "vote_count": 159,
      "budget": 0,
      "overview": "A woman in the midst of an unpleasant divorce moves to an eerie apartment building with her young daughter. The ceiling of their apartment has a dark and active leak.",
      "similar": [
         91586,
         77949,
         452507,
         10014,
         288158,
         441701,
         2655,
         1562,
         377,
         242224,
         138843,
         201085,
         416160,
         397243,
         19592,
         164457,
         8967,
         73,
         620,
         693
      ],
      "original_title": "仄暗い水の底から",
      "runtime": 101,
      "poster_path": "/h0f2nPiK2tKKL0UKqUsbySOsjBB.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Office Augusta Co. Ltd.",
            "id": 84047,
            "origin_country": ""
         },
         {
            "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
            "name": "Nikkatsu",
            "id": 955,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Oz Company",
            "id": 4563,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kadokawa Shoten Publishing Co.",
            "id": 9068,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nippon Television Network (NTV)",
            "id": 20192,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Video Audio Project (VAP)",
            "id": 52024,
            "origin_country": ""
         }
      ],
      "release_date": "2002-01-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hideo Nakata"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Kôji Suzuki",
         "Ken'ichi Suzuki"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0308379/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzkyMzkzNDYwOF5BMl5BanBnXkFtZTcwMjg3MzAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Hitomi Kuroki, Rio Kanno, Mirei Oguchi | See full cast and crew »"],
      "reviews": [
         "Yoshimi Matsubara (Hitomi Kuroki) is in the middle of a nasty divorce from her husband, Kunio Hamada (Fumiyo Kohinata). The biggest issue of contention is their daughter, Ikuko (Rio Kanno). Kunio accuses Yoshimi of being unstable, and he seems to have a point. Still, Yoshimi is awarded at least temporary custody of Ikuko. We see her finding an apartment for her and Ikuko to live in. They pick a less-than-ideal apartment, because it is affordable. Soon after, strange occurrences begin. Yoshimi's bedroom ceiling is developing a water stain. Mysterious puddles of water appear in different locations. An unusual item keeps appearing, despite attempts to discard it. Yoshimi periodically sees a strange girl, but only in glimpses. Ikuko begins acting oddly. On top of all this, Yoshimi is trying to go back to work, and she's having trouble balancing that with taking care of Ikuko. Things are spiraling out of control. Are the problems due to Yoshimi's divorce, or is there also something more sinister or supernatural going on? Despite Dark Water's relatively overt similarities to a number of other filmic works, this is one of director Hideo Nakata's most successful films--at least as good as his famed Ringu (1998), if not better. I came awfully close to giving Dark Water a 10 out of 10, and can easily see myself raising my score on subsequent viewings. Many facets of the film do not open up until you see them again. For example, when fact checking something about the film shortly before writing this review, I re-watched the beginning; the opening credits are extremely eerie, but the full impact doesn't hit you until after you've seen the film once and more fully realize what you're looking at while watching the first shot. The similarities include quite a few thematic resemblances to Ringu, which shouldn't be surprising considering that not only is Nakata the director for both films, they are both based on novels by the man who is often called \"The Japanese Stephen King\", at least in the Japanese press--Koji Suzuki. Like Ringu, Dark Water's menace comes in the form of a young, long haired Japanese girl who makes frequent, mysterious appearances. Girls may be the focus because of irony--they're supposed to be cute (as is Kanno, who turns in a great performance along with her more adult fellow cast) and innocent. A girl menace should therefore be that much more unnerving. The menace is often accompanied by water. Water was important symbolism in Ringu, too. I would venture a guess that Nakata and/or Suzuki have a fear of water. It might be more impersonal, too. Water is a powerful force, both easily adapting to its surroundings and easily molding them. It permeates much of the world. As such, it's a good visual symbol for kami, which is the Shinto \"essence\" or \"beingness\" that permeates everything, and (among many other things) can be godlike, or the soul of a dead human, or tsumi, a \"pollution\" form of kami which could perhaps be also at least symbolically cleansed by water. Another important symbolic commonality shared by both Ringu and Dark Water is that of claustrophobic spaces. These occur in Ringu in forms like the well, closets and crawl spaces. Dark Water has the elevator and a structure for which you'll only realize the importance near the end of the film. Water combined with the elevator also enables Nakata to give a nice nod to Stanley Kubrick's The Shining (1980) in one scene. A further similarity to Ringu is that Dark Water is just as concerned with familial problems as it is concerned with horror. In fact, the horror may only be symbolic or may only be a metaphor for familial problems (in the Ringu/Ring films, this is made even more clear in Nakata's latest, American Ring film--The Ring Two, 2005). Both feature a young mother struggling to maintain a normal existence with her only child. In Dark Water, it is particularly easy to see the horror elements as mere metaphors for Yoshimi's psychological decline and the effects it has on her daughter, which echo her own problematic childhood--we learn that her parents were also divorced when she was young, and the opening dramatic scene of the film shows Yoshimi as a child, waiting at school for someone to pick her up. We also hear her comment that her mother was \"bad\". This is not to say that Dark Water has no focus on horror. Nakata's well known deliberate pacing is perfect here. The spooky events are subtle but unnerving, and Nakata achieves some amazing build-ups, such as the scene in the elevator near the end of the film, with a particularly frightening reveal. This reveal works as well as it does because Nakata takes so long to get there. He builds tension through stretching out pregnant pauses until the viewer is ready to burst. There are many such scenes throughout the film. Dark Water also succeeds because the story is kept relatively simple and straightforward. Unlike typical American films, much of the story is \"told\" through implication. As a viewer, you are frequently left to figure out decisions and events based on seemingly innocuous comments in an antecedent scene followed by relationship and scenario changes in a following scene. In other words, you have to make assumptions about what has happened. That might sound complex, but the aim, which is wonderfully achieved, is actually to simplify the events on screen. Although that famous Asian horror film dream logic is still present in the supernatural events, it doesn't usurp the plot, which continues to gradually hone in on and build up the tension between Yoshimi, her husband, Ikuko, the mystery girl, and the apartment complex. The ending, which comments on all of those elements and the profound ways that they've changed, is particularly uncanny and poignant.",
         "This is my idea of a horror movie. No junk, no noise, no random jolts, but plenty of fear, delivered quietly and compactly, without fuss. It's the most suspenseful movie I've seen since \"Ring,\" and I think it's even better. Like that movie, it put my stomach in knots to prep them for the chills, which rose up like waves out of calm water. I thought \"Ring\" rather like a Robert Aickman story; this is as near as a movie can come. The director has uncanny skill in knowing where to place the camera and how long to hold a shot. And the leading actress gives a wonderful performance. Her face in the elevator...but that would be giving it away. The conclusion is foreseeable--maybe the ends of all ghost stories are foreseeable--but nonetheless satisfying. If you like tales of quietly disturbing dread, this is one for you.",
         "Hideo Nakata's \"Dark Water\" is one of the creepiest Japanese horror movies I have ever seen.A nervous mother Yoshimi Matsubara,undergoing divorce proceedings,moves into an apartment building that is haunted by a young girl,who disappeared years earlier.\"Dark Water\" is a perfect horror film.It is based on a novel by Koji Suzuki,so fans of \"Ringu\" won't be disappointed.Nakata's technique is to imply terror by suggestion,rather than the overuse of special effects.He perfectly captures an atmosphere of uncontrollable fear.Hitomi Kuroki is excellent as the neurotic,paranoid Yoshimi and Rio Kanno is equally remarkable as her five year old daughter,Ikuko.So if you're a fan of Japanese horror give this one a look.10 out of 10.Highly recommended.",
         "A story very similar in certain areas to another story by Hideo Nakata, but different enough to stand apart. Using similar techniques to the Ring series, Nakata employs askew camera angles, wide shots and the mixing of foreground and background, showing normality in one and abnormality in the other, often with the horrors in the background, unnoticed by the foreground characters. The use of audio, and indeed lack of in parts, heightens the tension and the feeling of unease even more. Throughout the film a nervousness grows, beginning with a slight niggle of something wrong, building to the final shocking realisations. Despite understanding the story before the end is reached, Nakato manages to pull you on through the story, in fact, even past where other films would have ended. Acting from the child is stunningly good, as is with the mother, with much of the story played out in the emotions of their faces rather than their actual words. This is perhaps what succeeds so well, the realism of the dialogue and the slow brooding story, with a distinct lack of action. Something Hollywood attempts to recreate in their unoriginal remakes.",
         "In the middle of a difficult custody battle over her 6 year old daughter with her ex husband, Yoshimi Matsubara takes a flat in an old building in order to get some stability in their lives. However the problems start with a constant and spreading leak in the ceiling of their flat and the sense of someone else being around the building. Yoshimi becomes increasingly on edge when Ikuko appears to be effected. Setting out my stall from the start I really liked Ringu and was happy to see this film from the same director. I knew nothing about it when I sat in the cinema and I think that is the best way to see it (although my plot synopsis about will have spoilt nothing). Dark Water continues Nakata's ability of unsettling audiences with little devices. Here he stays with the child theme from Ringu and it works very well despite being a much simpler plot that isn't anywhere near as clever as the other film. However in terms of delivering scares Nakata builds with shadowy images and creeping effects \u0096 the spread of the leak across the ceiling is creepy and the reoccurring image of a child's pink bag becomes increasingly unnerving as the film progresses. The direction is strong throughout with the camera preferring to turn to see what the characters see rather than having something leap into view or simply be cut to \u0096 this turning movement can take seconds where our tension is build by being kept waiting. Again the use of shadowy figures and fleeting glimpses of things is very creepy and it really worked for me much better than all the gore in the world. It is a little ironic that one of the biggest jumps from the audience came from the film's one use of CGI effects, but this worked well simply due to the build up of suspense all the way through. To compliment this the film uses music and sound very well. On the odd occasional it does the tradition thing where the music builds to up the tension, this works but is not unusual. What works better is the use of music WHEN the creeps arrive! Whenever Yoshimi looks at the leak the music gives it an unnerving quality that may not have existed with the shot alone. The simple plot makes for an effective little ghost story \u0096 there is an element of mystery here but it is more about the suspense than the history. This is OK but the ending is a little more predictable than I would have liked (at first glance) and the epilogue didn't really work for me and I felt it needed a stronger close (not necessarily a jump though). I say `at first glance' because it appears predictable but really it changes where I thought the film was going and the whole basis for the creepy scenes \u0096 ie I had assumed that the girl was taking Ikuko for play etc \u0096 I'll say no more but you'll understand when you see it. The cast were good. My friend said that Kuroki's Yoshimi was so sappy she wanted to slap her but I actually thought she played it well. She convinced me she was a woman going through an emotionally challenging time and was being pushed. There was an element of her overplaying (maybe? It could be taken as realism) the fear in order to heighten the audience's but really this was benefical to the film as a whole. Kanno's Ikuko is excellent \u0096 I can't imagine a child I know being able to cope with that sort of filming but she does it very well and is a million miles from the annoying brats that Western films seem to dig up when required. These two are excellent and have reasonable support characters but the real star is a character you only really glimpse and the creepy atmosphere created by Nakata. Overall anyone who saw the remake of Ringu (and it was No1 for a while) should ignore the subtitles and go and see this. It lacks the depth of Ringu and the epilogue's search for a greater significance is a little plodding and out of place, but it is still an effective ghost story that is a painfully slow at times but only serves to make it genuinely unnerving and creepy throughout.",
         "My theory of why I responded so strongly with Dark Water is that it's about people that you can relate to. It isn't about a cop who searches for the serial killer leaving cryptic puzzles, nor a lawyer who defends a crazy murderer who may not be the real killer, etc. It's about a single mother who's on the verge of losing one thing she cares for the most - her daughter. She has to go for job interviews, she has to find a place to live with little money, and she has to see a divorce lawyer to fend off her rather nasty (yet not unreasonable) husband. Life's tough for Yoshimi, and who could not identify with her? I certainly did, and maybe it's the main reason why the movie worked on me so well. I sympathised her character and her predicament. I cared for her choice. I kept thinking, 'God, please give this poor woman a break.', but as every good movie must, problems keep piling up on her already over-burdened shoulder, and the ghost haunting that old, damp apartment doesn't help her situation. As many other reviewers mentioned, this is not all that scary. If you are looking for pure Asian horror to scare you s***less, this isn't it. But on some level it worked on me better than, say, Grudge, because the characters inhabit this picture felt real. Natural performances from the little girl were just amazing (except a couple of spots where her acting was just little off), but overall I totally bought her character. When she says she needs no one but her mother, I felt a tingle of sensation in my eyes - I wanted them to be together as their love seemed so real. Hitomi Kuroki, playing the motehr, nicely underplays her role - she is polite and tries so hard to pull her life together against overwhelming odds. She is the center of this picture in every single sense. Also consider the characters in Dark Water, they are all firmly grounded on reality. The divorce lawyer for example, when she tells him that she sees a ghost, he calmly examines the apartment and offers the most reasonable advice that any lawyer would give. Even the husband, while nasty, never oversteps the line of a villain. He after all does care for the welfare of the little girl, and concerns that she sometimes doesn't pick up the child in time. This is a sad, tragic drama that deals with the souls of the children abandoned and lost by their parents. When that yellow flashback plays on the screen, I felt more pity than horror, so much so the last scene where Yoshimi held up that dead child, maybe it all made sense. Ending perhaps was little weak - maybe because I cared so much about Yoshimi and her daughter, I just wanted them to be happy and together. Not like this. All great movies regardless their genre constructs human drama as its core. While this may not be a great movie, but a damned fine human drama with a streak of horror this is.",
         "I like these flicks. Very slow in the beginning, very creepy in the end. Of course there are similarities between 'Dark Water' and 'Ringu' but who cares if you enjoy the movie. If we can learn one thing from both movies is that children are scary. People refer to 'The Shining' when reviewing this film and whenever I think of that movie I think of children... the twin sisters... scary! Personally I think this movie is more a 'Kramer vs Kramer meets The Changeling' instead of a 'Ringu revisited' or 'The Shining' rip off. I agree with people who say that after 'Ringu' a lot of bad horror movies followed from asia (e.g. kakashi, tomei) but this is NOT one of them. It scared the hell out of me! So far the best 3 asia horror movies I've seen: The Eye, Ringu and this one Dark Water. Hope to enjoy more movies like these.",
         "The silence the newly divorced mother and her 6 year old daughter experience in an apartment block they have just moved into sets the mood here. We see how they are together realistically, that means lots of silence and little action. One aspect that makes this scary is this realistic depiction of isolation you can get in these houses. And you cant help but wish the best for the two, struggling with work, the divorce rights and beginning school. And it rains. Water starts dripping from the ceiling and soon it permeates the whole building creating an uneasy and nervous mood that sneaks in on you and when you're not ready for it makes your nerves scream. You know its gonna happen and you get a good idea of where its leading, but its so well made that it doesn't matter.",
         "The reviser Yoshimi Matsubara (Hitomi Kuroki) has just divorced from her husband and is disputing the custody of their five years old daughter Ikuko Matsubara (Rio Kano) in the justice. She is looking for an apartment and a job to restart her life alone with Ikuko. She finds a small old apartment, and she does not pay attention to a stain of water on the ceiling. When she moves to the apartment, she notes that there is a drip of water in the bedroom, and she asks the landlord to repair the leakage. Meanwhile, Ikuko finds a red bag on the terrace, and Yoshimi returns it to the administrator. Yoshimi sees the creepy shape of a girl wearing a yellow coat, and she finds that she resembles a young girl that has been missing for two years in the neighborhood. She becomes afraid that the girl might be a ghost. \"Honogurai Mizu no Soko Kara\" is a tense low-paced horror movie, with a frightening and original story. The characters and the situation are slowly developed, the climax is scary, but I did not like the conclusion. I was really a little disappointed, since I expected much more. However, this film is another great Japanese horror movie, the best producers of this genre in the present days. My vote is seven. Title (Brazil): \"Dark Water \u0096 Água Negra\" (\"Dark Water \u0096 Black Water\")",
         "After his acclaimed Ringu Hideo Nakata has made a brilliant, chilling horror film that won't soon be forgotten by any one who sees it. Few films have the nerve to incorporate solid emotion into a good horror story. But this film is not afraid and it suceeds. Because of the way it is you become so completely involved with the charachters and the storyline equally enhancing the scares ten fold. this film and everyone assoicated with should be commended for making one of the most terrifying horror movies of all time. It's about a woman and her young daughter whom move into a new apartment. It just so happens that the past occupant a little girl is haunting it. And she must unravel the mystery as it approaches unrelentlessly. Rush out and find this movie where ever you can. You won't regret it. Dark Water is an instant classic. prepare for some scare!!!!!!!!!"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Kadokawa Shoten Publishing Co.",
         "Nippon Television Network (NTV)",
         "Office Augusta Co. Ltd."
      ],
      "summaries": [
         "After winning a custody battle for her daughter, Yoshimi tries to make a new start. The apartment she moves into seems perfect at first. Soon though, strange things begin happening. Huge water stains appear on the ceiling and drip constantly, more liquid oozing into the rooms every day. She calls the landlord in but he refuses to do anything about it. A child's red bag shows up in odd places and soon the child herself starts appearing. Yoshimi then discovers the origin of the ghost...",
         "A mother and her 6 year old daughter move into a creepy apartment whose every surface is permeated by water."
      ],
      "budget": 0
   },
   "movielensId": 8019,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2002-01-19",
      "dvdReleaseDate": "2005-06-28",
      "directors": ["Hideo Nakata"],
      "runtime": 101,
      "movieId": 8019,
      "title": "Dark Water",
      "mpaa": "",
      "actors": [
         "Hitomi Kuroki",
         "Mirei Oguchi",
         "Fumiyo Kohinata",
         "Asami Mizukawa",
         "Rio Kanno"
      ],
      "imdbMovieId": "0308379",
      "originalTitle": "仄暗い水の底から",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["zM_5hGBKqbE"],
      "plotSummary": "A woman in the midst of an unpleasant divorce moves to an eerie apartment building with her young daughter. The ceiling of their apartment has a dark and active leak.",
      "tmdbMovieId": 12205,
      "avgRating": 3.38918,
      "releaseYear": "2002",
      "numRatings": 776,
      "posterPath": "/h0f2nPiK2tKKL0UKqUsbySOsjBB.jpg"
   }
}