{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt1315419",
      "video": false,
      "title": "The Truth",
      "recommendations": [
         55662,
         77494,
         148526,
         39397,
         128280,
         334648,
         44646,
         47853,
         84924,
         14789,
         49261,
         61613,
         183258,
         35656,
         29776,
         42053,
         160907
      ],
      "backdrop_path": "/urCeJXcn3sMyIHX7kWxnwsKTxPg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jonathan Davenport",
               "gender": 2,
               "credit_id": "52fe47069251416c91067c03",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gabriel Doyle",
               "gender": 2,
               "credit_id": "52fe47069251416c91067c07",
               "name": "Brendan Sexton III",
               "profile_path": "/kQsOIQuGcqwdpolSEzLV7RfYVsV.jpg",
               "id": 2839,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dana Davenport",
               "gender": 1,
               "credit_id": "52fe47069251416c91067c0b",
               "name": "Erin Cardillo",
               "profile_path": "/f2Ozdo2ejILSBqUjTAaFIm4JxaC.jpg",
               "id": 122517,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gabriel's Father",
               "gender": 2,
               "credit_id": "52fe47069251416c91067c0f",
               "name": "Daniel Baldwin",
               "profile_path": "/vDLkhz6EliUtYumpJdFTquUvdfp.jpg",
               "id": 24516,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gabriel's Mother",
               "gender": 1,
               "credit_id": "52fe47069251416c91067c13",
               "name": "Erica Shaffer",
               "profile_path": "/7L6yfu2SETLrd08WDS7vqGtGZbQ.jpg",
               "id": 122518,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47069251416c91067c19",
               "name": "Ryan Barton-Grimley",
               "profile_path": null,
               "id": 122520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47069251416c91067c1f",
               "name": "Ryan Barton-Grimley",
               "profile_path": null,
               "id": 122521,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.914971,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39240,
      "vote_count": 8,
      "budget": 0,
      "overview": "When a couple is taken hostage in their home by an intruder, a simple home invasion robbery turns into something much more complicated...",
      "similar": [
         274,
         10285,
         949,
         189,
         2832,
         181283,
         336843,
         1949,
         158011,
         910,
         996,
         8834,
         371608,
         4638,
         845,
         28902,
         72784,
         9272,
         10424,
         2163
      ],
      "original_title": "The Truth",
      "runtime": 98,
      "poster_path": "/oRWnkJmzjtnPSwA0H21wt3cuh01.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "RBG Films",
         "id": 5763,
         "origin_country": ""
      }],
      "release_date": "2010-05-20",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "The truth... Is always complicated.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ryan Barton-Grimley"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Ryan Barton-Grimley",
         "Ryan Barton-Grimley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1315419/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MjY1NzY3NV5BMl5BanBnXkFtZTcwNDIyMTQ4Mg@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Heard, Brendan Sexton III, Erin Cardillo | See full cast and crew »"],
      "reviews": [
         "The Truth may not have risen to a level that I would normally write a review -- except for the two reviews that precede it. One clearly appears to be blindly promotional. The other - really: it is based upon the reviewer having watched the opening scene and then skipping through to the end. In the words of Rodney King: \"Can we all try to get along here?\". Though it features three established actors, it is pretty clear that In Truth was made on a relatively small budget. Nonetheless, it kept me interested and curious as to how \"the truth\" would come out. And how that truth came out was among the more impressive aspects. There were no \"aha\" moments. Rather, the writing, the direction and the performances were sufficiently nuanced that there were no WTFs. The acting? Actually quite good. Brendan Sexton's early scenes were an effective combination of engaging and threatening. Comely Erin Cardillo ranged well between feisty and combative and vulnerable. John Heard -- aging and overweight? Duh. His was an aging and overweight character! He did fine. Call it a poor man's \"Desperate Hours\" if you will. But it was watchable and fun, and deserves better than skipping through. Not a 10, but at least a 7.",
         "This film was interesting and kept me involved through the entire 90-minutes. The plot and concepts were not unique, I have seen many movies that follow similar concepts. That being said, it was still an interesting and compelling story, and had some good twists and turns throughout. From movies such as The Strangers, Desperate Hours, Panic Room, Funny Games, and maybe even Death Trap, the concept of people being locked in their home and being kept hostage is not new. I think the acting wasn't that great, though there were some recognized names in the credits. I found John Heard's acting the best of the group, though the rest of the actors were so poor it is hard to tell if he was any good or just better than the worst. If you like movies that have twists and are a mixture of thrillers and mystery you might like this movie.",
         "For Ryan Barton-Grimley, \"The Truth\" (2010) is his first written and directed movie. It's a very good or better neo-noir debut, not reflected in the current low IMDb rating of 4.8 which suggests a sub-par movie. This picture is of the kind that has a narrow focus in story and location, like \"Fourteen Hours\" (1951) and \"The Ledge\" (2011). The picture is restricted largely to the interior of a single home inhabited by John Heard and his wife Erin Cardillo that is invaded by Brendan Sexton III. It is mainly in sepia-toned flashbacks showing Sexton as a young man with his mother (Erica Shaffer) and father (Daniel Baldwin) that we depart from this interior. Those who expect a big-budget, big movie kind of affair will be disappointed. The question for this kind of movie is how well the story, acting and direction hold your attention and interest within a rather narrow frame as compared with the typical motion picture. \"The Truth\" succeeds handily in all three departments. The story succeeds as much as a mystery as it does a thriller. One can savor not only the story but three rich and shaded performances from its three main players, each of whom comvey hidden layers. Director Barton-Grimley is to be credited with the way in which this all comes together and smoothly engages us. This picture is an easy recommend. Appearances deceive and only gradually are we forced into changing our assessments of the three main characters, sometimes more than once. Real psychological battles accompany the physical battles. The story's sardonic tone, its character revelations, and its situation reversals compose a more than satisfactory and satisfying neo-noir. In movies with a somewhat similar home invasion premise, the tables are quite often turned. No such simplicity is present in \"The Truth\" because the truth is far more multi-faceted and complex. It is only after multiple turnarounds, all of which fall into place logically, that we reach stasis and the curtain falling. Only then do we know the truth, and it is a dark uncompromising neo-noir truth, through and through.",
         "There is no possible comment on such a thriller since any detail would lead you to the truth, the last minute of the film when it is all revealed that three people can hold so many secrets and so many false truths and true lies that you will never imagine life as still possible on the surface of this earth. First you can always get away with a murder, though it is more difficult to get away from a secret. The secret does not go with you and stays behind but catches upon you absolutely all the time. At times the murder can come back too but you are ready to face it since you know it will come back, sooner or later. But the secret you think, dumb as you are, that it is buried in your own mind and no one knows about it. You have it all wrong. It takes one person behind who remembers for you to be tricked, trapped, doomed, for you to trip on that stumbling block. With these two lines bring together three people in which two of them, hence three couples share one secret per couple. A knows something about B who knows something about C who knows something about A and the vicious circle closes onto a dead end in the shape of a never opening round rail that works forever and ever like an eternal merry-go-round. That's a hamster's wheel to which each one of those three animals is chained and they have lost the keys to liberate the handcuffs, the manacles or other steel fetters. Enjoy that film. It is so dense that you may even believe it is true and at the end you will feel relieved and redeemed and then suddenly you will relapse into the doom of that infernal basic fact of life: you can always get away with a murder but you will never get away from a secret. Think hard and answer that simple double question: what crime did you commit and what secret do you hide? Dr Jacques COULARDEAU",
         "4.8/10 i couldn't believe my eyes wen i saw that rating. i found this movie highly engaging, very unpredictable and dark. even though this is a small movie but u never feel that, i guess we have to thank the good direction for that. its a movie about love, betrayal and revenge. actors have done a fantastic job, keeping it tense but not being over dramatic. i guess its a perfect example that proves you don't need a big budget to make a good enjoyable movie, just a good script and some fine actors are more than enough to keep the audience glued to their seats foe 90 minutes. in short very enjoyable.",
         "The truth is that once you get into this movie, it really isn't bad. This film starts out as awful as can be, and if I wasn't watching it with someone else, I might have turned it off, but it does eventually get much better. In The Truth, three people who don't know each other are connected by things they've done in the past, and of course there is only one way to get them to admit what they've done. When you kidnap them, torture them, and stick a gun in their face's, people tend to become a bit more agreeable. This film is unique because of the varying degree of talent offered by this cast. John Heard is a tremendous guest star and a great secondary character, but as a lead he is ridiculously in over his head. Heard may have taken this role for the paycheck and it shows. The Killing's Brendan Sexton III, on the other hand, basically makes the movie with his outlandish behavior and his cheesy, but hysterical comments. The truth about The Truth, I wouldn't run out and buy it, but if I saw it again on TV, I wouldn't turn it off either. It's pretty well written, the acting isn't terrible, and it has it's moments.",
         "I rented this movie at a red box, or well block busters version of red box. I think this movie cost about 10,000 to make, they walk in to there house and really never leave. It is not what i would call a \"Bad\" movie, it just belongs on Saturday afternoon TV. It is kinda like panic room, but not. My only problem with this movie is that the whole time they sit and talk, then some one gets punched then they sit in talk. I get that with this rough economy you have to save money, but it seems like they are just putting out some real cheapo movies. I hate to sound so passive aggressive but thats why it got a a 5, its worth watching but not the best?",
         "Sigh. Yet again I am foxed by a fulsome critique by a previous reviewer. I started watching this hoping the reviewer was right only to be faced with an overweight John Heard in a soft porn entanglement with his 30 years younger 'wife' within two minutes of the opening credits. \"You have husbandly responsibilities to attend to\", she says, with the finesse of an 'actress' hired for the money shot. Background music of the sort that's dubbed over films of the XXX amateur genre caused me to wince immediately. I could almost hear \"Action\" being grunted as the clapper board snapped for probably the 10th time to herald woman riding man cowgirl styleee in half-hearted bondage. The only convincing part was the groaning. They were probably genuine groans of regret at having committed to such a project. I couldn't watch anymore, so skipped through stopping to see the same set over and over again with the addition of an intruder plus bondage, blood, bruises, guns, rape, and death. Dialogue of note was there none. Ho, hum. Perhaps my review is invalid. But I'd be surprised if any discerning film buff can get past the first scene.",
         "I am a big fan on independent movies. Although, The Truth never lets on to the fact that it isn't a \"big budget\" film. The movie is well scripted. There is also some star power in its line up of actors. The plot thickens heavily in the movie, as certain truths are tested. The director (Ryan Barton-Grimley) is obviously good at keeping secrets, and using them as triggers. Barton-Grimley allows the hidden truths to unravel so slightly, that you are holding your breathe for every baited answer. This movie was devilishly good. It was a thrill ride beginning to end. I would definitely recommend this film. Audiences will indisputably get some adrenaline from this heart pumping thriller."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["RBG Films"],
      "summaries": ["When a couple is taken hostage in their home by an intruder, a simple home invasion robbery turns into something much more complicated. The wife may, or may not, know the intruder; and the intruder may, or may not, have previously crossed paths with the husband. Can a couple survive once they have been exposed to each other for who (and for what) they really are? Is the intruder actually there just to rob them? What are they each trying to hide from him and from each other?"],
      "budget": 500000
   },
   "movielensId": 80233,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-05-20",
      "dvdReleaseDate": "2010-08-24",
      "directors": ["Ryan Barton-Grimley"],
      "runtime": 98,
      "movieId": 80233,
      "title": "The Truth",
      "mpaa": "",
      "actors": [
         "John Heard",
         "Brendan Sexton III",
         "Erin Cardillo",
         "Daniel Baldwin",
         "Erica Shaffer"
      ],
      "imdbMovieId": "1315419",
      "originalTitle": "The Truth",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "When a couple is taken hostage in their home by an intruder, a simple home invasion robbery turns into something much more complicated...",
      "tmdbMovieId": 39240,
      "avgRating": 1.91667,
      "releaseYear": "2010",
      "numRatings": 6,
      "posterPath": "/oRWnkJmzjtnPSwA0H21wt3cuh01.jpg"
   }
}