{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "adventure",
            "id": 4414
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0092269",
      "video": false,
      "title": "Young Again",
      "recommendations": [],
      "backdrop_path": "/r9UmjoNFWLtUpqJYWx4TBGyIr1z.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "zavierz9",
         "id": "50c12400760ee31a8c000020",
         "content": "One of the best TV movies ever made! Why Disney hasn't released it on US VHS and DVD is beyond me. I originally watched it on the Diney Channel when I was little just to see Robert Urich and came away with a major crush on Keanu Reeves! This movie has a lot of heart and soul. One of Reeves' best performances. Reeves and Wagner are sweet together and Robert Urich is at his best. The way in which the screenwriter and director went about Urich's character getting his wish was smart. This movie is not at all cheesy like a lot of TV movies. The only flaw in the film is that it is too short(85 min.), so you don't get much of Urich and Wagner together. However, Reeves'charisma saves the film and makes you want more of him than Urich. A great film for the whole family. A+",
         "url": "https://www.themoviedb.org/review/50c12400760ee31a8c000020"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael Riley",
               "gender": 2,
               "credit_id": "52fe4bc29251416c7510d0cd",
               "name": "Robert Urich",
               "profile_path": "/rWFlXQmgJ8vsQTjL8Qxyn7N9NZr.jpg",
               "id": 64119,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Laura Gordon",
               "gender": 1,
               "credit_id": "52fe4bc29251416c7510d0d1",
               "name": "Lindsay Wagner",
               "profile_path": "/n26onWq0lM5BusHY7KLRMOAnB1i.jpg",
               "id": 57905,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Michael Riley",
               "gender": 2,
               "credit_id": "52fe4bc29251416c7510d0d5",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tracy Gordon",
               "gender": 1,
               "credit_id": "52fe4bc29251416c7510d0d9",
               "name": "Jessica Steen",
               "profile_path": "/lZMvl7tJZPThfF7Lnui4wgEoOIf.jpg",
               "id": 42707,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The Angel",
               "gender": 2,
               "credit_id": "52fe4bc29251416c7510d0dd",
               "name": "Jack Gilford",
               "profile_path": "/mc8fpSHQ8Kds8MKwyHHJzrMz57I.jpg",
               "id": 64929,
               "order": 4
            }
         ],
         "crew": []
      },
      "genres": [],
      "popularity": 0.610205,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 148175,
      "vote_count": 3,
      "budget": 0,
      "overview": "Michael Riley whishes to be 17 again and which comes true. He goes back to the high school where he fell in love with Laura and still be in love with her. Mick is very happy and excited to be 17 again, he finds Laura who is a widow having 2 children and then realizes the reason why they broke up years ago. Laura makes Mick understand that there is no way to go back. Finally Mick is willing to face who he is and has a new start with Laura when he turns back to a middle age man.",
      "similar": [
         49519,
         158907,
         8967,
         5176,
         866,
         7345,
         587,
         73,
         274167,
         693,
         93456,
         298312,
         394117,
         195589,
         244772,
         225886,
         277216,
         7972,
         376659,
         433
      ],
      "original_title": "Young Again",
      "runtime": 120,
      "poster_path": "/p4ZW15twOPBgnMry2XrG0QNs5vQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1986-05-11",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Some wishes do come true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Hilliard Stern"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Barbara Hall",
         "David Steven Simon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092269/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzEzMzQzMDc0Nl5BMl5BanBnXkFtZTcwMTk5ODczMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Urich, Lindsay Wagner, Keanu Reeves | See full cast and crew »"],
      "reviews": [
         "Young Again is an excellent movie. I enjoy watching it as Keanu Reeves is very fresh [to the movies and to this film] and vibrant and gives a very credible performance. I am touched by the interactions between Keanu's character [Mike Riley] and Lindsay Wagner's character. When he finally gets her to realise it's really him [a 40 year old in a 17 year old's body] I feel that that scene is among one of Keanu's best performances and it's fantastic because it's so early on in his career.",
         "This film is what got Keanu Reeves noticed. He was 22 years old, but looked like he could pass for 17. Michael Riley(Robert Urich) is a man who seems to have it all, he's rich and successful. But there's one thing he does not have, his youth. On his 40th birthday, while on a bus. Michael sees a lot of teenagers on the bus having fun, and wishes he could be 17 again. A mysterious man(Jack Gilford) on the bus, grants him that wish. Michael is now a teenager again(Keanu Reeves) and begins to have fun, goes back to school, and becomes the star player of the basketball team. Michael begins dating Tracy Gordon(Jessica Steen) the daughter of his ex-girlfriend Laura Gordon(Lindsay Wagner). A good forerunner for the Big, the story lines are somewhat similar. A good family movie. Viewers started taking notice who Keanu Reeves was. Who had yet to through his Bill and Ted and Matrix faze.",
         "One of the best TV movies ever made! Why Disney hasn't released it on US VHS and DVD is beyond me. I originally watched it on the Diney Channel when I was little just to see Robert Urich and came away with a major crush on Keanu Reeves! This movie has a lot of heart and soul. One of Reeves' best performances. Reeves and Wagner are sweet together and Robert Urich is at his best. The way in which the screenwriter and director went about Urich's character getting his wish was smart. This movie is not at all cheesy like a lot of TV movies. The only flaw in the film is that it is too short(85 min.), so you don't get much of Urich and Wagner together. However, Reeves'charisma saves the film and makes you want more of him than Urich. A great film for the whole family. A+",
         "I loved this movie. It's one of my all time favorites. Keanu Reeves is great in it and shows the full range of emotions. The plot is very well thought-out and acted. Robert Urich is very handsome and believable as a man who isn't ready to turn 40. He makes a wish to be seventeen again while riding a city bus. The next morning he's seventeen again. This is one of those movies that makes you cry in some parts. It's a bittersweet story of love that comes along too late....or is it? The story teaches us that you can be young at any age, that it's not age that's the problem, it's our attitude. In our house, this movie is a classic. I hope they put it on DVD, I'd buy it in a minute.",
         "I watched this movie this year (2000) and I think it still seems funny and interesting! When Keanu appears at the first time in the movie on the bus it's so amazing! He can play so naturally! I liked when he was dancing in his bedroom. He was funny! I think it's a wonderful movie to be watched anytime.",
         "Robert Urich is Michael Riley, the world's oldest 40-year old man complete with greying hair, wrinkles, creeking bones, and a taste for opera over rock. That's not 40, that's 60, trust me I'm 40!!! He is granted a birthday wish to be young again by \"old man\" Jack Gilford (the only senior citizen in \"Cocoon\" who didn't want to be young again--good casting). Michael Riley turns into a silly grinning Keanu Reeves (of the \"Bill and Ted\" variety as opposed to the silly grinning Keanu Reeves of the \"Speed\" variety). 17-year-old Michael is able to pop into town, into a rooming house, and into high school, without documentation of his parents \"death,\" school records, or references. He immediately becomes a basketball star, a civics class whiz, art lover, and all around intellectual. We see nothing in either glimpse of his life that would suggest he would be a whiz at anything at any time of his life -- regardless of how many chances he'd have. Michael meets cheerleader Tracy Gordon (Jessica Steen) the image of her mother Laura Gordon at that age. Laura was Michael's high school sweetheart and he still hold a torch for her. Michael dates Tracy to get close to mom Laura, played by Lindsay Wagner. Lindsay Wagner is not a youthful 40 either, but that's okay, like fine wine Lindsay Wagner looks better and better with each year and she still looks hot enough to turn on any man of any age (in fact she even looks better now over ten years later in those car commercials). Michael makes the moves on Laura, but Laura see herself as a mother surrogate only. There's a lot of holes in the plot but it's the holes that cause fantasys to be just that. Without the holes it would be reality. The ending is resolved happily in wholesome style (this is a Disney film after all). The film might have been able to make a better point if 40-year old Laura would have fell in love with the young Michael (and it does touch on those feelings so quickly you'll miss them if you hick-up). Certainly they were meant for each other but the strains of age difference are never explored only labeled taboo. I think Laura would have preferred the studly Reeves over the creeking Urich and Michael never really wants to return to the old body (only whatever is needed to win Laura). Michael also preferred the sexy older mom over the bland airhead of a daughter cheerleader (who wouldn't?). A wrestling over the moral dilemma, town gossip, etc. could have been explored better. It would have been interesting seeing where that relationship could have went."
      ],
      "genres": [
         "Adventure",
         "Biography",
         "Drama",
         "Family",
         "Western"
      ],
      "productionCompanies": [
         "Sharmhill Productions",
         "Walt Disney Television"
      ],
      "summaries": ["Michael Riley whishes to be 17 again and which comes true. He goes back to the high school where he fell in love with Laura and still be in love with her. Mick is very happy and excited to be 17 again, he finds Laura who is a widow having 2 children and then realizes the reason why they broke up years ago. Laura makes Mick understand that there is no way to go back. Finally Mick is willing to face who he is and has a new start with Laura when he turns back to a middle age man."],
      "budget": 0
   },
   "movielensId": 80352,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-05-11",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 120,
      "movieId": 80352,
      "title": "Young Again",
      "mpaa": "PG",
      "actors": [
         "Robert Urich",
         "Lindsay Wagner",
         "Keanu Reeves",
         "Jessica Steen",
         "Jack Gilford"
      ],
      "imdbMovieId": "0092269",
      "originalTitle": "Young Again",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Michael Riley whishes to be 17 again and which comes true. He goes back to the high school where he fell in love with Laura and still be in love with her. Mick is very happy and excited to be 17 again, he finds Laura who is a widow having 2 children and then realizes the reason why they broke up years ago. Laura makes Mick understand that there is no way to go back. Finally Mick is willing to face who he is and has a new start with Laura when he turns back to a middle age man.",
      "tmdbMovieId": 148175,
      "avgRating": 2.375,
      "releaseYear": "1986",
      "numRatings": 4,
      "posterPath": "/p4ZW15twOPBgnMry2XrG0QNs5vQ.jpg"
   }
}