{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tv show",
            "id": 2571
         },
         {
            "name": "oakland athletics",
            "id": 170837
         },
         {
            "name": "photo album",
            "id": 170845
         },
         {
            "name": "show",
            "id": 170850
         },
         {
            "name": "child kidnapping",
            "id": 170865
         },
         {
            "name": "horror host",
            "id": 208012
         }
      ],
      "imdb_id": "tt0107247",
      "video": false,
      "title": "Jack the Bear",
      "recommendations": [
         59930,
         27984,
         53151,
         1363,
         118991,
         44546,
         76800,
         59820,
         139408,
         64509,
         70374,
         96010,
         15719,
         24050,
         48130,
         34615,
         25269,
         32091,
         18713,
         40876
      ],
      "backdrop_path": "/d4lB5CHKB59s0YbGh3JYP3g1pWm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Leary",
               "gender": 2,
               "credit_id": "52fe46d99251416c91061d0f",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Norman Strick",
               "gender": 2,
               "credit_id": "52fe46d99251416c91061d13",
               "name": "Gary Sinise",
               "profile_path": "/n5AbjoNfONICaggp2f1QhYAjAoZ.jpg",
               "id": 33,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Peggy Etinger",
               "gender": 1,
               "credit_id": "52fe46d99251416c91061d17",
               "name": "Julia Louis-Dreyfus",
               "profile_path": "/lK58eLbTUFReUyFD4ummcb3A0qS.jpg",
               "id": 15886,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Karen Morris",
               "gender": 1,
               "credit_id": "52fe46d99251416c91061d1b",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jack Leary",
               "gender": 0,
               "credit_id": "544d07eac3a36872d20024ab",
               "name": "Robert J. Steinmiller Jr.",
               "profile_path": null,
               "id": 76995,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dylan Leary",
               "gender": 2,
               "credit_id": "544d07f8c3a36872bc002547",
               "name": "Miko Hughes",
               "profile_path": "/hpteoojNUAomlQVbiL4eSjUeJ4K.jpg",
               "id": 8186,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Festinger",
               "gender": 2,
               "credit_id": "544d0809c3a36872b4002554",
               "name": "Art LaFleur",
               "profile_path": "/4rEvPSEtiOeYfqNzwZ6PnCCAP9F.jpg",
               "id": 44792,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Father-in-Law",
               "gender": 2,
               "credit_id": "544d0816c3a36872b400255a",
               "name": "Stefan Gierasch",
               "profile_path": "/y4w2yNJYdAcaKddQyCYm4qtmLqO.jpg",
               "id": 52463,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mother-in-Law",
               "gender": 1,
               "credit_id": "544d0825c3a36872b400255c",
               "name": "Erica Yohn",
               "profile_path": null,
               "id": 40349,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Elizabeth Leary",
               "gender": 1,
               "credit_id": "544d0834c3a36872bc002550",
               "name": "Andrea Marcovicci",
               "profile_path": "/si9sB6IcnL7C4WjZOZ0XLju4is2.jpg",
               "id": 18859,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mitchell",
               "gender": 2,
               "credit_id": "544d0845c3a36872bc002554",
               "name": "Bert Remsen",
               "profile_path": "/kLddDLz6g3vBaTnmPD0yzPj04Bo.jpg",
               "id": 30621,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d99251416c91061d0b",
               "name": "Marshall Herskovitz",
               "profile_path": "/lx7aETWxebJ28hALsM4vouFrmZB.jpg",
               "id": 9182,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54ec2b069251417961001046",
               "name": "Bruce Gilbert",
               "profile_path": null,
               "id": 14841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54ec2a2ac3a3686d56000ff3",
               "name": "Lilly Kilvert",
               "profile_path": "/c1OtwQAEToq4GSFIFY0WYHPkGr9.jpg",
               "id": 9199,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "54ec2aaec3a3686d660011f3",
               "name": "Mary Goldberg",
               "profile_path": null,
               "id": 23349,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "54ec2ad99251417968001061",
               "name": "Steven Rosenblum",
               "profile_path": null,
               "id": 2484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "544d07c90e0a2608cd00241f",
               "name": "Steven Zaillian",
               "profile_path": "/7fPmGcUA8I0l74UrVunepIFEjMa.jpg",
               "id": 2260,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "544d07d60e0a2608d40023b2",
               "name": "Dan McCall",
               "profile_path": null,
               "id": 1377839,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "54ec287dc3a3686d6d0010bd",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54ec288bc3a3686d56000fbe",
               "name": "Fred Murphy",
               "profile_path": "/oLzSw5wj6X3H5FYIQuXruf8TkaW.jpg",
               "id": 17765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "54ec2a7f92514112d8000dd0",
               "name": "Deborah Lynn Scott",
               "profile_path": "/lYYxq6AxOMYqc934V80ez9Cmfwj.jpg",
               "id": 8527,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "54ec2b5092514179740010f0",
               "name": "Ron Yerxa",
               "profile_path": null,
               "id": 17173,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54ec2cbd925141795f0010bf",
               "name": "Peter Burrell",
               "profile_path": null,
               "id": 578787,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "54ec2ce7c3a3686d58000fe1",
               "name": "Marion Tumen",
               "profile_path": null,
               "id": 1338840,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.244514,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38749,
      "vote_count": 16,
      "budget": 0,
      "overview": "Story of the relationships between two sons and their father, who moves the family to California and becomes a tv horror show host after the death of his wife.",
      "similar": [
         11374,
         11450,
         837,
         9310,
         9275,
         11959,
         11598,
         5465,
         10807,
         482004,
         383682,
         29725,
         11871,
         13917
      ],
      "original_title": "Jack the Bear",
      "runtime": 99,
      "poster_path": "/x6kE7lIUFHNsNv73pzb84Fp7py8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lucky Dog Productions Inc.",
            "id": 36392,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Filmworks",
            "id": 8310,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-04-02",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marshall Herskovitz"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Dan McCall",
         "Steven Zaillian"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107247/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1Mjk3MTQxOV5BMl5BanBnXkFtZTcwODkzMDcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny DeVito, Robert J. Steinmiller Jr., Miko Hughes | See full cast and crew »"],
      "reviews": [
         "Jack the Bear is a wonderful movie. It is the story of John Leary (Danny DeVito) and his two boys, Jack (Robert J. Steinmiller, Jr.) and Dylan (young Miko Hughes, known e.g. from his later accomplishment in 'Mercury Rising'). It is a story that takes a bittersweet look at the joys and pains of growing up. By doing so it elaborates on weighty issues, while at the same, it has a certain amount of humor to it. Yet despite the subtle comedian edge, this movie is by no means a comedy. It is a very emotional and instructive tale of one family's struggles, of challenges and tragedies. It features sincere messages of life and can be seen as a symbolic story that stands for the premise that growing up is never easy. Sometimes it is painful. Sometimes it is scaring. Then again, when the chips are low and the world seems to fall apart, there is hope. Hope you find within your family, hope \u0096 and the knowledge that there will be brighter days ahead. Danny DeVito plays Jack Leary, a widower who works as a monster-host of a late night horror show and who entertains the neighborhood kids with silly ghoulish antics. His twelve-year-old son Jack is the movie's main protagonist. He talks to the audience as if he would tell the story of his life \u0096 which he does to some extent. The entire developments are told through his eyes mainly. Thus the story is endowed with the childish naivety that makes it so special and so sincere. Dylan, Jack's little brother, is about four years old. The setting is Oakland, California, in 1972. The main theme that runs through the entire story is the theme of monsters. Jack Leary, the perfect monster in his TV show, is not the only one. Right at the beginning Jack says that he would find out that summer that real monsters existed. Then there is Jack's \"monster\" crush on the lovely girl at school (young Reece Witherspoon), which is a sub-theme of the plot. We share Jack's joy and his confusion after their first date, which is so funny as many will be able to identify with his tenseness prior to and his enthusiasm after their first kiss. The real monster is introduced as weird and apparently dangerous Norman Strick (Gary Sinise, who completes the quality of the cast), who turns out to be a deceitful and dangerous antagonist. The strongest emotional theme is that of family life. John's wife, Jack's and Dylan's mom died the previous winter in a road accident after some heavy arguments with her husband. This left a huge gap in the boys' lives and painful scars on Jack in particular. He occasionally seems to see her, and we get some flashbacks to their time together throughout the movie. This is very tough and intensifies the feeling of loss and loneliness. This theme is then even more so addressed when Dylan is kidnapped, which is presented in all its horror and pain for Jack and his dad. Very close to this is John's struggle to be a good father, to overcome his irresponsibility and live up the needs of his boys. All of these aspects mixed together make up the story's strength and provide substantially more than mere entertainment, but real issues of daily struggles and common problems. Seen from socio-cultural aspects, this movie is typically American in its entire setting and its developments. Following the emotionally stirring showdown with Norman Strick, Jack has an emotional breakdown and cries for his mother. When John tries to comfort him, Jack shouts: \"No, nothing is all right!\" Then John looks straight into his son's eyes and replies: \"Then we gonna make it all right.\" This is the embodiment of the American Dream, the American attitude never to give up and keep fighting, even if the chips are low and the times are hard and full of privation. The cast is outstanding, the acting is very convincing and the themes are brilliantly worked out. It is the struggle of a father to keep his kids; it is one boy's quest to find happiness; it is a typically American tale of courage and steadfastness, of values, trust and love. The movie captures pure messages of life, is exciting and displays tremendous wisdom, all woven together in the cultural stratum of 1972. And finally, it has genuine humor and provides first class entertainment for the entire family. You will enjoy Jack the Bear, and you have all reason to do so.",
         "'Jack the Bear' is drama set in the Seventies revolving around Leary family and their first summer since the loss of their wife and mother. John hosts a late-night horror show and, while he has an understanding of television, he struggles to be a proper father to his sons, thirteen-year-old Jack and four-year-old Dylan. Instead Jack is left to be a substitute parent to his young brother while not only going through adolescence but is also struggling with the recent loss of his mother. This film is a much darker version of the subjects brought up in 'My Girl' with the lead here being a boy instead of a girl. It was quite interesting to see a boy (instead of a girl who is usually cast in such movies) cope with the loss and guilt over his mother's death, shouldering the responsibility of caring for his little brother and alcoholic father and learning the lessons of his first love. One of the main themes of the film is coming-of-age, both for Jack and his father. John is relearning how to be a parent without his partner by his side and redefining his relationship with his boys. As for Jack, as a boy of thirteen, he is starting to see life through an adult's eyes as he lets go of childhood innocence. One of the harshest lessons of the adultworld he learns, is that not all monsters are ugly things who live in the closet and humans can be evil too when his younger brother kidnapped by a Nazi neighbour who harbours a grudge against his father and a young lad in his neighbourhood develops some Nazi traits when he turns to the wrong person for a role model. This films is really enjoyable, both with cute moments (Jack's little brother is adorable) and darker, angstier times. Definitely worth a look.",
         "The Leary family, John (Danny DeVito), Jack (Robert J. Steinmiller, Jr.) and Dylan (Miko Hughes), have moved from Syracuse, New York to Oakland, California in the early 1970s. John was a children's show host in Syracuse, but also has a love for horror films, and becomes a television horror film host in Oakland. On one level, the film is just a drama about the Leary's trying to settle into their new life. On another level, Jack The Bear is about confronting various kinds of monsters, from make-believe to human, as well as more abstract \"monsters\", including behaviors that are difficult to control and accidental tragedies such as deaths. I've seen Jack The Bear a few times now, and every time I see it I like it even better. The performances are fantastic, taking you on a roller coaster of emotions. But it almost requires multiple viewings to really \"get\" the film. At its heart is the growing presence and threat of the various \"monsters\" mentioned above. The various monsters are all woven together in very complex ways, and most of the developments later on in the film are about how those monsters can be conquered, but always at some price. Just as the threads are densely combined, so is the vanquishing of the monsters, and both the development of the monsters and the \"solutions\" to them are like various pieces of a large jigsaw puzzle, each piece necessary for the whole, and often affecting the whole in unexpected ways. The direction, script, editing, cinematography, and all of the technical aspects are impeccable. The score is also wonderful and not only enhances the setting, but underscores the dramatic developments if you listen to the lyrics closely. A 10 out of 10 from me. Don't miss this film.",
         "DeVeto gives the performance of his career in this lesser known film. A period piece set in the early 1970's, about a widower raising two young boys alone. His wife is killed in an auto accident shortly after storming out the house because she and Jack had an argument. He blames himself, and turns to alcohol. A touching and comic film that did not get the attention it deserves. This is a must see.",
         "I bet you like me have lots of movies you saw when you were younger, and you remember them being great. Then, years later you get to see these movies, and they aren't that great, you understand that you've grown and that your taste in movies has changed...still some of \"those\" movies remain \"classics\" to you. I have a few of those movies...when I saw that Jack The Bear was coming out on DVD, I ordered a copy right away. I hadn't seen this movie since 93-95. I remember it being very powerful, even got my older brother in tears. Although, I wasn't sure how I would find it now 10-11 years later. I must say, it's truly a very powerful drama. It's very very touching, never seen De Vito this good, the kids, Senise etc - Everyone/everything is great. It's a very heart-warming story, and it feels very \"real\". It's truly a \"classic\" movie, and I must say I even appreciate it more now that I've grown up (26 years old). Still - One of my favorite movies. www.sannelli.com",
         "I really was in spell of this movie. I was loving it. It was funny and heartwarming. Characters are believable but then the plot goes downhill. the plot becomes expected and keeps falling into clichés. Everything that you think that movie shouldn't do, it does. The whole thing really doesn't makes much sense and things just seem to happen to get the required emotions from the viewer. But even with these shortcomings in the plot, I have given it an average rating. Mostly due the interesting first half. It could have been really good if the movie had a better and more believable plot. In the end, how you perceive it will depend mostly on your own experience. Naive viewers will fall in love with it. More jaded and more astute viewers will be able to see behind the ruse. I however felt in between. I was able to see through the ruse, but I still wanted the movie to redeem itself somehow.",
         "Most people are surprised when they find out about this film. The only one to blame for this is the studio, because the trailer, synopsis and the poster don't do it justice. When it was released, most people probably thought it was a kids movie, so they skipped it. In fact this is a \"kid's movie for adults\" genre that had it's glory days from the second half of the 80ies (with the \"all boys\" Stand by Me) to the second half of the 90ies (with the \"all girls\" Now and Then). These movies (usually a grownup character's reminiscence of childhood days) are about kids, but their tribulations (although not always probable) are with the real world. This ain't no Goonies, but it isn't Dolores Claiborne either. These films were meant for us (the kids that grew up and now can laugh, with a certain nostalgic feel, about the adventurous moments of childhood). Here, Danny has a very interesting main supporting role as a caring and sacrificing (if flawed) father of two boys during the day, and a host of a macabre kids show during the night. As it's predecessors, this movie also does some things right and some things wrong. It has many good and serious elements, and yet it is really sweet all the way through. This sweetness is created by great direction that menages to capture a nostalgic vibe, especially through 60ies classic rock soundtrack, special camera lance shading (like we're watching something from the past) and a sense of actual neighborhood and family community (a street where Danny and the kids live). Just in the \"look\" department, this film mostly resembles the look of 1993's film \"Matinee\" with John Goodman. The past we see here may be real or yet, just a way we want to remember it, but it does feel real enough and that helps in our occasional suspension of disbelief for the plot. On the other hand, this film is occasionally very melodramatic, often predictable (way way too much obvious foreshadowing) and sometimes not sure what it is (a serious drama or adventurous film). They could say they were going with recreating the real \"life\" (which is often a comedy and a tragedy) feeling with that one. Kids do a great job (especially the kid brother) and actors do make a wonderful (again if melodramatic) sense of family unity against all odds. Long story short, this is a movie of \"Stand By Me\" kind and if you like the latter (or Danny) do watch this one. They are not kids movies, but they are not real dramas either. They are the past that we can identify with because we feel it could (or should) have been our own.",
         "Warning: Contains some spoilers Although essentially a \"coming of age\" drama, few coming of age films show the degree of anger experienced by the title character of this movie. Jack is an adolescent who, as the movie opens, has just moved to a new neighborhood after the death of his mother. During the next few months, he faces some harsh life realities, such as a new school, his decaying opinion of his father, the abduction of his little brother and his fear of a dangerous neighbor. Most of all he faces the loss of his mother and deals with it the only way he can: by crying. None of these themes are new in a coming of age movie, but the emotions Jack goes through seem multiplied by 100 when compared to similar films. When he feels guilt, I was shocked by its intensity. And when he feels angry, I felt uneasy at the degree of rage shown by a basically mild mannered pre-teen. The film is also not afraid to show its characters acting unpredictably. I came to care about them and was sometimes shocked by their behavior. But although disturbing, it was always realistic. All in all, I thought the film offered a bold example of how a family copes with big problems. I'd say that it's too intense for small children, but unfortunately adults may be put off by the story-line and the age of the main character. However, I'd recommend it to teens and adults who might have forgotten how rough adolescence can be.",
         "I do start off with a bias - I like Danny DeVito. Not in the much announced movies like Twins, but in those that really give hime elbow room - and those that have him behind the camera. Ruthless People, War of the Roses, Madeline. And that's what happens in Jack the Bear. It's a low-key film with warm camera work that isn't afraid of shots that linger on the actors, letting their expressions speak rather than filling the space with words. I didn't go out of my way to see this movie - caught it by accident when it was on cable, but it's the best thing I've seen during my Christmas break. The more dramatic moments may a bit unreal, the characters may not be developed as much as some would like - but overall, a little gem.",
         "I found \"Jack The Bear\" to be a touching, honest portrayal of how life's trying times effect us, bring us closer together, and teach us to carry on. I found the acting very good and the dialogue believable. Devito does a good job in delivering his character earnestly, and his comic genius is well employed through his character's job as a movie host. Gary Senise does his usual fine job and the young actors are all excellent. The flashbacks of the mother are done tastefully, and though a dark film, it is entertaining and enjoyable. The scenes of the neighborhood kids interacting are accurate and the dialogue very natural and real. The attitudes of that era are captured quite accurately as well. I recommend this film highly."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "American Filmworks",
         "Lucky Dog Productions Inc."
      ],
      "summaries": ["Danny De Vito is a professional clown, whose wife's death in a car accident has left him to care for his two young boys. Loving, but useless at the daily job of fathering, the onus falls on plucky Jack the Bear (Robert J. Steinmiller Jr.). De Vito's conscience, and a quantity of alcohol leads him to denounce a neo-fascist candidate on his children's TV programme - and also to the kidnapping of youngest son Dylan (Miko Hughes) by a disturbed neo-nazi supporter."],
      "budget": 0
   },
   "movielensId": 8043,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-04-02",
      "dvdReleaseDate": "2004-12-14",
      "directors": ["Marshall Herskovitz"],
      "runtime": 99,
      "movieId": 8043,
      "title": "Jack the Bear",
      "mpaa": "PG-13",
      "actors": [
         "Danny DeVito",
         "Gary Sinise",
         "Julia Louis-Dreyfus",
         "Reese Witherspoon",
         "Robert J. Steinmiller Jr.",
         "Miko Hughes",
         "Art LaFleur",
         "Stefan Gierasch",
         "Erica Yohn",
         "Andrea Marcovicci",
         "Bert Remsen"
      ],
      "imdbMovieId": "0107247",
      "originalTitle": "Jack the Bear",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "sAt46gyl1c8",
         "vH6p2cgDbck"
      ],
      "plotSummary": "Story of the relationships between two sons and their father, who moves the family to California and becomes a tv horror show host after the death of his wife.",
      "tmdbMovieId": 38749,
      "avgRating": 2.98851,
      "releaseYear": "1993",
      "numRatings": 87,
      "posterPath": "/x6kE7lIUFHNsNv73pzb84Fp7py8.jpg"
   }
}