{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt1008017",
      "video": false,
      "title": "Palermo Shooting",
      "recommendations": [],
      "backdrop_path": "/1n8Mvc9d8IMz26eQNLr4zaP0shm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Finn",
               "gender": 2,
               "credit_id": "52fe44c4c3a36847f80a9057",
               "name": "Campino",
               "profile_path": "/qMVYmvPL8Gsl2ef6I8TJEHWs2HW.jpg",
               "id": 146462,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe44c4c3a36847f80a904b",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe44c4c3a36847f80a904f",
               "name": "Milla Jovovich",
               "profile_path": "/mcNgLarIVho7LheWcvd1oQ2tBOg.jpg",
               "id": 63,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Flavia",
               "gender": 1,
               "credit_id": "52fe44c4c3a36847f80a9053",
               "name": "Giovanna Mezzogiorno",
               "profile_path": "/y7iDx9K45rC1p82rdXkgmzfS041.jpg",
               "id": 105685,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44c5c3a36847f80a905b",
               "name": "Lou Reed",
               "profile_path": "/lWFiXdQtYHqr2EXnk5nhDFm36XF.jpg",
               "id": 46392,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe44c5c3a36847f80a905f",
               "name": "Patti Smith",
               "profile_path": "/sHYdAAE8IKDQtZnjk9lwekysjlu.jpg",
               "id": 56200,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Karla",
               "gender": 1,
               "credit_id": "52fe44c5c3a36847f80a9063",
               "name": "Inga Busch",
               "profile_path": "/fawlryGRdjf8VfErjjCiU8bwZPF.jpg",
               "id": 6271,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Julian",
               "gender": 2,
               "credit_id": "541216550e0a26730a000039",
               "name": "Sebastian Blomberg",
               "profile_path": "/cmWWEr76Yavj6I1mxZvONbiDnal.jpg",
               "id": 6268,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Banker",
               "gender": 2,
               "credit_id": "54121663c3a3682f6b000033",
               "name": "Udo Samel",
               "profile_path": "/kHdK0LHJcZr2hSfKy1WewfZsZzR.jpg",
               "id": 6264,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "5aa239fec3a36829a800705e",
               "name": "Melika Foroutan",
               "profile_path": "/3ytXOVwLbx34H34hiT5aYvX1CgA.jpg",
               "id": 57064,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 1,
               "credit_id": "5aa23a0c9251414c5a006482",
               "name": "Jana Pallaske",
               "profile_path": "/rQypkheMCWLFVCz6jvljeqLP5Bv.jpg",
               "id": 20259,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 1,
               "credit_id": "5aa23a199251414c5d006a35",
               "name": "Anna Orso",
               "profile_path": "/3UdpJM9TIyJneMHCQtyNHAdnB1y.jpg",
               "id": 25784,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 0,
               "credit_id": "5aa23a470e0a262c74006cfc",
               "name": "Letizia Battaglia",
               "profile_path": null,
               "id": 1716965,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 2,
               "credit_id": "5aa23a639251414c63006a5f",
               "name": "Axel Sichrovsky",
               "profile_path": "/57WO7LIwrUUVIy7m7VxqWtbZzzK.jpg",
               "id": 1663826,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c4c3a36847f80a9047",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54d9434fc3a3687abe000538",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59f504bf9251414d6201d665",
               "name": "Franz Lustig",
               "profile_path": null,
               "id": 17848,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "59f5053fc3a3681fbb01da8f",
               "name": "Gian-Piero Ringel",
               "profile_path": "/3u3qKnozgS2NExI509Yx8FltQFS.jpg",
               "id": 40497,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59f50522c3a3681fdd01c1a1",
               "name": "Norman Ohler",
               "profile_path": null,
               "id": 1913577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59f5054c9251414d4d01d4be",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59f5055ec3a368201701c9f0",
               "name": "Peter Przygodda",
               "profile_path": null,
               "id": 2309,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59f5056ec3a3681fbb01dac4",
               "name": "Oli Weiss",
               "profile_path": null,
               "id": 32473,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59f5057fc3a3681fc901e1fb",
               "name": "Sebastian Soukup",
               "profile_path": null,
               "id": 20014,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59f5059ac3a368200101d566",
               "name": "Irmin Schmidt",
               "profile_path": null,
               "id": 43487,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59f511609251414d6201e939",
               "name": "Sabina Maglia",
               "profile_path": null,
               "id": 1614330,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59f5119a9251414d2001c6fb",
               "name": "Mirko Scheel",
               "profile_path": null,
               "id": 1913594,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.413839,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 8886,
      "vote_count": 16,
      "budget": 0,
      "overview": "After the wild lifestyle of a famous young German photographer almost gets him killed, he goes to Palermo, Sicily to take a break. Can the beautiful city and a beautiful local woman calm him down?",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Palermo Shooting",
      "runtime": 108,
      "poster_path": "/cyHGXb8H2cosR4jUPRhv07SfN9d.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rectangle Productions",
            "id": 2700,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Neue Road Movies",
            "id": 4503,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "P.O.R. Sicilia",
            "id": 4504,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Reverse Angle Production",
            "id": 4505,
            "origin_country": ""
         }
      ],
      "release_date": "2008-11-20",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wim Wenders"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Wim Wenders",
         "Norman Ohler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1008017/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwMTI1MDIxNV5BMl5BanBnXkFtZTcwNDQxMjQ2Mg@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Campino, Giovanna Mezzogiorno, Dennis Hopper | See full cast and crew »"],
      "reviews": [
         "Wenders' supreme quality as an author, to my view, is that he knows that his films are not so much about what images show, but about images themselves. This is his magic, and his curse. This is why i have a shelter in his films, and why so many increasingly misunderstand them (first reviews on this one show it will go to the same package). Wenders knows this, whenever he is making a film, he is reflecting on the nature of image, and how that affects vision, and how vision affects understanding, and how understanding affects meaning, and essence. Not few times, he addresses directly the theme, and embeds it in the plot of the film. This is such a case. Film about images. People who are about image. People who become the images they fetch. The very first scene makes it clear. It \"frames\" (how meaningful this word is with Wenders) a landscape, through a window of a building which is in itself all about framing. A pure volume full of square holes, all of them corresponding to a different frame, depending on moment you look, position, distance to the window. This building reflects the personality of the photographer, it is in itself a succession of frames, a closed capsule interlaced with partial views to the outside. Than we have a story about creating images. A character photographer who loses his soul because he becomes a faker, he forgets the essence, he no longer searches for a truth in the image, instead he creates his own fake truth. Fake Australian skies reflected on S.Paulo's windows, that kind of stuff. The introduction of Milla stands for this, as she is photographed 'artificially', and than transported to the \"true\" environment. Than the photographer retires, isolated, to a place he feels to be 'true' (a big port, Palermo means). Now the big things happen in Palermo. The woman. Her work is to recover images, it is to find the \"truth\" of images, it is to interpret the vision of somebody else. Those eyes of the painter, starring at the \"camera\", what he was seeing is what she wants to see. Check the oppositions, check how that fresco is worked on the film: detail versus global sight, understanding versus loosing the essence, long versus short. Check how the time of an image is understood. The woman takes years working on one image, the photographer produces thousands without understanding a single one. The Death. It's not the death, it's Dennis Hopper, and this matters. To see how Hopper was inserted in this project made the whole thing come clear to me, and it completed a portion of my film life that i now know was incomplete. Hopper is here the designated master framer, the man who observes life, who pulls strings (even though he is only doing his job). He is a superior agent, someone who is beyond and above all that we see. When people look at him, he looks back. He makes the record of all that, we see that, that metaphor of arrows, of \"shooting\" with a double meaning. So he is framed as much as he is a framer. Now, remember The American Friend. See that film before seeing this one if you can, it may strike you as 2 halves of the same idea, as it stroke me. Check how similar are the characters Hopper performs. There he was also the master framer, the manipulator behind the actions that we had. In fact he was manipulating a \"framer\" (literaly, a man who created frames for paintings). He used the framer as he provided the main \"image\". That film, which i consider essential, was all about the same game of images. Now we have an update, on how times changed (and with it changed deeply our relation to images) and how Wenders himself changed. Dennis Hopper is the connection, and his role is pivotal. Now, i believe that if you want to establish a successful relation to a creator you have to take his works for what they are. It's like loving beyond infatuation, like friendship beyond day to day chat. You have to enjoy the qualities and most important, acknowledge the flaws, and you have to live with that. That's my kind of relation with Wenders. His films in the last 10 years or so have become more and more on the verge of being an intellectual monologue, something you are supposed to sit and listen, and nod affirmatively with you head. That's something i won't tolerate with other filmmakers (Stone, Tarantino), but that i'm willing to put up with Wenders, because it matters to me what he has to say. If, like i did, you are able to put up with discursive dialogs, and the sensation that the man beyond the scenes is leading you to believe that he has the Truth, you may let this change your life. I did. A side quality you might appreciate is how music shapes the environment, regardless of the scenery. Wenders was also great in understanding this, now he does it with the aid of portable music. The music editing is great My opinion: 5/5 http://www.7eyes.wordpress.com",
         "I watched the film in Cannes with anticipation, and great 'trepidation' at the same time( given the director's previous flop) but came out nicely surprised, as did other people that I had the opportunity to exchange views with afterwards. There was an obvious feeling that Wenders has delivered us a very special film, and one that is predominantly visionary in every way. But of course, this is not the opinion of many, who have been for a while unforgiving of Wenders and are still waiting for the next \"Wings of Desire\"...well folks, that 'aint gonna happen' simply because Wenders is one of those rare directors that never looks back. Maybe someone would care to notice that \"Palermo Shooting\" is probably Wenders' most personal and cathartic work since \"Kings of The Road\", and that the portrayal of a slightly impassive well known photographer( just as in the mentioned classic), who has come to a crossroads in is life falls beyond just being a coincidence, or a gimmick, but it is deliberate and mirrors more often than not Wenders himself. In Palermo, we feel to our bones the confusion and loneliness that Campino( for whom Wenders wrote this script)experiences, through the powerful and beautifully composed shots and music that follow him as he comes to grip with Palermo and his own ghosts. Wenders presents us with incredibly varied and well chosen music and introduces the very 'of the moment' use of the ipod to deliver the tracks to coincide with the central character own moves. This concept on its own is not just a clever device but a subtle social comment, at which Wender's has always been good. It says an awful lot about modern man at the cutting edge enjoying a successful professional life, surrounded by every possible gadget which help him and control him at the same time. All the props that define Campino's character are desirable, from the 360 degree rotating camera to the beautiful classic car. So, even the way he wanders through Palermo's old streets make the film ultra modern, and breathtaking. Here Wenders is in top form in the composition of his scenes and juxtaposition of cultures and ideas.One of my favourite scenes in the film is when the photographer walks into a derelict old theatre following some screaming voices. After walking through the empty corridors he arrives at the source of the screams: a heated play is being rehearsed and a man appears to be shouting to a chair that he holds at face level. The lines being shouted are not subtitled for stronger effect, and Campino takes a sit on a back bench and just soaks in(as does the audience) the entire scene: the derelict theatre, semi open to the elements, the passionate play that he cannot understand and it is so alien to his controlled self and culture....unable to tare himself away he stays until he falls asleep. The entire film is full of subtle and poignant moments and the cohesive and straight story is blended to great effect with the surreal and supernatural. The use of special effect is unprecedented in Wenders' work and here he achieves a very different type of film with the help of these, permeating the psyche of his lead and pushing him into further confusion, to the point were he cannot tell the difference between dream and reality, and were the surreal takes centre stage as the film reaches it's climax. Which points at the sheer metaphor that life is. How often do we find ourselves in situations which seem surreal and that go beyond 'coincidence'? I for one could tell a few. The story of a self centred and successful man who, after having had a near death experience,goes through a live changing crisis is is indeed not new and has been tackled successfully before, BUT Wenders goes a step forward and in a original,and comic too, way makes his character and DEATH( played to perfection by a wise old Dennis Hopper)confront each other once more, keeping his lead, and us, always on the edges of reality, in a way that is reminiscent of \"Wings of Desire\" indeed. He also blatantly turns death into a 'good guy' who is there to advise as much as to scare...two concepts that are just a thread apart. Death makes the photographer question his intentions, even down to the presumptuous use of his camera. So, when the man says\" you shot me!\"( referring to a moment when Death shoots at him with a bow and arrow from a balcony in Palermo, where the photographer is taking pictures), Death answers:\" you shot me first! no one takes a picture of me!\" Death's speech to the mortal is as relevant here as that which Wenders gave us in \"Kings of the Road\" from a frustrated son to an ageing and regretful father inside the newspaper printing workshop. I won't deny that I would've liked the film to end not too long after this point, and that I felt that we didn't really need to know about the female character's own ghosts. It could've been a leaner picture with a neater ending without this. I 'd also mention that the beginning dragged a little as Campino's trendy life in Düsseldorf is presented to us a bit too long. These are a bit annoying but can be forgiven of Wim Wenders as, nevertheless he has given us a striking, original and beautiful film.and he proves himself a true visionary once more. In time, I'm sure this will become another one of his classics. With Palermo Wenders is, as usual, on the pulse of things, he has always been a very different type of storyteller who can say as much with a few words, than without, and here he achieves both beautifully. The fabulous and original use of music combined with astonishing cinematography and pace takes us on a remarkable 'voyage'. Thank you Mr. Wenders",
         "I can't add much to hpark5's fine comments (though I'd encourage him or her to make use of paragraph breaks) so I won't attempt a full review of Palermo Shooting. I will mention, however, that when I saw the film at the Berlin and Beyond Film Festival in San Francisco, it was received enthusiastically by an audience of over a thousand people in a packed theater. Wim Wenders was present and answered questions after the film. The things he said were exceptionally thoughtful and responsive. Although his work may be uneven because of his willingness to take risks, I thought Palermo Shooting a major success. Wender's integration of the death theme with Palermo's ancient and decaying physical environment was especially impressive. To me, the crucial moment of the film occurs when Finn, the photographer, asks Death what he can do for him. Death says that no one has asked him this before and that the only thing that he can do is to live well for the rest of his life.",
         "Finn, the successful photographer, is an artist of this medium. As the story begins, he is involved with several important projects. One that is close to his heart, is a shoot with a pregnant Milla Jovovich. As far as the work goes, he is not satisfied, and neither is the actress. He suggests a change of locales. While examining some portfolio, he decides to finish the work in Palermo, Sicily. Just before leaving, Finn has an unnerving experience. One night driving his convertible, listening to a loud soundtrack, he almost collides with another car driven by a mysterious figure, he does not quite get to see. Finn seems to be a man searching for more than what he now possesses. In spite of his fame he is not a fulfilled man. One day, Finn, who has climbed a tree that overlooks a placid meadow near the Rhine, meets another mysterious man dressed in a plastic raincoat who is tending to a flock of sheep. After the shoot with Milla Jovovich is over, Finn decides to stay in Palermom for a while. The end result of his work is excellent, although for the finished product showing a nude Milla, he could have done it in his home base in Germany. The city has an intriguing allure to Finn. While admiring the area of the Quattro Canti, he falls asleep by the side of one of the buildings he has been admiring. He is awakened by the mysterious hooded figure who is wielding a bow and arrow aiming at him. He feels wounded, but there is no sign of having been hit at all. Walking through the old streets of Palermo taking pictures with his camera, Finn discovers a museum. The door is open and he takes a chance going in. The only people in the place are two women that are restoring a giant painting from an obscure Sicilian artist. Flavia, who comes down to talk to Finn, tells him about the picture. In the center there is an animal-like figure that represents death. He is surprised to see a couple of clerics that appear to be dead stabbed by arrows. Through his walks in the city, Finn comes face to face with death symbols that, in a way, give him an uneasy feeling. Flavia shows a reluctance to getting involved with Finn, but he wants to continue seeing her. She takes him to the port giving him a chance to see the magnificent views of Palermo. Finn takes picture with his prized camera. While photographing an interesting angle, he discovers a figure aiming at him. Trying to avoid the arrow, Finn breaks the camera and falls in the water. As a surprise, Flavia decides to take Finn to her late grandmother's home in a hill town. The old house has a mystery about it that plays into the surreal antique setting. One night, Finn is awakened by a noise. He steps into the old library where he is chased by a man bathed in a white light that makes him appear as a ghost. Finn comes face to face with the man, who proclaims he is death. The ghost-like figure points out to Finn's brush with death. It all makes sense to him. Figuring he is about to die, he has yet, another surprise coming to him. Wim Wender's \"Palermo Shooting\" was shown recently on a cable channel. The film does not seem to have been commercially released in the United States, but seen in festivals. It is a shame because although the director is not aiming for a broad audience, it pays off for serious fans of his work. Mr. Wenders work in this film is almost a continuation of some of his past work, more to the point, \"Wings of Desire\". The film is dedicated to two influential masters in Mr. Wender's life, Michelangelo Antonioni and Igmar Bergman. One can see how \"Blowup\" might have impressed him. Campino, appearing as Finn, does an amazing job for the director. Dennis Hopper gets reunited with Mr. Wenders in a small, but pivotal role. The gorgeous Giovanna Mezzogiorno is perfect as Flavia. There are some familiar faces in the film doing cameos for the director, notably, Lou Reed and Milla Jovovich. The film owes a lot to the editing of two men, Oli Weiss and Peter Przygodda. The cinematography by Franz Lustig captures images that add the aura of mystery and suspense. The musical score by Irmin Schmidt blends well with the popular songs being played. Although most people thought this film to be flawed and pretentious, it will be enjoyed by fans of Wim Wenders.",
         "Like many films, I failed to catch the opening credits for \"Palermo Shooting\", and until the end I knew nothing about the creators. I was pretty surprised, both in a positive and negative way. The frame was just perfect, in the best possible way. Excellent shots, camera positions, strong and yet gently muted colors, beautiful scenery and filming locations... The visual aspect of the movie is pure art and eye candy. The story, well, in it's basis it's pretty intriguing. As a photographer, I could easily identify my self with the main character. Also, death has ever been a complex, a source of unanswered questions and mysticism and it's one of life's eternal dilemmas. So, it wasn't all that surprising that Wenders wrote and directed this film. He is a brilliant director. However, the acting ruined \"Palermo Shooting\", which could easily get close to perfection. The main actor, self-named \"Campino\" (what sort of a name is that...?) was anything but convincing. The same could be said for Inga Busch, and the final kiss of death was Dennis Hopper's performance. A story that was deep and complex in it's core, turned out to be a watery semi entertaining shot in the air. Why Wim, Why...? Overall, visually perfect, and as for the rest, forget it as soon as possible.",
         "I saw it yesterday at a late evening screening in Los Angeles with Wenders in-attendance, and he did an intro and stayed for a Q&A afterward (which ended at 1:30am!) I'd describe Palermo Shooting as an interesting failure, though with some good stuff in it. And not as a worst-ever film, or even as awful like some folks. Also interesting to me was how the naturalistic Wenders of \"Paris, Texas\" days has embraced modern CGI effects. Dennis Hopper, in his last role, was very good in a small but important supporting part in the very last scene of the film (don't walk out early or quit watching, cause you'd miss Hopper). It's kind of a 3 act play defining by its locations: Act 1. Dusseldorf, Act 2. Palermo, Act 3. Gangi. Not one of Wenders good ones. But if it had some editing-out of some of the more pretentious musing stuff, and general tightening-up, and a bit of clarification here and there, it could've been pretty good. Too bad... For a long and detailed plot summary, see the German Wikipedia page (worthwhile to do even putting up with Google Chrome's German-to-English translation.) It helped clarify a lot for me. de.wikipedia.org/wiki/Palermo_Shooting (Note: the English Wikipedia page was very minimal).",
         "Since I am a Berlin-based photographer and film enthusiast, Palermo Shooting was very appealing to me: Wim Wenders, a key figure of contemporary German cinema, shooting a story revolving a photographer learning to see anew? What could go wrong? Well, pretty much everything, I'm afraid. There are problems with Campino's delivery of the lines (insufficient acting or unbelievable dialog?), with a soundtrack that feels like an ipod on shuffle (and hey, I love Portishead as much as anyone), and with the general rush of scenes. The same filmmaker that twenty years ago made wonders directing with restraint (How to forget the cabin scenes of Paris Texas, for instance?) is nowadays lost in camera movements, cinematography effects, and 'dynamic' editing. However, the main problem of the movie lies on how its thesis actually contradicts the film itself. Here we have a photographer, Finn, who at the beginning of the movie believes that photography can just depict surfaces because that's the only thing there is to reality. The film, therefore, will follow him as he learns otherwise: that the things we cannot see shape our experiences and understandings. How ironic �and disappointing-, that he gets his final lesson from a guy painted in white who IS Death. And how disappointing, too, that when our hero overcomes his fear to Life by embracing Death, Wenders has to actually show us how they hug. There's no subtlety, no space for the images of the film to mean more than what they are; they feel clichéd and, sadly, superficial. Maybe Wenders should now look for his own Palermo and, instead of having characters delivering grandiloquent speeches about the unseen, show us what lurks under the visibility of things, because Palermo Shooting is shot with the same disregard for the revealing qualities of the photographic/cinematographic image, as Finn shots his fashion campaigns. Just surface.",
         "So let's sum up what this movie is about: a guy that \"has a failed life\"(it isn't really shown how his life is out of place they could at least made him a crack addict) that is not in touch with the world around him and goes to a small but charming(...not) Italian town and finds love, good food, old painting...and the meaning of life. So what can I say? Did I enjoy it? No. Will you enjoy it? Only if you have not seen more than 2 films in your life: one being The Princess Bride and the other being Space Jam. If so the film will strike you with it's dark images and \"themes\" and will leave you magnified by it's depth. Palermo Shooting was a real disaster for me so it's hard to chose where to start. The acting was pretty bad. Dennis Hopper was too lame in it. Let's not forget that this was the role that predated his performance in An American Carol so this is not exactly rock bottom. Mr. Campino (when I first heard his name I thought he was an Italian designer but now that I know that he is fronting a famous German rock band I know that he is really hip) reminds me of Macaulay Culkin in Home Alone but with cool tattoos and a nice camera. Milla Jovovich wanted to mix with THE art crowd so she decided to come and show her \"magnificent belly\". The others just are not worth mentioning. The story was cliché. It is a mix of The Seventh Seal, the Disney adaptation of A Christmas Carol and maybe something \"wiered\" like Eternal Sunshine... in the visuals(mostly the dream sequences). I watched it in a cinema and it was loud. When the film reached the point when the photographer meets the girl and she says she understands him I thought the movie will turn in to a Indiana Jones type of story and she will go on and tell him about the secret Palermo treasure guarded by the death. Such a shame it did not turn that way... The music is out of place and I must admit there are some hip tunes but they are not at all in tone with the movie.",
         "This is easily Wim Wender's most pretentious movie to date, and that's saying a lot given that Wenders is perhaps the most pretentious director of his generation. There is so much symbolic Mumbo-Jumbo I don't know where to begin: Dungeons. Coffins. Dead people. Ghosts. Including Lou Reed as a black-and-white specter of himself. Flocks of sheep. A shape-shifting city skyline. Hooded strangers, shooting arrows and causing crashes. All of which I have seen before, and with more panache: In \"Dark City\", in Cronenberg's \"Crash\", Paul Auster's \"Lulu on the Bridge\", Tom Tykwer's \"Winter Sleepers\", even in TV's \"Lost\". I'm not even mentioning \"The Devil's Advocate\". At the height of his self-importance, Wenders has Dennis Hopper, in the part of Death himself, make a speech about the merits of analog photography. Sounds ridiculous? Go figure. But the weakest link is Wender's choice of Campino as photographer Finn Gilbert, the lead character. Campino, a German rock star in his day job, may be photogenic in an aging toy boy way, but an actor he sure is not. Anything he says sounds like a line from a script, and the script is weak enough to begin with. Wenders asks too much of him, and too little of his co-lead Giovanna Mezzogiornio, a fine actress restricted to sleepy smiles and sullen glances in this movie. Charming guest appearances by Jana Pallaske as a feisty arts student, Inga Busch as a sexy swimming instructor in Ugg boots and a bathing suit, and by the divine Milla Jovovich as her glamorous self. Nice enough soundtrack, featuring Bonnie Prince Billy, Nick Cave, and The Velvet Underground. Watch with your eyes closed.",
         "Since I saw \"Der Himmel über Berlin\" approximately 3 years ago I've become a valid Vim Venders fan. After that day, I always thought, Wim Wenders had something original to say. Palermo Shooting hasn't changed my verdict, well... Almost. The Thing about Palermo Shooting that I guess, this movie tells the well known story with different methods. The methods that little bit um, shall we say cheesy? Of course, this doesn't mean that it's not a enjoyable movie. It's very \"warm\" movie after all. But despite all this \"warmness\", you think in somewhere, something/things is/are missing in this movie. Still, it's worth to watching."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Neue Road Movies",
         "P.O.R. Sicilia",
         "Arte France Cinéma"
      ],
      "summaries": ["After the wild life-style of a famous young German photographer almost gets him killed, he goes to Palermo, Sicily to take a break. Can the beautiful city and a beautiful local woman help him calm himself down?"],
      "budget": 0
   },
   "movielensId": 80430,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "2008-11-20",
      "dvdReleaseDate": null,
      "directors": ["Wim Wenders"],
      "runtime": 108,
      "movieId": 80430,
      "title": "Palermo Shooting",
      "mpaa": "",
      "actors": [
         "Dennis Hopper",
         "Milla Jovovich",
         "Giovanna Mezzogiorno",
         "Campino",
         "Lou Reed",
         "Patti Smith",
         "Inga Busch",
         "Sebastian Blomberg",
         "Udo Samel"
      ],
      "imdbMovieId": "1008017",
      "originalTitle": "Palermo Shooting",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After the wild lifestyle of a famous young German photographer almost gets him killed, he goes to Palermo, Sicily to take a break. Can the beautiful city and a beautiful local woman calm him down?",
      "tmdbMovieId": 8886,
      "avgRating": 3.2,
      "releaseYear": "2008",
      "numRatings": 15,
      "posterPath": "/cyHGXb8H2cosR4jUPRhv07SfN9d.jpg"
   }
}