{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stalker",
            "id": 6844
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "stalking",
            "id": 10333
         },
         {
            "name": "tv movie",
            "id": 156321
         }
      ],
      "imdb_id": "tt0078295",
      "video": false,
      "title": "Someone's Watching Me!",
      "recommendations": [
         42471,
         40350,
         57537,
         69526,
         44284,
         5434,
         182928,
         31018,
         83413,
         178535,
         162804,
         54116,
         96712,
         30640,
         42870,
         42344,
         83676,
         127985,
         279138,
         353085
      ],
      "backdrop_path": "/nNvY0ZASCq07E5hRsL2kuFmEwsB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Leigh Michaels",
               "gender": 1,
               "credit_id": "52fe447d9251416c91012851",
               "name": "Lauren Hutton",
               "profile_path": "/kYJFTG1On90T9eLJZ0pE56LC781.jpg",
               "id": 27964,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Paul Winkless",
               "gender": 2,
               "credit_id": "52fe447d9251416c91012855",
               "name": "David Birney",
               "profile_path": "/h1BDocq44qfQstJVhlgfI4dWebj.jpg",
               "id": 20913,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe447d9251416c91012859",
               "name": "Adrienne Barbeau",
               "profile_path": "/vKZpJlrGLK4qFTTnWFa6LMH2FMc.jpg",
               "id": 11782,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Burly Man",
               "gender": 2,
               "credit_id": "52fe447d9251416c9101285d",
               "name": "Len Lesser",
               "profile_path": "/h6mL9dHhYa4sHppv4GRJIkUTqwe.jpg",
               "id": 78087,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gary Hunt",
               "gender": 2,
               "credit_id": "52fe447d9251416c91012861",
               "name": "Charles Cyphers",
               "profile_path": "/pglMfoHMVEcziDlnl33DrZjRSM3.jpg",
               "id": 11786,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Frimsin",
               "gender": 2,
               "credit_id": "52fe447d9251416c91012865",
               "name": "John Mahon",
               "profile_path": "/tkBnAn8PA3gSOj3bSH8zquD7P04.jpg",
               "id": 43978,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Steve",
               "gender": 2,
               "credit_id": "54b26cc0c3a36809510040ff",
               "name": "Grainger Hines",
               "profile_path": "/8eKbbE6CCtPS5NcIRQ7evoORr22.jpg",
               "id": 169839,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Leone",
               "gender": 2,
               "credit_id": "54b26ccfc3a3682346001a36",
               "name": "James Murtaugh",
               "profile_path": "/ljcmntlZigoxr3fR7MdbWc8H1qP.jpg",
               "id": 101781,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Police Inspector",
               "gender": 2,
               "credit_id": "54b26cdf92514174720041a8",
               "name": "J. Jay Saunders",
               "profile_path": "/s5uvUSSUH8gYK76TGUR4zatysrQ.jpg",
               "id": 152727,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "TV Announcer",
               "gender": 0,
               "credit_id": "54b26cf0c3a3680951004108",
               "name": "Michael Laurence",
               "profile_path": "/lAy0KqghmzLwpIkYbP65rAKIfH0.jpg",
               "id": 1299570,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Herbert Stiles",
               "gender": 2,
               "credit_id": "54b26cfe925141144f00164a",
               "name": "George Skaff",
               "profile_path": null,
               "id": 114509,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "54b26d0c925141746c003cda",
               "name": "Robert Phalen",
               "profile_path": null,
               "id": 15515,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Groves",
               "gender": 0,
               "credit_id": "54b26d1a925141746c003ce1",
               "name": "Robert Snively",
               "profile_path": null,
               "id": 1412166,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Waitress",
               "gender": 0,
               "credit_id": "54b26d26c3a368094e0045ac",
               "name": "Jean Le Bouvier",
               "profile_path": null,
               "id": 1019060,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Slick Man",
               "gender": 0,
               "credit_id": "54b26d379251416fe1003530",
               "name": "James McAlpine",
               "profile_path": null,
               "id": 1412167,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "54b26d44c3a36823130016f7",
               "name": "Edgar Justice",
               "profile_path": null,
               "id": 1412168,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "54b26d529251416fe1003534",
               "name": "John J. Fox",
               "profile_path": null,
               "id": 109947,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c91012847",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c9101284d",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54b26d64c3a3680940004374",
               "name": "Anna Cottle",
               "profile_path": null,
               "id": 1258116,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "54b26d70c3a36823130016fe",
               "name": "Richard Kobritz",
               "profile_path": null,
               "id": 63905,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54b26d7f9251412ae7003590",
               "name": "Harry Sukman",
               "profile_path": null,
               "id": 29330,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "54b26d8bc3a36820a70010bc",
               "name": "Robert B. Hauser",
               "profile_path": null,
               "id": 41411,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54b26d969251417479003d3d",
               "name": "Jerry Taylor",
               "profile_path": null,
               "id": 1412169,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54b26da3c3a36820a70010c1",
               "name": "Philip Barber",
               "profile_path": null,
               "id": 148824,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54b26db592514114a20018fd",
               "name": "Donald J. Sullivan",
               "profile_path": null,
               "id": 1412170,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.324006,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31428,
      "vote_count": 27,
      "budget": 0,
      "overview": "A woman is being watched in her apartment by a stranger, who also calls and torments her. A cat-and-mouse game begins.",
      "similar": [
         353979,
         10585,
         1949,
         2832,
         948,
         336843,
         8834,
         371608,
         4638,
         949,
         10285,
         189,
         181283,
         9272,
         21484,
         4232,
         13811,
         186,
         1018,
         1586
      ],
      "original_title": "Someone's Watching Me!",
      "runtime": 97,
      "poster_path": "/vTkbuc3uRXCfprVHjJ3PIthVsTz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nmcNfPq03WLtOyufJzQbiPu2Enc.png",
         "name": "Warner Bros. Television",
         "id": 1957,
         "origin_country": "US"
      }],
      "release_date": "1978-11-27",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Carpenter"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["John Carpenter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078295/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3NTE2MTYxMzleQTJeQWpwZ15BbWU4MDM5NDI5MDMx._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Lauren Hutton, David Birney, Adrienne Barbeau | See full cast and crew »"],
      "reviews": [
         "I couldn't believe my luck when I stumbled on to this movie at a local video store in Iceland. It had subtitles and everything. What a find! As many of you know, this is the \"lost\" John Carpenter movie, and it's nothing short of fantastic. It plays like an homage to the likes of Dario Argento and Alfred Hitchcock, although the Hitchcock influences are more apparent here. Lauren Hutton moves into a fancy apartment building and starts receiving mysterious phone calls and presents. And we, as the audience, know that this stalker lives in the building across from hers and that he's watching her every move. Although not much actually happens here, the film's gradual buildup to a terrifying finale is nothing short of brilliant, orchestrated by a very fresh John Carpenter at the height of his creativity. The cinematography (especially the POV's) makes one think of Dario Argento but the atmosphere (and storyline) reeks of Hitchcock. John Carpenter has admitted to the fact of having been inspired by both. I strongly recommend this film. If you can locate it, that is.",
         "A woman moves into a high rise building with a history of suicides and finds herself being harassed by an unseen psycho, who cleverly manages to remain distant enough to keep from being captured by police. Not much time is spent developing characters or story lines, this one simply works on the viewers' emotions, and succeeds where so many suspense films fail. The suspense starts building slowly and grows to a sweat-inducing rate by the climax. Very rarely does a television film capture its audience so calculatedly, and with such determination, as this one does. A lost and forgotten John Carpenter film released in 1978 to television audiences, but never officially released on video in the U.S. Well worth the time to uncover. *** out of ****",
         "John Carpenter's SOMEONE'S WATCHING ME! is an undisguised homage to REAR WINDOW, with nods to BLACK CHRISTMAS (an avowed favourite of Carpenter's) and the Italian Giallo genre, specifically Argento's DEEP RED. One elaborate scene, wherein the anxious heroine drops a knife through a grate, and then squeezes laboriously into the crawlspace beneath to hide, is a clear riff on giallo scenography. The material is stale, but the execution is not. Carpenter's virtuoso use of gliding camera shots, shadow detail, composition, and mise en scene, ratchets up the suspense even during what would otherwise be incidental scenes in another director's hands. On occasion, TV-movie limpness creeps in momentarily, but, in the main, the picture's production is very professionally handled. One major irritant is Lauren Hutton's protagonist, Leigh. She is endlessly spunky, constantly talking to herself, always rushing headlong into situations. It's grating right from the start, but as events unfold, her happy-go-lucky ebullience morphs (in the viewers' eyes) into a kind of blithe stupidity. Most thinking people would have closed their curtains, locked their doors, taken the prank calls more seriously, or perhaps moved away (pride be damned), much sooner than did she. Certainly most people wouldn't have walked knowingly into the stalker's trap, as Leigh does at the very end. \"Someone's Watching Me\" is nerve-wracking enough for one to suspend one's incredulity, and good enough to belong in, or just below, the rarefied sphere of Carpenter's two best, HALLOWEEN and THE THING.",
         "An early TV movie by director John Carpenter about Lauren Hutton who's being stalked in her apartment, you know the sort of thing. This is pretty good actually and it still plays well today. Definately one of my favorites, Halloween was made shortly after, I think.",
         "This is often referred to as \"the lost Carpenter film\", and many of you have probably not even heard of this film. Well now that it have finally been released to DVD, I advice all of you that are either John Carpenter or thriller fans to go out and by or rent this immediately. This is a high quality thriller that is packed with Carpenter great ability to create chills and paranoia. This movie may be ahead of it's time as I've noticed these kinda movies got very popular during the 90's. If you like this you'll probably like movies as \"Phonebooth\" and such. This is definitely the best thriller of the 70's and has a noticeable Alfred Hitchcock feel to it. I must admit this is far from John Carpenters best movie, but it is far from bad. This was movie the movie he directed right before his biggest success film of all time \"Halloween\", and if I'm not wrong it was because of this film, that he was chosen specifically to direct it. I give this film a 9/10.",
         "I've heard some really good things about this film, so it didn't surprise me that it didn't quite live up to expectations. Someone's Watching Me is an early TV movie from so-so director John Carpenter and it was released in the same year that his biggest hit - slasher flick Halloween - was released, so I'm guessing that a lot of the praise for this film comes from John Carpenter fans. This would appear to be Carpenter's attempt at a Brian De Palma-style Hitchcock tribute, and the main influence here is obviously Hitchcock's masterpiece, 'Rear Window'. Naturally, the film has nothing on Hitchcock and could really be described as a poor man's impression of the classic film; but thankfully, Carpenter doesn't just copy and the result is an interesting take on an already well done theme. The plot focuses on a female TV director who finds herself being watched through a telescope by a man in the block across from her. Not content to just watch, the man also terrifies her by calling her up. She tells the cops, but as usual there's nothing they can do - so she takes to investigating herself, along with her new found boyfriend and a lesbian who works at the same TV station. I have to say that I'm not the biggest fan of John Carpenter's body of work; but this film actually represents one of his biggest successes. The film works thanks to the way that the writer/director manages to keep things at least mostly interesting throughout, and while the film doesn't boast too many real biting sequences, it at least never stagnates to the point of tedium. The Rear Window influence is felt throughout, and one pivotal sequence is pretty much lifted from the earlier film. However, most of the movie is original, and so I wouldn't go as far as to call this a complete rip off. The film was made for television in the seventies, but all this really means is that there's a lack of bloodshed (which the story doesn't really need anyway) as the production values and acting are decent enough for this sort of film. I have to say that I'd have liked this film more if Carpenter could have worked a bit more mystery into the proceedings, as the identity of the tormentor is never really important, and that's a shame as it could have added an extra element of interest if the director was willing to go a little further. Still, the film ends well (if a little abruptly), and since it runs smoothly throughout, I have to give a thumbs up.",
         "The TV director Leigh Michaels (Lauren Hutton) moves from New York to the fancy apartment building Arkham Tower in Los Angeles to forget a relationship. She is hired by a local television and befriends the lesbian assistant Sophie (Adrienne Barbeau). Then she dates the philosophy professor Paul Winkless (David Birney) and starts a relationship with him. Leigh is a woman that likes to joke and out of the blue she receives gifts and strange phone calls. Soon she realizes that a stranger is stalking her driving her mad with phone calls, gifts and letters. Leigh and Paul decide to go to the police but the police inspector tells that he cannot do anything to help her. Leigh decides to investigate the opposite tower block, she witness the stranger killing Sophie. She calls the police but no one but Paul believes her. What can she do? \"Someone's Watching Me!\" is one of the first movies by John Carpenter and homage to Alfred Hitchcock's \"Rear Windown\". Despite the low budget since it is made for television, the story holds the attention of the viewer until the last scene. The cat-and-mouse game between the stalker and Leigh is tense and full of suspense with great performance of Lauren Hutton. My vote is seven. Title (Brazil): \"Alguém Me Vigia\" (\"Someone's Watching Me\")",
         "John Carpenter's first tv movie, Someone's Watching Me! is perhaps the best tv horror movie this side of The Night Stalker. Made, I believe, right after Halloween, it's obviously inspired by that movie, but also stands up on its own. All of Carpenter's trademarks are present, from a strong female lead to some beautifully orchestrated scares. It's interesting to see his visual style, usually full cinemascope, applied to a tv screen. Despite the cheesy title and tv pedigree, I'd rate Someone's Watching Me! up there with the best of Carpenter's early work. As of this writing, I don't think it's on tape. Why the hell not?",
         "I never expected that a TV movie like this early work from John \"Thrillmaster\" Carpenter could be thrilling and excellent as this one was made. Thanks Mr Carpenter. Excellent entertainment and terrific conclusion.",
         "While feature films became a staple of 1970s TV - think \"Brian's Song\" and \"Sybil\" - few were like John Carpenter's \"Someone's Watching Me!\". The story is quite familiar: a woman (Lauren Hutton) moves into an apartment, starts getting strange phone calls, and eventually realizes that there's a peeping tom in the vicinity. As this is a TV movie, there are unfortunately some things that we don't get to see (namely Lauren Hutton naked), and the spots where they obviously had commercial breaks gives the movie a slight feeling of silliness. But the really neat factor springs from the clear homage to other kinds of horror flicks: the voyeurism scenes look like a \"Psycho\" reference. As for the cast, Lauren Hutton easily looks vulnerable enough, but I can't figure out why the characters in these movies take threatening phone calls in stride; I would have immediately suspected that something was amiss. You can see Adrienne Barbeau getting primed for the other kinds of between-A-and-B-movies in which she would later star. So, it's mostly your average suspense movie, but certainly one that you'll enjoy. And just be suspicious the next time that your lights start flickering."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Warner Bros. Television"],
      "summaries": [
         "A woman is slowly stalked to the brink of madness by a man watching her from the opposite tower block. Her attempts to get the police to take her seriously leave her with no option but to track him down herself.",
         "The TV director Leigh Michaels moves from New York to the fancy apartment building Arkham Tower in Los Angeles to forget a relationship. She is hired by a local television and befriends the lesbian assistant Sophie. Then she dates the philosophy professor Paul Winkless and starts a relationship with him. Leigh is a woman that likes to joke and out of the blue she receives gifts and strange phone calls. Soon she realizes that a stranger is stalking her driving her mad with phone calls, gifts and letters. Leigh and Paul decide to go to the police but the police inspector tells that he cannot do anything to help her. Leigh decides to investigate the opposite tower block, she witness the stranger killing Sophie. She calls the police but no one but Paul believes her. What can she do?",
         "A woman is being watched in her apartment by a stranger, who also calls and torments her. A cat-and-mouse game begins."
      ],
      "budget": 0
   },
   "movielensId": 80447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-11-27",
      "dvdReleaseDate": "2007-09-25",
      "directors": ["John Carpenter"],
      "runtime": 97,
      "movieId": 80447,
      "title": "Someone's Watching Me!",
      "mpaa": "",
      "actors": [
         "Lauren Hutton",
         "David Birney",
         "Adrienne Barbeau",
         "Len Lesser",
         "Charles Cyphers",
         "John Mahon",
         "Grainger Hines",
         "James Murtaugh",
         "J. Jay Saunders",
         "Michael Laurence",
         "George Skaff",
         "Robert Phalen",
         "Robert Snively",
         "Jean Le Bouvier",
         "James McAlpine",
         "Edgar Justice",
         "John J. Fox"
      ],
      "imdbMovieId": "0078295",
      "originalTitle": "Someone's Watching Me!",
      "genres": [
         "Horror",
         "Mystery",
         "TV Movie",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Ys-TjlXLZEg"],
      "plotSummary": "A woman is being watched in her apartment by a stranger, who also calls and torments her. A cat-and-mouse game begins.",
      "tmdbMovieId": 31428,
      "avgRating": 3.18421,
      "releaseYear": "1978",
      "numRatings": 19,
      "posterPath": "/vTkbuc3uRXCfprVHjJ3PIthVsTz.jpg"
   }
}