{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bureaucracy",
            "id": 211
         },
         {
            "name": "court",
            "id": 6148
         },
         {
            "name": "law and order",
            "id": 163104
         }
      ],
      "imdb_id": "tt0070258",
      "video": false,
      "title": "Juvenile Court",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b4bc3a36847f81fca8f",
               "name": "Frederick Wiseman",
               "profile_path": "/uYlxuYtXn27b4CYLII2K8KyqwUc.jpg",
               "id": 138006,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59b8e426c3a36813d300e420",
               "name": "Frederick Wiseman",
               "profile_path": "/uYlxuYtXn27b4CYLII2K8KyqwUc.jpg",
               "id": 138006,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59b8e42f9251417e5d00dbb8",
               "name": "Frederick Wiseman",
               "profile_path": "/uYlxuYtXn27b4CYLII2K8KyqwUc.jpg",
               "id": 138006,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59b8e43ec3a36813bc00e65b",
               "name": "William Brayne",
               "profile_path": null,
               "id": 151983,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.161672,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 114395,
      "vote_count": 2,
      "budget": 0,
      "overview": "JUVENILE COURT shows the complex variety of cases before the Memphis Juvenile Court: foster home placement, drug abuse, armed robbery, child abuse, and sexual offenses. The sequences illustrate such issues as community protection vs. the desire for rehabilitation, the range and the limits of the choices available to the court, the psychology of the offender, and the constitutional and procedural questions involved in administering a juvenile court.",
      "similar": [
         389,
         1645,
         1592,
         819,
         9800,
         595,
         881,
         8055,
         388,
         5559,
         68,
         314365,
         390043,
         336843,
         396371,
         7453,
         392982,
         9623,
         548,
         205601
      ],
      "original_title": "Juvenile Court",
      "runtime": 144,
      "poster_path": "/hGDh3hMREs6b22KPVrZ8ctZ1Z23.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1973-06-04",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Frederick Wiseman"],
      "runtime": 144,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070258/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "I've been writing about a number of Frederick Wiseman films here on the IMDb. The issue of ethics in Documentary films fascinates me, and Wiseman's films are perfector a discussion of that type. In my entry on \"Basic Training\", I discussed what role the audience plays in judging a films ethical standpoint. I continue that discussion here. In \"Juvenile Court\" there is a scene in which a psychologist questions a 15-year-old boy who has been accused of molesting a small girl he was baby-sitting. We later meet the mother of the girl who seems nervous and sexually obsessed. We see the boy agree to take a lie detector. Then we see some attorneys, some counselors, and the judge in the case discuss whether or not the mother might have fabricated the charges. That is the last we see of that case. As Thomas R. Atkins wrote in a 1974 article in \"Sight and Sound\": \"The characters have spoken for themselves, and each viewer can have his own reaction, make his own judgment according to his particular prejudices and values. The implications of the legal issues and human attitudes extend far beyond the innocence or guilt of this specific defendant, raising tough questions about the system of juvenile justice as well as the condition of society in general.\" But some could argue that the goal of documentary is to present the facts and not to make ambiguous statements about the issues. Then again, it could be said that documentary films are not the same as news programs, and should be about representing the ambiguities of life, and as Atkins suggests, to use the events in the film to focus on broader issues.",
         "Okay. It takes a village to raise a child. Frederick Wiseman takes that point in kind and answers with, \"And what if the village has its own problems?\" This is not surprising. Wiseman's interest in institutional order always has its disturbing undertones in his documentaries like Titticut Follies and High School, but what I like about this one is that the juvenile court workers all try hard, all try to listen, and all try to help the best they can, and that does not change the fact that for a lot of these kids justice is blind and nobody can really know what to do. In some cases the kids can't help but be talked down to as they bitterly cover the same arguments over and over again, and in others have to be defended against paranoid adults projecting their own traumas and dysfunction onto the kid. The judge tries to get as much information as he can while dealing with case after case after case (and looking more wearied as the movie advances), the social worker tries to be as positive as she can in the light of real pain, and the psychiatrist doesn't know what to make of any of it. Wiseman's right, sounds like the world to me. Of course, documentary wouldn't be interesting if all the positive and working things were represented, so in some ways this movie could be a little more bleak than the actual court. I think in all fairness to Wiseman, he chose a spectacular and hard-working crew of juvenile court workers where choosing more corrupt and disturbing ones would have made his job easier. That doesn't mean you'll always agree with the judgments handed down on these cases. In many cases, the result is infuriating and scary. However, as a big question mark over just how much a village is even capable of raising its children, this movie is a poignant documentary. --PolarisDiB",
         "I saw this film along with a visit by FW to my university in the late 1970s - and haven't seen it since. I saw \"Aspen\" in the 90's and liked it, well enough but less. It's hard to find FW's work on DVD. I looked him up today because New Yorker's David Denby has reviewed a new film about the Idaho State Legislature which IMDb doesn't seem to be aware of. I think Mr. Yates 2002 comment about Juvenile Court as a test of \"ethics\" is well-taken, but don't think the point is for omniscient viewers to draw moral judgments about participants in the documentary - as if they could do better. The most compelling thing about FW's films is the ability to bring out a genuine, even decent, humanity in the people working within institutional constraints. The main pattern of interaction in the film is between apparently well-meaning authorities in their jobs, who see and apparently sincerely try to help the juvenile offenders for the 15 minutes or hour-or-two the job mandates - but then clinically or even surgically sever the relationship. The main realization is that such a setup can't possibly work. My impression was that instead of a series of discontinuous ceremonial office visits, each of the kids needed to be taken home and raised by one of the decent people who interviewed them."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Zipporah Films"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 80467,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-06-04",
      "dvdReleaseDate": null,
      "directors": ["Frederick Wiseman"],
      "runtime": 144,
      "movieId": 80467,
      "title": "Juvenile Court",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0070258",
      "originalTitle": "Juvenile Court",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "JUVENILE COURT shows the complex variety of cases before the Memphis Juvenile Court: foster home placement, drug abuse, armed robbery, child abuse, and sexual offenses. The sequences illustrate such issues as community protection vs. the desire for rehabilitation, the range and the limits of the choices available to the court, the psychology of the offender, and the constitutional and procedural questions involved in administering a juvenile court.",
      "tmdbMovieId": 114395,
      "avgRating": 4.4,
      "releaseYear": "1973",
      "numRatings": 5,
      "posterPath": "/hGDh3hMREs6b22KPVrZ8ctZ1Z23.jpg"
   }
}