{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0098533",
      "video": false,
      "title": "Tumbledown",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Lawrence",
               "gender": 2,
               "credit_id": "52fe4a5bc3a368484e14ec41",
               "name": "Colin Firth",
               "profile_path": "/lKUq407IhFF6CQoJbUgbEyfS9JA.jpg",
               "id": 5472,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "588ebe2ec3a36860af000336",
               "name": "Paul Rhys",
               "profile_path": "/yDTa82q4hIL9bSlHZa15iafkuzE.jpg",
               "id": 80365,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hugh MacKessac",
               "gender": 2,
               "credit_id": "588ebe399251410198000364",
               "name": "Paul Rhys",
               "profile_path": "/yDTa82q4hIL9bSlHZa15iafkuzE.jpg",
               "id": 80365,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "John Lawrence",
               "gender": 2,
               "credit_id": "588ebe44925141019d000390",
               "name": "David Calder",
               "profile_path": "/ixaxa85cJRQuyVihWjr27Dyh9Bf.jpg",
               "id": 10779,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jean Lawrence",
               "gender": 1,
               "credit_id": "588ebe55c3a36860ac0003a2",
               "name": "Barbara Leigh-Hunt",
               "profile_path": null,
               "id": 8228,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Louise Stubbs",
               "gender": 1,
               "credit_id": "588ebe6292514101a30003ab",
               "name": "Sophie Thompson",
               "profile_path": "/39q6651Z7Ux8xrmRDhbXyOXGRom.jpg",
               "id": 32990,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Prothero",
               "gender": 2,
               "credit_id": "588ebe6e925141019a000386",
               "name": "Dan Hildebrand",
               "profile_path": "/cuWu8hSOVv7K7icqkXZGQeJPSg6.jpg",
               "id": 117192,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lumpy",
               "gender": 2,
               "credit_id": "588ebe7b925141019d0003af",
               "name": "Mark Williams",
               "profile_path": "/mDcipTHC41LIHMx0UJxpF6YOQGw.jpg",
               "id": 20999,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Saltemarsh",
               "gender": 2,
               "credit_id": "588ebe90c3a36860ac0003c1",
               "name": "Paul Higgins",
               "profile_path": "/tQfmzAHy7vc7wEZsS3XKyNrX0p0.jpg",
               "id": 71084,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Lt. Colonel Bill Kirke",
               "gender": 0,
               "credit_id": "588ebea69251410198000394",
               "name": "Timothy Carlton",
               "profile_path": null,
               "id": 96182,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Terry Knapp",
               "gender": 2,
               "credit_id": "588ebeb192514101a90003a7",
               "name": "Clive Russell",
               "profile_path": "/3dkiAdWPMPiPRqwi5MVBFOSD9Xo.jpg",
               "id": 19901,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Major (Rehabilitation Centre)",
               "gender": 2,
               "credit_id": "588ebece92514101ad0003ab",
               "name": "Pete Postlethwaite",
               "profile_path": "/5nbSzrwyDcLhC15buncGdrQqJ8e.jpg",
               "id": 4935,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Major Newman",
               "gender": 0,
               "credit_id": "588ebedf925141019f00037d",
               "name": "Angela Morant",
               "profile_path": null,
               "id": 26681,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Angie",
               "gender": 1,
               "credit_id": "588ebeecc3a36860b3000352",
               "name": "Liza Tarbuck",
               "profile_path": "/kVHXM3Z1kIgvh63gSsWNneN5fmn.jpg",
               "id": 1216171,
               "order": 13
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "550494b2c3a36825290014de",
            "name": "Richard Eyre",
            "profile_path": "/zwl4IdDL0331fxZMfHfN1dVpfb1.jpg",
            "id": 36693,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.318115,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 121154,
      "vote_count": 5,
      "budget": 0,
      "overview": "The film centres on the experiences of Robert Lawrence MC (played by Colin Firth), an officer of the Scots Guards during the Falklands War of 1982. While fighting at the Battle of Mount Tumbledown, Lawrence is shot in the head by an Argentine sniper, and left paralysed on his left side. He then must learn to adjust to his new disability.",
      "similar": [],
      "original_title": "Tumbledown",
      "runtime": 115,
      "poster_path": "/2rpprS3rMzRNf7WlcdsZW46PbeE.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
         "name": "British Broadcasting Corporation (BBC)",
         "id": 3324,
         "origin_country": "GB"
      }],
      "release_date": "1988-05-29",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Eyre"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Charles Wood"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098533/",
      "coverLink": null,
      "actors": ["Stars: Colin Firth, Paul Rhys, David Calder | See full cast and crew »"],
      "reviews": [
         "Just as much of the controversy over the political rights and wrongs of the Falklands War had dissipated, the BBC managed to bring them back very much into the public domain with this no-holds-barred but realistic dramatisation of the experiences of Royal Scots Guard Lieutenant Robert Lawrence, covering his military training, the fateful action he saw in the Falklands conflict and the aftermath of the terrible injuries which he sustained. The themes running through the film have been dealt with many times before and many since - the futility and barbarity of war, the way in which jack-the-lad trainees react to the true horrors of battle, the notion that the atrocities of war are very much the result of the reaction of its protagonists to the death of colleagues around them, the `kill or be killed' reality. What most war films have failed to do, though, and which is effectively achieved here, is to marry the harsh realities of the battlefield with the equally harsh realities of the social readjustment of the returning soldiers, particularly the seriously injured ones. Unlike the early Marlon Brando vehicle \"The Men\" or the highly-acclaimed 1946 drama \"The Best Years of Our Lives\", we are actually party to the battlefield horrors, both physical and mental, from which the subjects must recover, as a result of which we have fresh understanding of the traumas from which recovery is required. Those aforementioned films deal only with the ways in which the veterans deal with the problems of readjustment to everyday life within the constraints of their injuries, states of mind and social and economic rejection. On the other hand, the classic \"All Quiet on the Western Front\"and Oliver Stone's \"Platoon\" deal only with the realities of war on the battlefield. The picture that comes closest to achieving the wider effect of \"Tumbledown\" is undoubtedly \"Born on the Fourth of July\", a film also based on a real-life case (that of Vietnam veteran Ron Kovik), whose responses to his experiences and injuries (a campaign to end the war in Vietnam) are much more widely-based than the more personal agenda of Robert Lawrence. There is no doubt that Lawrence (and, indeed, writer Charles Wood and director Richard Eyre) vehemently believes that the fight over a barren and distant group of islands was not worth the price paid in terms of life and limb. But Lawrence is (and remains through all his adversities) a devoted and loyal professional soldier. He lays the burden of blame on everybody (the politicians who instigated the conflict, the heirarchy of the armed forces who persistently fail to recognise their responsibilty towards him and, unjustifiably in this case, the medical professionals who try to mend his mind and body) - all except the sniper who shot him. His bitterness towards all of these is because he perceives them as failing in their duty to him. His lack of bitterness towards the sniper is by virtue of the fact that he acknowledges him as a true professional soldier was was merely doing his job. He had done the same in similar circumstances, to which his bayoneting to death of the Argentinian soldier in a particularly nasty battle scene attests. Why couldn't everybody else have acted with the same professional attitude and with the same honour that he, his colleagues and the enemy had done? It appears that the only honour a soldier can have is to die gloriously on the battlefield - not to suffer horrendous woundings that leave him as a liability and embarrassment to the military, political and social leaders that had sent him to battle. Lawrence is not a particularly likeable chap, either during his training, during his difficult rehabilitation or in his bitter recounting of his experiences to his friend's parents - here Firth does an excellent job in portraying an individual with whom he has accepted in interview he would have found it very difficult to have made friends on a personal level. What makes his performance all the more remarkable is that, despite the brashness, self-righteousness and downright insolence of the character at times, the viewer still feels genuine sympathy for the circumstances of Lawrence's plight, if not for Lawrence himself. The format of the film also helps to drive home the points that it attempts to make. The events unfold in the form of apparently random flashbacks whilst Lawrence relates the story of his experiences to the parents of a close colleague. These flashbacks cover the Guards' training and the build-up to their despatch to the South Atlantic, the injury to Lawrence and his subsequent removal from the battlefield,through the various stages of his treatment, recovery and recuperation to the reactions of his family and friends and the battle scenes which culminate in his injury. Each linking flashback is chosen to increase the impact of the previous or forthcoming sequence, a technique which may appear to give rise to a disjointed narrative, but which is nevertheless highly effective in retaining the viewer's attention and making him wonder what the next fade will bring. Through all this, Colin Firth's portrayal of Robert Lawrence shines out like a beacon. His performance is truly remarkable in its range and its ability to provoke emotional response in the viewer. It was a part which undoubtedly increased his profile as a serious actor capable of producing credible and powerful pieces of acting and which lifted him to close to star status in both costume drama (BBC TV's \"Pride and Prejudice\" and the Oscar-winning \"Shakespeare in Love\") and contemporaneous tales (\"Fever Pitch\" and \"Hostages\"). Around him, there are some equally impressive support performances, particularly by the quietly reliable David Calder as Lawrence's father and Paul Rhys as his army colleague and closest friend. And director Eyre excels in his treatment of both the dramatic scenes and the action on the battle fields. Lastly, any critique of the piece would be incomplete without a tribute to the terrific screenplay of Charles Wood who has adapted Robert Lawrence's story with style, intelligence and brutal honesty to provide, through the personal experiences of a badly injured war veteran, an intense insight not only into the highly-publicised controversies surrounding the circumstances of the Falklands conflict, but also the more easily overlooked background issues at stake.",
         "Some background information; in 1982 2nd Bn, the Scots Guards were pulled from public duties (sentry-mounting in London) and sent to the Falkland Islands as part of the Task Force sent to recover it from Argentina. Unprepared as they were, they fought a savage and decisive battle to capture a vital hill, Mount Tumbledown. During the fighting, Lt. Richard Lawrence was very severely wounded. This film alternates sequences from before and after his wounding; the battle, and his long and difficult recovery and convalescence. It has to steer a tricky course around the major pitfalls of british public opinion. There are on one hand, the tabloid-fuelled jingoism of a country involved in a major fight, and on the other hand the subsequent revulsion that such losses were suffered in a squabble for some barren islands several thousand miles from home. The film does highlight the callousness and indifference with which the war's casualties were sometimes treated. The overall story and moral are not new, but their treatment here, with hardly any bad language or earth-shattering battle effects, strikes a more thoughtful note than, say, \"Saving PRivate Ryan\".",
         "This is a movie not often shown or seen. It is a gripping study of the aftermath of war and battle. Filmed in a realistic fashion, with dream-like flashback sequences, it keeps the viewer deeply enmeshed in the struggles of the principal hero. It is an adept adaptation of a particular battle fought in the Falkland Islands, 1982. If you are looking for immense battle scenes or action, it will not be found here. Instead brace yourself for a realistic portrayal of the ravages of war, the apathy of governments and personal strength and heroism.",
         "An outstanding study of one man's personal commitment and sacrifice to winning a meaningless war on a rain sodden rock 8000 miles away from home. Charles Woods storytelling is first class and gives Colin Firth an opportunity to totally convince us that he really is an officer in the Scots Guards. The production, given the BBC's lack of money is superb. Remember too, that this was produce despite political opposition from the very government which ordered the war in the first place and was then too embarrassed to recognise and honor the cripples who returned.",
         "This was a TV movie done by the BBC in 1988, aired in the UK in 1989 that stirred all sorts of attitudes and drew a lot of flak within the UK. Yet it sticks to the memories of Lt. Lawrence, the Scots Guards officer who came to fight for the Queen and for his country, contributed to final victory at the summit of Mount Tumbledown in the Malvinas (Falklands) Islands, but paid a price higher than being killed: to stay alive, but critically wounded, useless for the Army, and not able to return to the only job he could work in. It showed crudely that 1. The victors did not handle their wounded well, hiding them in indifference and with shame 2. War is war, and far from romantic. The most controversial scene (that the Ministry of Defense tried to delete from the movie by putting pressure on the BBC) shows Lt. Lawrence mercilessly bayoneting a wounded Argentine marine on the hillside. The soldier groans \"don't kill me, don't kill me, please.. please... while the killer pushes the bayonet several times, almost sadistically. For the British viewers this was hard to see, as it also portrayed their soldiers as evil in combat with fallen enemy soldiers. 3. It is one of the few movies that recreates faithfully how the Falklands war was fought. Until 2005, there were only two movies with this war as a background. The other one was \"Resurrected\". In 2005 the movie \"Lit by fire\" (Iluminados Por El Fuego\") told form the Argentine side the way its vets were neglected from society). \"Tumbledown showed that the Argentines did fight well despite their limitations (18-year-old draftees with inadequate clothing and shaky morale).",
         "This film is a 'must' to watch. I felt so emotionally overwhelmed and stunned after watching Colin Firths portrayal of Robert Lawrence that I felt the need to put down some of my thoughts and to thoroughly recommend this film to others. Tumbledown was totally absorbing, gripping and a poignant reminder to us all of just how our Soldiers suffered and what they sacrificed during and after the Falklands War. Its brought home to me the realities of the battle and the truth about how the Soldiers and their families coped with the aftermath of Battle and their own 'personal'struggles to recover from and cope with their physical and mental injuries during and after the War. Colin Firths portrayal of Robert Lawrence's was totally captivating and electrifying that one could really relate to and feel the struggle that Robert had gone through to recover from his injuries and his experiences and nightmares of the battle, also it was chilling to watch just how insensitive and distant the Nurses, Doctors,some Senior Officers and people in general were towards our great hero's, their experiences and sufferings in battle and the mental and physical scars they were left with. After watching Tumbledown it just confirms my beliefs further still that Colin Firth is such a natural highly talented, fantastic Character actor and he deserves far more recognition and credit when he plays such roles. It shone through that Colin Firth had thoroughly researched this role and whilst spending time with Robert during filming had got to know and understand the very essence of Roberts character,his sufferings and anger. Colin conveyed all of this to the audience with a natural honesty and sensitivity that was gripping, refreshing and emotive to watch. Also credit must go to David Calder (John Lawrence) and Barbara Leigh-Hunt (Jean Lawrence), they were perfect in their roles as Roberts shocked and distraught Parents upon learning of their sons serious injuries, their love and devotion,hope and despair was very touching and distressing to watch during Roberts recovery and their feelings of outrage, helplessness and disbelief at how Robert was treated by some Medical Staff,some of the Army and members of the Public. This film should be a lesson to us all of how to relate to those of us who are in great need, to treat them with respect, honesty and above all as an equal. Thanks first and foremost to Robert Lawrence for allowing his story to be told, to the writer for such an excellent script and of course thank you to Colin Firth for vividly, emotionally and honestly depicting Robert Lawrences story and character in an unforgettable emotionally moving, thought provoking film. The feelings of this film will stay with me always.",
         "When the BBC want to be daring and be uncompromising and have the nerve to do it they do it very very well.I last saw this in 1988 and remembered aspects of it, it was shown on BBC4 (27092012) I had the pleasure of again viewing this docudrama of Robert Laurence's time in the Falklands campaign and the consequences of the aftermath.It shows in my view how hard it was in the Falklands, as Laurence's says it wasn't all about yomping, there were some hard battles fought, his descriptions of killing made me think about things, Robert is a hard man, he is a soldier and he loves his job, he is uncompromising in his recovery, with pure determination he shows that despite the sniper injury he isn't beaten, in a film with few laughs there is a \"humourous\" scene on the Uganda when he has his BO since tumbledown, but it shows that despite these men doing the jobs the polictians send them too they were soon forgotten, what do we do with them, what are my next moves now I'm battle injured, it asks the questions that are relevant today as they were in over 30 years ago.... I don't know of any other films that has dealt with the Falklands like this has, the Falklands was wet, cold and was a hard fight, Tumbledown shows this, as Laurence himself says there is some artistic dramatic licence , \"he never shouted isn't this fun\". For a unique insight in to one mans actual view of his battle on and off the battlefields Tumbledown is a superb narrative and i would recommend it watched for its modern history aspect, and as it was politically the thatcher eras finest hour !!",
         "\"Tumbledown\" is yet another film in the list of some of Colin Firth's early works that needs to be made available for viewing in the US, in some fashion, now. I was able to get a copy and it was a revelation to me. Various reviewers here have given excellent account of the entire film and its historical context, so I would like to zero in on the acting of Firth, as Robert Lawrence. Anyone who has an image of Firth only as Mr. Darcy, both \"Pride and Prejudice\" and \"Bridget Jones\" versions, being the essence of his acting really needs to try to see this amazing early work of this actor. There are plenty of other examples of the great potential that led to the pinnacle of his success as an actor in \"A Single Man\" and \"The King's Speech\", but in this film, he is simply a force of nature. You forget completely that he was not actually a partially paralyzed man. The viewers also need to have conveyed to them the emotions and feelings that can only be done so through the eyes and facial expressions of the actor, and not every actor is as accomplished as Mr. Firth in this regard. He showed, even in his twenties, that not just a great actor was in the making, but was already fully formed. There are wonderful supporting performances in this as well, particularly the Lawrence parents, played by David Calder and Barbara Leigh-Hunt. Their love for their son, mixed with the emotions of needing to let him be in his life, along with the frustration at his circumstances, is beautifully and poignantly portrayed. Note must also be made of a fine performance by Paul Rhys as the good friend of Lawrence, often helpless in the hurricane of emotions that make up his blustery, gung-ho, and eventually badly damaged friend and fellow officer. If one is any sort of fan of Colin Firth, \"Tumbledown\" is a must-see. Simple as that. I believe this film is still available in the UK on DVD, and US Region copies exist. This viewer is wishing this, along with several of Firth's other films, could be made available in the US. The deeper talents of this actor need to be on equal display with to the lighter fare that originally brought him success in the US.",
         "There is a serious problem with TUMBLEDOWN and that is with the way Charles Wood has structured the script . The story opens with no hook and becomes very irritating as the events cuts back and forth in time with the climatic battle happening not until the very end of the story There are also other problems with the script in what is it actually trying to say to the audience ? That war is bad ? Thanks but I think everyone knew that , and it does lead to a problem for any writer to set an anti war drama ( Though be it a drama based on actual events )against the background of The Falklands conflict . The number of war dead from the conflict was in the region of 1,000 ( 255 British with around 750 Argentine dead ) but only three of the people killed ( All Falkland civilians killed by a shell from a British warship ) can in any way be described as non combatants . Can anyone name a conflict where 0.3 % of the dead were innocent bystanders ? Compared to all the other wars , genocides , democides etc of the 20th Century The Falklands conflict was almost certainly the \" cleanest \" war of the last century therefor there`s little opportunity to make angst ridden statements of mans inhumanity to man . It`s also hard to make anti war statements when you`re on the winning side . Why do you think the best anti war films from Hollywood like PLATOON feature Vietnam as a back drop or CROSS OF IRON and ALL QUIET ON THE WESTERN FRONT show conflict through German eyes ? As has already been mentioned Lt Robert Lawrence isn`t a sympathetic character on screen either so it`s very difficult to sympathise with a character who switches from self pity to arrogance back to self pity again , but at least writer Charles Wood hasn`t tried to modify or embellish Lt Lawrence into the boy next door and now that I come to think of it Wood should be congratulated for not making any overt political statements with the script which the more I think about it comes across as being anti war but pro soldier . But I have to stick with my original conviction that the script to TUMBLEDOWN is very flawed down to the confusing and irritating manner the story is told"
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": ["British Broadcasting Corporation (BBC)"],
      "summaries": ["Based on the experiences of Lieutenant Robert Lawrence, M.C.."],
      "budget": 0
   },
   "movielensId": 80596,
   "movielens": {
      "languages": [""],
      "releaseDate": "1988-05-29",
      "dvdReleaseDate": null,
      "directors": ["Richard Eyre"],
      "runtime": 115,
      "movieId": 80596,
      "title": "Tumbledown",
      "mpaa": null,
      "actors": [
         "Colin Firth",
         "Paul Rhys",
         "Paul Rhys",
         "David Calder",
         "Barbara Leigh-Hunt",
         "Sophie Thompson",
         "Dan Hildebrand",
         "Mark Williams",
         "Paul Higgins",
         "Timothy Carlton",
         "Clive Russell",
         "Pete Postlethwaite",
         "Angela Morant",
         "Liza Tarbuck"
      ],
      "imdbMovieId": "0098533",
      "originalTitle": "Tumbledown",
      "genres": [
         "TV Movie",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The film centres on the experiences of Robert Lawrence MC (played by Colin Firth), an officer of the Scots Guards during the Falklands War of 1982. While fighting at the Battle of Mount Tumbledown, Lawrence is shot in the head by an Argentine sniper, and left paralysed on his left side. He then must learn to adjust to his new disability.",
      "tmdbMovieId": 121154,
      "avgRating": 4.25,
      "releaseYear": "1988",
      "numRatings": 4,
      "posterPath": "/2rpprS3rMzRNf7WlcdsZW46PbeE.jpg"
   }
}