{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "gay son",
            "id": 12342
         },
         {
            "name": "co-worker",
            "id": 14522
         },
         {
            "name": "recital",
            "id": 14590
         }
      ],
      "imdb_id": "tt1301990",
      "video": false,
      "title": "Every Day",
      "recommendations": [
         56965,
         51321,
         40818,
         73846,
         47676,
         171780,
         44305,
         9971,
         50875,
         18820,
         89883,
         96001,
         26195,
         44594,
         33175,
         75680,
         42599,
         70585,
         124581,
         164435
      ],
      "backdrop_path": "/3P0DxmsgEOvp5L1ZNVrBn4gxEz.jpg",
      "revenue": 18000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robin",
               "gender": 1,
               "credit_id": "52fe46aec3a36847f810c3eb",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ned",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c3ef",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jeannie",
               "gender": 1,
               "credit_id": "52fe46aec3a36847f810c3f3",
               "name": "Helen Hunt",
               "profile_path": "/ws1ClG9BBUIVLZRYTNKconJn9Sy.jpg",
               "id": 9994,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c3f7",
               "name": "Brian Dennehy",
               "profile_path": "/5OgSljTrXQ3pZvy66WveAGpygnS.jpg",
               "id": 6197,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jonah",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c3fb",
               "name": "Ezra Miller",
               "profile_path": "/1tgihUq8F6zPHU9IYyRZ7vI6nme.jpg",
               "id": 132157,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Garrett",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c3ff",
               "name": "Eddie Izzard",
               "profile_path": "/j5hzBqmcyWG2GC754uACCoNgAvS.jpg",
               "id": 1926,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c415",
               "name": "David Harbour",
               "profile_path": "/chPekukMF5SNnW6b22NbYPqAStr.jpg",
               "id": 35029,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Guillermo's Girlfriend",
               "gender": 0,
               "credit_id": "52fe46aec3a36847f810c419",
               "name": "Benita Robledo",
               "profile_path": "/owxlOczDUVZC89bGAUQjkOGGCXV.jpg",
               "id": 143717,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Ian",
               "gender": 2,
               "credit_id": "52fe46aec3a36847f810c41d",
               "name": "Tilky Jones",
               "profile_path": "/v929f9bvBIzhf1vhe6afgq20IbI.jpg",
               "id": 143718,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Callen",
               "gender": 0,
               "credit_id": "52fe46aec3a36847f810c421",
               "name": "Daniel Yelsky",
               "profile_path": "/oQXqIsgUBAMrv7SvPhXrBwBRoZB.jpg",
               "id": 143719,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Stefanie",
               "gender": 0,
               "credit_id": "52fe46aec3a36847f810c425",
               "name": "Brianca Giancoli",
               "profile_path": "/9IYGmZvtURZbgvFXSuoI5UX8tFq.jpg",
               "id": 143720,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Ashley",
               "gender": 0,
               "credit_id": "52fe46aec3a36847f810c429",
               "name": "Sabrina Hahn",
               "profile_path": null,
               "id": 143721,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46aec3a36847f810c405",
               "name": "Miranda Bailey",
               "profile_path": "/xk0jNeFK8oF3mlyEK07VvRBD8x3.jpg",
               "id": 66263,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46aec3a36847f810c40b",
               "name": "Richard Levine",
               "profile_path": null,
               "id": 132161,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53d40f39c3a3686b9a001b58",
               "name": "Richard Levine",
               "profile_path": null,
               "id": 132161,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5548d645c3a36878770023bd",
               "name": "Darren Griffiths",
               "profile_path": null,
               "id": 1460644,
               "department": "Visual Effects",
               "job": "Color Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.599194,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45077,
      "vote_count": 37,
      "budget": 0,
      "overview": "Ned (Liev Schreiber) is in the throes of a mid-life crisis. His work as a writer on an outrageous, semi-pornographic TV show is less than satisfying. His fifteen year old son has just told him he is gay and his eleven year old is afraid of, well pretty much everything. When his wife, Jeannie (Helen Hunt), moves her sick and embittered father (Brian Dennehy) from Detroit into their home in NY, it puts added stress on an already strained marriage. And when a sexy female co-worker (Carla Gugino) puts the moves on Ned, the temptation sends him spiraling. EVERY DAY is about one family's struggle to survive the unexpected curve-balls that are simply part of real life; aging and death; commitment and freedom; love and acceptance. It's an uncompromising look at an ordinary family making an extraordinary journey towards themselves and towards each other.",
      "similar": [
         201676,
         11397,
         133805,
         9611,
         89185,
         11355,
         40264,
         18892,
         51588,
         36599,
         7341,
         20771,
         20107,
         73108,
         46420,
         14429,
         39929,
         47541,
         41828,
         435104
      ],
      "original_title": "Every Day",
      "runtime": 93,
      "poster_path": "/tSh9Bb8naVwBkMJnI0V62ToA6l7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-01-14",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "A comedy about a New York City couple in romantic crisis",
      "adult": false,
      "homepage": "http://www.everydaythemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Levine"],
      "runtime": 93,
      "synopsis": "Ned (Liev Schreiber) is in the throes of a mid-life crisis. His work as a writer on an outrageous, semi-pornographic TV show is less than satisfying. His fifteen-year-old son has come out to him, and his 11-year-old is afraid of, well pretty much everything. When his wife, Jeannie (Helen Hunt), moves her ailing and embittered father (Brian Dennehy) from Detroit into their New York home, it puts added stress on an already strained marriage. And when a sexy female co-worker (Carla Gugino) puts the moves on Ned, the temptation sends him spiraling. EVERY DAY is about one family's struggle to survive the unexpected curve-balls that are part of life: aging and death; commitment and freedom; love and acceptance. It's an uncompromising look at an ordinary family making an extraordinary journey toward themselves and each other.",
      "writers": ["Richard Levine"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1301990/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMjE1MjEyOF5BMl5BanBnXkFtZTcwMjk3MjAzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Liev Schreiber, Helen Hunt, Carla Gugino | See full cast and crew »"],
      "reviews": [
         "\"Every Day\" tells the tale of a couple going through a midlife crisis. Ned (Liev Schreiber), is a man on the brink of a mental breakdown. You see life isn't easy for Ned as he is dealing with a boat load of problems. He is bored with his screen writing job, he is dealing with trying to accept that his son Jonah (Ezra Miller) is gay, and on top of all this his marriage is falling apart. His wife Jeannie (Helen Hunt) has her own issues as she is responsible for taking care of her father Ernie (Brian Dennehy) who is dying and trying to save her marriage with her husband Ned who doesn't seem to give her the time of day. Life isn't easy for Ned and Jeannie but what happens in \"Every Day\" is an interesting look on the subject of marriage and life in general. I saw \"Every Day\" at the \"World Premiere\" screening at the Tribeca Film Festival on Saturday April 24, 2010. I basically went into this film knowing nothing about it other than the fact that it starred Helen Hunt, Carla Gugino, and Liev Schreiber all of which are solid actors. What I got out of the film was an interesting look at life and marriage written by a man named Richard Levine, who is a first time screen writer and director. One of my favorite things about the film was the whole workplace scenario that Ned was placed in. This subplot to me proved to be realistic. This was one of those films where I felt it did a good job capturing how too much work can destroy your life outside of work. It also shows that life as an adult isn't easy and is a balancing act with everything that gets thrown your way. The subjects of marriage, having children, having a sick parent, cheating, working too much, and a few other subjects all get looked at in the film. My problem however with the film was that I wasn't sure what was going on in the end of the film. It felt like the movie had a conclusion but it really didn't. I guess the film had one of those \"life happens\" endings. The subject matter of cheating was never really talked about, which bothered me because it seemed to be one of the key focuses of the film. While the film itself felt real like these characters exist in the real world something about how everything ended did not. I can't really explain it but its just something that blurred the line of fiction and reality. I like that aspect of it and I didn't at the same time. The characters were all good as well as the development of them. Liev Schreiber did a great job in the lead role. I really felt his struggles as a parent and as a married man to devote his time to the right people. Helen Hunt does a good job as well dealing with her marriage and with her father's obsession with wanting to die. Brian Dennehy performance is solid but that's no surprise because he has been a solid actor for many years now. You really did however feel for what he was going through. Carla Gugino makes a nice supporting role appearance here, playing the sexy \"screen writer\" with her eye on Ned. Carla's role really isn't as deep as I would have liked it to be but Carla has a knack for playing the sexy coworker role. She was perfectly cast to play the role she played. The kids Ezra Miller and Skyler Fortgang both do a terrific job on screen and I am sure they will have a lot more roles coming their way in the near future. In the end...I liked the film for what it was. It had some issues here and there but coming from a first time writer and director that was bound to happen. It was a valid effort and the film itself is interesting and realistic for the most part. The acting was good and the roles were well written. As I mentioned above, some things about the film blurred the lines between reality and fiction. The film's ending is its weakness in my humble opinion. Not saying that it was bad but just didn't impress me and left me rather indifferent about what I just watched. All in all, I would recommend it because it was a solid film about life and the famous midlife crisis. Check it out when it hits theaters! MovieManMenzel's final rating for \"Every Day\" is a 7 out of 10.",
         "I found this piece to ring so true to family life in America today. I loved that it did not sugarcoat how hard it is to raise kids or help aging parents or keep a marriage fresh. This cast is superb and they have all brought their A game to the screen. They are reachable and poignant and they each have their own agenda that is faithfully followed throughout the story. I really see this as an ensemble piece and, therefore, don't want to single any one cast member out. They each delved into the details of their characters to bring a real slice of life to us. It was easy to get lost in the writing, the story, and the emotions we can all relate to with the deft ability of the cast and how they were directed. I highly recommend it.",
         "What if what you thought you were missing in life you already had? A writer for a TV show, Ned (Schreiber) is stuck in a job where his boss demands more and more strange things. His wife Jeannie (Helen Hunt) has just brought her father home to take care of. His son is gay and Ned is trying to avoid admitting it, and his co-worker (Gugino) is another reason his life is spinning out of control. So many movies and TV shows come out that claim to be true to life, or \"Reality Shows\", they usually turn out to be so over the top they end up borderline spoofing the stars. This is one huge exception. While not being a reality show at all, this is the most true to life movie I have seen in a while. It was depressing in parts, but again because it seemed like they just took a family and watched how they live and made a movie from it, without changing anything. Ned is stuck trying to sort out what his life has become that he finds himself trying to be someone he isn't. This movie is another glaring example of how unless you have a $200 million budget and your movie make $400 million in theaters you will get no recognition or advertising. There are no big name stars in here like Tom Cruise or Katherine Heigle, and because of only casting good actors and relying on script and acting, it gets overlooked. Which is a travesty. I give it an A. Would I watch again? - Yes I would, but again it would lose some of the effect.",
         "Richard Levine's 'Every Day' takes a slice of life look at Ned and Jeannie's family life. Their monotonous life is further disrupted when Jeannie's grumpy father, after the death of his wife. Levine tells the story with sincerity but it feels very familiar. It bares some resemblance to movies like 'The Savages' and 'Little Children'. I liked the angle with the teen son who gets lured into sneaking out at night to meet a guy at a disco and yet he's strong-minded enough to refuse drugs. The dynamic between him and his father, especially concerning his homosexuality is portrayed effectively. The struggle between Jeannie and her father is well-depicted. The characters are well-written. The lines are witty and funny but the plot is contrived and very predictable. The Eddie Izzard track felt like an attempt to be quirky and it hardly contributes much to the main story other than providing some comic relief. It's good to see Helen Hunt back. She performs naturally. Brian Dennehy is brilliant and the two child actors are good too. Carla Gugino is spot on. Liev Schreiber and Eddie Izzard are passable. Overall, it may be a typical slice of life family drama but still worth the watch mostly because of the way it portrays certain themes, sharp dialogue and good performances",
         "If you can look past Liev Schreiber's beard and stop wondering when Sabretooth is going to kill everyone, this is an amusing and affecting little family drama. It's true that about an hour in when you realize the movie's message is nothing more than \"Life sucks. Keep going\", you'll get a brief sense that your time has been wasted. Get over that disappointment and stick it out to the end. Every Day doesn't have some sort of spectacular finish. That would be very out of step with its low key manner. The ending does give you a sense of completion that validates a viewer's investment. You have to savor these subdued performances and quietly clever story all the way through to fully appreciate them. Ned (Liev Schreiber) is a writer on an awesomely trashy TV medical drama. He's got a teenage gay son, Jonah (Ezra Miller), that he frets over and a sensitive pre-teen son, Ethan (Skyler Fortgang), that he tries to be patient with. Ned's also got a beautiful wife, Jeannie (Helen Hunt), who's just returned home with her elderly, ill and emotionally toxic father in tow. Ernie (Brian Dennehy) is the sort of stubborn, disconnected parent who can only seem to engage his children through criticism. As Ned worries about Jonah starting to date and has to deal with a wife perpetually angry from dealing with her father, he's also confronted by trouble at work and the temptation of a hot co-worker who has an unencumbered life that looks pretty good to Ned right now. This is an enjoyable and well made motion picture that employs and unfocused narrative to great benefit. Though Ned is the center of things, he doesn't dominate the story in any way. Not only are Jeannie's struggles with her father largely independent of Ned, but Jonah, Ernie, Ned's hot co-worker and even his demanding boss (Eddie Izzard) are all given their own little battles to deal with in the story. Those secondary story lines, however, reflect back onto what happens with Ned in a way that gives the film an unforced unity of emotion. Jonah's difficulty in dating validates Ned's concerns. Ernie grappling with his mortality seeps into Ned's brain and heightens his sense of being trapped. The things that attract Ned to his co-worker eventually blow up and make him appreciate his own life. His boss is not just a threat but the boss' uneasiness in dealing with his lover's teen son mirrors Ned's worries about Jonah, creating a potential link between the two that the audiences longs to see Ned connect. A lot of attempts at this kind of family drama get overpowered by one central character and one central theme, with all else reduced to window dressing. Every Day achieves an organic relatability without ever losing its way in meandering digressions. The film never gets caught up in trying to make this out to be the worst moment for Ned and his family or strains a muscle trying to elevate this family's story into some transcendent realm of meaning. Which is the only real problem with this movie. It's not edgy or intense or provocative of compelling. It's a pleasant hour and a half that maybe gives you a chance to take a breath and realize the problems in your life aren't quite as overwhelming as you make them out to be. Every Day lacks that \"hook\" to grab onto the viewer and pull itself of the crowded entertainment field. I can't imagine too many people hating this film and I can't imagine too many people loving it, but this sort of middle ground entertainment has a hard time find a foothold in today's cultural deluge. I'm glad I saw this film and how often can you really say that? Maybe instead of always going for the home run and usually striking out, we'd all be better off if more filmmakers did what Richard Levine does here and try to hit for average.",
         "Great cast in a mostly typical domestic pot-boiler. You could probably write the plot yourself after the initial set-up, and the climax is conventionally contrived to happen all in the same night. Not quite as funny or dramatic as it might have been throughout. The son's homosexuality is realistically handled especially the dynamic between him and his dad. But Eddie Izzard's boss-man lives in a world that doesn't touch reality - even Reality TV. This plot line threatens to de-rail the whole enterprise for me What sort of TV show is this??? Hunt's best line was left on the cutting room floor \"It's not porn. It's cable.\"",
         "this movie is listed as a comedy and there are a few comic moments. but i found most of the laughs in some of the overdone dramatic scenes. couldn't believe this as a real family. their daily life is almost to the point of being a 'pot boiler'. the acting is good and nicely cast, but something is missing. a sweet story being told by some rather over done characterizations - in my opinion. but i enjoyed the movie as a whole. it's just sort of a hollow feeling when it's finished. emotionally the viewer expects something more solid. my favorite scene is in the parking lot after Ned has his blowout at the staff meeting. and i appreciate having the son realize he made a mistake deceiving his parents - thus his reaction at the club. very watchable story but .....!",
         "EVERY DAY � CATCH IT ( B ) A movie about dysfunctional family is my favorite genre. These movies sometime brings out the greatest moment and performance out of actors you actually never expect. Even here we see a side of Liev Schreiber, which I have not seen before. Watching him with Helen Hunt was really interesting. Helen Hunt is a fine actress and we rarely get to see her these days. I really would love to see her soon in some more movies. Ezra Miller is uprising young actor and he is really impressive can't wait to see what he brings on table with bussed about movie\" We Need to talk about KEVIN\". Carla Gugino is a sweet actress, its always fun watching her and her chemistry with Liev was HOT. Tilky Jones and Ezra Miller smooching was HOT. Overall, it's a good effort and I really enjoyed the whole dynamics of the characters and specially the funny dialogues. I enjoyed it.",
         "This movie is a waste of time. The script is sophomoric, Helen Hunt is wooden and unconvincing. Schreiber tries, but he also falls short with a script that tries too hard to be contemporary and relevant. The sick dad is a running cliché. Schreiber's siren is equally stiff and unbelievable. The scene with her in the swimming pool towards the end is flat out stupid. By this point the wheels had come off the film. The move is primarily a vehicle for convincing us how normal it is in our changing society to come out as gay in high school. The male on male sex is difficult to watch, it wasn't necessary and American audiences will still be largely turned of by it, imo.",
         "So many problems, it's a wonder any family copes? They strive, they work their way through? There is unpleasantness, we see it coming, we watch it develop, but the director keeps the scenes short, so the unpleasantness fades and we move on to the next scary issue. That's a great way to deal with it. So, why the 10 rating? Because it is so real. They are real problems, a real story of coping, real people. And my other requirements for a 10, some especially good scenes, and examples of really good dialogue. It's all here. Ned (Schreiber) is a writer for a shock-horror TV show, and must be quite good at it, even though he doesn't really like the attitudes. He is trying to cope with eldest son who wants to go to a 'gay prom'. That would try any parent. His wife (Hunt) has her father (Dennehy) come to live with them. He is declining, and demanding. Very unpleasant mostly. Scary too, we all will (or might) get old and others will have to cope. The plot has the potential to go really awful, but great directing and superb acting achieve so much. Any of us could face similar issues, and how would we cope? Badly maybe. Getting the best from child actors takes patience, persistence and careful guidance - director Levine has done a great job here. And Levine has written some great lines too, Ernie at the rest home... \"We're all just visiting\". A profound thought for us to ponder. Although the DVD blurb says 'fast and funny', there is only one really funny part - when Ned at first says his cut face came from hitting his steering wheel, but then he explains the real reason and you should see the surprise on the faces of his boss and work colleagues! Great."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cold Iron Pictures",
         "Ambush Entertainment"
      ],
      "summaries": [
         "This day really isn't all that different than every other day, except today Ned's gay son Jonah wants to go to a college party, his wife is bringing home her elderly father to live with them, and his outrageous boss seems to have become even more crazy and demanding than would even seem possible. As his wife tries to take care of her father and reconnect with him, Ned tries to reconnect with Jonah, and then without trying, he seems to have formed a connection with his co-worker. If he can get through days like these, he should be able to get through anything else life throws at him.",
         "Ned and Jeannie: married 19 years. Ned has trouble with Garrett, his boss at the cable show he writes, and he's ill-at-ease with his older son Jonah's coming out and wanting to go to a high-school gay student society prom. Jeannie puts work on hold while she attends to Ernie, her sour and mean-spirited father whose ill health forces him to move in with them. While Jeannie taxis the boys, goes to one son's recital, sees to her father's needs, and fixes meals, Garrett assigns Ned to rewrite a script with Robin, an uninhibited, unattached colleague who offers no-strings fun. Can this family hold together while a chicken hawk circles Jonah, Robin inveigles Ned, and death hunts Ernie?",
         "A comedy about a New York City couple (Schreiber and Hunt) in romantic and family crises."
      ],
      "budget": 0
   },
   "movielensId": 80779,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-01-14",
      "dvdReleaseDate": "2011-03-08",
      "directors": ["Richard Levine"],
      "runtime": 93,
      "movieId": 80779,
      "title": "Every Day",
      "mpaa": "R",
      "actors": [
         "Carla Gugino",
         "Liev Schreiber",
         "Helen Hunt",
         "Brian Dennehy",
         "Ezra Miller",
         "Eddie Izzard",
         "David Harbour",
         "Benita Robledo",
         "Tilky Jones",
         "Daniel Yelsky",
         "Brianca Giancoli",
         "Sabrina Hahn"
      ],
      "imdbMovieId": "1301990",
      "originalTitle": "Every Day",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "vLO1GFEvIIE",
         "b4nbltfmWeI"
      ],
      "plotSummary": "Ned (Liev Schreiber) is in the throes of a mid-life crisis. His work as a writer on an outrageous, semi-pornographic TV show is less than satisfying. His fifteen year old son has just told him he is gay and his eleven year old is afraid of, well pretty much everything. When his wife, Jeannie (Helen Hunt), moves her sick and embittered father (Brian Dennehy) from Detroit into their home in NY, it puts added stress on an already strained marriage. And when a sexy female co-worker (Carla Gugino) puts the moves on Ned, the temptation sends him spiraling. EVERY DAY is about one family's struggle to survive the unexpected curve-balls that are simply part of real life; aging and death; commitment and freedom; love and acceptance. It's an uncompromising look at an ordinary family making an extraordinary journey towards themselves and towards each other.",
      "tmdbMovieId": 45077,
      "avgRating": 3.2,
      "releaseYear": "2010",
      "numRatings": 25,
      "posterPath": "/tSh9Bb8naVwBkMJnI0V62ToA6l7.jpg"
   }
}