{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1346983",
      "video": false,
      "title": "Loving Leah",
      "recommendations": [
         57943,
         27353,
         71465,
         60662,
         46228,
         244776,
         47525,
         67809,
         109614,
         62984,
         24625,
         104732,
         253282,
         72240,
         35109,
         286971,
         197481,
         19448,
         24068
      ],
      "backdrop_path": "/3o76OtPzXiRa6CUtgQZuf7QsRd2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Leah",
               "gender": 1,
               "credit_id": "54023aac0e0a2658e90056a3",
               "name": "Lauren Ambrose",
               "profile_path": "/zEdW3X6MHTDVG4jizKfVebVTmCH.jpg",
               "id": 54470,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Jake Lever",
               "gender": 2,
               "credit_id": "54023ab90e0a2658db00570f",
               "name": "Adam Kaufman",
               "profile_path": "/vueHeQoUo6wox2D26MTATKPnQIy.jpg",
               "id": 95746,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Malka",
               "gender": 1,
               "credit_id": "54023ac50e0a2658f1005515",
               "name": "Susie Essman",
               "profile_path": "/7KFZDPGoiu5y0J9s2p5eAgMoUW5.jpg",
               "id": 56910,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Rabbi Belsky",
               "gender": 2,
               "credit_id": "54023ad50e0a2658f1005519",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Esther",
               "gender": 1,
               "credit_id": "54023ae70e0a2658e200584e",
               "name": "Natasha Lyonne",
               "profile_path": "/8rhl25eCPQQFhv1Mvqe9eMP3MpS.jpg",
               "id": 10871,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Rabbi Gerry",
               "gender": 1,
               "credit_id": "54023af80e0a2658de005896",
               "name": "Ricki Lake",
               "profile_path": "/y0nbFpKzWKLkziM9rZYYRUqciyn.jpg",
               "id": 70233,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Janice",
               "gender": 1,
               "credit_id": "54023b0a0e0a2658e2005856",
               "name": "Mercedes Ruehl",
               "profile_path": "/dGyZ3s7TdC88JgDMQaQqUOwFul0.jpg",
               "id": 2167,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Emily",
               "gender": 0,
               "credit_id": "54023b160e0a2658de00589c",
               "name": "Tonye Patano",
               "profile_path": "/vmxQm19ncWnZDCIKsN74b13o6Rc.jpg",
               "id": 1214060,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Raj",
               "gender": 2,
               "credit_id": "54023b230e0a2658ee005682",
               "name": "Donnie Keshawarz",
               "profile_path": "/srTrT1DAjIhM4YMakExGcjLnpQi.jpg",
               "id": 83223,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Young Jake Lever",
               "gender": 2,
               "credit_id": "57be04599251417326002230",
               "name": "Timothée Chalamet",
               "profile_path": "/gz5kyVsUzOratQmGHdDg3AnxP9h.jpg",
               "id": 1190668,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "54023b360e0a2658e90056b9",
            "name": "Jeff Bleckner",
            "profile_path": "/8mgbryrtiwKvEeQe8K1aaQP2B04.jpg",
            "id": 69982,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.450502,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52221,
      "vote_count": 13,
      "budget": 0,
      "overview": "A handsome Washington, D.C. doctor and a young New York woman fall in love at an unusual time...after they get married. Leah Lever is married to an Orthodox rabbi, Benjamin Lever, whose brother, Jake is a successful cardiologist and a non-practicing Jew. Jake is stunned when Benjamin dies suddenly, but not as stunned as when he is told that, under an ancient Jewish Law, he is expected to marry the childless Leah to carry on Benjamin's name.",
      "similar": [],
      "original_title": "Loving Leah",
      "runtime": 95,
      "poster_path": "/kwlu0uwLNgIgC8NiLTXEyIq9oy8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hallmark Hall of Fame Productions",
         "id": 9027,
         "origin_country": ""
      }],
      "release_date": "2009-01-25",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Bleckner"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Pnenah Goldstein"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1346983/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4ODU3NDkxN15BMl5BanBnXkFtZTcwNDE1NDUyMg@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Lauren Ambrose, Adam Kaufman, Susie Essman | See full cast and crew »"],
      "reviews": [
         "Jake is a Washington, D.C., physician who has been accepted into a fellowship program. He is engaged to Carol, who he met at the hospital when they were having lunch at the same time. Carol is pretty and seems to work at the hospital, but I'm not sure what she does. Jake, who grew up Jewish but is no longer observant, dreams that he sees his brother Benjamin, a rabbi who he has not kept in touch with, telling him everything is now all right between them. They used to be close, as shown in flashbacks. Jake then finds out Benjamin is deceased. Jake goes to Brooklyn to attend the funeral. He finds out that he obligated by scripture (Deuteronomy 25:5) to marry Benjamin's widow Leah. Neither Jake nor Leah wants to do this, but a halizah ceremony is required to release Jake from his obligation. The words Jake is forced to say would require him to denounce his brother, which he can't do. So he goes through with a sham marriage and moves Leah into his very masculine Georgetown apartment, giving her the other bedroom. The two rarely see each other. Still, you can imagine how this makes Carol feel. Meanwhile, there is an additional complication: the mothers of Jake and Leah don't know the marriage is fake. So they have to go through the motions to keep up the charade. Leah wanted to leave Brooklyn anyway; she wants to go to college and investigates the possibility. Very devout and conservative, she also seeks out a place of worship. The one she finds is very different from the one in Brooklyn; instead of lots of men with black hats and beards, this temple has a female rabbi. The \"marriage\" appears unlikely to succeed. But wait: why does this movie have the title that it does? Maybe there is hope after all. The leading actors in this movie all do a good job. Lauren Ambrose is pleasant enough, and she is attractive but very plain, though she has beautiful hair (it's actually a wig). I especially liked Ricki Lake as the female rabbi who helps Leah find answers in a new community of faith. Susie Essman plays Leah's mother as abrasive (but in New York City, that's actually love) and intolerant (would an on screen Jewish mother be anything else?). Mercedes Ruehl does an especially fine job as Jake's mother. It is rare to see this much detail about the Jewish faith. Most movies and TV series show Jewish people as non-observant or, where they are faithful, we often don't see the details of what is required of them. The Brooklyn Jews in this movie are the most conservative Jews I have ever seen portrayed. And yet the female rabbi teaches Leah a lot about how all the requirements may not be necessary. Leah and Jake have a lot to teach each other as well. It was worthy of the name \"Hallmark Hall of Fame\".",
         "I liked this movie a lot. I thought Lauren Ambrose was great in the role of Leah, an orthodox Jewish woman living in brooklyn who's husband dies leaving her a widow, and according to tradition, which I've NEVER heard of that she should be encouraged to marry the brother of her dead husband so she can have children and carry on the family name. The catch is that the living brother is extremely reformed in his ways while the deceased was extremely devout. They decide to marry, but both agree it's for convenience only and she moves to DC to live with him while he works on his medical fellowship. She's a free spirit and is happy for the opportunity to renew herself and wants to pursue a college degree against the wishes of her mother who believes a womans role is to serve her husband and children. What happens next is largely predictable, but it didn't bother me becuause the development of their relationship seemed to come very naturally and honestly. What struck me most about this movie was the charming childlike innocence of Leah as she was learning this whole new life. It was as if she was an amish person who moved to the big city and had to adapt to the pace and modern ways of life in addition to trying to maintain her OWN way of life through the way she decorated her room to her cooking traditional meals and taking on wifely duties....It was like she was trying to figure out how she could merge two worlds into one. It was a typical Hollywood ending no surprise. After all this was a hallmark hall of fame movie, but I really liked it.",
         "First, I would like to thank Hallmark for putting on this movie because in doing so they took a chance that people could actually relate..and not be afraid to throw in a story with a religious element..the old adage is never talk about politics or religion. While it is true that we delve into some fundamental issues of the Jewish faith, this is first and foremost a story of friendship offered and love found. One review called this a romantic comedy..others found faults here and there but there will always be those that look for some shortcomings. I see this as a tender story of two people discovering that they have much to offer each other after Jake's brother dies leaving a widow. She has her ways steeped in tradition and Jake has his ways..not being home much and a girlfriend and working long hours at the hospital..did I mention that his girlfriend initially encouraged Jake (Adam Kaufman) to befriend the young widow (Lauren Ambrose)?After all, she's family. The first days and weeks thrown together as \"roommates\" are played in such a realistic and touching way, you are drawn into \"their\" story..and it is theirs and the memory of his dead brother..and mothers wanting what's right for their kids..this is a sweet, innocent and tender. Telling of simple love..there's no comedy here..but the facial expressions and the eyes say this is really some fine acting..I waited for this to come on and was not disappointed. And neither will you.It's that good.",
         "Some religious customs are an enigma to most of us, not having been exposed to them, as is the case at the center of this story. Jake Lever's brother, having come from the same secular background as he, turned into a strict Orthodox Jew and married the young Leah, a religious young woman living in Williamsburg, Brooklyn. Jake, an intern at a Washington hospital, sees his brother in a dream, so vividly that when he is told he has died suddenly, it shakes him completely. Jake is seeing Carol, also an intern. Little prepares Jake for what his life will turn into when he is told of an ancient Orthodox custom where the young widow must marry her husband's single brother, or else, her brother-in-law must renounce to that claim by doing something that feels repugnant to him. As a result, Jake and Leah, are married. That is when things start getting complicated for both of them. Jake and Leah agree on a convenient arrangement that suits each other. Leah will try to pursue an education that was cut short when she married for the first time. Carol, on the other hand, feels as though Jake is not being honest with her. Eventually they break their relationship. It takes no time before Jake realizes he has been falling in love with Leah, but didn't want to admit it. Jeff Bleckner directed this television presentation, written by Pnenah Goldstein for a Hallmark type movie. It is a romantic comedy that combines elements that have been used in other films of this genre. Our only interest in watching was Lauren Ambrose, one of our best, and more versatile actresses working in movies and television these days. She is wonderful as Leah because of her take on the young woman who is taken out of her world reluctantly. Mercedes Ruehl, also in the cast, has nothing to play. Adam Kaufman appears as Jake, the man who falls in love with someone against his better judgment. Susie Essman, a successful comedienne in her own right, is seen as Leah's mother.",
         "I was a religious Jew once or I pretended to be, and I did crazy things like Leah do in the film. That's perhaps the reason why I identify with the movie a lot. I love the way how tradition and religion is illustrated and introduced to people unaware of Judaism. I definitely believe the writer went through a very profound research to gather the story well. Yibbum and Halitzah is mentioned in the Torah (Deuteronomy 25:5-10) and truly is no longer practiced, but the Halitzah ceremony until now exist; Like the Pidyon haben (redemption of the first born son) and many other symbolic ceremonies that are part of the Jewish culture, religion and tradition. I am glad the movie is around for all of the reason above, I loved it so much that I expended one week every night watching it.",
         "This title reminds me of a filipino actress: Lea Salonga. She had a show before title Love, Lea. and an album Leah in Love(1999). Well maybe that's how they came up with the title. Additional info: Leah Salonga sang as Mulan in Disney's Mulan Movie. it might not a high budget action movie. but will always be a favorite. well mine. I love this movie! by just watching this movie... i felt so happy all day. Leah isn't a usual woman. She lives her life w/ restrictions. She wants to live her life to the fullest you know. i'm not a jew but i can relate to her. She got what she wants in the end Freedom and L.O.V.E. Her journey is so romantic and liberating...",
         "The basic plot about a young religious widow whose unobservant brother in law decides to \"fake\" marry her because he misunderstands Yibum / Halitzah (which by the way -almost always Halitzah- is still practiced and the brother in law doesn't have to be single ) and feels guilty about having lost contact with his suddenly deceased Religious \"rabbi\" (not all religious Jews are Rabbis) brother. Leah the widow agrees because she sees it as an option to get more freedom and control over her life - her mother is pressuring her to remarry and doesn't approve of her wanting to go to collage. This part of the plot while unusual could be believable. As a religious Jew, I found an number things unrealistic or overly omitted. Firstly no mention of Jake's (or anyone's) need to say Kaddish (a prayer in affirming g-d in honor of the dead) for his brother. Little things - like when did Leah change the dishes so she could eat off them and cook in his kitchen. But most unrealistic that Leah would go to a reform synagogue and spend Shabbat with a reform Rabbi woman or not(Reform Jews do not observe the Sabbath in a way Leah would /could identify with and generally do not keep kosher). Judaism is a very family and community based religion. While Leah might have wanted more freedom and might there for have avoided the very closed orthodox type of community she came from... it is more logical and reasonable for her to join a modern orthodox -young Israel community or at lest a conservative synagogue. She apparently found kosher food stores and a kosher Chinese restaurant. Also was a lack of spiritual growth in Jake that could make the meeting of their worlds and hearts more realistic. Again the film and acting was quite good but had there been more development of the growth and changes that were bringing Leah and Jake together it could have been much ,much better.",
         "My wife and I are Orthodox Jews addicted to the Perry Mason of our childhood. We couldn't resist watching Hallmark's presentation of levirate marriage, or yibum, but never expected we could stomach more than 20 minutes of it. The writers and directors certainly get credit for coming up with an original plot device to create romantic tension and resolution. This is Hallmark, after all, and we didn't expect all the dramatic unities to be observed, but we were pleased at the overall high quality of the research, writing and acting. There are Orthodox men who make a living outside the rabbinate, and non-Orthodox Jewish men who aren't cardiac surgeons, but avoiding these clichés might been too distracting. The mystical / romantic motivation was never made quite reasonable, but much worse was the simple fact that marriages religious and secular require sexual consummation in order to be valid. The whole point of yibum is that the wife should get pregnant with her brother-in-law's child and therefore continue her dead husband's family and name. Such a beginning would have ruined the plot and perhaps run afoul of Hallmark's standards and practices. One may quibble about this or that presentation of Jewish religious practice, but on the whole this movie did a good and conscientious job with remarkable few cringe-inducing mistakes. In the end it worked as a romantic comedy/drama which held our attention to the end.",
         "The story line wasn't full of any big surprises but the overall cleanness left my husband and me grinning for the rest of the evening. I Loved the fashionable modesty in this film..... even the non religious characters were dressed more modestly than the average cast. Except for Jake's topless moment there wasn't a lot of skin! I will recommend it to my friends who are picky about this sort of thing Leah's choices for head coverings after she let go of her wig are inspiring for any woman who is thinking of adding this to her way of life. I usually cover my head in public and I was truly blessed to see a film whose leading lady covered head and herself yet remained well groomed and didn't lean too far to the frump. Also, the biblical reference to Jacob and Leahs loveless marriage was fantastic. I doubt most viewers picked up on it but there it's there and that little triumph made it an even sweeter tale. Even my super manly husband said this is one we will enjoy again and again.",
         "To begin with, a real Orthodox Jewish woman, from an Orthodox Jewish community, would not bother making an oven kosher for use if she couldn't count on her own flatmate to try to keep it kosher, or even to know what's kosher and what isn't. She wouldn't go to a swimming pool where men are allowed in at the same time. She wouldn't even hold a conversation alone with a strange man on a rooftop. We're given to understand that the heroine of this film isn't the typical Orthodox Jewish woman anyway, because she likes to sneak out to the movies; but obviously the real reason for her atypical behavior is that without it, the plot of the film could never occur. Also misrepresented is Reform Judaism: a Reform rabbi explains soberly about the interaction between the living and those who have passed on, and although with enough effort you could probably find a Reform rabbi who would say almost anything, I think you would look hard before you found one who claimed that the dead soul goes through experiences, and harder yet before you found one who claimed to know exactly what those experiences are. All that said, what we have here is a well acted film albeit a doubly formulaic one-- formulaic both in the progress of its love story and in its reconciliation of ostensibly incompatible ways of life."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Hallmark Hall of Fame Productions"],
      "summaries": [
         "When his estranged brother dies suddenly, Jake Lever is confronted with an old Jewish custom. In days past, a man was expected to marry his deceased brother's childless widow, but it is now customary to perform a ceremony releasing the pair from the obligation. During the Halizah ceremony, Jake feels uncomfortable renouncing his brother's memory. Additionally, Leah wishes to escape the confines of her orthodox community and avoid her mother's matchmaking. On the spur of the moment, Leah and Jake decide to enter into a platonic marriage of convenience.",
         "A quirky love story revolving around the unexpected wedding and unconventional married life of a 26-year-old widow and her late husband's brother, a handsome 30-year-old cardiologist."
      ],
      "budget": 0
   },
   "movielensId": 80789,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-25",
      "dvdReleaseDate": null,
      "directors": ["Jeff Bleckner"],
      "runtime": 95,
      "movieId": 80789,
      "title": "Loving Leah",
      "mpaa": "",
      "actors": [
         "Lauren Ambrose",
         "Adam Kaufman",
         "Susie Essman",
         "Harris Yulin",
         "Natasha Lyonne",
         "Ricki Lake",
         "Mercedes Ruehl",
         "Tonye Patano",
         "Donnie Keshawarz",
         "Timothée Chalamet"
      ],
      "imdbMovieId": "1346983",
      "originalTitle": "Loving Leah",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A handsome Washington, D.C. doctor and a young New York woman fall in love at an unusual time...after they get married. Leah Lever is married to an Orthodox rabbi, Benjamin Lever, whose brother, Jake is a successful cardiologist and a non-practicing Jew. Jake is stunned when Benjamin dies suddenly, but not as stunned as when he is told that, under an ancient Jewish Law, he is expected to marry the childless Leah to carry on Benjamin's name.",
      "tmdbMovieId": 52221,
      "avgRating": 3.53333,
      "releaseYear": "2009",
      "numRatings": 15,
      "posterPath": "/kwlu0uwLNgIgC8NiLTXEyIq9oy8.jpg"
   }
}