{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0016690",
      "video": false,
      "title": "Brown of Harvard",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tom Brown",
               "gender": 2,
               "credit_id": "535d23ca0e0a264fdb004bd5",
               "name": "William Haines",
               "profile_path": "/lRgJ60XEhdpRAFgoAJHsZuV1y0i.jpg",
               "id": 150638,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jim Doolittle",
               "gender": 2,
               "credit_id": "535d23d70e0a264fe8004e58",
               "name": "Jack Pickford",
               "profile_path": null,
               "id": 97991,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mary Abbot",
               "gender": 0,
               "credit_id": "535d23e40e0a264fe1004d21",
               "name": "Mary Brian",
               "profile_path": "/eU6hUwmXImyNbylwCTKeNtDRDKA.jpg",
               "id": 114767,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Bob McAndrew",
               "gender": 2,
               "credit_id": "59ff47ddc3a36868350469fe",
               "name": "Francis X. Bushman Jr.",
               "profile_path": "/6itMMpLPGK6OkLdrGv5wARIRDUU.jpg",
               "id": 1670560,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Brown",
               "gender": 0,
               "credit_id": "535d24070e0a264fd5004e55",
               "name": "Mary Alden",
               "profile_path": "/nHw8ivrd8YfzDvwpngTXVicRPzH.jpg",
               "id": 8832,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Brown",
               "gender": 2,
               "credit_id": "535d24210e0a264fe8004e5c",
               "name": "David Torrence",
               "profile_path": "/cejygbRMOBNOVy6wlp78P0TddaT.jpg",
               "id": 32139,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Professor Abbot",
               "gender": 2,
               "credit_id": "535d24300e0a264fd8004df3",
               "name": "Edward Connelly",
               "profile_path": null,
               "id": 144050,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Reggie Smythe",
               "gender": 0,
               "credit_id": "535d24440e0a264fd5004e59",
               "name": "Donald Reed",
               "profile_path": null,
               "id": 589726,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Yale Football Player (uncredited)",
               "gender": 2,
               "credit_id": "535d24670e0a264fe50050c0",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bacc3a36847f820ee2b",
               "name": "Jack Conway",
               "profile_path": "/9XtA1YzzVibf1xl907PB9uQYdyi.jpg",
               "id": 82413,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a486973925141031400b698",
               "name": "A.P. Younger",
               "profile_path": null,
               "id": 1313116,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a4869800e0a26489d00cb22",
               "name": "Joseph Farnham",
               "profile_path": null,
               "id": 29965,
               "department": "Crew",
               "job": "Title Graphics"
            },
            {
               "gender": 2,
               "credit_id": "5a4869890e0a26489500c4f3",
               "name": "Donald Ogden Stewart",
               "profile_path": "/eS4tJHSN4fm81yXXiUXnvoRnmGu.jpg",
               "id": 14676,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5a4869b1c3a36818fb00b61c",
               "name": "Rida Johnson Young",
               "profile_path": null,
               "id": 1157628,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.266689,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 117211,
      "vote_count": 3,
      "budget": 0,
      "overview": "Tom Brown shows up at Harvard, confident and a bit arrogant. He becomes a rival of Bob McAndrew, not only in football and rowing crew, but also for the affections of Mary Abbott, a professor's daughter.",
      "similar": [],
      "original_title": "Brown of Harvard",
      "runtime": 85,
      "poster_path": "/ruxxlJVrrtANlSlsPWbUlt01BQP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1926-05-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jack Conway"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Joseph Farnham",
         "Donald Ogden Stewart"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016690/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxMDgwMDY1OV5BMl5BanBnXkFtZTgwMjk0NDIwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Haines, Jack Pickford, Mary Brian | See full cast and crew »"],
      "reviews": [
         "One of the biggest hits of 1926, Brown of Harvard is a exciting comedy/drama featuring regatta and football scenes that gave William Haines the role he needed to become a major star. It's patented Haines all the way: brash smart aleck who takes nothing serious until he is rejected by everyone wises up and becomes a man/hero and wins the girl. No one worked this formula like Haines. A terrific comic actor (Little Annie Rooney with Mary Pickford, Show People with Marion Davies), Haines could swing from comedy to tragedy with a change in facial expression. He is a total joy in this film as he was in Tell It to the Marines (with Lon Chaney) and West Point (with Joan Crawford), where he repeats the formula. Mary Brian is good as the girl, Jack Pickford is very good as the sickly roommate, Ralph Bushman is the rival. Edward Connelly, Mary Alden, David Torrence, Guinn Williams, and Grady Sutton co-star. This film is noted now for its homoerotic relationship between Haines and Pickford and for being John Wayne's film debut as a Yale football player (but I never spotted him). Haines was a top-five box office star starting with this picture through 1932. It's a shame he has been largely forgotten and that most of his films appear to be lost. He was one of the most appealing and talented actors of his time.",
         "as to why this film has such a high rating on the IMDb. Sure, it's okay but it's not all as great as it's cracked up to be. At it's very best, BROWN OF HARVARD is a 7. It's about a college freshman, Tom Brown (William Haines) and his life Harvard. The movie was dragging a bit for a while, but it really picked up in the last 40-30 minutes. Jack Pickford was pretty good as William's nerdy best friend/sidekick, considering he was supposed to be a real ladies' man/ ne'er do well in real life. Mary Brian was fine as the girl Haines falls for. I think the script of Brown of Harvard could've been more interesting. The characters do not do much. William tries out for sports and hits on girls. Jack just good-naturedly listens to anything Haines has to say. Mary Brian stands around for most of the film smiling and occasionally looks slightly indignant. She hardly gets angry when William drops all her groceries on purpose, and doesn't even pay for replacements. If some fresh guy wrecked my groceries that I paid for and didn't even pay for them after he wrecked them I would be very angry, no matter how smooth and handsome he (thinks) he is. And for a while, William Haines' character seemed a bit annoying to me, and came across as a little too self-confident to me. But after a while you can see that the overflowing self-confidence is just something his character uses to hide his weaknesses. Haines was very good. If you are a William Haines fan then Brown of Harvard is really worth seeing. If you are looking for a worthwhile silent college flick I say skip this one for now and watch THE PLASTIC AGE (1924).",
         "I've been intrigued by this film for a while, in part because of the extremely high score here on IMDb -- a 9.0 average with over 300 votes gives it the highest rating of any accessible silent film! How had I not heard of this film before this website? Well, you can't always trust the ratings. This is actually a very good film, preserved quite well if the fine VHS transfer I rented is any indication -- excellent acting by the principals, especially William Haines as Brown, and good location work at Cambridge with some fine action footage in the climactic Harvard/Yale football game -- but the story must have seemed a hoary chestnut even in 1926. Obnoxious, self-centered and charismatic guy goes to school and gets put in his place, becoming in the process a caring, self-sacrificing friend; I doubt people in 1926 found much that was really exciting in the last few reels, the predictability factor is high. Still, it starts out very well, and is certainly deserving of being remembered, if not praised to the heavens. Maybe the previous 350 voters are mostly Harvard men... EDIT Now 600+ voters and the score has actually climbed to 9.2! Seriously, folks, there is ballot-stuffing going on here - I defy anybody to explain why this is a better film than \"Metropolis\" or \"The General\"!",
         "This is an extraordinary film, that tricks you constantly. It seems to be heading toward cliche at several points, and then something astonishing will happen that genuinely startles. It would give away too much to say much more, but stick with this film and you will be richly rewarded. William Haines is absolutely delightful - he is certainly a star that deserves to be re-discovered. The gay subtext in his relationship with Jack Pickford is amazing - there is even a scene where Haines rubs Pickford's chest (Pickford has a cold). Both actors play this sub-text subtlely and with great depth of emotion, so that there are moments that are very moving. And I never thought I could get so involved in a football match as I did in this movie - and I don't even understand the rules! Also excellent is Francis X. Bushman's son Ralph as Haines' rival for the girl (yes, it's not completely a gay movie). Wonderful silent classic - a great example of Twenties commercial cinema with an edge.",
         "This is apparently the second remake of this film, having been filmed before in 1911 and 1918. And, in so many ways it reminds me of the later film, A YANK AT OXFORD. Both films concern a conceited blow-hard who arrives at one of the top schools in the world and both, ultimately, show the blow-hard slowly learning about teamwork and decency. In this film, William Haines is \"Tom Brown\" and his main rival, \"Bob\" is played by Frances X. Bushman. And, in a supporting role is Jack Pickford--always remembered as the brother of Mary. Of these three, Pickford comes off the best, as the sympathetic loser who becomes Tom's pal--he actually has a few decent scenes as well as a dramatic moment just before the Big Game! All the standard clichés are there and the movie, because it was done so many times before and since, offers few surprises. However, it is pleasant film and is enjoyable viewing. In my opinion, for a better silent college film, try Harold Lloyd's THE FRESHMAN--it's football scenes are frankly more exciting and Harold is far more likable and sympathetic than the annoying Tom Brown. THE FRESHMAN is probably the best college picture you can find from the era. Another reason why BROWN AT HARVARD is a lesser picture is that William Haines played essentially the same unlikable and bombastic character with the same plot again and again and again (such as in WESTPOINT and THE SMART SET, among others)--and if you've seen one of these films, you've seen them all. Well made, but certainly NOT original! And, because it is just a rehash of his other films, anyone giving the film a score of 10 is STRONGLY advised to see these other films. 4/25/08==I just checked and saw this this small film was the highest rated film on IMDb from the 1920!! Talk about over-rated! There are dozens and dozens of better films--how this film got to be #1 is anyone's guess.",
         "Brown of Harvard is a hard movie to pin down. We expect a lot more from our movies these days, so it helps to remember that audiences in the 20's were a bit more innocent. William Haines is charming as the rogue who has to stumble through pain and humiliation to find success and, even, glory. All of the relationships in the movie feel very stilted EXCEPT for the homoerotic tie between Billy and Jack Pickford, the town nerd. The movie has everything, romance, tears, love, death, and even sports... It's a great education in how society has changed in the 20th century.",
         "I found it difficult to watch this film with a critical eye, as I have limited experience with the silents. However, it was interesting to think that I was watching the heart throbs of the time, in one of the most popular movies of the time. The story of the relationship between Brown and his bookish roommate was, uh, interesting, but overall the story seemed so unrealistic (a partying slacker who happens to be accomplished at all sports, mysterious and unnamed life-threatening illnesses) that I wondered how such a storyline was accepted in 1926, or anytime. Tips from anyone who knows how to appreciate or analyze a silent despite the hamminess would be appreciated."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Tom Brown shows up at Harvard, confident and a bit arrogant. He becomes a rival of Bob McAndrew, not only in football and rowing crew, but also for the affections of Mary Abbott, a professor's daughter."],
      "budget": 0
   },
   "movielensId": 80827,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-05-02",
      "dvdReleaseDate": null,
      "directors": ["Jack Conway"],
      "runtime": 85,
      "movieId": 80827,
      "title": "Brown of Harvard",
      "mpaa": "",
      "actors": [
         "William Haines",
         "Jack Pickford",
         "Mary Brian",
         "Francis X. Bushman Jr.",
         "Mary Alden",
         "David Torrence",
         "Edward Connelly",
         "Donald Reed",
         "John Wayne"
      ],
      "imdbMovieId": "0016690",
      "originalTitle": "Brown of Harvard",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Tom Brown shows up at Harvard, confident and a bit arrogant. He becomes a rival of Bob McAndrew, not only in football and rowing crew, but also for the affections of Mary Abbott, a professor's daughter.",
      "tmdbMovieId": 117211,
      "avgRating": 2.5,
      "releaseYear": "1926",
      "numRatings": 1,
      "posterPath": "/ruxxlJVrrtANlSlsPWbUlt01BQP.jpg"
   }
}