{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "space race",
            "id": 156836
         }
      ],
      "imdb_id": "tt0062827",
      "video": false,
      "title": "Countdown",
      "recommendations": [
         199503,
         79921,
         49978,
         31517,
         46817,
         46916
      ],
      "backdrop_path": "/vGu2j00ct5lKp0TklQzZiYDDlWd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lee Stegler",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b85",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mickey Stegler",
               "gender": 1,
               "credit_id": "52fe454ac3a368484e051b89",
               "name": "Joanna Moore",
               "profile_path": "/fzSAhMvjKSTy0PNkbehN3OHO5fe.jpg",
               "id": 94889,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chiz",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b8d",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jean",
               "gender": 1,
               "credit_id": "52fe454ac3a368484e051b91",
               "name": "Barbara Baxley",
               "profile_path": "/b3fdCrXnI20ZOuzTnvLc99EoudY.jpg",
               "id": 30610,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Gus",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b95",
               "name": "Charles Aidman",
               "profile_path": "/cZqacx2pDq0CKYYO2ZDGURSHaCb.jpg",
               "id": 61150,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ross Duellan",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b99",
               "name": "Steve Ihnat",
               "profile_path": "/A4Fea7MjorXKnglxKogkLLKb8TX.jpg",
               "id": 16101,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rick",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b9d",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Walter Larson",
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051ba1",
               "name": "Ted Knight",
               "profile_path": "/32OrUdfeRgxmtkbnYbxYDvGoAJs.jpg",
               "id": 71146,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe454ac3a368484e051b81",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ac3a368484e051ba7",
               "name": "Loring Mandel",
               "profile_path": null,
               "id": 136001,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe454ac3a368484e051bad",
               "name": "Hank Searls",
               "profile_path": null,
               "id": 1178133,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.119675,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27441,
      "vote_count": 6,
      "budget": 0,
      "overview": "A scientist (James Caan) replaces a military officer (Robert Duvall) as an astronaut on a space-race moonshot.",
      "similar": [
         157336,
         395992,
         62,
         286217,
         49047,
         2103,
         2067,
         95,
         40430,
         328429,
         274870,
         2900,
         4437,
         568,
         438740,
         871,
         348,
         49529,
         19995,
         126889
      ],
      "original_title": "Countdown",
      "runtime": 101,
      "poster_path": "/8dht1dWzjEAmGjfKxFv11siT3n0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/1i7zSq0ZnZ1XCNkgqUi3M2I4sED.png",
         "name": "Warner Brothers/Seven Arts",
         "id": 4051,
         "origin_country": ""
      }],
      "release_date": "1968-02-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "The motion picture that puts a man on the moon and you follow him every terrifying second of the way.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Altman"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Loring Mandel",
         "Hank Searls"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062827/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MDU4MjI4OV5BMl5BanBnXkFtZTcwODMxMDQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Caan, Robert Duvall, Joanna Moore | See full cast and crew »"],
      "reviews": [
         "\"Countdown,\" Robert Altman's first theatrical release, is the only film I've seen by the prolific director that feels nothing like an Altman project. A bit of history surrounding it reveals that Altman battled the studios over creative control, and that the final version of the film exists more as a product of the studio than of the auteur. Never again, for better or worse, would Altman relinquish control of his films, a tenacity that won him an instantly recognizable style not afforded to many other directors. So \"Countdown\" isn't terribly interesting formally and feels like it could have been directed by anybody, but that's not to say it isn't an interesting movie. Released a year before man actually landed on the moon, it provides a remarkably accurate guess at what such a feat would look like, and the film is played with conviction by a strong cast of actors led by James Caan, Robert Duvall and Michael Murphy. Duvall and Murphy would appear again in \"MASH,\" and Murphy would go on to become an Altman regular. Barbara Baxley, known to Altman devotees as Haven Hamilton's wife in \"Nashville,\" fulfills wifely duties in this film as well, though women may as well not even exist for all the attention the screenplay affords them. As a studio film, \"Countdown\" isn't half bad. As an Altman film, it's one of his weakest. But nevertheless, it's well worth seeking out, especially for fans of the iconoclastic director. Grade: B-",
         "A comment on \"Marooned\", the movie that was made about a moon mission disaster which was released after the Apollo 11 landing but prior to the Apollo 13 real-life disaster, mentioned that the movie is not available on DVD and rarely, if ever, appears on television. I believe that the same is true of this movie (at least regards TV screenings) and it's for the same reason. \"Marooned\" and \"Countdown\" are movies that are so much of their period that they scarcely make any sense at all to 21st Century minds. Of course, we all know about the Cold War, and most cold war movies involve international espionage which is timeless. Countdown is a movie about the Space Race which dominated the daily agenda at least as much as conventional Cold War conflicts like the Korean and Vietnam wars. The plot concerns a situation in which the Soviets succeeded in their aim to send a manned rocket to the Moon before the Americans were ready to fly Apollo. However, contact with the cosmonauts has been lost, and there is still a chance for NASA to fulfill Kennedy's challenge of \"sending a man to the Moon and returning him safely to the Earth\" - as well as the kudos gained from discovering and being the ones to tell the Soviets what happened to their men. An interesting sideline on this is that the actually successful method of moon exploration used, ie send three men to lunar orbit and then two can travel to the surface in a smaller ship, is certainly not the only solution, and this movie explores a different one forced by necessity. Since Apollo is not ready and there is no lunar lander capable of taking off from the moon, why not send a less complex ship with only one man, and let him stay on the moon, kept alive by an environment habitat sent on ahead by unmanned rocket and by provision of supplies by further unmanned ships? Such a scenario had already been envisioned by science fiction authors like Arthur C. Clarke as being the most efficient way to explore our satellite. Certainly nobody had previously imagined that we would send men to the Moon for a matter of a few days in a ship which could not carry more than a few hundred pounds of samples back to Earth. By exploring this other methodology this movie succeeds in highlighting the true nature of our Lunar adventure. The point was not to expand the human frontier or to increase the sum of scientific knowledge - the point was to get a man on the moon and safely back before the Russians did.",
         "Mostly good, solid, well acted (especially by Robert Duvall and James Caan) story of behind the scenes politics among astronauts as we raced Russia towards the moon in the late 1960s. Gets a little soapy at times, some of the politics and science seem a little cheated, and key incidents are convenient and co-incidental. Production values, especially the special effects, are pretty weak. And Caan's astronaut is a little too open with his fears to be believed as a man of his position at that moment in history. On the other hand it's impressive that in 1969 someone made a space movie focusing on complex emotions and human behavior, not technology. The climax is a bit 'Hollywood', although at least a little more bittersweet than usual, if predictable (and a cheat). The small roles are well cast and played. Not really recognizably an Altman film, but certainly shows talent and is worth seeing.",
         "A geologist(James Caan)working for NASA gets the opportunity of a lifetime. Since US government will not allow perhaps a better candidate(Robert Duvall), an \"air-force guy\", to pilot the PILGRIM capsule to the moon, a civilian is needed and Caan is their boy. It's all about beating the Russians to the moon and first-time feature film director Robert Altman takes the helm fashioning it into a matter-of-fact documentary type deal where we see how everything takes place prior to launch. The media swarm, the rivalries(Duvall's Chiz is indeed screwed out of an opportunity), how the families cope, the spent time before that fateful trip, the planning, the testing, the debating on who should be piloting the capsule..everything is shown to us so that we get a clear picture of what it is like in not only the pilot's life, but also those that worry about the mission themselves. I must say this film is exceptionally well made, with an intelligent approach which tries to explain to us the hullabaloo that surfaces at such a historic event and how that effects Caan and his family along the way. It all comes down to that trip, though, that really provides some suspense. It's a curio piece also considering it features Duvall and Caan in the early stages of their careers as well as seeing the beginning of Altman's reign as an unusual artist with his camera placements and how the characters speak to one another(there is some moments where people talk over each other during discussions mainly in the sequences where Caan is in the capsule nearing the orbit of the moon).",
         "Released two months before '2001: A Space Odyssey', and on a soap opera scale compared to that, 'Countdown' comes from a time when movies didn't have to have huge budgets, big stars or auteur directors to get national distribution: I saw it as a second feature (remember them? - to 'Ice Station Zebra', I think, a far worse movie) in one of the now defunct three small cinemas in my home town. It's pretty formulaic, with a 'time clock' plot, a little bit of character play, a fair bit of topicality, and for its time and budget, a reasonable stab at gritty space realism, compared to the stagey, squeaky 'Star Trek' universe that had boldly gone on TV only two years before, and Kubrick's tour de force that was to follow shortly. Interesting as a snapshot of cinema history, with a director and lead actor (and Robert Duvall) who went on to join the A-list, which nobody knew about then. They don't make 'em like this any more; or if they do, they go straight to DVD.",
         "I've just got to throw my 2 cents in. I thought the Countdown was an excellent movie. The acting is what carries it for sure, but the special effects aren't bad either for the time period. I've seen Apollo 13 with Hanks and I thought this picture did a better job of portraying tension, ( although fictitious ) within the capsule. Robert Duvall is a superior actor as is James Caan. The overall dismay he portrays when not picked for the mission, and the subsiquent attempt to discredit Caan is great acting!",
         "It's interesting that I initially had the same reaction as \"anonymous\" did to the lunar lander depicted in the movie. Sure, it looks like a Gemini capsule stuck on top of a descent stage, but guess what? When Altman made this movie, NASA actually had already planned the \"Countdown\" mission AND the Gemini lunar lander, although it was never used. BTW, I read Hank Searl's book \"The Pilgrim Project\" while I was in eighth grade and loved it.",
         "In this film Robert Duvall and James Caan portray to perfection the rivalry between aviators competing for a mission much better than The Right Stuff. The scrubbed astronaut Robert Duvall tries to wash out his replacement James Caan who he must train for the mission he himself desires. The addition of an on-board electrical power shortage in flight foreshadows the actual events encountered during the Apollo 13 mission. Although entirely fiction the film is a time machine that brings back the look and feel of the Space Race era. To see NASA Building 5 filled with Apollo and Gemini simulators is a pure delight. And the chance to experience the The Space Environment Simulation Laboratory in NASA Building 32 is an even greater delight. Unlike other movies the filming in mission control NASA Building 30 shows just how small it actually is. The cinematography in widescreen format using Panavision equipment is flawless. Although as ordered from Warner Archive digitized from a non remastered print it is crystal clear and free of flaws when projected on a 100\" screen. This film is a must have for any aviation and space enthusiast. I should note that there are few special effects in this movie except for some photographic tricks with light to simulate black sky on the lunar surface. All the equipment was actual NASA simulation equipment. There was some stock footage used for the rocket launches. During the space race NASA had contingency plans for a Gemini Lander and a prototype was built. The choice to use one man was because Gemini life support was designed to support two men for 15 days. If a landing was aborted using Earth Free Return life support for one man would be taxed to it's limit.",
         "Not a great film but very much worth it for Altman fans. In many ways it's a conventional cold war drama, but it has some wicked resonances if you see the Robert Duvall astronaut character as what he was surely meant to be: an over the top version of John Glenn: a boy scout rah rah guy who can't stand the much hipper, laid back James Caan, who is a stand-in for the real astronaut Al Shepard. (Wolfe's The Right Stuff, if I recall, has useful material on the mutual distrust between Glenn and Shepard.) Altman tries a few tricks for which he is later famous. The primary one is overlapping dialogue. Altman hated the formal style of traditional films in which everyone speaks in complete sentences and never overlaps. You can see the overlapping here, though not to the degree that comes through in later films like M*A*S*H and McCabe and Mrs. Miller. Still, the innovation was enough to infuriate the studio execs when they began viewing the rough cut. Hey! We can't understand half of what the actors are saying! So they fired Altman about nine-tenths of the way through shooting. Watch closely and toward the end of the picture, you'll see a change in style as the replacement director takes over. It's much more stilted (especially in the press conference). And I recall (though can't be sure at this remove, I haven't seen or read about the picture in decades) that the original ending was a tragedy, which was changed to a happy one instead. The most effective aspect of Altman's interest in sound design was what he did when Caan loses contact with ground control as he approaches the moon. Altman heightens anxiety (Caan is already worried that Duvall is endangering his life) when the radio contact picks up static and it gets hard to hear. Caan begins to feel all alone out there, millions of miles from earth. And so do we, instinctively...we want to hear what Mission Control is saying, and their words keep breaking up. Very clever: using +bad+ sound to make viewers unconsciously uneasy. It's a great way to accomplish your goal on a lower budget project.",
         "The film is interesting although very TV-movieish in many ways (editing, melodramatic score, zooms and pans) but it had some good points nonetheless. Many of the scenes involving characters in conflict were very realistic-people talked over each other, facial expressions, sarcasm, etc. The scene between Ross and Gus was exceptionally well done and very interesting since we had Ross trying to do his job for the government and Gus showing concern about the human element of the project. The training simulations were cool and it seemed many were filmed at NASA or at least recreated in an authentic fashion. This a good movie for Saturday or Sunday afternoon...give it a try and enjoy the acting, script, and low-key TV style film-making."
      ],
      "genres": [
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["William Conrad Productions"],
      "summaries": [
         "When the U.S. learns the Soviets are about to launch a manned mission to the moon, they feel it imperative that they get there first. The moon program isn't ready to launch yet so they decide to send one man in a modified Gemini capsule that will be able to land on the moon. The astronaut will have to stay there for up to a year - in a special built shelter that will be sent ahead of time - until an Apollo mission can rescue him. The obvious choice for the mission is Chiz, who knows the Gemini inside out but the Soviets are sending civilians, not military men, so geologist Lee Stegler is asked to go. He has only three weeks however to learn about the intricacies of the spacecraft and no one is sure if he will make it.",
         "The Apollo 3 crew are training when it is discovered that the Russians plan a moon landing. The Americans enact a makeshift plan to land a man on the moon first, using an older style Gemini spacecraft. Lee is chosen as the astronaut instead of Chiz, who was trained for the mission, because Lee has no military connection. Lee has three weeks to train before take-off, and will have to stay on the moon in a shelter for about a year, until an Apollo is ready to pick him up. However the Russians take off two days earlier than expected.",
         "Desperate to reach the moon first, NASA sends a man and shelter separately, one-way. He must find it to survive; he can't return until Apollo is ready."
      ],
      "budget": 0
   },
   "movielensId": 80980,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-02-01",
      "dvdReleaseDate": "2009-06-22",
      "directors": ["Robert Altman"],
      "runtime": 101,
      "movieId": 80980,
      "title": "Countdown",
      "mpaa": "",
      "actors": [
         "James Caan",
         "Joanna Moore",
         "Robert Duvall",
         "Barbara Baxley",
         "Charles Aidman",
         "Steve Ihnat",
         "Michael Murphy",
         "Ted Knight"
      ],
      "imdbMovieId": "0062827",
      "originalTitle": "Countdown",
      "genres": [
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "duc9W9Bsffo",
         "ThaYmhXARac"
      ],
      "plotSummary": "A scientist (James Caan) replaces a military officer (Robert Duvall) as an astronaut on a space-race moonshot.",
      "tmdbMovieId": 27441,
      "avgRating": 3.09091,
      "releaseYear": "1968",
      "numRatings": 11,
      "posterPath": "/8dht1dWzjEAmGjfKxFv11siT3n0.jpg"
   }
}