{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "leech",
            "id": 2517
         },
         {
            "name": "swamp",
            "id": 4551
         }
      ],
      "imdb_id": "tt0053611",
      "video": false,
      "title": "Attack of the Giant Leeches",
      "recommendations": [
         22749,
         31393,
         112481,
         37464,
         85682,
         100661,
         22741,
         38269,
         34077,
         38260,
         29121,
         63088,
         27625,
         31258,
         109122,
         67716,
         29389,
         37426,
         31123,
         37579
      ],
      "backdrop_path": "/1gDYBtmagI0x7N0rATpG8srRkb4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Steve Benton",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b37d",
               "name": "Ken Clark",
               "profile_path": "/3juksb2A0jrmN1HaYWXVKAkF3rX.jpg",
               "id": 89162,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Liz Walker",
               "gender": 1,
               "credit_id": "52fe444cc3a368484e01b381",
               "name": "Yvette Vickers",
               "profile_path": "/jNutHlchIcGa75cGb7sabT8DNFa.jpg",
               "id": 89163,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Cal Moulton",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b385",
               "name": "Michael Emmet",
               "profile_path": null,
               "id": 89165,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Nan Greyson",
               "gender": 1,
               "credit_id": "52fe444cc3a368484e01b389",
               "name": "Jan Shepard",
               "profile_path": null,
               "id": 83811,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Doc Greyson",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b399",
               "name": "Tyler McVey",
               "profile_path": null,
               "id": 134635,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Dave Walker",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b39d",
               "name": "Bruno VeSota",
               "profile_path": "/aTdZjaPIr7qx3cJM9G1RIXZZ4kK.jpg",
               "id": 98164,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Sheriff Kovis",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b3a1",
               "name": "Gene Roth",
               "profile_path": "/8rH6ysyAEvkjDmjxdNNF4vora00.jpg",
               "id": 101232,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Porky Reed (as Daniel White)",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b3a5",
               "name": "Dan White",
               "profile_path": "/tnwilbvrLDuFtF5boIgTgb8WvKs.jpg",
               "id": 94897,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Lem Sawyer",
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b3a9",
               "name": "George Cisar",
               "profile_path": null,
               "id": 153387,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe444cc3a368484e01b367",
               "name": "Bernard L. Kowalski",
               "profile_path": null,
               "id": 89157,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b36d",
               "name": "Gene Corman",
               "profile_path": null,
               "id": 89158,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe444cc3a368484e01b373",
               "name": "John M. Nickolaus Jr.",
               "profile_path": null,
               "id": 89159,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe444cc3a368484e01b379",
               "name": "Carlo Lodato",
               "profile_path": null,
               "id": 89160,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe444cc3a368484e01b395",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56cee5b79251413e62002032",
               "name": "Daniel Haller",
               "profile_path": null,
               "id": 28236,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56cee5e49251413e59001f18",
               "name": "Leo Gordon",
               "profile_path": "/pd3Nbf2GqNW2800GB4IpTEHkSDf.jpg",
               "id": 95082,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56cee5ec9251413e5f001e60",
               "name": "Leo Gordon",
               "profile_path": "/pd3Nbf2GqNW2800GB4IpTEHkSDf.jpg",
               "id": 95082,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "56cee60a9251413e62002036",
               "name": "Alexander Laszlo",
               "profile_path": null,
               "id": 105479,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.300922,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22718,
      "vote_count": 18,
      "budget": 0,
      "overview": "In a community nearby a swamp, a local dweller sees a couple of giant monsters but nobody believes on his words. Later, the cuckold Dave Walker (Bruno Ve Sota) finds his slut wife Liz Walker (Yvette Vickers) cheating him with his friend Cal Moulton (Michael Emmett). He chases the couple through the swamp, and forces them to jump into the water. The leeches attack them, and the shocked Dave is arrested, accused of murder. Two other locals decide to look for the bodies of Liz and Cal to get the prize of US$ 50.00 per body, and also vanish in the swamp. Finally, Sheriff Steve Benton (Ken Clark) organizes a patrol to investigate the caves under the swamp, finding the lethal giant leeches.",
      "similar": [
         300668,
         256030,
         587,
         808,
         11908,
         2757,
         9326,
         43919,
         18274,
         17918,
         24480,
         38225,
         11414,
         31442,
         488,
         14138,
         33518,
         18990,
         12528,
         472338
      ],
      "original_title": "Attack of the Giant Leeches",
      "runtime": 62,
      "poster_path": "/tTuK2rBQBe8QqYcW533TYuOsyeT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "American International Pictures (AIP)",
         "id": 9266,
         "origin_country": ""
      }],
      "release_date": "1959-10-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "Massive Blood Sucking Monsters!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Bernard L. Kowalski"],
      "runtime": 62,
      "synopsis": "While poaching in the Florida Everglades, Lem Sawyer [George Cisar] fires five shots into a giant leechlike creature, but none of the old boys lolling around in Dave Walker's [Bruno VeSota] General Store will buy that it was anything other than one too many swigs on Lem's jug of moonshine. Besides, there is Dave's slutty she-cat of a wife, Liz [Yvette Vickers], running around in various shades of undress to occupy their conversation. However, when State Game Warden Steve Benton [Ken Clark] comes upon Lem's body, his face covered with marks like those that would be made by the tentacles of a giant squid or octopus, it's apparent that something unnatural killed Lem, and it wasn't an overgrown gater, as Sheriff Kovis [Gene Roth] would have Steve believe. For the next two days, Steve takes his girlfriend, Nan Greyson [Jan Shepard], and a rowboat, and they go searching the back channels of the swamp, but to no avail. Meanwhile, Dave and Liz Walker are having another of their fights. Liz abhors her fat, balding, wimp of a husband. When Dave leaves the store to make a grocery delivery, Liz sneaks out with her current paramour, Dave's best friend Cal Moulton [Michael Emmet]. Liz and Cal end up out in the swamps where they are found in each others' arms by Liz's husband and his double-barreled shotgun. In order to teach them a lesson, Dave chases Liz and Cal through the swamp, firing rounds of shot over their heads until they finally come to a stalemate along the riverbank. Still as mad as a hornet, Dave forces Liz and Cal into the water. When Dave thinks that they've had enough, he tells them to come out of the water, but it's too late. Two giant leeches sneak up behind Liz and Cal and carry them off. When Dave tries to explain to Sheriff Kovis about the creatures, Kovis concludes that Dave shot them both and hid their bodies in the swamp. The next day, they search the swamps but find no bodies, so the sheriff arrests Dave for murder. Later that day, Dave hangs himself in his cell. Nan's father, Doc Greyson [Tyler McVey], suggests that they plant explosives in the swamp in order to bring up the bodies, but Steve refuses on grounds that it would kill all the wildlife in the area and wreck what took nature years to build up. Funny thing is, there is no wildlife. Two old poachers, Sam Peters [?] and Slim Reed [Dan White], both after the $50 finder's fee should they locate the bodies, have gone poking around in the reeds, figuring that gaters have planted the bodies there in order to ripen them for a few days, but they've noticed that even the gaters have disappeared from a part of the swamp that should be crawling with them. Just as they conclude that there really is something suspicious in the swamp and it would be best to get on dry land, the giant leeches overturn their boat and carry their bodies to a cave with an underwater air pocket where they have also taken Liz and Cal so that they can feed at will on their blood. When Steve hears that Sam and Reed have also disappeared, he rounds up a search party and some bloodhounds, and they go searching the swamps again -- but find nothing. The next day, Doc Greyson decides to take things into his own hands. He plants dynamite in the middle of the swamp and sets it off. The blast dislodges the bodies of Cal Moulton, Sam Peters, and Slim Reed. The odd thing is that, although they've been missing for several days and every drop of blood has been drained from their bodies, death only set in a few hours ago. Doc Greyson concludes that the creatures are holding the bodies in some underwater caves, and Liz Walker might still be down there...alive. Steve sends for his friend Mike, who brings along some SCUBA gear. While Mike waits in the boat, Steve takes a speargun and goes looking for underwater caves. Not long after going down, he encounters one of the leeches and shoots it. Liz Walker's body dislodges and floats to the surface. After re-arming himself with another speargun, Steve goes back down to make sure the leech is dead. It's not, so Mike dives in, and together they overpower the creature. Unfortunately, where there is one giant leech, there's probably more, so Steve agrees that the best policy is to dynamite the swamp. They plant charges, blast away, and the bodies of several giant leeches come floating to the surface. As they walk away from the water, the peculiar gurgling sound of another giant leech can be heard among the reeds. [Original Synopsis by bj_kuehl.]",
      "writers": [
         "Leo Gordon",
         "Leo Gordon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053611/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0NTE3MzkxOF5BMl5BanBnXkFtZTcwNjA3NjkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ken Clark, Yvette Vickers, Jan Shepard | See full cast and crew »"],
      "reviews": [
         "Regardless of the rabid fans of MST3K (myself included), attack of The Giant Leeches isn't the horrid film they make it out to be. Certainly it is low budget, but trying to shine through the lackluster production is a film that has some good writing, few plot holes, and exhibits an actual knowledge of the subject (swamps, critters, rednecks who are a danger to themselves and others...). As far as Corman flicks go, this one has a good feel to it. Some drama, tragedy, comedy (well, some that was intentional), and an attempt at a real story. The screenwriter, Leo Gordon, has created a good feel for the south, and is an accomplished (although not great) practitioner of his trade. So, laughs aside, watch this movie again and focus on the plot when you can. There is no hocus pocus, minimal pseudo-science, and some likable characters. Oh yeah, and please don't be a danger to yourself or others...",
         "This unusual blend of Southern white trash and blood-curdling terror features a good narrative, capable performances by most, excellent musical score, and a misty, shadowy, eerie atmosphere. Despite other negative reviews, this and many other small-budget 1950s are continually being released on DVD and video, to the delight (and distributors' profits) of horror fans. Ken Clark is adequate playing the stalwart hero, as a surprising (for is time) ecologically-minded ranger overseeing a Southern bayou swampland. Third-billed Jan Shepard is really the leading lady here, getting more scenes and close-ups than Yvette Vickers, who basically appears in early scenes, than basically disappears. Shepard is earnest and very pretty, and lends semi-feminism to the proceedings, by joining boyfriend Clark in the swamp, seeking murderous radiation-produced mutations. Shepard appears, 1950s style, in her first and last scenes, with her hair down, in an off-the shoulder white dress, well made-up, walking near a swamp! At least she's not in high heels! Vickers is slinky perfection as the adulterous wife of Bruno Ve Soto, another fine actor. Gene Roth as Shepard's doctor father is also convincing. All these are \"finished\" actors, professionals who have amassed many credits through the years. While the leech costumes may disappoint, the unnerving cave scene won't. This film does in 65 minutes what other \"blockbuster\", star-cast thrillers can't.",
         "Them folks down on the swamp there darn gone and got themselves killed or worsen. Yes giant inflatable swamp critters attack and suck the blood out of their victims. Just joking around there folks. Honestly this was much better than I was expecting although it really doesn't hold any surprises(but may cause you to laugh a time or two). Still for a low budget film, I felt it was well-done and benefits from being only 62 minutes in length. I really enjoyed this one.",
         "A village near a swamp faces giant leeches who capture people that wander into their waters. Since the waters usually have alligators, this seems like a fair trade. But the local game warden (Ken Clark), the very archetype of maleness, will not leave those pesky leeches alone. This film is ranked under 3 out of 10 on the Internet Movie Database, with many people having voted a \"1\" (the most popular vote). Believe me, this film is far from a one -- it is actually rather interesting and well put together. Much better than other films with \"giant\" animals and the explanation revolving around \"radiation\" -- and I can especially say this after seeing the rubbish that is \"Beast of Yucca Flats\". It is amusing to see the dynamic between the shop owner (Bruno VeSota) and his wife (Playboy centerfold Yvette Vickers). She seems upset because he calls her \"baby\" every sentence. But the man she is seeing on the side shows up and calls her \"baby\" every sentence, too... so I guess she just does not like fat, balding men. The dialog is actual one of the better parts of this movie. The conversations give the characters more depth than most horror or science fiction films and all the villagers interact quite a bit. Everything is explained and the background is rich. The leeches? Okay, the leeches are cheesy and obviously men in squid suits. But this does not take away from the overall film. In fact,it adds a special flavor that seems appropriate. The reason this film is ranked so low, in my opinion, is the quality of the film. Public domain copies (which look terrible) are easily available, and it is easy to dismiss the film on picture quality alone. Also, it apparently appeared on \"Mystery Science Theater\", and people have a tendency to instantly rank MST3K films as 1 or 2 (for reasons unknown to me). If someone took the time to digitally remaster the movie, I think it would have much better reviews... but who would invest time and money into a public film?",
         "Grotesque gigantic mutant leeches attack and feed on the various local yokels in a seedy Florida stick swamp hamlet. Bernard L. Kowalski directs the admittedly ludicrous premise with admirable seriousness, coaxing solid acting from a sturdy cast, maintaining a steady pace throughout, and ably creating a brooding, spooky and pungently sordid Southern-fried backwoods atmosphere. Leo Gordon's deliciously lurid and melodramatic script plays like a blithely low-rent redneck version of \"Peyton Place\" with ghastly beasts tossed into the mix to spice things up. The colorful hillbilly characters are a real hoot (Gene Roth is especially amusing as a huffy bonehead sheriff). Ken Clark contributes an engaging performance as the stalwart ranger hero. Jan Shepard is equally appealing as Clark's sweet girlfriend. The delectable Yvette Vickers brings an irresistibly naughty \"Babydoll\"ish allure to her juicy role of a brazen hick hussy. 50's B-picture regular Bruno VeSota truly shines as Vickers' angry and obese cuckolded general store manager husband. The monsters are really hokey, but that only adds to the film's considerable schlocky charm. The scenes in an underwater cave with the hideous leeches sucking blood from their luckless shrieking victims are genuinely gross, chilling and even downright disturbing. John A. Nicholaus' stark, gritty cinematography and Alexander Laszlo's shuddery ooga-booga bombastic score are likewise on the money. Good, trashy low-budget 50's creature feature fun that's tons better and more enjoyable than its undeservedly lousy reputation would suggest.",
         "Another of the many giant creature movies from the '50's, this one being somewhere in the middle of the bunch. This time, it's swamp hicks who are being menaced by leeches. Not just leeches, but big, mean leeches! I tell you, it's a load of cheese from beginning to end, but this is what one would expect from a genre movie of this era. It's a movie that leaves you asking, \"why don't the fools just get a pound of salt and waste 'em?\" Anyway, it's an OK effort with some decent acting. But those leeches, oh boy! The monsters are strictly tongue-in-cheek! So, B-movie fans should love this one, it's a wonder it took four years for this movie to make it to Mystery Science Theater 3000. In any event, proceed with caution into the boggy swamps of schlock. ** out of ****",
         "There's just enough of a story and an almost sensible scientific rationale to the proceedings to make \"Attack of the Giant Leeches\" an entertaining hour, though it IS offset by cheesy monster costumes reminiscent of DC Comics' Starro the Conqueror. When the philandering wife (Yvette Vickers) of a saloon owner disappears with her lover Cal (Michael Emmett), the distressed husband (Bruno VeSota) is arrested for their murder, incoherently babbling about some beasts that apparently took them home for lunch. Two backwoods hicks capitalize on the sheriff's reward to locate the bodies and also wind up missing, prompting local game warden Steve Benton (Ken Clark) to get involved in the investigation. Warden Benton staunchly disapproves of setting off a dynamite charge in the swamp, but as is pointed out a number of times by the locals, there is no life left in the swamp to be harmed. Against Benton's advice and warning, Doc Greyson (Tyler McVey) detonates the explosive, which brings the bodies of three of the victims to the surface of the lake, their bodies having been sucked dry of their blood. With Liz Walker still missing, it's theorized that she may still be alive in an underwater cave, held captive by the monsters. To check the theory, Benton tests the waters in diving gear, and in no time at all is engaging one of the creatures in hand to tentacle combat, while the voluptuous Liz Walker seductively slithers into the waters of the swamp to be recovered by the search party. With no doubt as to the threat imposed by the leeches, Benton does the honors of pushing the plunger on the explosive charge that finally defeats (and deflates) the creatures. If you're into grade Z horror of the 50's, \"Attack of the Giant Leeches\" simply begs for just one screening, and it wouldn't be an entirely wasted hour of your time. Then watch it again with a bunch of friends and a slight buzz on to make it even better.",
         "Okay this movie sucks...literally.In some backwoods bayou a couple of poachers disappear. the locals think they're drunk but we know better don't we!There's some sort of varmints in the swamp! A hot little tramp(Yvette Vickers in a stand out role)is running around on her lovesick/foolish husband. While fooling around with her wimpy boyfriend the hubby comes upon them with a shotgun. To scare them he herds them into the swamp.Well the swamp varmints come up and snatch the couple off in front of him. Well the locals don't believe the story(especially the hero who has the personality of a deck chair).He's jailed where he promptly hangs himself.Before too long others start vanishing in the swamp. There is a creepy scene of the leech's victims stacked up in a cave like human groceries.When the leeches start draining the blood of the tramp and others it is very effective too. Problems with this fun piece of trash are numerous.The leading man is a real stiff.He has the acting range of a watermelon. The leeches while creepy also elicit some big laughs.You can see how the costume designer didn't take into consideration the actors would need oxygen tanks.Nice tanks.There also seems to be only two leeches due to a very limited budget.The townsfolk are pretty stupid and you can only wish more of them had fallen prey to the leeches. This movie isn't a classic nor is it as bad as you've heard.A fun way to waste an hour!",
         "Attack of the Giant Leeches is a very fun movie if you like watching B-horror movies to laugh at how poorly they are made and scripted. A few things I learned from this movie: 1) Alligators aren't scared of men or animals but they may be afraid of minerals 2) Game wardens take their wives out on dates while they look for poachers 3) Atomic testing can cause giant mutations of just about anything (OK, OK, I already knew that. Most of these movies are about that.) 4) Women like being called \"baby\" 5) If you're in a boat for 2 days looking for something in the water, then you hear it sloshing around, it's OK to just go home without checking it out. 6) It's OK to have a picnic in a boat while looking for dangerous monsters. 7)Sleezy people always die in the end (I already knew that) 8) Good guys don't need a good reason to take their shirts off (Ok, I knew that, too) The monster costume was so bad I couldn't make out the shape of the leech at all- it looked like what it was- a man in a cheesy suit. I gave the movie a 2 because it really was bad, but don't let that stop you from watching it. It was 64 fun minutes of foolish pleasure from the king of B-horror, Roger Corman",
         "First off, I'm a huge fan/collector of all things weird in vintage cinema. There's a thousand times more charm in the \"Wild, Wild World of Batwoman\" or \"Blood Freak\" 's out there than of any modern day piece of demographically determined dreck that Hollywood currently cranks out of their movie-making machine. Watch any CGI assisted modern day horror film and see just how much \"fun\" you'll have. \"Attack of the Giant Leeches\" is a flick I've watched close to twenty times. \"Good Lord, why?!\" you'll probably ask - and I wish I could tell you! I suppose it's because this movie is one of those little gems that just grows on you on repeated viewings. Most of the characters come off as \"Deliverance\" locals, extra-light. Being a northerner (from Canada, actually) I find something very compelling about movies based in the deep south. Much of the horror from \"Texas Chainsaw Massacre\" for example, is derived from this unfamiliarity of culture. Although \"Leeches\" isn't at all frightening, it IS creepy - all the more heightened if you're viewing it on one of the numerous grainy public domain DVD/VHS releases. In fact, that's the ONLY way to watch this film! I won't bother retreading the plot, but this film is paced briskly and has a short enough running time (what's with that ending, anyhow? ha-ha) to keep you entertained throughout...that is, if you're somebody who doesn't demand $110 billion dollar effects and will take the film for what it is. I suppose if you're reading this, you're probably a fan of old horror/sci-fi anyways. One of my personal faves...I say 8/10 on the old-time family fun-o-meter! Yvette Vickers is a total cutie as well!"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["American International Pictures (AIP)"],
      "summaries": [
         "After local-moonshine swilling trapper Lem Sawyer sees a giant creature, people start disappearing. While searching for illegal traps Steve Benton and Nan Greyson, his girl-friend find Lem dying with giant sucker wounds on his body. One couple Liz Walker and Cal Moulton, forced into the water by her enraged husband Dave Walker, gets taken by the leeches. When police refuse to believe Dave's story, he hangs himself. Soon after this, 2 more trappers disappear, the local Game Warden Steve Benton gets involved. He and Nan's father Dr Greyson realize that the people were taken by the leeches and the leeches live in caves under the swamp. Using dynamite, the 4 missing bodies are discovered and the leeches are destroyed.",
         "In a community nearby a swamp, a local dweller sees a couple of giant monsters but nobody believes on his words. Later, the cuckold Dave Walker finds his slut wife Liz Walker cheating him with his friend Cal Moulton. He chases the couple through the swamp, and forces them to jump into the water. The leeches attack them, and the shocked Dave is arrested, accused of murder. Two other locals decide to look for the bodies of Liz and Cal to get the prize of US$ 50.00 per body, and also vanish in the swamp. Finally, game warden Steve Benton organizes a patrol to investigate the caves under the swamp, finding the lethal giant leeches."
      ],
      "budget": 70000
   },
   "movielensId": 8138,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-10-01",
      "dvdReleaseDate": "2002-08-27",
      "directors": ["Bernard L. Kowalski"],
      "runtime": 62,
      "movieId": 8138,
      "title": "Attack of the Giant Leeches",
      "mpaa": "",
      "actors": [
         "Ken Clark",
         "Yvette Vickers",
         "Michael Emmet",
         "Jan Shepard",
         "Tyler McVey",
         "Bruno VeSota",
         "Gene Roth",
         "Dan White",
         "George Cisar"
      ],
      "imdbMovieId": "0053611",
      "originalTitle": "Attack of the Giant Leeches",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "2uuO0m8ZHdg",
         "bdoyyjjJkKU"
      ],
      "plotSummary": "In a community nearby a swamp, a local dweller sees a couple of giant monsters but nobody believes on his words. Later, the cuckold Dave Walker (Bruno Ve Sota) finds his slut wife Liz Walker (Yvette Vickers) cheating him with his friend Cal Moulton (Michael Emmett). He chases the couple through the swamp, and forces them to jump into the water. The leeches attack them, and the shocked Dave is arrested, accused of murder. Two other locals decide to look for the bodies of Liz and Cal to get the prize of US$ 50.00 per body, and also vanish in the swamp. Finally, Sheriff Steve Benton (Ken Clark) organizes a patrol to investigate the caves under the swamp, finding the lethal giant leeches.",
      "tmdbMovieId": 22718,
      "avgRating": 1.96094,
      "releaseYear": "1959",
      "numRatings": 64,
      "posterPath": "/tTuK2rBQBe8QqYcW533TYuOsyeT.jpg"
   }
}