{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "cocaine",
            "id": 2150
         },
         {
            "name": "paranoia",
            "id": 2340
         },
         {
            "name": "heroin",
            "id": 2671
         },
         {
            "name": "cold turkey",
            "id": 2694
         },
         {
            "name": "assignment",
            "id": 4967
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "undercover cop",
            "id": 11199
         },
         {
            "name": "theft",
            "id": 14604
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "narcotics cop",
            "id": 155799
         },
         {
            "name": "dealer",
            "id": 199029
         }
      ],
      "imdb_id": "tt0102820",
      "video": false,
      "title": "Rush",
      "recommendations": [
         39787,
         21309,
         44895,
         31924,
         38980,
         32029,
         88448,
         41944,
         51927,
         14662,
         28047,
         7015,
         26555,
         41480,
         43780,
         15402,
         32969,
         28028,
         353125,
         30180
      ],
      "backdrop_path": "/wSJySDCtO5CHYi1hiZBxf28XJLa.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "579db2689251412752000295",
         "content": "I'm going deeper underground!\r\n\r\nRush is directed by Lili Fini Zanuck and adapted to screenplay by Peter Dexter from the Kim Wozencraft novel. It stars Jason Patric, Jennifer Jason Leigh, Sam Elliott, Max Perlich and Gregg Allman. Music is by Eric Clapton and cinematography by Kenneth MacMillan.\r\n\r\nTwo undercover narcotic cops get on a downward spiral that they may not return from...\r\n\r\nSet and filmed in Texas, Rush is a hot, sweaty and claustrophobic neo- noir. It maybe doesn't have the classic visual tics of yesteryear, but it has photographic style to burn - with Clapton's score suitably melancholic, which in turn is something that sits perfectly with the perpetual sense of doom that pervades the pic. Corruption and addiction lead the way, all while love tries its hardest to break on through to the other side, but we are on a bus to noirville, and noirville is an unforgiving place...\r\n\r\nPatric and Leigh are damn fine actors if given the right material to work with, and they carry this with aplomb. Sadly, Allman is a weak villain, maybe because he looks like a Rick Wakeman clone?! While under using Sam Elliott is just a plain waste. However, this deserves its place on neo-noir lists. It is deliberate in pacing, therefore asking for you to buy into the thematics at work, to let them itch your skin, but to do so has rewards, for in true noir style it doesn't chicken out once the end credits have rolled. 7.5/10",
         "url": "https://www.themoviedb.org/review/579db2689251412752000295"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jim Raynor",
               "gender": 2,
               "credit_id": "52fe43dfc3a368484e00321b",
               "name": "Jason Patric",
               "profile_path": "/1WxY2kcQqx9gHloTmRuY5ta3Nje.jpg",
               "id": 12261,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kristen Cates",
               "gender": 1,
               "credit_id": "52fe43dfc3a368484e00321f",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dodd",
               "gender": 2,
               "credit_id": "52fe43dfc3a368484e003223",
               "name": "Sam Elliott",
               "profile_path": "/f2AxZZ6d0Cit0tmf6wYTHcGfwT9.jpg",
               "id": 16431,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Walker",
               "gender": 2,
               "credit_id": "52fe43dfc3a368484e003227",
               "name": "Max Perlich",
               "profile_path": "/baFBjA3vKNqZCbXrJepVweeLj3d.jpg",
               "id": 7268,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gaines",
               "gender": 2,
               "credit_id": "52fe43dfc3a368484e00322b",
               "name": "Gregg Allman",
               "profile_path": "/jYabbwXyNpxfaRCfJ9BUfJaeq5n.jpg",
               "id": 85880,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "52fe43dfc3a368484e00323b",
               "name": "William Sadler",
               "profile_path": "/nnr5u5lTL9cScrMSKV5MwslgSnn.jpg",
               "id": 6573,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43dfc3a368484e003231",
               "name": "Lili Fini Zanuck",
               "profile_path": "/qowwpTsd4cJAlmdi7Bb4tARL3IP.jpg",
               "id": 5707,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dfc3a368484e003237",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "547ff6b0c3a36829a700137a",
               "name": "Kim Wozencraft",
               "profile_path": null,
               "id": 1393952,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "547ff6c6c3a368299f000e64",
               "name": "Peter Dexter",
               "profile_path": null,
               "id": 28938,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.378381,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20289,
      "vote_count": 53,
      "budget": 0,
      "overview": "Undercover cop Jim Raynor (Jason Patric) is a seasoned veteran. His partner, Kristen Cates (Jennifer Jason Leigh), is lacking in experience, but he thinks she's tough enough to work his next case with him: a deep cover assignment to bring down the notoriously hard-to-capture drug lord Gaines (Gregg Allman). While their relationship turns romantic during the assignment, they also turn into junkies, and will have to battle their own addictions if they want to bring down Gaines once and for all.",
      "similar": [
         16980,
         796,
         9777,
         979,
         627,
         319,
         180863,
         12271,
         4995,
         6075,
         703,
         44214,
         273481,
         106646,
         86331,
         49524,
         122081,
         1643,
         10474,
         226
      ],
      "original_title": "Rush",
      "runtime": 120,
      "poster_path": "/1euLGu3gg3eHmnhBZXAFN2x1pFG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Zanuck Company",
            "id": 80,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-12-22",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "How far do they go before they've gone too far?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lili Fini Zanuck"],
      "runtime": 120,
      "synopsis": null,
      "writers": [
         "Kim Wozencraft",
         "Peter Dexter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102820/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NzQ5NzIxM15BMl5BanBnXkFtZTcwMjI0NzI5NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Patric, Jennifer Jason Leigh, Sam Elliott | See full cast and crew »"],
      "reviews": [
         "I watched this only because Sam Elliott was in it, expecting little from Patric & Leigh, whom I looked upon as TV-quality lightweights. I was quite wrong -- both can act with great strength when given a quality script (a rare item in Hollywood). This is an intense, driven tale about undercover cops firmly entangled in the drug underworld, with the criminal activity and hypocrisy evenly spread between the cops and the dealers. The accuracy of this portrayal and the obvious futility of the \"War on Drugs\" explain why this film was hammered loudly by the police departments, newspapers and mainstream critics. To anyone who hasn't spent time around serious junkies this film will be a bit of a jolt, but it's the best and most honest portrayal of this world ever put on film. This is definitely not your standard two-cop \"buddy\" films that spew forth so often from the Hollywood colon. The story is not predictable, nor is the ending....nor the ending after that ending. Scripts like this are jolting because they make you realize just how awful most of the other films actually are. Some of the secondary actors turn in surprisingly nice jobs here. Sam Elliott turns in his usual good work, always enjoyable, but several others are well worth mention: Max Perlich, the pathetic little snitch, and Gregg Allman, who with almost no dialogue does a very convincing portrayal of a malevolent local crime kingpin. This is one of those rare movies where the soundtrack is worth owning. Eric Clapton does a superb score, and his selection of music for the saloon and drug den scenes is masterful. I've watched this three times, each a few years apart, and it gets better each time. The film doesn't have rely on fancy car chases, lengthy gunfights or comic relief. It's simply a fine film done by craftsmen -- a rare treat indeed.",
         "'Rush' is a very powerful and moving drama complimented by some of the greatest acting performances of the stars' careers. Patric and Leigh are the most notably outstanding actors as a duo of undercover narcotic police officers delving into the illegal drug world of a small town in Texas. There were a few problems, though, in this film. Small parts of the film's dialogue are flawed and the pace gets too choppy at many points. Nevertheless, 'Rush' remains a great example of what dramatic scenes and acting should be. Highly recommended for drama movie lovers.",
         "For those who claim this film unrealistic, mind you it is based on a true story. I hail Rush as one of the most powerful and emotional films to ever portray addiction. The characters coupled with Pete Dexter's realistic and sincere dialog paint a very sad, yet human picture of our culture. Our need to punish crime, yet our inability to steer 100% clear of it, is one of many themes intertwined with Rush's story. This film is a fine example of true filmmaking. There are no big effects, no trick stunts, yet one cannot turn away from the screen. Everything from the sutle production design to Eric Clapton's score make Rush a true modern classic.",
         "Rush was a controversial film upon it's initial release. Scenes depicting drug use by police officers were denounced by the usual Fraternal Orders and right wing cranks. Those scenes are only part of what makes Rush such a memorable experience. Good performances from Jennifer Jason Leigh as a starry eyed rookie narc, Sam Elliott as her burned out boss, and especially Max Perlich as a construction worker making some extra bucks in the drug trade anchor a film that makes a mockery of our vain attempts to somehow end the importation and use of these illegal substances. When does use change into addiction? How far will we go to stop people from abusing their bodies, and how many lies must be told in the process? Rush is a brave and provocative film that tells it's story without histrionics, a minimum of gunplay, and a dearth of sensationalism...despite what Officer Friendly may say about it.",
         "Rush was definitely interesting to watch, though not always pleasant to look at. Set amidst the war on drugs, this film challenges us to rethink this battle. Are the wasted resources really worth the hypocrisy and corruption that go hand in hand with the arrests? The movie was not extraordinary, but I did go away haunted by many of the prevalent themes. The relationship between the two undercover agents was very intriguing. I would have liked to have seen a bit more development before they became so involved, but nevertheless, their support of each other, alone in a world they don't belong in, is very interesting. Their different descents, and partial ascents accross the blurred line of addiction gives merit to the portrayal of this affliction. I would definitely recommend Rush for those who have second thoughts about the war on drugs. This film shows us that the worlds of the law breakers and the law enforcers may not be so far apart after all.",
         "I saw \"Rush\" yesterday and it surprised me completely. I haven't seen so powerfully dedicated acting in a long time! In \"Rush\" two undercover police officers (soulful pair Jason Patric and Jennifer Jason Leigh) who are trying to bust every big drug dealer in Los Angeles. But there is a fine line of becoming a drug addict when you are acting to be one... Is it save to use drugs in the name of good intentions? Lili Fini Zanuck directed (and her spouse Richard D. Zanuck produced) Jason Leigh and Patric with a touch of a combination of rough and soft at the same time. The pair gives performances which are strong and morningly present, too. Probably their career's best roles. The pair supports the story and are the strength of whole movie. I was blown away. Jason Leigh and Patric really had the unspoken chemistry. That isn't easy to achieve. They were very impressively convincing. Although of the rough subject of the movie the love story rises behind it. If your partner is screwed than so are you, Patric's character Jim Raynor says to Kirsten (Jason Leigh) about their under-covering. Yes, it is true but I think that Kirsten would have done whatever Jim would have wanted her to do even she was so strong individual. It is a notion of overcoming love. I really loved the feeling of the seventies in the movie. The music (composed by guitar-wizard Eric Clapton), clothes and the spirit was so '70s (my favorite decade even I wasn't been born yet). After happy hippie-sixties, the golden era of drug-using was behind and the drug-busting was just begun. If the using was so free in the '60s in the '70s it was spreading more fluently and the criminality was increasing. The movie shows that how dangerous it is to be close encounter with the drug dealers. The movie has R-rating here in Finland and some other countries too and it is definitely rough and tough although there is a softer side. But I am sure that the drug addicts life isn't so pretty so \"Rush\" feels very authentic and real. \"Rush\" was surprisingly good movie which held me throughout the whole movie. I highly recommend it.",
         "While no masterpiece, \"Rush\" is an offbeat, well made film set in the early '70's centering on the efforts of some Texas cops to bust supposed drug dealer Greg Allman -- at all costs. All of the actors perform well -- Jason Patric gives a particularly intense performance as the once idealistic officer who has obviously stayed undercover too long. Great score by Eric Clapton. I really have no idea why this fairly unconventional film (gee, maybe that was the reason -- it wasn't a formulaic cop/buddy movie) did not receive more acclaim. 7/10.",
         "I was about 21 when i first saw the movie Rush.. and i just fell in Love (well maybe not love, but close..) with Jason Patric. The mix between him and Jennifer Jason Leigh was wonderful. And adding Sam Elliot to the show was like icing on the cake. Then adding Max Perlich and Gregg Allman gave this movie the perfect cast. It was a movie that people could relate to b/c the writers and directors didn't dress it up to be something that it wasn't. They made a real life situation seem not only realistic, but interesting and informative as well . I felt like i was there with them the whole time, going through the motions like they were. I've watched this movie many times and it is by far my favorite movie,, never have i found a movie that can match the feelings that this one gives me. I say great job to all who where involve. It is an amazing movie and a must see. Truly what a movie should be. Thanks for listening, Angel",
         "Rush does not have my favorite atmosphere, that of big belt buckles, long hair, cowboy hats, and barrelhead bars. Not a fan. But, the film is very powerful. It's directed with a very discerning pace and clearcut, head-on reception of every emotion and tension released by every scene by Lili Fini Zanuck. Because of this, the film, which some say is not so action- packed, is actually brimming with action. The action doesn't largely involve guns or chases or fights but involves a harrowing ride through the attacks of libido and paranoia of drug addiction. The film is a masterpiece of direct film-making. Not only is Zanuck's aforementioned style barefaced and precise, the story is the reality of a deep cover narcotics operation. Hardly any connection with the outside world at all, the acclamation to hard drugs, the dangerous risk taken by the chemistry between the narcs working together, and the unexpected traumatic, malicious confrontations that turn out to be the most harrowing and affecting experiences on the whole. Jason Patric and Jennifer Jason Leigh make for a surprisingly very intense duo. Patric delivers a gem of a performance as a dark, hardened cop who reaches the peak of every alarming human extent. Leigh, as the straight man so to speak in that particular area, delivers on quite a sensitive note. Also, having been scarred by her maddening irritating side in The Hudsucker Proxy, I was happy to see her in a performance where she did not go over the top and stayed at the level that made her stand out quite a lot. And, on a side note, I had no idea she was so hot. Her body, especially around the level of the hips and thighs, is perfection rarely so magnified. Watch for the scene in the apartment where she's wearing jeans and a black shirt. You'll sweat till your clothes stick. Rush has what one wouldn't expect from a film like it, and that is a villain that is an added bonus in every way. We see him only as silent punctuation at the beginning, middle, and end. He is elusive, smarter than any of his partners, calculating, all underneath that long Texas hair of his. From the start, we are presented with a man who only appears to all that come in contact with him to be no different, wearing boots, the accent, everything I said at the top, the like, but beneath the appearance is someone who knows the trouble and chaos those who try to catch him throughout the film are about to go through and smirks inside about it.",
         "Although this story isn't about the average person's everyday life, in my opinion this film is one of the most realistic and interesting movies I have ever viewed. This tale takes place in Caterly, TX where two undercover detectives have found their chance to make a difference, but after becoming involved in this world they realize that right and wrong is not always black and white. This film is very close to my heart. There are no cheesy lines that you only here in movies where you find yourself thinking \"who really talks like that?\" The emotions displayed by these characters come across the screen as guanine and hit you where it hurts. Most of all this movie has an unbelievable soundtrack including hits from Jimi Hendrix and Eric Clapton."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Zanuck Company, The"
      ],
      "summaries": [
         "Raynor is an undercover narcotics cop. For his next assignment he chooses the more inexperienced but tough and good-looking Kristen. Their ultimate target is Gaines, a renowned but very elusive drug dealer. While doing their work they unexpectedly fall into a morase of drug-addiction and fall in love with each other. Despite subjecting themselves to the life of low class, one track junkies they do not get the evidence they want to convict Gaines, and instead are forced into using false evidence in court.",
         "Two small town Texas cops go undercover to catch a major drug dealer and are sucked into the drug culture, compromising their assignment."
      ],
      "budget": 0
   },
   "movielensId": 8158,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-12-22",
      "dvdReleaseDate": "2002-12-03",
      "directors": ["Lili Fini Zanuck"],
      "runtime": 120,
      "movieId": 8158,
      "title": "Rush",
      "mpaa": "R",
      "actors": [
         "Jason Patric",
         "Jennifer Jason Leigh",
         "Sam Elliott",
         "Max Perlich",
         "Gregg Allman",
         "William Sadler"
      ],
      "imdbMovieId": "0102820",
      "originalTitle": "Rush",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["3poimzNM5SY"],
      "plotSummary": "Undercover cop Jim Raynor (Jason Patric) is a seasoned veteran. His partner, Kristen Cates (Jennifer Jason Leigh), is lacking in experience, but he thinks she's tough enough to work his next case with him: a deep cover assignment to bring down the notoriously hard-to-capture drug lord Gaines (Gregg Allman). While their relationship turns romantic during the assignment, they also turn into junkies, and will have to battle their own addictions if they want to bring down Gaines once and for all.",
      "tmdbMovieId": 20289,
      "avgRating": 3.50209,
      "releaseYear": "1991",
      "numRatings": 478,
      "posterPath": "/1euLGu3gg3eHmnhBZXAFN2x1pFG.jpg"
   }
}