{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1725156",
      "video": false,
      "title": "Scared Shrekless",
      "recommendations": [
         13394,
         51256,
         118248,
         25472,
         25523,
         83201,
         58508,
         57718,
         53985,
         50393,
         128914,
         54482,
         161143,
         10258,
         13931,
         82881,
         210599,
         67125,
         64170,
         82530
      ],
      "backdrop_path": "/w6LakNLInxevoDbq3chl4huqpUl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Shrek (voice)",
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b73",
               "name": "Mike Myers",
               "profile_path": "/sa8MMxXZrHgQ85hTAP11WS4N3ik.jpg",
               "id": 12073,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Princess Fiona (voice)",
               "gender": 1,
               "credit_id": "52fe4767c3a36847f8133b77",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Puss in Boots (voice)",
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b7b",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 2
            },
            {
               "cast_id": 1,
               "character": "Donkey (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b4f",
               "name": "Dean Edwards",
               "profile_path": null,
               "id": 98396,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Gingerbread Man / Muffin Man (voice)",
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b5b",
               "name": "Conrad Vernon",
               "profile_path": "/kSyVrs8NtLoQhfBXFBhnTWzC7Vm.jpg",
               "id": 12080,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Sugar (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b7f",
               "name": "Kristen Schaal",
               "profile_path": "/rn84XtsczLSvJOWWNXLocaLx2df.jpg",
               "id": 109869,
               "order": 5
            },
            {
               "cast_id": 2,
               "character": "Pinocchio / Three Pigs (voice)",
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b53",
               "name": "Cody Cameron",
               "profile_path": "/tEVQtTHkBPuqUzER8mvDyy6NaVO.jpg",
               "id": 12095,
               "order": 6
            },
            {
               "cast_id": 3,
               "character": "Blind Mice (voice)",
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b57",
               "name": "Christopher Knights",
               "profile_path": "/Ut3gyVRUhEn17gAJ4THnahs0fg.jpg",
               "id": 12097,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Wolf (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b5f",
               "name": "Aron Warner",
               "profile_path": "/8VFfsfSRKabBgRQOZ344kEgy7RX.jpg",
               "id": 12106,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Ogre Baby (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b6b",
               "name": "Miles Bakshi",
               "profile_path": "/6yHLUKaezNn5IJUMnHAtbtTd4BE.jpg",
               "id": 76743,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Ogre Baby (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b6f",
               "name": "Nina Zoe Bakshi",
               "profile_path": null,
               "id": 76744,
               "order": 10
            },
            {
               "cast_id": 6,
               "character": "Creepy Clockwork Chorus (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b63",
               "name": "Patty Cornell",
               "profile_path": null,
               "id": 140970,
               "order": 11
            },
            {
               "cast_id": 7,
               "character": "Creepy Clockwork Chorus (voice)",
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b67",
               "name": "Susan Fitzer",
               "profile_path": null,
               "id": 76741,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Teenager (voice)",
               "gender": 2,
               "credit_id": "58900dd89251413f33002782",
               "name": "Gabriel Basso",
               "profile_path": "/rHD6iBvmAYOtyFaV0wXJMvYZrMU.jpg",
               "id": 222122,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Teenager #2 / Teenager #3 (voice)",
               "gender": 2,
               "credit_id": "58d874dd9251411fd5061fed",
               "name": "Devon Werkheiser",
               "profile_path": "/42pBiBllRY9aFbVBecG5KiFSocK.jpg",
               "id": 127725,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b85",
               "name": "Gary Trousdale",
               "profile_path": "/naRhdLVuw6a8KtDPM2aJWPhPjsp.jpg",
               "id": 62047,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b8b",
               "name": "Raman Hui",
               "profile_path": "/BmPYRLBeb2Ln881ihfemK1lo4w.jpg",
               "id": 12099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4767c3a36847f8133b91",
               "name": "Sean Bishop",
               "profile_path": null,
               "id": 64446,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4767c3a36847f8133b97",
               "name": "Gary Trousdale",
               "profile_path": "/naRhdLVuw6a8KtDPM2aJWPhPjsp.jpg",
               "id": 62047,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5549114f92514104ba0001fa",
               "name": "Michael Isaak",
               "profile_path": null,
               "id": 1463252,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.455999,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48466,
      "vote_count": 107,
      "budget": 0,
      "overview": "Shrek challenges Donkey, Puss in Boots and his other fairy tale character friends to spend the night in Lord Farquaad's haunted castle, telling scary stories to see who can resist becoming scared and stay the longest.",
      "similar": [],
      "original_title": "Scared Shrekless",
      "runtime": 21,
      "poster_path": "/tDoLNXLKoEUoLOL0FPjpBE0SGaV.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [{
         "logo_path": "/kP7t6RwGz2AvvTkvnI1uteEwHet.png",
         "name": "DreamWorks Animation",
         "id": 521,
         "origin_country": "US"
      }],
      "release_date": "2010-10-28",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Gary Trousdale",
         "Raman Hui"
      ],
      "runtime": 26,
      "synopsis": "Shrek and company attempt to scare each other with spooky tales.",
      "writers": [
         "Gary Trousdale",
         "Sean Bishop"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1725156/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MjE4NjMyOV5BMl5BanBnXkFtZTcwODkzMDg5NQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Mike Myers, Cameron Diaz, Antonio Banderas | See full cast and crew »"],
      "reviews": [
         "I marvel at how much Dreamworks has exploited their Shrek franchise. I mean, how many movies, specials and short films can they make until enough is enough? While I clearly am worried about the future of the series, I must admit that despite everything, \"Scared Shrekless\" clearly has gorgeous CGI. So, despite being a short and having a substitute voice for Fiona, it is still amazingly nice to look at and features a lot of what made the other films enjoyable. The episode is set at Halloween. Many of the old storybook characters come to Shrek's house to celebrate and tell scary stories. The Gingerbread Man tells a story about his mate--how he and a crazed baker made what SEEMED like the perfect partner. But, things go awry and the story is frighteningly cute. Then, Puss tells a story that is clearly inspired by \"Psycho\". But, again and again, Donkey keeps interrupting the story--making a mess of it and forcing Puss to tell what REALLY happened. Finally, Shrek tells a story he says is a cute version of \"The Exorcist\". All in all, I was surprised that I enjoyed this film as much as I did. All three stories were very enjoyable and worth seeing...surprise! Nice, light viewing for the entire family.",
         "This 20-minute short film from 2010 is so far the last entry to the hugely successful Shrek franchise and was released shortly after the fourth film 5 years ago. And looking at it, you would not even guess that the franchise is apparently in decline. This Halloween special was lots of fun. The gang are having a contest, during which they will tell each other stories and the one who is scared last wins. It looks like Donkey proves a worthy opponent for Shrek, but the real highlight were the stories, who were actually pretty creepy, especially the Gingerbread Man story with his girlfriend. The reference on \"The Exorcist\" was nice as well. Competent short movie I have to say. The director, by the way, is the guy who also directed \"Beauty and the Beast\" a long time ago. Gary Trousdale also came up with the script together with a handful other guys. If they manage to keep that level, I would not even mind if they make a fifth Shrek feature film. Will they? Who knows? However, about this short film here, it was a success. It got several nominations from the Annie Awards and deservedly so. I enjoyed watching it and recommend it.",
         "Scared Shrekless (2010) *** 1/2 (out of 4) Highly entertaining 21-minute short takes place on Halloween as Shrek proudly teaches his kids the proper way to scare people. This gets the \"group\" discussing how they might be able to scare Shrek and this is when donkey, the gingerbread man and Puss in Boots tell their scary stories. It seems some people thought that the later SHREK films weren't all that good but I must say that I found this short to be extremely good and I think it's so good that it'll probably appeal to more horror film buffs than actual SHREK fans. I say that because the film has some wonderfully clever homages to older films like PSYCHO and THE EXORCIST and I think both of them work tremendously well. The stuff dealing with Puss in Boots and PSYCHO were highly entertaining and especially when Donkey got involved. Another great moment happened when Shrek tells his story of a possessed Pinocchio. The animation, as you'd expect, is top-notch as are the vocal performances with everyone really giving it their all and delivering fun performances. Obviously there's nothing here too scary that kids won't be able to watch it but I do wonder how many young ones will recognize the films that are being paid homage to. Either way, adults and especially those who enjoy horror movies should really enjoy this.",
         "Scared Shrekless is a brilliant Halloween special, of the two Dreamworks specials(the other being the Monsters vs Aliens one) this is the better one of the two. Gorgeously animated(the backgrounds are always colourful yet wonderfully atmospheric at times too) with creepy music, hilarious, witty writing, inspired storytelling, all our favourite characters at the top of their game(especially Puss and Gingerbread) and great voice acting(even with the replacement of Eddie Murphy for Donkey's voice). The special is made up of three parodies, the best being the parody of Bride of Frankenstein with Gingerbread, hysterically funny, full of creepy atmosphere and often cute. Shrek's Exorcist parody was also amusing and effective in its creepiness, if not quite as terrifying as the real thing(understandably). Puss and Donkey's Psycho parody was good, it was funny with great voice work and storytelling, only let down by a couple of Donkey's comic interruptions, occasionally coming across as forced. Overall though, Scared Shrekless is brilliant, if you love the first two films(I do) or love horror(the more I see the more I highly appreciate it) you will love it. 9/10 Bethany Cox",
         "This was based off of the fourth in the series, I thought. But regardless, it was very well made considering that the fourth one was pushing it. Heck the 3rd one pushed it. It was basically a bunch of the guys coming together for a challenge to decide who's the best story teller. I loved each character's variation, and the puss in boots and donkey story which was changed constantly. And Shrek's was pretty good as well. The ending was really funny and I wasn't expecting it, haha. The thriller bonus video was pretty good as well as I got it on DVD. I liked it and thought it was well made and funny! Rated 8/10.",
         "To be honest I went into this movie a little deflated expecting a cheap, run of the mill Halloween episode designed only to milk the last bit of magic from the Shrek franchise. As with Shrek the Halls I was completely wrong. It was excellent. You can kind of tell that Eddie Murphy isn't there, but it doesn't matter his replacement does a fine job. Scared Shrekless sees our favourite characters head to Lord Farquad's mansion to see who can stay the night while telling scary stories. We get a pretty chilling song from the information booth (Tuloc is a creepy place) that from the very start sets the scene. We then head right into the action hearing Ginger Bread's, Donkey and Puss and Shrek give three parodies of horror movies. The first and the third are definitely creepy; Puss & Donkey's tale is somewhat lacking and much more comic then those two. However that being stated all three stories all three stories present a weird demented dark humour that will have you laughing like you did way back in Shrek 2. The final scene we're Shrek is left alone with Donkey gives us what Shrek is really about as Shrek uses his ogre abilities (with a little help from the wife and kids) to prove who really is the King of Halloween. With Donkey running and screaming away the final Shrek chapter ends with Shrek, Fiona and the kids hurling eggs at the 7 Dwarfs. This little story is a gem that you can put with your copy of Shrek the Halls. It will have you laughing out loud as you hear the horror stories you grew up with. Its something you'll be able to watch and enjoy every Halloween. I really recommend it, it was a great way to finish the Shrek franchise, a bit disappointing that Eddie Murphy wasn't there but a brilliant job overall. Children under 7 won't get scared, you may wish to wait until your kids are about that age before you sit down and watch it with them. Otherwise go for your lives.",
         "This short animation is about Shrek and his friends having a competition to see who can tell the scariest story. \"Scared Shrekless\" is a fun animation. It is so colourful and fun. It is not easy to make a scary enough but not too scary animation for kids. Everything about \"Scared Shrekless\" is so adorable. The characters are cute, and the haunted house is spooky in a fun way. The gingerbread man sub-story is scary and fun at the same time. It sounds crazy, but the story that the gingerbread man tells is scary, and yet the gingerbread man and women are so adorable and colourful that it makes the story entertaining and not so scary.",
         "Surprisingly hilarious Halloween special with the first episode, a brilliant Bride of Frankenstein parody, particularly outstanding. After the average Christmas special the writers really upped the ante and came up with some gruesomely funny ideas and jokes, using the by now all too well-known Shrek characters remarkably well. The result's an entertaining half-hour roller-coaster with only the middle section lagging. Since the first two installments, Shrek has never been this funny. Aaaargh!!! 7 out of 10 haunted castles",
         "Scared Shrekless was the perfect Halloween short movie for those of us who are faithful Shrek fans. It was well written and contains all of my Shrek favorites. It is a compilation of 3 Halloween stories from each characters point of view. The parts with the 3 Little Pigs and with the Gingerbread Man are especially funny. Great spooky little film. A must see for fall. The colors and animation quality in the film are great as well. It is better on TV in HD. The kids and myself love Scared Shrekless and Monsters vs Aliens Mutant Pumkins, but won't be buying the DVD. We are waiting for them to make them on Bluray. Most movie buffs these days have hi def TV's and need hi def discs."
      ],
      "genres": [
         "Animation",
         "Short",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["DreamWorks Animation"],
      "summaries": ["Shrek gets in the Halloween spirit by challenging his fairytale friends to come up with scary stories for a contest. But the gang learn that they'll have to spend the night in Lord Farquaad's haunted castle before the winner is named."],
      "budget": 0
   },
   "movielensId": 81711,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Polski"
      ],
      "releaseDate": "2010-10-28",
      "dvdReleaseDate": null,
      "directors": [
         "Gary Trousdale",
         "Raman Hui"
      ],
      "runtime": 21,
      "movieId": 81711,
      "title": "Scared Shrekless",
      "mpaa": "PG",
      "actors": [
         "Mike Myers",
         "Cameron Diaz",
         "Antonio Banderas",
         "Dean Edwards",
         "Conrad Vernon",
         "Kristen Schaal",
         "Cody Cameron",
         "Christopher Knights",
         "Aron Warner",
         "Miles Bakshi",
         "Nina Zoe Bakshi",
         "Patty Cornell",
         "Susan Fitzer",
         "Gabriel Basso",
         "Devon Werkheiser"
      ],
      "imdbMovieId": "1725156",
      "originalTitle": "Scared Shrekless",
      "genres": [
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": ["ZIbHKKXz-BE"],
      "plotSummary": "Shrek challenges Donkey, Puss in Boots and his other fairy tale character friends to spend the night in Lord Farquaad's haunted castle, telling scary stories to see who can resist becoming scared and stay the longest.",
      "tmdbMovieId": 48466,
      "avgRating": 2.92857,
      "releaseYear": "2010",
      "numRatings": 70,
      "posterPath": "/tDoLNXLKoEUoLOL0FPjpBE0SGaV.jpg"
   }
}