{
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [],
      "runtime": 60,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1453159/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NDgwNjQ4MV5BMl5BanBnXkFtZTcwMzU5MjI2Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ian McShane, Matthew Macfadyen, Eddie Redmayne | See full cast and crew »"],
      "reviews": [
         "I always wondered why nobody ever thought about turning Ken Follett's brilliant epic \"The Pillars of the Earth\" into a movie. Without a doubt, it is the greatest book I have ever read, with a cleverly constructed and well-researched story, engaging characters and is full of intrigues, violence and sex. There is so much going on in the book that not a single page seems to be wasted, which is saying a lot about a novel that has over 1000 of them. Now, over two decades after the novel hit the bookshelves, Ridley and Tony Scott bring you an eight-part miniseries that promises to be one of the best ones I have seen in recent years. It is 1135 and a dark time in the history of England. 15 years earlier the king's only legitimate heir died during the sinking of a ship, and England's monarch has neglected God and the church during his reign. The priests and bishops are most eager to ensure a religious man ascends the throne after the death of the king, and in return for swearing allegiance to them, they promise Stephen, the nephew of the king, to put him on the throne. A fierce battle of succession ensues between Stephen and King Henry's only legitimate child Maude. In these times, a young and ambitious monk named Philipp is made Prior of Kingsbridge, a fairly large city that has suffered in recent times and that is in dire need to have its church remodeled. Tom Builder travels through England with his son Alfred, his daughter Martha and after his wife Agnes died in childbirth, they are joined by the two outlaws Ellen and Jack. Finally, Tom finds a job in Shiring, but the Lord Bartholomew is conspiring against the new king Stephen and the William Hamleigh, who was rejected by the lord's daughter Aliena, finally sees an opportunity to take revenge. Philipp, Tom and his family and Aliena are faced with several challenges and hardships, but their paths cross in Kingsbridge, and they all will play a vital role in the construction of the brand new cathedral. Two episodes into the miniseries, I'm quite impressed by how much the atmosphere of the book was kept and although I was prepared to be disappointed, I am really enjoying it so far. It seems that the best and most expensive stuff was just good enough for this series and the medieval cities of the book such as Kingsbridge and Shiring look stunningly real. I am glad that eight episodes were dedicated to tell the story of \"The Pillars of Earth\" instead of merely a two-hour movie, although it's not nearly as epic as Ridley Scott's big movies such as \"Gladiator\". The series does have combat scenes, but ultimately it's more of a dark drama, focusing on characters and relationships before anything else. The miniseries stays very close to the plot in the novel, and only minor details were changed. One of them is that Tom knows that his son is raised in Kingsbridge from the beginning, and in the novel it's only revealed at almost the very end. And then there is the king, who dies at the beginning of the novel, but here lives through almost the entire first episode. Those are merely small deviations though, unnecessary perhaps, but not really something to make a big deal about. The series was mostly shot in Hungary and Austria, although most scenes are actually confined to the insides of a castle or a town. On a side note, there's a lot of blood, obscenity, violence and nudity in the series, and if you have seen HBO's \"Rome\", you should already know what to expect. While there are not too many big names in the cast, some of them you have probably heard of and those are the ones standing out acting wise as well. Ian McShane was the perfect choice to play Bishop Waleran, and he is wonderfully slick and cunning as the main antagonist of Prior Philipp, played by Matthew Macfadyen. I actually find Macfadyen to be almost a little dry in the role of Philipp, but since the character is described with exactly that word many times in the book, I guess he should be commended for his performance. Rufus Sewell so far is the best of the actors in the series, and he is very emotional as Tom and exactly how I imagined him from the books. Natalie Woerner, a German actress, really stands out so far as Ellen and it's unbelievable that she is 43 years old already. She and Sewell have an amazing chemistry together and I completely believe the character's passionate, but scorned upon relationship. Hayley Atwell and Eddie Redmayne as Aliena and Jack will have more to do as the series progresses, as will David Oakes who doesn't seem evil enough for William quite yet. Anatole Taubman, whom you might know from the last James Bond film, is also quite good as Remigius, the manipulative sub-prior of Kingsbridge and Donald Sutherland also appears as Bartholomew in a few episodes. The cast is not well-known perhaps, but definitely strong and I really like what I'm seeing of them so far. I suppose the miniseries won't be quite as epic as the book, but from what I'm seeing so far it will be a big candidate to pick up a couple of Golden Globes and Emmys in the miniseries category next year. \"The Pillars of Earth\" deserved a fantastic adaptation, and I'm glad to see that the producers and the director Sergio Mimica-Gezzan were seemingly ambitious enough to ensure that this would be a memorable series, worthy of this great book. But watching the series, no matter how good it is now and will be in the weeks to come, will never be an adequate substitute for actually reading the book.",
         "Ken Follett is one of the most brilliant novelists of modern times. His stories immerse and engage the reader into worlds so real that it seems possible to step into them. \"Pillars of the Earth\" is one of his most popular books. Originally published in 1989, it gained a cult following through word of mouth then achieved even greater prominence when Oprah discovered it just a few years ago. Tandem Productions and Tony and Ridley Scott took the risk of adapting the sweeping historic novel into a miniseries. The novel is such an intricate spiderweb of lust, revenge, and triumph of an iron will that the mere act of adapting the screenplay for sound-bite and short attention span 21st century viewers was a daunting challenge. The makers of \"Pillars of the Earth\" succeeded in what seemed like an impossible challenge. They have followed the novel's plot entirely,making minor tweaks and changes for the sake of exposition and moving things along. The two hour premiere manages to thrust the viewer into 1100s England and reveal the complicated origins of the civil war with the ship burning and the crisis related to heirs of the throne. A monk overhears a plot to overthrow the king and tells his brother, who tells an archbishop, and the brother becomes a prior by helping the archbishop become elevated to bishop. Why is that detail important? The new prior, Phillip, has decided to rebuild his cathedral by making it a \"compass to God\" and this event becomes central to the story \"Pillars of the Earth.\" While wars and strife erupt around it, the beautiful cathedral rises from an English meadow. The special effects and art direction masterfully create the grimy, gritty world of 1100s England and the stark contrasts between privileges of royalty and serfs wallowing in the mud beside the hogs they keep. Public executions and dismembering are commonplace as one plot change involving the deposed Earl Bartholomew of Shiring (portrayed aristocratically by Donald Sutherland) tears at the heart. While the novel relied on straightforward storytelling, the miniseries offers deftly executed, haunting flashbacks to establish the mysterious Ellen's role in the dirty laundry of Percy Hamleigh and Archbishop Waleran's past. Her husband had been mysteriously executed around the time the ship burned. Ellen's son Jack, who is portrayed as an artistic savant, becomes a force in building the cathedral. King Stephen also plays a larger role in the miniseries. His father portrays a ghost in his dreams in a manner similar to Hamlet, creating a torturous tumult of inner conflict in him. Best of all, Ian McShane as the absurdly evil Bishop Waleron Bigod explodes from the screen with a voice that booms like a thunderclap as he progresses from one dirty deed and double cross to another. Eddie Redmayne as Jack Jackson, one of the central characters of the story, deserves special mention for his deft portrayal of the sensitive but strong character. Rufus Sewell as Tom Builder also shines, especially during one early intense scene where he forces the nasty William Hamleigh to pay him and his helpers despite being out-armed. Some viewers may blanch at the changes involving the relationship between William Hamleigh and his mother, Regan. Even a casual review of the works of Shakespeare reveals that incest ran rampant through royalty during the middle ages, so the plot detail is historically relevant and manages to create additional atmosphere and tension. Overall, the television miniseries should thrill the fans of the novel. Even the opening credits contain a clever, metamorphosing animated sequence and a stirring dramatic musical score punctuates and accentuates the grandeur.",
         "I have read everything Ken Follett has written, but I pretty much had him pegged as a writer of extraordinarily readable suspense potboilers. Better than Stephen King, but no Cormac McCarthy. Then, in 1989 he unveiled \"Pillars of the Earth\" and I was stunned. Follett gave full rein to his incredibly vivid and compelling storytelling abilities. When I finished I was sad. I could no longer follow the adventures of these heroic and scheming English men and women in the the tumultuous 12th Century, a time of uncertainty over who should be on the throne. I have now watched the first six episodes (available on Netflix for instant viewing) and am dying to see the final two when they come available. I didn't know what to expect, but I can declare myself fully satisfied. What worried me most going in was the series was what the tone would be. Follett is a master of grand, operatic gestures. The mini-series captures that. He also is far from shy about sex, barbarism and vulgarity. There's a scene when the monks put Ellen on trial as a witch that made my jaw drop. No F-bombs, but one startling c**t bomb. The incest theme between William and his mother is not explicitly shown, but very clear. Occasionally, it's a bit \"stagey\" and the CGI is good, but not state of the art. Still, \"Pillars\" is a triumph of epic storytelling.",
         "Very good, it is always difficult to find 'drama' that is quality and not overdone, over-the-top or tired. The acting in this is excellent all around and it is definitely worth watching; at least from the two episodes that I have seen thus far. Considering I haven't heard hardly a thing about this until I watched it I am very impressed. The storyline seems to contain fairly valid historical accounts of the time if not the lives of individuals. Keeping in mind it is not as mystical as I would have thought from the title and even the previews I've now seen since I began to watch it - it has made up for that with a strong story and lovely backgrounds for visual appeal and 'time proper' settings. Can't wait for more.",
         "I'll admit that I almost gave up on this series after the first episode. So many plots shown briefly and so many characters! But I had just taken a course on the period so I battled through it. Luckily, they've been doing many repeated showings of the episodes, so I watched the first episode a second time and the series has won me over. Now if you've read the book, of course, you're going to be a little disappointed. You've spent many hours with these characters and formed your own images and opinions about who they are and what they look like. The author had the luxury to spend as much time on each one and each scene to craft all the details. The series has only 8 hours so many details and subplots will have to be altered just a bit. And many of the reviewers who have been devoted lovers of the book have complained either that it would be impossible to catch every detail or that the series creators left out so-and-so detail but the fact is that you can't satisfy the nit-pickers. After watching the first 4 episodes, I've become entranced by the characters and the epic. Sure you have to invest some effort into figuring things out at the start. Sure some of the historical inaccuracies when it comes to the portrayal of printed books centuries before they could have existed are a bit jarring. But the important facts are that these are small trade-offs when you consider the big picture. They only make me more intrigued about how anyone could become learned in a time when printed information was difficult to come by. The acting is uniformly fine and I've come to like the good guys and feel my skin crawl when the evil ones make appearances. I really do hope that they do a second series and I'll be at the edge of my seat for the final 4 episodes of this one. It's been ages since an historical mini-series has succeeded as well as this. Let's appreciate it and hope that it lights the spark for many more to come. It's not sitcom pablum and big ideas deserve to be thought about deeply. Put in the effort and this series rewards.",
         "I've only seen two episodes, so this is a somewhat uninformed review. Oh, and I haven't read the book, which probably helps to enjoy the show as it's own creation. It's important to note that Ridley Scott is a producer and his most recent film Robin Hood, shares quite a resemblance to the general story and setting of Pillars. (Side note; the opening credits are exactly the same). If you've seen Robin Hood, then you get the Monarchical, religious complications as well as the bleak, foggy, dark blue world backdrop of old England. I was expecting a more fantastical, mythical world, but this series is pretty grounded in reality so far. The show's greatest strength is the actors. You can't go wrong with Donald Sutherland and Rufus Sewell in a TV series. And Ian McShane is always great, especially when he's playing a dark character. Might not blow you away, but unless the show takes a nosedive, it's definitely worth watching.",
         "PILLARS OF THE EARTH is an ambitious cinematic adaptation of Ken Follett's novel by the same name. This first season is to be eight episodes, with a 'Season 2' already suggested. The overall message of this historical novel can be summarized as follows: this is a story 'about the building of a cathedral in the fictional town of Kingsbridge, England. It is set in the middle of the twelfth century, primarily during the time sometimes called the Anarchy, between the time of the sinking of the White Ship and the murder of Thomas Becket. The story traces the development of Gothic architecture out of the preceding Romanesque architecture and the fortunes of the Kingsbridge priory against the backdrop of actual historical events of the time. Although Kingsbridge is the name of an actual English town, the Kingsbridge in the novel is actually a fictional location representative of a typical market town of the time'. Shot on location in Hungary with director Sergio Mimica-Gezzan, director of photography Attila Szalay, and set to the fine musical scoring by Trevor Morris, PILLARS OF THE EARTH is off to a fine start in the first three episodes. While the series is based on historic facts, there are so many sidebars of added information that it is a bit difficult to keep the flow of the story straight. Prior Philip (Matthew Macfadyen) yearns to build a cathedral in Kingsbridge, much to the chagrin of the evil Waleran (Ian McShane). Philip's innate kindness and focus of his mission leads him to Tom Builder (Rufus Sewell) whose wife has died in childbirth and the newborn is left by Tom on his mother's grave only to be saved by a quiet monk. Tom encounters Ellen (Natalia Wörner) and her mute son Jack (Eddie Redmayne) who join forces to not only build Prior Philip's cathedral but fight against the forces of royalty who would alter life in general for all of them. The fine cast includes Donald Sutherland (early on beheaded), Hayley Atwell, Allison Pill, Gordon Pinset, David Oakes, Sam Claflin, Skye Bennett and many others. The costumes and sets are realistic and portray the period well. There is a lot of the now requisite bloodshed and some rather gory scenes, but those go along with the accurate reenactment of the period. Definitely worth watching. Grady Harp",
         "\"Pillars\" is amazing! Yes, it does differ some from the original book but it's another story-telling device that enhances an enthralling tale from the 12th century that is fascinating and exquisitely portrayed. I read the book as well as its sequel and thoroughly enjoyed both. The characters in the mini-series were intriguing, beautifully casted and totally believable. There is no way every detail from the book could be worked into the 8+ hour movie for TV. Critics can take exception to some of the what-was-left-out rather than realizing reading a book and watching a movie involve entirely different enjoyment method levels. The mini-series is worth every effort to view. I sometimes watched episodes 2 or 3 times again to take it all in. The sets, special effects, displays of church control vs. every day life for many was portrayed amazingly well. Say what you will about fractured details, overall \"Pillars of the Earth\" is a fabulous experience that captivates and informs, most of all, invites interest in the metaphor of the building of some of Europe's most gorgeous reaches for heaven architecture-wise as well as the corruption and deceit of many who defied religious belief in the worst ways when they should have been stellar examples of loving leadership.",
         "Being a reader of the book this show was a great excitement for me. I was extremely surprised to see it being made but it was a happy surprise for they where making it the right way, in a mini series not a movie, a movie would have been horrendous and ruined the whole thing. That being said I went ahead and viewed the entire series from start to finish. To begin, the actors that played all the parts were absolutely fantastic, they were exactly what i was led to believe when i read the book to perfection. The story was not to far stretched from the truth and I was not entirely disappointed. However with this being a miniseries i was to believe that they would have kept the story as the author had wrote it, a master piece, while this show is good it is by no means a masterpiece. The story that they tell in this show does not stray to far out of line until the last 3-4 episodes. Then it becomes a great a reckless attempt at making a show more on a budget then on what the author created. There was no Richard going to the crusades for the king in the book he went because he killed Alfred for raping Aliena. There was not incest subplot between William and his mother. Williams wife did have a child but because she was so young when she did was unable to bear another. William became sheriff much sooner. William killed a bishop and thats why he was hanged not for some accident. The list goes on and on. If the creators of this miniseries had simply followed the book and extended the series a little bit then maybe they could have made a better show. All this being said, as i stated before, I was not entirely dissatisfied with the show. It was good in its own way. It was simply a disappointment to not see so many stories told by Follet that were either misrepresented or not represented at all. All in all its a good statement of what the book was sort of about but because of the so many eliminated plot lines and characters I ended the series thinking.. That kinda sucked. If your into swords medieval times and ways of thinking this series is for you. If your a strong supporter of the book not so much. As always this is simply my opinion and i am perhaps too in favor of keeping written things in there true form. Please make your own opinions, perhaps watching the series will prompt you to read the book, if so then the series has accomplished something better then itself..",
         "Now I did not have the good fortune of reading Ken Follet's book, but when I saw the promos and previews for this, I know I wanted to watch it. The characters are so well done, every one of them has a story element to bring to play and not one of them is poorly written. Everything that happened, and the way it happened, made it believe that it really happened. There was not a single dull moment in the entire miniseries. I never knew that building a church could be the basis for such a gripping storyline riddled with events that never stopped entertaining me. It has a little bit for everyone. For those who enjoy romance, there are several love triangles and paradoxes, for those who enjoy action, there are plenty of bloody sword-wielding fight scenes, there are laughs, there are cries, its not just a miniseries, but an experience; a life. Its absolutely wonderful and I will hope to see it amongst television classics someday."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Tandem Communications",
         "Muse Entertainment Enterprises",
         "Scott Free Productions"
      ],
      "summaries": [
         "The Pillars of the Earth is set against a backdrop of war, religious strife and power struggles which tears lives and families apart. In that time, there rises a magnificent Cathedral in Kingsbridge. Against the backdrop, love-stories entwine: Tom, the master builder, Aliena, the noblewoman, the sadistic Lord William, Philip, the prior of Kingsbridge, Jack, the artist in stone work and Ellen, the woman from the forest who casts a curse. At once, this is a sensuous and enduring love story and an epic that shines with the fierce spirit of a passionate age. Follett masterfully weaves these stories through political turmoil of 12th century England, creating a relevant and viable world for today's audience and for generations to come.",
         "Set against a backdrop of war, religious strife and power struggles which tears lives and families apart."
      ],
      "budget": 40000000
   },
   "movielensId": 81731,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-07-23",
      "dvdReleaseDate": "2010-11-23",
      "directors": ["Sergio Mimica-Gezzan"],
      "runtime": 421,
      "movieId": 81731,
      "title": "The Pillars of the Earth",
      "mpaa": "",
      "actors": [
         "Ian McShane",
         "Matthew Macfadyen",
         "Eddie Redmayne",
         "Hayley Atwell",
         "Sarah Parish",
         "Rufus Sewell",
         "Natalia Wörner",
         "Anatole Taubman",
         "John Pielmeier",
         "Robert Bathurst",
         "Sam Claflin",
         "Donald Sutherland",
         "Liam Garrigan",
         "Tony Curran",
         "Douglas Booth",
         "Féodor Atkine",
         "Götz Otto",
         "Alison Pill",
         "Virág Bárány",
         "David Oakes",
         "Skye Bennett",
         "Gordon Pinsent",
         "Freddie Boath",
         "Barnabás Réti",
         "Molnár Piroska",
         "Lisa Millett",
         "Clive Woods",
         "Richard Rifkin",
         "László Áron",
         "Kelly Banlaki",
         "David Bark-Jones",
         "Tamás Baross",
         "Ken Follett",
         "Tatiana Turner",
         "Michael Mehlmann",
         "Skye Lourie",
         "Peter Linka",
         "Mark C Phelan"
      ],
      "imdbMovieId": "1453159",
      "originalTitle": "The Pillars of the Earth",
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Pillars of the Earth is an eight-part 2010 TV miniseries, adapted from Ken Follett's novel of the same name.",
      "tmdbMovieId": 133252,
      "avgRating": 3.82326,
      "releaseYear": "2010",
      "numRatings": 215,
      "posterPath": "/7uZx4tJEpFBGGqsnlFk5HWZGyAL.jpg"
   }
}