{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "miracle",
            "id": 2618
         }
      ],
      "imdb_id": "tt0029201",
      "video": false,
      "title": "The Man Who Could Work Miracles",
      "recommendations": [
         35920,
         44669,
         44101,
         59964,
         10146,
         72529,
         26592,
         84086,
         78734,
         99920,
         41773,
         44100,
         67022
      ],
      "backdrop_path": "/kuMDs3RzG0K4Y9C87MFBUE7RbEw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George McWhirter Fotheringay",
               "gender": 2,
               "credit_id": "52fe47abc3a368484e0d36ed",
               "name": "Roland Young",
               "profile_path": "/cyptVAtLuiHPaYJrgq4HCamJCiB.jpg",
               "id": 14685,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Colonel Winstanley",
               "gender": 2,
               "credit_id": "52fe47abc3a368484e0d36f1",
               "name": "Ralph Richardson",
               "profile_path": "/p9FyikB1ShTtq1cpMgkkhUrI9Bp.jpg",
               "id": 12689,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Major Grigsby",
               "gender": 2,
               "credit_id": "52fe47abc3a368484e0d36f5",
               "name": "Edward Chapman",
               "profile_path": "/560SL2ZjiLozbRyWGIMyBk2Aquy.jpg",
               "id": 33267,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Maydig",
               "gender": 2,
               "credit_id": "5461d31b0e0a2672a0001bc6",
               "name": "Ernest Thesiger",
               "profile_path": "/bmgsa81yJ2sYIrFLqiCKLaRDg4t.jpg",
               "id": 2925,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ada Price",
               "gender": 1,
               "credit_id": "5461d6bc0e0a2672aa001b9c",
               "name": "Joan Gardner",
               "profile_path": "/k3YteYmjUOtoXNCgUdBNwjySFZS.jpg",
               "id": 142724,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Maggie Hooper",
               "gender": 1,
               "credit_id": "555f4b459251417e5f0029b0",
               "name": "Sophie Stewart",
               "profile_path": "/cfP5Q74zmMNWrAbLz2CoStVpYqe.jpg",
               "id": 33272,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bill Stoker",
               "gender": 0,
               "credit_id": "555f4b54c3a36868e0002ea3",
               "name": "Robert Cochran",
               "profile_path": null,
               "id": 1372534,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Grigsby's Housekeeper",
               "gender": 1,
               "credit_id": "555f4b619251417e5c002c95",
               "name": "Lady Tree",
               "profile_path": "/b4I7IE2ODS9bXkBseDehC9qkzzQ.jpg",
               "id": 1043449,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Bamfylde",
               "gender": 0,
               "credit_id": "555f4b6e9251417e4d002d34",
               "name": "Laurence Hanray",
               "profile_path": null,
               "id": 134265,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "The Colonel's Butler",
               "gender": 2,
               "credit_id": "555f4b7cc3a36868d9002a6b",
               "name": "George Zucco",
               "profile_path": "/hduZG2CH9UeGuBamxnohkd3DEVg.jpg",
               "id": 30417,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Constable Winch",
               "gender": 2,
               "credit_id": "555f4b8a9251417e5c002c9a",
               "name": "Wallace Lupino",
               "profile_path": null,
               "id": 1007709,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Effie",
               "gender": 1,
               "credit_id": "555f4b979251417e51002cfe",
               "name": "Joan Hickson",
               "profile_path": "/8nAahe7ow6DfMpZvIXwlXZaROkL.jpg",
               "id": 11135,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Supt. Smithnells",
               "gender": 2,
               "credit_id": "555f4ba59251417e5f0029c1",
               "name": "Wally Patch",
               "profile_path": "/fAD7tIoaRPPk46SrcQjB4cTgvjB.jpg",
               "id": 554381,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Toddy Beamish",
               "gender": 0,
               "credit_id": "555f4bb3c3a3683b52001da3",
               "name": "Mark Daly",
               "profile_path": null,
               "id": 584082,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Indifference - a God",
               "gender": 2,
               "credit_id": "555f4bc09251417e5c002ca7",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55a4633fc3a3685e5700058f",
               "name": "Lothar Mendes",
               "profile_path": null,
               "id": 138144,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "555f4a7ac3a3683b52001d76",
               "name": "H.G. Wells",
               "profile_path": "/U8KahQDA3jjKToWl7Ho6df8BML.jpg",
               "id": 11624,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "555f4a83c3a36868eb002fec",
               "name": "Lajos Biró",
               "profile_path": null,
               "id": 71789,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58654979c3a36852cc01e9c0",
               "name": "Alexander Korda",
               "profile_path": "/iwUTfD7I6hcBWvx2PdJsCng9xmV.jpg",
               "id": 2490,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58654987c3a36852c002338a",
               "name": "Mischa Spoliansky",
               "profile_path": null,
               "id": 592417,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58654992c3a36852d201d098",
               "name": "Harold Rosson",
               "profile_path": "/iaCiQJnVexTWFyfcvnamRICx8XQ.jpg",
               "id": 9057,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5865499e9251412b8d01f7c2",
               "name": "Philip Charlot",
               "profile_path": null,
               "id": 1288228,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "586549b69251412b8701f037",
               "name": "John Armstrong",
               "profile_path": null,
               "id": 33263,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "586549d49251412b840202f4",
               "name": "Ned Mann",
               "profile_path": null,
               "id": 108816,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "586549e2c3a36852e00211c3",
               "name": "Lawrence W. Butler",
               "profile_path": null,
               "id": 89532,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "586549f19251412b7b02127a",
               "name": "Edward Cohen",
               "profile_path": null,
               "id": 1399546,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "586549ff9251412b8d01f807",
               "name": "Harry Zech",
               "profile_path": null,
               "id": 1312812,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.937366,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 68849,
      "vote_count": 8,
      "budget": 0,
      "overview": "George McWhirter Fotheringay, while vigorously asserting the impossibility of miracles, suddenly discovers that he can perform them. After being thrown out of a bar for what is thought to be a trick, he tests his powers and eventually sends a policeman to Hades by accident. Worried, he sends the police officer to San Francisco, and seeks advice from the local clergyman, Mr Maydig. Maydig, after having Fotheringay's powers demonstrated to him, quickly planning for reform of the world by means of miracle, but eventually Fotheringay orders a miracle which, due to clumsy wording, backfires. He relinquishes his power and returns to the time before he had it.",
      "similar": [
         583,
         788,
         160588,
         10204,
         293863,
         6978,
         72207,
         2018,
         2323,
         10603,
         1683,
         9693,
         402,
         628,
         11005,
         534,
         426,
         1402,
         707,
         9802
      ],
      "original_title": "The Man Who Could Work Miracles",
      "runtime": 82,
      "poster_path": "/e6MXJGdfG7TXN1nuIuubYko5Ht.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "London Film Productions",
         "id": 659,
         "origin_country": ""
      }],
      "release_date": "1936-02-19",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "A Modern Aladdin Who Could make Women Do Things!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Lothar Mendes",
         "Alexander Korda"
      ],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "H.G. Wells",
         "H.G. Wells"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzUxNTc5NDgzM15BMl5BanBnXkFtZTcwMjkyMTY5Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Roland Young, Ralph Richardson, Edward Chapman | See full cast and crew »"],
      "reviews": [
         "This is undoubtedly the best film adaptation by H.G. Wells of his own work, a wry fable free of the leaden polemics that so marred \"Things To Come\". Roland Young -- who played the title character to mischievous ghosts Cary Grant and Constance Bennett in the 1937 comedy \"Topper\" -- is outstanding as George Fotheringay, a mousy store clerk who must come to grips with the sudden gift of almost unlimited power. He can literally do anything -- except change the human heart, as he finds when he commands his beautiful coworker Ada to fall madly in love with him, and she merely laughs in his face. (Incidentally, \"George\" is Wells' middle name, and Roland Young bears more than a little resemblance to a younger H.G.) Mischa Spoliansky's score is by turns droll and light-hearted, complementing the story perfectly, as George struggles to make sense of his new-found abilities. He learns the danger of an unguarded word, when he tells an officious constable who wants to run him in for disturbing the peace to \"go to blazes\", leading to a hilarious bit in which the constable, finding himself instantaneously transported to the nether regions of brimstone and hellfire, tries to keep calm and take notes about the incident while his notepad smolders. Fortunately, George isn't the vindictive type. As soon as he realizes what he's done, he rescues Constable Plod from the Inferno. (Although, just to be on the safe side and give him some time to cool off, George also teleports him to San Francisco.) Since he makes no secret of his miracle-working, George is bombarded with advice from his coworkers and various worthies on how he should use his powers. His boss wants to sign him to an exclusive contract, establishing a chain of \"miracle\" stores featuring instantaneous delivery, with free healing clinics offered on Tuesdays and Fridays to allay George's discomfort with exploiting his talent solely for monetary gain. Mr. Maydig -- a Baptist minister and amateur philosopher played to prim perfection by gaunt character actor Ernest Thesiger -- advises George to bring the Millennium, to end war and disease and poverty. George cooperates with Maydig to the extent of fulfilling a Biblical prophecy, converting the prized antique cutlery collection belonging to a local representative of the gentry (Sir Ralph Richardson) into what his butler describes with a visible shudder as \"agricultural implements\". Even worse, at Maydig's insistence George adds injury to insult by turning all of Colonel Winstanley's fine whiskey into non-alcoholic \"temperance water\". The butler (George Zucco) gets another of the best lines in the movie. Accused of having done something to the Colonel's tipple, he's the picture of wounded innocence as he responds: \"Sir! I'd as soon poison a baby as tamper with good whiskey!\" Next morning, after meeting George and seeing further proof of his unlimited power, the Colonel naturally concludes this mild-seeming clerk is a dire threat to the established order. Taking matters into his own hands, Winstanley almost succeeds in assassinating George, triggering the climactic sequence in which George declares himself invulnerable and immortal and decides he will remake the world to his own plan, starting now. What happens next is too weird and wonderful for me to spoil it for anyone who hasn't seen the film, except to observe that it's not the typical \"absolute power corrupts absolutely\" denouement that modern viewers have come to expect. \"The Man Who Could Work Miracles\" is a wise, funny and humane comment on the human psyche, a film which can be enjoyed many times and still seem fresh with each viewing.",
         "The Man Who Could Work Miracles has its start in the heavens where some Greek God like creatures are roaming among the stars, one of them played by an as yet unknown George Sanders. Apparently H.G. Wells's idea of a Deity was closer to the Greeks and Romans than Christianity. In any event these three creatures discuss the happenings on planet earth where a group of puny creatures dominate, but who might start getting into their realm in the heavens in a few generations. Let's see what they can do if one of them is granted our powers, creation with a mere thought. And with a random selection of a celestial finger it lands on meek little Roland Young as he's entering his local pub. It takes time for Young to grasp the significance of his gift and this is Wells's most telling comment on the film, the sheer pettiness of the average man. From parlor tricks to trying to improve his love life, Young just can't seem to get it into his head what he can do. Of course they're others who do think about these things more deeply than young. But I believe what H.G. Wells was trying to say is that even those who see a bigger picture than Young and attempt to use him only see it from a narrow perspective. The former colonel Ralph Richardson thinks of conquest, Edward Chapman thinks in terms of business and commerce, Ernest Thesiger is a dreamy Utopian with a theological background. Even Young sees the flaws in each of their versions of Utopia. H.G. Wells in his other film that came out around the same time provided the answer by his lights. It was the scientists who should establish the benevolent despotism of the age, they alone have the wisdom to rule all of us. Wells said as much in Things To Come, though I never saw any evidence in the film and in real life that scientists are any better qualified than anyone else. Still that was his view. The subject of humans being given the Godlike power of creation has been done many times. In a more serious version it was the subject of a classic Star Trek episode with Gary Lockwood being given just that power and in a half hour Twilight Zone episode, a hapless Burgess Meredith was a subject of a similar experiment. Meredith made Young's character look hip and appealing. Though some might argue that Cosmo Topper was his career screen role, I would hold out that Everyman George William Fotheringay, selected by the Gods to be The Man Who Could Work Miracles is Roland Young's best part. He's such a hapless slob that each and every one of us can identify with. You might think you would know what to do given his power, but when you examine yourself a bit further......................",
         "What would a world without want be like? The answer has been the subject of countless stories, not a few movies, & every sensitive soul's nighttime sighing for ages. H. G. Wells poses the question by having godlike beings give a department store clerk, George McWhirter Fotheringay, that ability, & watching it evolve, as he bounces from adviser to adviser, from the sexy girl he desires to a retired British Army man. The film is a treat, especially for those of us accustomed to (& maybe a little bored by) the Star Trek treatment of absolute power conferred on lowly mortals. I don't know much about the history of science fiction in the movies, but Wells goes about everything (he wrote the script, based on his novel) with the fabulous in mind, while adding purely sci-fi touches, which I won't give away. Fotheringay is no bleeding-heart aching to turn the world into a painless utopia, nor is he a selfish, power-hungry perve, but a nondescript man who takes his time to figure out just what has happened to him before bringing everything to a head. In the meantime, we're given what amounts to a funny English comedy of manners, as well as a peek into a time (& place) where science fiction took a different direction. (For example: if you found out you had miraculous powers, would you tell anyone? I don't think I would. & if you told anyone, wouldn't you imagine the authorities pouncing on you at the first opportunity? Not so in 1930's Essex!) The ending seems Gene Roddenberry-esque, & perhaps the Star Trek creator admired & shared Wells' humanism; but the film shines with neat-o special effects (some cool stuff, for the time) & a wonderful performance by Roland Young. A must-see for those who like their sci-fi earthbound & thought-provoking. (My subject line, by the way, refers to anarchy as a form of government in which there are no governments, just self-government; I don't mean it in the common usage of disorder or chaos. The movie touches on the idea that, without their lives being controlled by those in power, who have a vested interest in people needing money & goods, people might find other ways to spend their time - like, for example, in creation.)",
         "Okay, much has already been discussed about the philosophical merits of this film and the deep, profound underlying morals within and the gentle yet omni-present humour laced throughout The Man Who Could Work Miracles. I agree it is there but to varying degrees of success. Who knew H. G. Wells did the script himself(I didn't know he was even still alive then). Because he did, you knew it would have some kind of social message - and it does. What would we do if given complete, absolute power? Can mankind given this power effectively change? Will mankind come to some communal consent as to the betterment of the species as a whole? Well, being the true Machiavellian at heart philosophically that I am - I knew the answers to these questions as posed by Wells who by this time in his life seeing Europe yet again on the fringe of war in 1936 must have come to the same conclusions. But Wells to his credit leaves the viewer the opportunity to decide what he/she thinks with little prodding from the script. While the movie has a lot of hokey dialog and contrived plot sequences, I enjoyed it overall and its message of - whatever it is to you goes here. The acting is charming at the very least. Roland Young is always good and he portrays Mr. Farthingay with great affability and anonymity. Young is one of the best things about the movie as he stumbles in his fashion through the dialog and the scenes with calculating indifference as only he can do. The supporting cast is ably aided with the likes of Ralph Richardson, Joan Gardner, Joan Hickson, George Zucco, and as two godlike spirits watching earth - George Sanders looking incredibly young and Torin Thatcher(from The Seventh Voyage of Sinbad fame). The best outside of Young is Earnest Thesiger from The Bride of Frankenstein and The Old, Dark House fame playing a minister named Mr. Maydig who wants Young to do only good, beneficial things for mankind - at least it appears so ostensibly. No one and I mean no one can deliver a line like Thesiger! Words from his mouth are music to my ears. There are some problems with the film. Much of it comes off as forced and not very amusing. The script ends really in a muddle of a mess. How about the ridiculous music and the title sequence at the beginning of the film. What was up with that huh? But despite these shortcomings, see The Man Who Could Work Miracles for what it is - a thought picture that has a message presented in a light-hearted fashion.",
         "Roland Young was a stage star in the 1920s and early 1930s. To us, he usually played an impeccable gentleman, usually of diffident, uncertain, and shy personality, but occasionally showing a roguish personality (as \"Uncle Willy\" in THE PHILADELPHIA STORY) or an unscrupulous, villainous one (as \"Uriah Heep\" in David COPPERFIELD) or even a murderous one (as in the killer in THE GREAT LOVER). His best remembered starring part was as the spooked banker \"Cosmo Topper\" in three movies, but his best performance may well have been as \"George Fotheringay\" in this film, THE MAN WHO COULD WORK MIRACLES. In this film he was the average little man - the man in the street, if you will, who is given extraordinary powers by the Gods and proceeds to demonstrate how human beings cannot handle great power. H. G. Wells' amusing fantasy shows how power without wisdom or control is never a safe commodity. Young is the sort of person we meet everyday. He is harmless. He is acceptable. He is forgettable. In short he is one of us. He is unable to even make a dent with a girl he's interested in (Joan Gardner). But once he gets power, he can't succeed in doing much with it. He is able to frighten some friends in a pub, during a philosophical chat. He can cause personal amusement and enjoyment in his room, but it does annoy the landlady (particularly all of the animals he now has for pets). He tries to find a fast way of ending poverty by creating money out of the air - much to the dismay of the local banker (Laurence Hanray). He tries to rid the world of weapons, much to the anger of the local military man (Ralph Richardson, in heavy make-up). Richardson is also annoyed that his liquor is now juice or cider. In the end, stalked by Richardson and the others who find more to fear than to accept in Young's sudden powers, Young decides he has to protect himself. He makes himself master of the world, but when he decides to show himself as the center of the universe by stopping the earth's rotation, he nearly destroys the earth. Only sheer accident prevents total disaster. The film is not flawless. When Young makes himself world dictator he tells off the rulers of the world (whom he has brought together at his new court) that they like the furs and feathers they wear. This is typical of Wells - he always thinks that the finery and trappings of power are the goals of powerful people, and not a side issue. It is even pushed to extremes in his other scripted film, THE SHAPE OF THINGS TO COME, when Ralph Richardson (as \"the Boss\") wears a costume of furs and feathers. Young also lacks real imagination, which is an odd lapse for Wells. His \"common man\" heroes, like Mr. Polly, do have a degree of imagination. Fotheringay's idea of economic curing is to wave his hand and out pops a ten pound note (to the dismay of the banker, who starts talking about inflation!). But he could do it on the sly, passing flawless cash around by mail without any problems. He's just not swift enough to do it quietly. But that is a minor quibble. The film is (on the whole) a joy as fantasy and as a field day for Roland Young. I give it a 10 as an example of exciting cinema.",
         "After a somewhat stilted beginning, this cheerful little fantasy caught my imagination. The extended plot has been enlarged almost seamlessly from the original short story, and in very much the same wry spirit: this is recognisable as authentic H.G.Wells in a way that, say, the adaptations of 'The Time Machine' and 'The Invisible Man' are not... but despite being characteristically didactic, it is also amusing and thoroughly entertaining. Roland Young, in the downtrodden role of the eponymous Everyman, is more or less required to carry the film singlehanded and makes an admirable job of it, his hesitant body language alone speaking volumes. He is entirely believable as the voice of puzzled common sense amid all the conflicting demands being made of him, but when the worm turns he is also a strangely formidable figure. Of the special effects -- the 'miracles' themselves -- there is nothing more to be said and no higher praise than that after the first few minutes, by and large, one simply takes them for reality, accepting the logic within the story. Those footprints in the hearthrug are a little obviously fake, though! This is no great classic of its era, but its ideas have worn well, and, more importantly, it still makes for an enjoyable night out. Its main flaw is the introduction of the framing 'godly powers' plot, which was evidently felt necessary to explain just what was going on, but today verges on the embarrassing; in my opinion, the story could have stood up perfectly well without it.",
         "I first saw this movie when I was a kid in the fifties. The movie stands out in my mind just as if I saw it yesterday (in fact I am going to see it in the next few days, whenever I can find a place that rents it.) It was interesting and entertaining just as most movies based on H. G. Wells stories are.",
         "H.G. Wells' lighthearted fantasy about an unassuming draperies assistant granted the ability to make his every dream come true might be the best film never made by Frank Capra. Normally a very sober thinker, Wells found the perfect balance between philosophy and whimsy for this original screenplay, in which a trio of cosmic gods conduct an experiment to see how the selfish inhabitants of this trifling world might cope with the possibility of total wish fulfillment. Astounded by his unexpected gift (which he believes to be a simple matter of will power), the meek and mild Mr. George McWirter Fotheringay soon finds himself besieged by friends and strangers offering opinions, advice, and partnership offers in lucrative business ventures. Should he use his miracle making for strictly personal gain, or for the benefit of all mankind? There are, of course, unexpected pitfalls to even the best intentions, but the consequences, while hardly optimistic, are never less than entertaining.",
         "The film, almost seventy five years after its release as this review is written, still provides a dilemma that could be endlessly discussed on the human condition. A man is given unlimited power by three deities as they look down on the earth. The mind of Wells is highly visible as the plot develops. It is approached in a tongue in cheek manner and the special effects of the time must have been very labor intensive in relation to the genius of todays computer graphics. The moral questions could employ any philosopher in endless discussion. A relatively young Ralph Richardson portraying an old character gives us a glimpse into the early career of a classic British actor. In a strange way it is a kind of feel good movie and very thought provoking. It may also intrigue the present day viewer as they consider the possibility of the cinema goer in the 1930s wondering how the camera tricks were performed.",
         "An unassuming Englishman named Fotheringay (Roland Young) is given miraculous powers by celestial beings (perhaps gods, the film never says). He doesn't know where he got the powers from or why and, at first, he doesn't use them for anything more than simple tricks. Gradually he starts to realize the gift he's been given and decides to use his power for the greater good. But he isn't sure how to do this so he consults several respected men in the community and gets wildly different suggestions. A delightful fantasy comedy with a script co-written by H.G. Wells, adapted from one of his short stories. It's leisurely-paced and well-directed. Amazing special effects for the time, particularly when you consider this wasn't a Hollywood production. Roland Young (wearing a toupee) is perfectly cast. I can't imagine another actor from this time playing this part so well. The rest of the cast is terrific with a few recognizable faces in the mix, including Ernest Thesiger and, in a small role, George Zucco. Ralph Richardson steals the show as a blowhard colonel quite put out by Fotheringay's miracles. A shirtless George Sanders plays one of the 'gods.' One of my favorite scenes is when Fotheringay tells a policeman to \"go to blazes\" and winds up sending the man to Hell! The policeman's reaction while there and Fotheringay's subsequent attempt to fix the situation are hilarious. Reportedly Wells intended the film to be more preachy, like his script for Things to Come the year before. But thankfully director Lothar Mendes and co-screenwriter Lajos Biró chose to focus more on the comedy and getting the points across that way. The result is a funny movie but with some big ideas that gives you a lot to think about."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["London Film Productions"],
      "summaries": [
         "George McWhirter Fotheringay, while vigorously asserting the impossibility of miracles, suddenly discovers that he can perform them. After being thrown out of a bar for what is thought to be a trick, he tests his powers and eventually sends a policeman to Hades by accident. Worried, he sends the police officer to San Francisco, and seeks advice from the local clergyman, Mr Maydig. Maydig, after having Fotheringay's powers demonstrated to him, quickly planning for reform of the world by means of miracle, but eventually Fotheringay orders a miracle which, due to clumsy wording, backfires. He relinquishes his power and returns to the time before he had it.",
         "An ordinary man suddenly finds that anything he says comes true. Or at least, almost anything!"
      ],
      "budget": 0
   },
   "movielensId": 81768,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-02-19",
      "dvdReleaseDate": "2006-06-12",
      "directors": ["Lothar Mendes"],
      "runtime": 82,
      "movieId": 81768,
      "title": "The Man Who Could Work Miracles",
      "mpaa": null,
      "actors": [
         "Roland Young",
         "Ralph Richardson",
         "Edward Chapman",
         "Ernest Thesiger",
         "Joan Gardner",
         "Sophie Stewart",
         "Robert Cochran",
         "Lady Tree",
         "Laurence Hanray",
         "George Zucco",
         "Wallace Lupino",
         "Joan Hickson",
         "Wally Patch",
         "Mark Daly",
         "George Sanders"
      ],
      "imdbMovieId": "0029201",
      "originalTitle": "The Man Who Could Work Miracles",
      "genres": [
         "Fantasy",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "George McWhirter Fotheringay, while vigorously asserting the impossibility of miracles, suddenly discovers that he can perform them. After being thrown out of a bar for what is thought to be a trick, he tests his powers and eventually sends a policeman to Hades by accident. Worried, he sends the police officer to San Francisco, and seeks advice from the local clergyman, Mr Maydig. Maydig, after having Fotheringay's powers demonstrated to him, quickly planning for reform of the world by means of miracle, but eventually Fotheringay orders a miracle which, due to clumsy wording, backfires. He relinquishes his power and returns to the time before he had it.",
      "tmdbMovieId": 68849,
      "avgRating": 2.79167,
      "releaseYear": "1936",
      "numRatings": 12,
      "posterPath": "/e6MXJGdfG7TXN1nuIuubYko5Ht.jpg"
   }
}