{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "samurai",
            "id": 1462
         },
         {
            "name": "greed",
            "id": 5332
         },
         {
            "name": "bigamy",
            "id": 6977
         },
         {
            "name": "tragedy",
            "id": 10614
         },
         {
            "name": "rural setting",
            "id": 11004
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "sengoku period",
            "id": 194424
         },
         {
            "name": "feudal japan",
            "id": 198754
         },
         {
            "name": "16th century",
            "id": 208244
         },
         {
            "name": "warring states period",
            "id": 223738
         }
      ],
      "imdb_id": "tt0046478",
      "video": false,
      "title": "Ugetsu",
      "recommendations": [
         20532,
         16672,
         43364,
         4495,
         48035,
         20530,
         43904,
         780,
         31217,
         20108,
         43255,
         36265,
         15244,
         34528,
         5801,
         41391,
         992,
         776,
         58129,
         976
      ],
      "backdrop_path": "/3n4vhUJMwWGwG49G1ofTkQdFc1A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Genjurô",
               "gender": 2,
               "credit_id": "52fe46119251416c7506bfef",
               "name": "Masayuki Mori",
               "profile_path": "/hX7gD4gUcymXJrgwcMtw8VCqimY.jpg",
               "id": 7452,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lady Wakasa",
               "gender": 1,
               "credit_id": "52fe46119251416c7506bff3",
               "name": "Machiko Kyô",
               "profile_path": "/rznlEYD1gngOTdyCgChGqrQY4ii.jpg",
               "id": 7451,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Miyagi",
               "gender": 1,
               "credit_id": "52fe46119251416c7506bff7",
               "name": "Kinuyo Tanaka",
               "profile_path": "/1YnlfBKCXsJW1AaoCst8NNdqW1Q.jpg",
               "id": 24551,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tobei",
               "gender": 2,
               "credit_id": "52fe46119251416c7506bffb",
               "name": "Eitarô Ozawa",
               "profile_path": "/xWAn0r6pD2nbw3h7gcue9lmWvUI.jpg",
               "id": 97203,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Genichi",
               "gender": 0,
               "credit_id": "52fe46119251416c7506bfff",
               "name": "Ikio Sawamura",
               "profile_path": null,
               "id": 97204,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Ohama",
               "gender": 1,
               "credit_id": "52fe46119251416c7506c03f",
               "name": "Mitsuko Mito",
               "profile_path": "/fYX7FJf3AMr4xhIPBfkR94OljD.jpg",
               "id": 108021,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Okun",
               "gender": 0,
               "credit_id": "52fe46119251416c7506c043",
               "name": "Kikue Môri",
               "profile_path": null,
               "id": 1092519,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Village Master",
               "gender": 0,
               "credit_id": "52fe46119251416c7506c047",
               "name": "Ryôsuke Kagawa",
               "profile_path": null,
               "id": 551748,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Knight",
               "gender": 0,
               "credit_id": "52fe46119251416c7506c04b",
               "name": "Eigoro Onoe",
               "profile_path": null,
               "id": 555561,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Old Priest",
               "gender": 0,
               "credit_id": "52fe46119251416c7506c04f",
               "name": "Sugisaku Aoyama",
               "profile_path": null,
               "id": 1049221,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Vassal",
               "gender": 2,
               "credit_id": "52fe46119251416c7506c053",
               "name": "Saburo Date",
               "profile_path": "/2aApL79MtchtDoCdMtwuutioDTY.jpg",
               "id": 125011,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46119251416c7506bfeb",
               "name": "Kenji Mizoguchi",
               "profile_path": "/pZzZlxlo2G0uJ8gsQ2prh7VQJO8.jpg",
               "id": 97202,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c00b",
               "name": "Yoshikata Yoda",
               "profile_path": null,
               "id": 134343,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c011",
               "name": "Akinari Ueda",
               "profile_path": null,
               "id": 1092518,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5832503292514162cf02fb11",
               "name": "Matsutarô Kawaguchi",
               "profile_path": null,
               "id": 134342,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c017",
               "name": "Kyûchi Tsuji",
               "profile_path": null,
               "id": 134382,
               "department": "Writing",
               "job": "Idea"
            },
            {
               "gender": 2,
               "credit_id": "52fe46119251416c7506c01d",
               "name": "Masaichi Nagata",
               "profile_path": null,
               "id": 7459,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46119251416c7506c023",
               "name": "Fumio Hayasaka",
               "profile_path": null,
               "id": 7460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c029",
               "name": "Tamekichi Mochizuki",
               "profile_path": null,
               "id": 1092504,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c02f",
               "name": "Ichirô Saitô",
               "profile_path": null,
               "id": 125001,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46119251416c7506c03b",
               "name": "Mitsuzô Miyata",
               "profile_path": null,
               "id": 1048948,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57171ade9251417a220060dc",
               "name": "Kazuo Miyagawa",
               "profile_path": null,
               "id": 7461,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 5.686602,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 14696,
      "vote_count": 126,
      "budget": 0,
      "overview": "In the civil wars of 16th century Japan, two ambitious peasants in Nakanogo want to make their fortunes. The potter Genjuro intends to sell his wares for vast profits in the local city, Omizo, while his brother-in-law Tobei wishes to become a samurai. A respected sage warns them against seeking profit in times of war but his advice goes unheeded, and their insistency leads to the ruin of their families.",
      "similar": [
         346,
         452507,
         13188,
         616,
         620,
         122,
         68730,
         51739,
         64686,
         343674,
         17979,
         77949,
         14282,
         288158,
         223,
         2323,
         3090,
         994,
         37950,
         58857
      ],
      "original_title": "雨月物語",
      "runtime": 94,
      "poster_path": "/gF4PQYOufm5WcQREHegJI7PjsDy.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Daiei Studios",
         "id": 881,
         "origin_country": ""
      }],
      "release_date": "1953-03-26",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kenji Mizoguchi"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Matsutarô Kawaguchi",
         "Hisakazu Tsuji"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0046478/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NDE0OTI3NF5BMl5BanBnXkFtZTcwNjEyMTIzMQ@@._V1._CR15,24,325,474_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Masayuki Mori, Machiko Kyô, Kinuyo Tanaka | See full cast and crew »"],
      "reviews": [
         "This holds a special place in my heart, and I still consider it to be absolutely one of the very greatest films ever made for adults. The work of a mature artist, it resonates with Buddhist practice, and is a profoundly moving tale of the suffering of the human condition, the violence of war, the possibilities of art uplifting the spirit, the possibilities of redemption of character. The closing scene is one of such deeply-felt compassion and understanding that it is almost frightening; it prefigures in a way the stunning and more personal close of the subsequent Mizoguchi film \"Sansho the Baliff\". On a lighter level, it is an amusingly sly allegory of the actual history of Japan for the 20 or so years prior to 1953, where in the end the women, embittered (or dead) as a result of their men's quixotic quest for military glory or war-profiteering, entreat them to give up their misguided and destructive dreams, settle down, and get back to their real responsibilities. Which they did. Originally available on LaserDisc.",
         "Having read much about this film, I thought I knew what to expect when I finally had the chance to see it. I was wrong; no amount of writing can convey the richness and impact of the images and the overall flow of the film-- which is why this commentary will be brief. Suffice it to say that I recommend this film wholeheartedly to anyone looking for cinematic poetry (though not, probably, to those who, misled by its being set during the Japanese Civil Wars, expect an action film). Perhaps the most striking thing about the film is the camera-work; on a first viewing one is scarcely aware of it much of the time, but the camera is in constant motion, emblematic of the restlessness which pervades not only the era and the central characters but, by implication, all of human life (in this regard, it's a very Buddhist film). This movement is never gratuitous; when the scene demands little or no movement the camera stays still. Notice, though, how often the camera's movement enhances the emotional impact of the scene, especially in the famous panning shot (not, as occasionally described, a 360 degree shot) of the reunion near the end. Along with this is Mizoguchi's penchant for long takes, which seduce the viewer into the rhythm of the film without calling attention to themselves or to his cleverness as a director. But these are technical comments which may or may not be helpful in focussing a viewer's attention; what really matters is the film itself as a whole. It is truly beautiful, and powerful in the unexpected way of great poetry. Technique and emotion, simplicity of means and complexity of effects, walk hand-in-hand here, and the result is remarkable in a way which film rarely attains.",
         "This is yet another superb addition to the Criterion Collection of the masterworks of Japanese cinema during the country's fruitful artistic period after WWII. Director Kenji Mizoguchi is not as well known as Akira Kurosawa, nor is he yet enjoying a renaissance like Yasujiro Ozu is now. However, he had a long, impressive career that stretched over four decades culminating in the 1950's with a handful of classic movies, the most famous being 1953's \"Ugetsu monogatori (Tales of Moonlight and Rain)\". Set in 16th-sentury Japan, it's a ghostly morality tale of two brothers, poor farmers who are both anxious to make their fortunes from the wartime activities surrounding them but via different means. The more focused Genjurô seeks his fortune through his homemade pottery which he sells in the bustling nearby town, and the younger Tobei's pipe dream is to become a samurai warrior. After their village is pillaged, the brothers set off on a boat to the same town on a fog-laden lake leaving their suffering wives behind. There Genjurô meets a noblewoman named Lady Wakasa, who appreciates his artistry and falls in love with him. However, she turns out to be the ghost of a woman who never experienced love, and this realization puts Genjurô into a desperate situation since he decided to leave his devoted wife Miyagi to marry her, a decision that will turn on him with supreme irony at the end. On the other hand, Tobei achieves his desire to become a samurai warrior but through dubious means, at which point he discovers his wife Ohama has become a prostitute after being raped by warriors in his absence. What Mizoguchi does remarkably well is interweave the two stories so that they reinforce and reflect upon each other seamlessly. He also avoids the pitfall of having the story pontificate upon the obvious morals of the story by not using archetypes but instead showing the realistic flaws in all the main characters. Without the use of special effects, the fantasy elements are not remotely contrived but rather emphasize the often nebulous difference between dreams versus reality, ambition versus happiness, and gratification versus fulfillment. The final spectral twist is a worthy precursor to \"The Sixth Sense\". Even more impressively, with the expert work of cinematographer Kazuo Miyagawa, Mizoguchi provides meticulous, often stunning tableaux to set his scenes, and his narrative is suffused with deep humanity even when the characters perform deplorable acts. The legendary Machiko Kyô plays Lady Wakasa with an appropriately otherworldly manner, at first remote but then romantically infatuated and gradually desperate to redefine her destiny. However, it's the quartet of actors who play the two couples that make the deepest impressions. Masayuki Mori portrays Genjurô with passionate fury, and Sakae Ozawa makes the foolhardy Tobei at once deceitful and sympathetic. Kinuyo Tanaka (Japan's first female director) provides the right amount of stoic gentility as Miyagi, and Mitsuko Mito makes Ohama's degradation hauntingly memorable. For anyone interested in Japanese cinema or simply a great ghost story beautifully told, this is a must.",
         "The movie starts out pretty uncomfortably, two peasants in 16th century Japan who dream of richness and glory so blindly, they can't even hear the pretty straight-forward protests of their loving wives who try to convince them that their happiness is fine at home. When one, a pottery smith, makes a small bundle selling his wares, they decide to make a much larger batch together and become rich. Forced out of their homes by an approaching war and uncertain where to go, they take their wares to a thriving market place, where the second peasant's ambition to be a samurai divides them and causes all four characters, the two peasants and their wives, to be separated, all fending for themselves amongst the war and various classes differently. At this point the film reverses itself and instead of being a pretty skin-deep, tragic bud of greed, it blooms into a beautiful and haunting tale of obsession and illusion. The two main stories of the peasants and their wives are opposite only in their imaged realism, where one peasant falls completely under the curse of an enchanting ghost and the other lies and steals his way to fame, only both of them are eventually knocked down from their own hubris and forced to finally awaken to what their wives have said all along. It's quite exquisite, this movie, with its long takes and its lack of the usual constructs that make up messages of obsession and greed. Once it gets beyond the small, uncomfortable, claustrophobic world of the peasant's home, it becomes audaciously challenging and mysterious, so that the same small home becomes amazingly wonderful and comforting. The very essence of the movie is breathed into the emotions of the audience in very subtle ways, making a very unforgettable cinematic experience. --PolarisDiB",
         "Ugetsu, based on a popular \"fairy tale\" in the Japanese folk tradition, is perhaps the greatest \"ghost story\" on film. Simple, direct, and beautiful in its visual style, one viewing of this movie will make you a fan for life. See it today, and hope that you can see it on the big screen soon. 10!",
         "In Japan, due to its Buddhism and Shinto culture, the term Ghost is an description for evil of the spirits world. and the idea of spirits which dispatch from its physical body are describe as phamton. from the difference associate with these 2 terms we can understand that even in spirits there is description for the good and bad spirits. this is similar to the Chinese mythology for ghost. even if the spirits was wrongly accused, and coming back to human world for its revenge, this is still consider as an spirits rather than ghost, as it has its positive of motive and would not harm people who is not associate with his death. since spirits normally does not appear in the human world, and its appearance often associate with unfinished matter or grudge. which is the main characteristic for most of the Japanese film. the most impressive Japanese ghost story is Ugetsu monogatari(1953), it was base on the novel with the same title. we can analysis the idea of Japanese ghost film via 2 aspect of the film. Firstly, while Genjuro was selling pottery in the market, he was been order by Lady Wakasa and its nurse maid to send the good to their mansion personally, which was the starting point of ghostly love relationship. By the hand of prestige cinema photographer, Kuzo Miyagawa, the mystic atmosphere, the trembling music of sanmise, the ghostly voice of men grudging, gives the mansion an appeal of a haunted mansion. The use of top view camera technique with the character Noh play like appeal,gives the scene much more mysterious, secluded, ghostly, euphoria aspect of the fantasy world. which above all explores the art of Japanese traditional beauty.although it is an black and white film, but Kuzo Miyagawa create an color of bewitch ghostly character on Lady Wakasa. The very motive for the existence of Lady wakasa was to have a taste of love, as she was kill before she can understand what love is, after resurrect by the nursemaid, she have become and spirits that looking for the ideal man to love. that is why she put a spell on Genjuro. to love not to hurt. The second aspect for Genjuro associate with spirits was at the end part of the movie, while He push open the cripple door of his home, he saw an empty house, yet after the camera return an image of the room, Miyagi, Genjuro's wife appear, who was setting beside the stove alone tailoring clothes, and waiting for his husband to eat and change into comfy kimono, Genjuro feel extremely tire after all the events therefore he quickly falls asleep, next morning, when the villager master realize he is return went into his home and explain the tragic of her wife. and the disappearance of his son, coincidentally, his son returns in the very moment. The movie finish with a long shot as the kid playing beside his mothers grave while Genjuro praying, which symbolize Miyagi has finally saw the father and son reunited and now he is able to rest in peace, and fly to heaven. The movie demonstrate the childish, stubbornness and foolishness of male. yet it purify the females character as loving and sincere, which demonstrate no scary or horrifying intention to the viewer when associate with ghost. infect we associate with the idea of gentleness, shyness of its character. the eternal serenity towards the love one can only be associate with ghostly figure in a time transcend world.",
         "This film used to make all the top ten lists for the greatest movies ever made. However, with the discovery of Ozu and the ( justified) cinematic canonization of Kurosawa, Mizoguchi has been been neglected. This is a pity, for he was one of the supreme masters of the cinema. Ugetsu Monogatari is one of the most beautiful explorations of the human spirit ever put on the screen. Rarely has black and white been used more beautifully, or the supernatural portrayed more convincingly. If Dreyer is the great \"Protestant\" of the cinema, and Bresson, Rossellini, and, it must said, Hitchcock and Ford, its great \"Catholics', Mizoguchi is its greatest Buddhist.",
         "In the beginning of the springtime in the period of the Japanese Civil Wars of the Sixteenth Century in Lake Biwa in the Province of Omi, the family man farmer and craftsman Genjurô (Masayuki Mori) travels to Nagahama to sell his wares and makes a small fortune. His neighbor Tobei (Sakae Ozawa) that is a fool man dreams on becoming a samurai, but he can not afford to buy the necessary outfit. The greedy Genjurô and Tobei work together manufacturing clay potteries, expecting to sell the pieces and enrich; however, their wives Miyage (Kinuyo Tanaka) and Ohama (Mitsuko Mito) are worried about the army of the cruel Shibata that is coming to their village and they warn their ambitious husbands. Their village is looted but the families flee and survive; Genjurô and Tobei decide to travel by boat with their wives and baby to sell the wares in a bigger town. When they meet another boat that was attacked by pirates, Genjurô decides to leave his wife and son on the bank of the river, promising to return in ten days. Genjurô, Tobei and Ohama raise a large amount but Tobei leaves his wife to buy the samurai outfit and seek fame and fortune. Meanwhile the female aristocratic Lady Wakasa (Machiko Kyô) and her servant ask Genjurô to bring her shopping to her fancy Kutsuki House. Sooner Genjurô and Tobei discover the price they have to pay for their ambition. \"Ugetsu Monogatari\" is the first movie that I have watched of Kenji Mizoguchi and I am impressed with this masterpiece. This supernatural story is very well constructed in a historic context of the Japanese Civil Wars of the Sengoku period, with two family dramas caused by the blindness of greed. This feature is supported by a magnificent cinematography in black and white, and the scene in the foggy lake is a piece of art. The performances are awesome, and the cast really seems to be living in the Sixteenth Century in Japan. My vote is nine. Title (Brazil): \"Contos da Lua Vaga\" (\"Tales of the Vague Moon\")",
         "Set amidst a war-torn feudal Japan in the 16th century, this tells the tale of two peasants who yearn for success, one in terms of wealth, the other as a samurai warrior. Together they disregard the welfare of their families and follow their ambition, and learn the hard way the folly of their desires. Mizoguchi is an exemplary film maker, often overshadowed by the attention received by Kurosawa. Ugetsu is the second of his films I have seen, following the exceptional Sansho Dayu, and possesses a quality that transends the sublime and enters richly lyrical territories. His compositions are beautiful; not a frame of film is wasted in depicting the characters and their surroundings with astonishing vividity. It is wholly justified for winning the Venice Film Festival's top prize in 1953. The peasant who seeks wealth finds himself seduced by the ghost of a princess whose family home was wiped out, and who was resurrected by her nurse to give her the chance at love that she never experienced in life. His friend finds success as a samurai- not through any prowess or skill, but by luck- but he too finds his actions carry a duplicitous edge to them, as the fortunes of his wife are unfavourable, to say the least. While much of the imagery is harsh; implicit rapes, murders, mass looting and deprivation of hard working peasants- the overall tone is far from defeatist. That was Mizoguchi's power, as evidenced in Sansho Dayu. He was not only one of cinema's greatest directors of women; in the case of Ugetsu Monogatari, he also captures the essence of the endurance of human love, transcending even death. See it and be amazed.",
         "I first saw this masterpiece in 1973 during a special retrospective of Japanese films on PBS hosted by the former US Ambassador to Japan, Edwin O. Reischauer. I was 18 at the time. Twenty-six years later this film still holds a special place in my heart (did you not fall in love with Machiko Kyo?). It also reminds me that Kurosawa's shadow has unfortunately obscured the works of Mizoguchi and Konichika (my apologies if I've misspelt the latter). Before writing this comment I reviewed the voter history and was dismayed to discover that three people ranked this film 3 or less on a scale of 10. Did I miss some flaw in this film? I hope this isn't too opinionated, but if you don't love \"Ugetsu\" then perhaps you should avoid foreign films altogether."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": ["Daiei Studios"],
      "summaries": [
         "In the beginning of the springtime in the period of the Japanese Civil Wars of the Sixteenth Century in Lake Biwa in the Province of Omi, the family man farmer and craftsman Genjurô travels to Nagahama to sell his wares and makes a small fortune. His neighbor Tobei that is a fool man dreams on becoming a samurai, but he can not afford to buy the necessary outfit. The greedy Genjurô and Tobei work together manufacturing clay potteries, expecting to sell the pieces and enrich; however, their wives Miyage and Ohama are worried about the army of the cruel Shibata that is coming to their village and they warn their ambitious husbands. Their village is looted but the families flee and survive; Genjurô and Tobei decide to travel by boat with their wives and baby to sell the wares in a bigger town. When they meet another boat that was attacked by pirates, Genjurô decides to leave his wife and son on the bank of the river, promising to return in ten days. Genjurô, Tobei and Ohama raise a large amount but Tobei leaves his wife to buy the samurai outfit and seek fame and fortune. Meanwhile the female aristocratic Lady Wakasa and her servant ask Genjurô to bring her shopping to her fancy Kutsuki House. Sooner Genjurô and Tobei discover the price they have to pay for their ambition.",
         "In the civil wars of 16th century Japan, two ambitious peasants want to make their fortunes. The potter Genjuro intends to sell his wares for vast profits in the local city, while his brother-in-law Tobei wishes to become a samurai. Their village is sacked by the marauding armies, but Genjuro's kiln miraculously survives, and they and their wives head for the city. However, Genjuro soon sends his wife Miyagi back home, promising to return to her soon, and Tobei, in his keenness to follow the samurai, abandons his wife Ohama. Meanwhile, a wealthy noblewoman, the Lady Wakasa, shows an interest in Genjuro's pots, and invites him to her mansion.",
         "A fantastic tale of war, love, family and ambition set in the midst of the Japanese Civil Wars of the sixteenth century."
      ],
      "budget": 0
   },
   "movielensId": 8199,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1953-03-26",
      "dvdReleaseDate": "2005-11-08",
      "directors": ["Kenji Mizoguchi"],
      "runtime": 94,
      "movieId": 8199,
      "title": "Ugetsu",
      "mpaa": "",
      "actors": [
         "Masayuki Mori",
         "Machiko Kyô",
         "Kinuyo Tanaka",
         "Eitarô Ozawa",
         "Ikio Sawamura",
         "Mitsuko Mito",
         "Kikue Môri",
         "Ryôsuke Kagawa",
         "Eigoro Onoe",
         "Sugisaku Aoyama",
         "Saburo Date"
      ],
      "imdbMovieId": "0046478",
      "originalTitle": "雨月物語",
      "genres": [
         "Fantasy",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "0dUwz9j4oGM",
         "NX95N9EuLgo"
      ],
      "plotSummary": "In the civil wars of 16th century Japan, two ambitious peasants in Nakanogo want to make their fortunes. The potter Genjuro intends to sell his wares for vast profits in the local city, Omizo, while his brother-in-law Tobei wishes to become a samurai. A respected sage warns them against seeking profit in times of war but his advice goes unheeded, and their insistency leads to the ruin of their families.",
      "tmdbMovieId": 14696,
      "avgRating": 3.93107,
      "releaseYear": "1953",
      "numRatings": 486,
      "posterPath": "/gF4PQYOufm5WcQREHegJI7PjsDy.jpg"
   }
}