{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "living dead",
         "id": 157351
      }],
      "imdb_id": "tt0028478",
      "video": false,
      "title": "The Walking Dead",
      "recommendations": [
         30307,
         26925,
         3164,
         99545,
         3165,
         28423,
         30348,
         84719,
         29468,
         23255,
         3484,
         27003,
         24111,
         38260,
         3574,
         28426,
         84419,
         27918,
         58733,
         23126
      ],
      "backdrop_path": "/rS5bgCi4puj9vAgOyIm5oAaevJ2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Ellman",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccaf",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nolan",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccb3",
               "name": "Ricardo Cortez",
               "profile_path": "/ztYv4178LAnIEPWgaZALprMWTEj.jpg",
               "id": 83476,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Evan Beaumont",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccb7",
               "name": "Edmund Gwenn",
               "profile_path": "/6IL8cwEo3yPZs6hLq07YC0boUoI.jpg",
               "id": 22600,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe452ec3a368484e04ccbb",
               "name": "Marguerite Churchill",
               "profile_path": "/2QQFoaAwRCZ1js2tsCGZOWBBNFR.jpg",
               "id": 97005,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccbf",
               "name": "Warren Hull",
               "profile_path": "/p61fiQiklN3iI1DCBJ0Va41jr8l.jpg",
               "id": 97006,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Loder",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccc3",
               "name": "Barton MacLane",
               "profile_path": "/vmfmiGO6cusQn9B8jw9oLPnSYr6.jpg",
               "id": 14451,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "District Attorney Werner",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccc7",
               "name": "Henry O'Neill",
               "profile_path": "/65tPuizhifyCJz5TR2bV1ygnmnU.jpg",
               "id": 20368,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Judge Roger Shaw",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04cccb",
               "name": "Joe King",
               "profile_path": "/fKd4KAwm6GYXVhbvhynQqvhWjN3.jpg",
               "id": 84640,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Prison Warden",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04cccf",
               "name": "Addison Richards",
               "profile_path": "/ztihdDQTNfW1ASDKkMUBGDlRonc.jpg",
               "id": 97007,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Blackstone",
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04ccd3",
               "name": "Paul Harvey",
               "profile_path": "/xDk9GgK3ykYIiXeM5ybhoJUwlzg.jpg",
               "id": 34320,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Merritt",
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04ccd7",
               "name": "Robert Strange",
               "profile_path": "/65rjVzkRxOa7mNtjuxbKJqGcrU9.jpg",
               "id": 34036,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Judge Roger Shaw",
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04ccdb",
               "name": "Joe Sawyer",
               "profile_path": "/7waP4U3fOYpqUr8jJd4qAvgWWqK.jpg",
               "id": 3341,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Betcha",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccdf",
               "name": "Eddie Acuff",
               "profile_path": "/44w2TkN7SmnPz05iJrbwF9LW590.jpg",
               "id": 33179,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04cce3",
               "name": "Kenneth Harlan",
               "profile_path": "/tBefmAZJJboB0obrsAshOFwT06X.jpg",
               "id": 34091,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Sako - Loder's Butler",
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04cce7",
               "name": "Miki Morita",
               "profile_path": "/yKC8sTyAEF04f0HUaZYRfzLVAWp.jpg",
               "id": 97008,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Mrs. Shaw",
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04cd0f",
               "name": "Ruth Robinson",
               "profile_path": null,
               "id": 967133,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccab",
               "name": "Michael Curtiz",
               "profile_path": "/3rQXKSKx1IV7Lg9LwPaJicQdAkC.jpg",
               "id": 4109,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04cced",
               "name": "Hal Mohr",
               "profile_path": null,
               "id": 14284,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe452ec3a368484e04ccf3",
               "name": "Orry-Kelly",
               "profile_path": null,
               "id": 4127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04ccf9",
               "name": "Ewart Adamson",
               "profile_path": null,
               "id": 144022,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04ccff",
               "name": "Peter Milne",
               "profile_path": null,
               "id": 113762,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe452ec3a368484e04cd05",
               "name": "Robert Hardy Andrews",
               "profile_path": null,
               "id": 121090,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe452ec3a368484e04cd0b",
               "name": "Lillie Hayward",
               "profile_path": null,
               "id": 62756,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.169696,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27115,
      "vote_count": 20,
      "budget": 0,
      "overview": "A gang of racketeers frames down-on-his-luck John Elman for murder. After he's found guilty, evidence is brought forth proving his innocence. But it is too late and he is executed anyway. A doctor sees an opportunity to use an experimental procedure to restore him to life but is that entirely possible? Desirable?",
      "similar": [
         485415,
         8408,
         45031,
         72190,
         19908,
         336843,
         82654,
         24920,
         11683,
         290999,
         16281,
         338676,
         434873,
         23963,
         106845,
         177221,
         74726,
         343173,
         24935,
         20842
      ],
      "original_title": "The Walking Dead",
      "runtime": 66,
      "poster_path": "/iqPdo0MyVItCmBc5pH5dAn1LCYp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1936-03-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "HE DIED a man with a hunger to love... and returned a monster with an instinct to kill.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Michael Curtiz"],
      "runtime": 66,
      "synopsis": null,
      "writers": [
         "Ewart Adamson",
         "Peter Milne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028478/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxMDEwNDQ0Nl5BMl5BanBnXkFtZTgwNTg2Nzg4MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Boris Karloff, Ricardo Cortez, Edmund Gwenn | See full cast and crew »"],
      "reviews": [
         "A stylish and expert hybrid between gangster drama and horror (of the mad scientist and zombie variety) made by a studio and director who had cut their teeth on the former but who proved equally adept at the latter on occasion; as for star Boris Karloff, he fared better here than in BLACK Friday (1940), a not dissimilar concoction. Karloff, as always, is remarkable and very moving as the hapless 'monster': his characterization draws on a few of his previous roles - THE CRIMINAL CODE (1931), FRANKENSTEIN (1931), THE RAVEN (1935) - but also looks forward to Karloff's \"Mad Doctor\" cycle which began with THE INVISIBLE RAY (1936). Edmund Gwenn is also effective in one of his earlier roles as the doctor who brings Karloff back to life after he is wrongly executed: obsessed by an urge to learn what goes on after death, he drives Karloff on but the latter's only concern is to get even with the corrupt gang which set him up (including Ricardo Cortez's shady lawyer, Barton MacLane as one of his associates and Joe Sawyer as a hit-man, the real murderer). The film's best moments feature Karloff's zombie rampage which, incongruous as that may seem, have a touch of poetry about them - not least because of the way that every member of the gang dies by his own hand through accident rather than Karloff's! At first, I was wary of the fact that a barely conscious Karloff could travel and somehow reach the gang's home addresses (of which he could have had no prior knowledge) in order to exact his revenge, but it is later suggested that Karloff became all-knowing in the hereafter - which is, after all, what every religion foresees for its believers. THE WALKING DEAD is a solid little film and I hope that someday Warners releases a Box Set of their lesser-known horror catalogue, to include THE MAD GENIUS (1931), DOCTOR X (1932), THE MASK OF FU MANCHU (1932), MAD LOVE (1935), MARK OF THE VAMPIRE (1935), THE DEVIL-DOLL (1936), THE RETURN OF DR. X (1939) and THE BEAST WITH FIVE FINGERS (1946)...",
         "Eerie, creepy, beautifully shot oddity, the kind of stuff they just wouldn't know how to make any more (not that they would want to). Karloff gives a fine performance as the gaunt, haunted patsy in a murder rap. Stand-out scene is definitely the fantastic build up to Karloff's undeserved execution, as sad cello music plays and prison guards banter about baseball while a man's life hangs in the balance. The ideas dry up a bit as King Karloff haunts his killers, but his sinister solemnity captivates the interest, and it's all crammed into little more than an hour.",
         "This is a one of a kind--combination horror/gangster! Karloff (who's just incredible) is bought back from the dead after being wrongfully executed and takes revenge on those who set him up. It's basically a gangster film until the last half hour--then the scary stuff kicks in. The film is VERY short (70 minutes) and moves quickly. It's intelligent (although bringing a person back from the dead after they've been electrocuted is a stretch!), very well-directed (effective use of shadows and camera angles) but the main reason to watch is Karloff. He never received the attention he deserved because he made horror films, which are still looked down upon. He was a wonderful actor and in this movie gives one of his best performances (\"The Black Room\" is probably THE best he ever gave). Just check out his expression after he \"kills\" the men he goes after. Excellent job. A perfect \"B\" movie. Don't miss it! I don't believe this is on video (I saw it on TCM), so if you get a chance, SEE IT! You won't be disappointed!",
         "Dispersed throughout the Universal reign of horror in the thirties came several remarkably well-made MGM and Warner Brother horror films. The Walking Dead is one such film produced by Warner Bros. that mixes their predominant genre of expertise, the gangster film, with the horror film. You might say in a way that it is a blend of reality and the supernatural. This film has stood the test of time well, and is a nice, taut story of a man wrongly accused of a crime, miraculously brought back to life, and eventually seeking vindication and justice from those that did him wrong. Karloff is a masterful lead in that he is able to frighten us and exact from us a tremendous amount of pity and understanding. In point of fact, his characterization of Ellman is one of his most powerful and sympathetic, a true tragic hero toyed with by crime bosses and a corrupt lawyer. Most of the acting beyond Karloff is rather pedestrian, with Edmund Gwenn turning in a nice portrayal of a questioning scientist and Ricardo Cortez wonderfully playing the stereotypical slimy lawyer. Curtiz does a good job of direction and lighting and shading are used to almost perfect results. A must see for the classic horror buff!",
         "I have to agree with those who consider Karloff an underrated actor. Given the nature of this film and its fantastic premise, he brings a real subtlety to the role. After each of his antagonists meet their untimely demise, there is just a hint of remorse and sadness. Who else in the horror genre would have underplayed it like that? Karloff becomes the walking conscience of his tormentors and apart from the films failings regarding plot, effects etc., I think it works quite nicely on the level of allegory.",
         "THE WALKING DEAD (Warner Brothers, 1936), directed by Michael Curtiz, is an interesting little item from the \"horror\" genre of the 1930s. Naturally starring Boris Karloff, but surprisingly produced and released by Warner Brothers instead of by Universal, where films of this sort were filmed and Karloff under studio contract. Being a Warners film, this also has the trademarks of its very own popular genre, the \"gangster\" story, yet, in this case, the use of modern-day setting with the blend gangsters with tales of the supernatural and science fiction. The story opens with Judge Roger Shaw (Joseph King), in spite of threats from the mob, convicting a racketeer named Steven Martin (Kenneth Harlan) to a ten year prison sentence. Nolan (Ricardo Cortez), Martin's lawyer, sets out to do away with the judge by arranging one of his fellow racketeers, \"Trigger\" Smith (Joseph Sawyer), to employ John Ellman (Boris Karloff), an out-of-work musician out on parole for two weeks following his ten year prison sentence, to \"spy\" on Shaw, the judge who also had sent him up, on the grounds that Shaw's wife suspects her husband of being unfaithful, and all Ellman has to do is watch his house and take notes. One night while spying on Shaw by his property, the judge is murdered elsewhere by the gangsters who take the body and leave it in the back seat of Ellman's car. At the same time, this is witnessed by a young couple, Jimmy and Nancy (Warren Hull and Marguerite Churchill), who remain silent after they are personally threatened. After Ellman notices the couple driving away, he discovers the body in his car. The next scene shifts to the courtroom where Ellman pleads his innocence and that there are witnesses who can verify his story, but with the \"help\" of his attorney Nolan, he gets him convicted of first degree murder and to face execution. On the night he is to go to the electric chair, Jimmy and Nancy come forth to Doctor Beaumont (Edmund Gwenn), their employer and scientist, who immediately telephones Nolan to contact the governor to stop the execution. Nolan purposely awaits until it is too late, and by then, the death sentence is carried out. Beaumont orders the autopsy to be stopped so that he may revive the body. After Ellman is brought back from the dead, he appears in a \"zombie\" state of mind, remembering nothing, but knowing precisely whom his enemies are, and through a supernatural force, goes after each one of those gangsters to learn why they had him framed, only to witness their destinies through accidental occurrences. Featured in the supporting cast are Warner Brothers stock company of Barton MacLane as Loder; Henry O'Neill as District Attorney Werner; Addison Richards as the Prison Warden; Eddie Acuff as Mitchell; with Paul Harvey as Blackstone and Robert Strange as Merritt. Boris Karloff is no stranger in playing a corpse resurrected from the dead. His role as The Monster in FRANKENSTEIN (Universal, 1931) or THE MUMMY (Universal, 1932), immediately come to mind, yet, in this production, he somehow resembles the monster, but in this case, doesn't go out on a murderous rampage in spite that he actually does have just cause to avenge his evil doers. Karloff's John Ellman is actually a gentle soul who, after being executed for a crime for which he is innocent, retains his gentleness even through his second life, yet, succeeds in bringing fright through his eyes to those who had done him wrong. He even finds peace and tranquility while roaming about the cemetery. Being a musician and pianist himself, he has a favorite musical piece, a somewhat quiet but moody composition he asks to be played as he walks his last mile to the execution chamber. As for the music, Ellman adds, \"I like to think Heaven like that.\" After his \"resurrection\" by Doctor Beaumont, the story occasionally shifts to mystic overtones as Beaumont tries to learn from Ellman his experience in death. At one point, Ellman responds, \"Leave the dead to their Maker. The Lord our God is a jealous God.\" In many ways, THE WALKING DEAD is highly original in its premise and during its short 66 minutes, starts off a bit slowly with some intrusive \"comedy relief\" provided by Eddie Acuff, whose sure thing in making wagers which turns out to be a bad gamble, but soon builds itself to a fast and memorable conclusion. During its second half, the movie plays like a \"film noir\" mystery with its dark atmospheric background along with some very creepy stalking from the titled character. THE WALKING DEAD may not be Academy Award winning material, but will guarantee to win a new and appreciative audience whenever shown on Turner Classic Movies. (**)",
         "Michael Curtiz directed this odd combination of gangster and horror films for Warner Bros. Karloff is a minor gangster released from prison who is framed and executed for murder. He's brought back to life when his name is cleared and confronts each of the men who framed him with his knowledge from beyond the grave. The execution scene is absolutely excruciating, as the only witnesses to the crime try to get the corrupt governor to call in a pardon while the music-loving Karloff walks to the electric chair, accompanied by a cello.",
         "One of the best horror films of the 30s. The only criticism lies in some of the acting by the secondary characters. Otherwise, superb direction, magnificent Hal Mohr photography, good script and story, and excellent music score by Bernhard Kaun (which was NOT listed in the credits by the way). Even if you are not a horror fan, it rates high as a rainy day diversion.",
         "This film is interesting because Karloff does end up a figure of doom to many people, but unlike other films his victims are not sympathetic at all, and he is not murderous. He has been framed for a killing by a group of criminals led by Ricardo Cortez and Barton MacLane, and is sent to the electric chair. But Edmund Gwenn has designed a method of restoring life, and does so to Karloff. The problem is that Cortez and the others are not too happy about his resurrection, especially as he seems to be omniscient towards them about their guilt. But he is also increasingly able to bring about their demises, all in rather horrific fashion. The trick that is being missed in most of the reviews of the film that are listed here is that Karloff is not really an avenging type here. His personality comes out in the first twenty minutes of the film, where he is panicking because of the tightening noose of fake circumstantial evidence brought against him, and then by his gradually accepting his doom as impossible to avoid. When he returns from the dead, he is silent (one could add \"as the tomb\" and be correct). He does not have much to say, and attempts by Gwenn and the others to ask him what life is like on the other side are met with quick dismissive comments. But it is soon apparent that Karloff is not really happy being back alive. He was, despite the unfair way it was brought about, at peace when he died. He and God knew he was innocent. The various \"revenge deaths\" are actually not revenge at all. Boris leaves his rooms with Gwenn and walks about town. He traces down Joe Sawyer and other villains, and they see him walk in \"zombie-like\" but also as a figure of doom. And each one accidentally dies by their own hand. And each time Karloff comes out of his trance after they die - and is as amazed at their demise as they probably were. The question the viewer should ask is why did the scriptwriter not have Boris kill these villains as they deserve. The answer is simple. When his character John Ellman died, Ellman had been framed for the crime. Although executed as a murderer, in reality Ellman was totally innocent. Depending on one's religious views, Ellman apparently died in a state of grace with God. He is forcibly brought back from the dead by man-made method, and yet is already marked as one who was blameless at death. He can't be changed now into an avenging creature. He can be used to cause panic among his enemies so they can cause their own demise. But as he is just an innocent instrument to rekindle justified fear in the hearts of evil men who destroyed him and the murder victim, he can maintain his state of innocence. Which he does. Even as he returns to the dead at the end, he still does not have any chance to describe heaven. And earlier he did mention that God is a jealous God.",
         "Gangster's led by Nolan (Ricardo Cortez) want to have a local law abiding judge killed, in doing so, they frame an ex-con, John Ellman (Boris Karloff) for the murder. Nolan acts as Ellman's lawyer and makes certain he is convicted and executed in the electric chair. Dr. Beaumont(Edmund Gwenn), a scientist is able to restore life to dead animals and seeks permission to try reviving Ellman's dead body. Dr. Beaumont is successful in restoring Ellman back to life. Boris Karloff goes on a killing rampage, running through graveyards making this picture very melodramatic with its black and white setting. Edmund Gwenn (Santa Claus in \"Miracle on 42nd Street) gives a very dramatic performance doing his very best to help Karloff. There is a great supporting cast with Marguerite Churchill, Warren Hull, Barton MacLane and Joseph Sawyer. This is truly a great Classic film."
      ],
      "genres": [
         "Crime",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "A gang of racketeers frames down-on-his-luck John Elman for murder. After a trial finds him guilty, evidence is brought forth proving his innocence, but it is too late and he is executed anyway. A doctor sees an opportunity to use an experimental procedure to restore him to life but is that entirely possible? Desirable?",
         "After hapless pianist and ex-con John Elman is framed for murder, he is resurrected by a scientist after his execution."
      ],
      "budget": 217000
   },
   "movielensId": 8220,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-03-14",
      "dvdReleaseDate": "2009-10-06",
      "directors": ["Michael Curtiz"],
      "runtime": 66,
      "movieId": 8220,
      "title": "The Walking Dead",
      "mpaa": "",
      "actors": [
         "Boris Karloff",
         "Ricardo Cortez",
         "Edmund Gwenn",
         "Marguerite Churchill",
         "Warren Hull",
         "Barton MacLane",
         "Henry O'Neill",
         "Joe King",
         "Addison Richards",
         "Paul Harvey",
         "Robert Strange",
         "Joe Sawyer",
         "Eddie Acuff",
         "Kenneth Harlan",
         "Miki Morita",
         "Ruth Robinson"
      ],
      "imdbMovieId": "0028478",
      "originalTitle": "The Walking Dead",
      "genres": [
         "Crime",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A gang of racketeers frames down-on-his-luck John Elman for murder. After he's found guilty, evidence is brought forth proving his innocence. But it is too late and he is executed anyway. A doctor sees an opportunity to use an experimental procedure to restore him to life but is that entirely possible? Desirable?",
      "tmdbMovieId": 27115,
      "avgRating": 2.61364,
      "releaseYear": "1936",
      "numRatings": 22,
      "posterPath": "/iqPdo0MyVItCmBc5pH5dAn1LCYp.jpg"
   }
}