{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0471911",
      "video": false,
      "title": "Seven Invisible Men",
      "recommendations": [],
      "backdrop_path": "/ztH3DfGl6QDu7GmUxGODyFdV3sj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Masha",
               "gender": 0,
               "credit_id": "52fe4a3e9251416c750e28fb",
               "name": "Rita Klein",
               "profile_path": null,
               "id": 1090076,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mila",
               "gender": 0,
               "credit_id": "52fe4a3f9251416c750e2903",
               "name": "Saakanush Vanyan",
               "profile_path": null,
               "id": 1153528,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bobik",
               "gender": 0,
               "credit_id": "52fe4a3f9251416c750e2907",
               "name": "Denis Kirillov",
               "profile_path": "/jO5TuR3hezOGaHqVx9Q54cbVPmV.jpg",
               "id": 34700,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Karpusha",
               "gender": 0,
               "credit_id": "52fe4a3f9251416c750e290b",
               "name": "Igor Cygankov",
               "profile_path": null,
               "id": 1153529,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pasha",
               "gender": 2,
               "credit_id": "5abb4310c3a368436200d227",
               "name": "Alexander Esaulov",
               "profile_path": "/rzHPmKLfcYn7TBFq386Yl6wH9y2.jpg",
               "id": 2009467,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Vanechka",
               "gender": 2,
               "credit_id": "5abccbd4c3a368435f02291b",
               "name": "Dmitry Podnozov",
               "profile_path": "/4OdsbOQ9KI3hwBM0LZsu1gEMrAI.jpg",
               "id": 1606883,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a3e9251416c750e28f3",
               "name": "Šarūnas Bartas",
               "profile_path": "/tG59rMcCdvNzp94NRPcV8MSASAi.jpg",
               "id": 109598,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a3f9251416c750e2911",
               "name": "Šarūnas Bartas",
               "profile_path": "/tG59rMcCdvNzp94NRPcV8MSASAi.jpg",
               "id": 109598,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5aa1ac059251412c5c003c36",
               "name": "Vladimir Golovnitsky",
               "profile_path": null,
               "id": 1993506,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [],
      "popularity": 0.115335,
      "production_countries": [
         {
            "iso_3166_1": "LT",
            "name": "Lithuania"
         },
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 99738,
      "vote_count": 1,
      "budget": 0,
      "overview": "The most unusual of all Bartas films, the pre-apocalyptic Seven Invisible Men (2005) starts off like a genre movie – a bunch of robbers trying to evade the police after stealing and selling off a car. It is only after about half an hour, when one of them arrives at a farm that is near completely severed from the rest of the world, that the film moves into the world of Bartas.",
      "similar": [],
      "original_title": "Septyni nematomi zmones",
      "runtime": 119,
      "poster_path": "/6hTRLsJndFAW05d6ifcSVPQOcDx.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Madragoa Filmes",
         "id": 11143,
         "origin_country": "PT"
      }],
      "release_date": "2005-12-10",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Lithuania",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sharunas Bartas"],
      "runtime": 119,
      "synopsis": null,
      "writers": ["Sharunas Bartas"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0471911/",
      "coverLink": null,
      "actors": ["Stars: Dmitriy Podnozov, Rita Klein, Aleksandre Saulov | See full cast and crew »"],
      "reviews": [
         "Kevin Costner's Russian cousin (the lead actor somewhat resembles Mr. Dances with Wolves), a woman and two other men leave the city in a stolen car. Something happens where 'Costner' gets separated from the group. He ends up on a farm where he seems to know the people. This is the beginning of a story that has to be completed mostly in the mind of the viewer. Beautiful photography of the Russian / Ukrainian prairie. Sergio Leone-style close-ups of non-speaking, serious looking faces. A point to stress: not much is spoken in this film. There is more dialog towards the end of the movie, but even then plot driving lines are very scarce. It's hard to either blindly recommend or tear down this contemporary 'Russian western' For most people, this is probably one of those \"you either love it or hate it\" cases. Personally, I have a little bit of both. There were plenty of times where the seemingly lack of plot and the slow pace were annoying. On the plus side, this picture has amazing shots of the southern countryside of Russia / Ukraine and its inhabitants. During the film festival where I saw this, I have seen about 20 other films after this one. However, images of this movie seem to be imprinted in my mind. So visually, this movie really stands out, I think. Also, the unpredictable and unconventional storytelling often creates a pleasant feeling of suspense. Mostly recommended if you are into a cinematic experience and don't mind letting your imagination complete the story or leaving the theater with some question marks above your head.. 7/10",
         "This was the first film that i saw in the Rotterdam Film Festival this year, and it was part of their Hot Spots program, looking at films from several locations in Europe, where it is felt that cinema is making a progression through external influences. Sharunas Bartas, a man of few words, both in answering questions at the festival as well as in his film uses intense cinematography, and amazing images to slowly progress his story. The characters do not say much, and at times it is humorous what little they actually do say to each other. It is not until these Lithuanians are gathered with family and friends, getting drunk trying to drink each other under they table that they become loud and festive. In this way, alcohol becomes the major way that the characters can express themselves, and actually become actively social. The imagery of the landscapes, and use of animals are quite interesting, at times it seems the goats and sheep are acting just as much as the people. Even though not much is said, through the neutral looks of people, and the obvious suffering that they must put up with is quite moving, and it doesn't seem like there is one moment that someone is not lighting or smoking a cigarette, possibly their only means of escape besides alcohol. This is not a film to see if you do not like slow, long shots, because at moments images are held for what seems like minutes, personally with my photographic background i find it beautiful, but there is not that much happening. Its more capturing the humanity of these poor, destitute Lithuanian characters, who despite their richly beautiful environments lead hard lives.",
         "I saw this movie at the Rotterdam International Film Festival. And it was the biggest disappointment of that day. I must say it beautiful shot the hole movie. But the dialog and the story was a drag. I mean if you want to sea nicely shot landscapes then you go to the woods or turn on Discovery channel. Maybe the point that was made that the characters lived a pointless live that was one thing that was brought over good. But to sit there in the cinema for 1,5 hours to see that.. Hmmm No.. it doesn't do it for me. I saw 2 other movies that day and I can recommend those 2. Opal dreams and Tideland. I really enjoyed watching those 2. If you have the opportunity to see one of those movies."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Studio Kinema",
         "Gémini Films",
         "Madragoa Filmes"
      ],
      "summaries": ["A group of drop-outs, losers and criminals are travelling in a stolen Mercedes seemingly aimlessly along numerous derelict houses and impassable roads to eventually end up on an old decaying state farm in Crimea, the southern tip of the former Soviet Union, where the mother, wife and daughter of one of them live. The men kill time with smoking, drinking and staring in front of them, but an undercurrent tension is brewing. On the last night they have a party that is equally destructive as their life."],
      "budget": 0
   },
   "movielensId": 82326,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2005-12-10",
      "dvdReleaseDate": null,
      "directors": ["Šarūnas Bartas"],
      "runtime": 119,
      "movieId": 82326,
      "title": "Seven Invisible Men",
      "mpaa": "",
      "actors": [
         "Dmitriy Podnozov",
         "Rita Klein",
         "Aleksandre Saulov",
         "Saakanush Vanyan",
         "Denis Kirillov",
         "Igor Cygankov"
      ],
      "imdbMovieId": "0471911",
      "originalTitle": "Septyni nematomi zmones",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "The most unusual of all Bartas films, the pre-apocalyptic Seven Invisible Men (2005) starts off like a genre movie – a bunch of robbers trying to evade the police after stealing and selling off a car. It is only after about half an hour, when one of them arrives at a farm that is near completely severed from the rest of the world, that the film moves into the world of Bartas.",
      "tmdbMovieId": 99738,
      "avgRating": 3.375,
      "releaseYear": "2005",
      "numRatings": 4,
      "posterPath": "/6hTRLsJndFAW05d6ifcSVPQOcDx.jpg"
   }
}