{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "car mechanic",
            "id": 3296
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "stolen cars",
            "id": 162842
         },
         {
            "name": "colleague",
            "id": 221412
         }
      ],
      "imdb_id": "tt0116164",
      "video": false,
      "title": "Regular Guys",
      "recommendations": [
         79908,
         32445,
         51764,
         97537,
         92326,
         27440,
         17539,
         19555,
         41922,
         12794,
         35638,
         16240,
         32519,
         239552,
         33247,
         15850,
         87107,
         73252,
         54934,
         32633
      ],
      "backdrop_path": "/6V7HG97Z1gBntElNBFxUEIkQggl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Christoph Schwenk",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae38f",
               "name": "Christoph M. Ohrt",
               "profile_path": "/mLghAeZy1G64BQWMhru9XgfTeCy.jpg",
               "id": 27320,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helen",
               "gender": 0,
               "credit_id": "52fe44dbc3a36847f80ae393",
               "name": "Carin C. Tietze",
               "profile_path": "/xuF3VqXhgruhmzGQWx6jISD2aN7.jpg",
               "id": 48690,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Edgar",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae397",
               "name": "Tim Bergmann",
               "profile_path": "/ekaOuiwfM6D7XZ6Fm99XAtLJWnA.jpg",
               "id": 56970,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae39b",
               "name": "Oliver Stokowski",
               "profile_path": "/lsw8F9zJSr1kfCaiIdQBKabUPI6.jpg",
               "id": 7804,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kallenbach",
               "gender": 0,
               "credit_id": "52fe44dbc3a36847f80ae39f",
               "name": "Rudolf Kowalski",
               "profile_path": "/52SxzTScQ8GxjWZBX2tHV4WFBCG.jpg",
               "id": 44430,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Marco",
               "gender": 0,
               "credit_id": "5349c4cfc3a3682dfe0006c0",
               "name": "Andreas Pietschmann",
               "profile_path": "/AqVCq1NPw3lTQa0oSJ7KwwOsWiS.jpg",
               "id": 1073985,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Deichsel",
               "gender": 0,
               "credit_id": "5349c4e5c3a3682ded00068e",
               "name": "Dieter Brandecker",
               "profile_path": "/tZJv3gs5PiNbkggsZTyDAM7EmXV.jpg",
               "id": 49167,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Iris",
               "gender": 1,
               "credit_id": "5349c506c3a3682dd100066d",
               "name": "Daniela Ziegler",
               "profile_path": "/6TC93DhNq0n1GSmmLcH3JIYxwC8.jpg",
               "id": 19884,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Karin",
               "gender": 0,
               "credit_id": "5832441f92514162c302e4bb",
               "name": "Ina Weisse",
               "profile_path": "/cP3PCsuzeuArJzvnm97ZbWMXeWn.jpg",
               "id": 34644,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mofafahrer",
               "gender": 0,
               "credit_id": "5832443292514162cb02fef1",
               "name": "Heinz-Werner Kraehkamp",
               "profile_path": null,
               "id": 50202,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a36847f80ae3a5",
               "name": "Rolf Silber",
               "profile_path": null,
               "id": 48685,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a36847f80ae3ab",
               "name": "Rudolf Bergmann",
               "profile_path": null,
               "id": 56971,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57b49b98c3a3686bd2000a1b",
               "name": "Rolf Silber",
               "profile_path": null,
               "id": 48685,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.871959,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 9098,
      "vote_count": 9,
      "budget": 0,
      "overview": "Christoph, cop and self-confident macho, has trouble with his fiance. After a long night he wakes up in the arms of Edgar, a good-looking, gay auto-mechanic. His live gets more and more troublesome after his girl friend throws him out of their apartment and as last resort he moves to Edgars place. Working together with a new, good-looking, very self-confident, female collegue, but living with a good-looking gay guy makes him pretty uncertain about his sexuality and his role as a cop. Written by Konstantin Articus",
      "similar": [
         449176,
         10938,
         184352,
         376867,
         11000,
         22597,
         26280,
         428493,
         338189,
         1966,
         1213,
         1422,
         398818,
         3597,
         9382,
         10806,
         455661,
         258480,
         26371,
         55347
      ],
      "original_title": "Echte Kerle",
      "runtime": 100,
      "poster_path": "/tPU3Qif3wRMOCEpdVMP3NKTvuQx.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TLA Releasing",
            "id": 328,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cobra Film",
            "id": 2572,
            "origin_country": ""
         }
      ],
      "release_date": "1996-05-30",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Macho cop finds himself in a relationship with a gay man and questions his life. German.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rolf Silber"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Rolf Silber",
         "Rudolf Bergmann"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0116164/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk0MTY3OTk5MF5BMl5BanBnXkFtZTcwMjQyMTQyMQ@@._V1_.jpg",
      "actors": ["Stars: Christoph M. Ohrt, Carin C. Tietze, Tim Bergmann | See full cast and crew »"],
      "reviews": [
         "(Note: the movie was released in late 2003 in the USA on DVD with excellent subtitles.) Despite being a sexist pig, the cop Chris Schwenk has likeable qualities -- it helps to be cute as well as off-balance, off-balance because he is bewildered to find himself living with a gay man (Edgar) with whom he may or may not have had drunken sex, and at the same time he's reluctantly drawn to a highly competent and attractive female colleague whom he resents and who (unnervingly) sees him for what he is and says so. Along the way there are varied opportunities for confusions and misunderstandings (it's a comedy, after all) that disconcert both the characters and the audience. No question Chris comes to be very fond of Edgar, for example, but the movie shrewdly makes it hard to tell how fond, and fond in what way -- and despite the fact that Edgar is somewhat mixed up in shady matters (is his garage really a chop-shop, as he jokingly claims? And what is a policeman to do about it?). All the principal characters are decidedly likeable, and even some of the minor ones such as Edgar's sophisticated and unflappable mother. The ending is a bit of a surprise, but a pleasant one, and upon reflection shouldn't be that much of a surprise anyhow (there are clues and hints sprinkled around, beforehand). By the way, there's frontal nudity (male) and naked men in a bed (and a bathtub) together, and a scene where Chris and Helen (the cop) are, well, doing what cops do (copulate -- har), but only a serious prude would be offended by any of it. A minor film without doubt, but droll and touching and well made.",
         "I have already seen a plenty of comedies about police men, macho men being dumped by girlfriend and then becoming sensible, men questionning their sexuality or a movie covering all those categories. But I have never seen such a pleasant comedy offering very clever funny situations and jokes as well as moving moments. There is one scene in this movie which, during the shot, made the crew on the set cry. I won't tell which scene it is, maybe you'll discover it by yourself, only so much: It's a dialogue which marks the end of something. I don't know how well the translation of the movie into English is, but everybody who understands German and gets the opportunity to see it in German - do it. It's very entertaining and definitely worth watching it!",
         "ECHTE KERLE or REGULAR GUYS is a polished little 1996 comedy from Germany that manages to tell a tale of mixing genders and satisfy all viewers no matter their viewpoint. Rarely has a film handled straight/gay juxtapositions with such an unbiased, honest and relaxed vantage. So often these gender bender films have the look of mini-budget movies, but this film as directed by Rolf Silber based on a screenplay by Silber and Rudolf Bergmann is photographed with panache by Jürgen Herrmann is slickly creative and wholly professional. Christoph Schwenk (Christoph Ohrt) is a plainclothesman police officer who does stakeouts spying on criminals with his partners Mike (Oliver Stokowski) and Helen (Carin Tietze). As the film opens Christoph is thrown out of his place by his 'ignored' girlfriend who has replaced him with a bodybuilder lover. Dismayed and angry, Christoph begins to drink, loses his car keys, his belongings on the street, and ends up with no place to stay as he stumbles into a gay bar where he passes out completely drunk. When he awakens he discovers he is in the arms of Edgar, a handsome auto mechanic who rehabs cars (?stolen?) and the question arises as to whether the two had sex during the night. Edgar is a kind and gentle man who evades this question, obviously feeling an attraction to Christoph. Edgar clothes Christoph so that he can find a place to stay and make it to work at the current stake out which just happens to be spying on car thieves. At work Mike and Helen notice something different in the paranoid Christoph who is more interested in finding an apartment and resolving his question of the previous night's sexual occurrences than he is with work. Unable to find any kind of hotel or apartment at all, he sleeps in his car until he eventually has the nerve to accept Edgar's offer for him to move in with him. Christoph makes it clear that is his Straight and Edgar makes it equally clear that he is Gay and likes Christoph. The relationship between Christoph and Edgar gradually strengthens, the threat of sexuality weakens to the point that as Christoph is seen in public with Edgar and when razed at work, Christoph sides with the idea of appearing gay and has a wonderful locker room confrontation with his fellow cops that says a lot about the barriers between gays and straights! Slowly, as Christoph settles into his new living conditions, he becomes enamored with Helen who is more than ready to pursue Christoph as she notices his 'machoisms' dwindle. At the same time Edgar's weekend lover Marco (Andreas Pietschmann) causes Christoph to query his surprising 'jealousy'. The three police become friendly with Edgar and Marco and when it seems they may be involved in the car theft ring under stakeout, they each find it easier to turn the other cheek and support each other. The ending pairs off the various members of this story in a warm and funny way, a manner which some may find predictable, but still satisfying and allowing all barriers to be down. The cast is uniformly excellent - the cameo supporting roles are very well done - and for once a film about straight perceptions of gay life makes ALL of the characters non-stereotyped: the men are all handsome hunks and the women are all beauties. This is light entertainment, a comedy with a message well stated.",
         "I totally enjoyed this movie, even with having to read the English. I can honestly say that it is one of my favorites. I could relate to Christoph and Edgar, having been in a similar situation. The scene in the locker room at the police station was great too, after rumors were going around. Christoph had reached a point in his thinking where he realized that it just didn't matter. And this happening after Christoph and Edgar came to terms with their relationship the night before. I also loved the ending. I wish I could say more, but I don't want to ruin it for anyone who hasn't watched it. I liked the movie so much, I bought the DVD.",
         "At last a film showing gay people as normal, healthy, good people. The policeman's frustration and skepticism is beautifully portrayed, so his loyalty to his new-won friend/pal in the end, which inspires a hidden homosexual colleague to step forward in the open. His anxiety of the possibility to having had sex with a man is taken seriously and the trust he experiences from the gay man is beautifully returned, especially in the bathing scene. A handsome actor giving life beautifully to the character of Edgar, the openly gay man, as a good guy. The story is not a happy-ending and in another way it is. The film showing Edgar as not taking advantage of the situation, being kind and respectful to his new friend. Unusually showing the gay man as a normal masculine guy with masculine interests without being outrageous in any way. Just normal! A heart warming film which should be recommended for viewing in schools.",
         "A cool fun film. Rarely is a gay-themed movie interesting in it's entirety, and this one delivers. It's a contemporary story of a cop, a bit down on his luck, and where circumstances lead him, and how it changes his life and friends; all with good humor and fun. Perhaps it's not as slick as most Hollywood fare; but then Hollywood could never handle the sensitivity and characters of this story. Sure, you have to read subtitles, but the dialog is direct, intelligent, funny, and always moving this tale forward; so one quickly gets caught up in this story. With an easy-on-the-eyes cast, and some beefcake; whether you are gay, straight, or just confused, you're gonna like it.",
         "Christoph M. Ohrt (who resembles a very young Richard Johnson) is outstanding in the lead role of a rather insensitive cop who suddenly finds his entire ego eroding when his girlfriend dumps him for a bodybuilder. This confused state of affairs is precipitated by his classic \"god was I drunk last night\" syndrome stemming from the fact that he wakes up one morning in bed and in the arms of a bigger and younger man who quite honesty declares he's in love with him! It is truly priceless to watch Ohrt's character deal with this...as he retreats into himself and gradually changes his nature...his only way of attempting to understand this forces him to be more observant and tolerant of others as he comes to learn more about himself. It's a painful and even a humorous situation which compromises him more than once, and in its unfolding imparts a great deal of joy and pleasure (entertainment!) to viewers. This comedic gem should not be overlooked. And hopefully, we will see much more of the delightful Mr. Orht in future.",
         "that America is still quite puritanical despite what appears to be the contrary. i have to say that i adore German cinema, though can only understand less than 0.5% of the language (i don't mind the subtitles). the movie, on the surface, would seem formulaic, but it actually has a few twists and unexpected turns. there's some morality lesson in there, but it wasn't delivered in a preachy way -- rather it made for some hilarious dialogue among the main character and his supposed comrades. not much more to say other than it was a really great film. if you find witty and fast-paced dialogues, you'll enjoy the film. the movie makes you really reconsider and think twice about your preconceived notions about certain \"types\" of people...if you know what i mean.",
         "The only copy I've seen was an all-region import disk from Kowloon; the subtitles which appear with Mandarin with English below, they are very sloppy, fading in and out, and not always jiving with the action. There are also lots of noticeable pops and crack in both score and screen. The story follows Christoph Schwenck, (or Schwenky, as some of the women he's bedded call him), a cop in some hard to pinpoint German town, who hits a streak of bad luck. More accurately is that he causes it himself. He prefers cruising the Autobahn and watching a football match to spending couple time with his lady, who proceeds to kick Schwenck to the curb, with his meager belongings in tow. For some hard to believe reason, there are apparently no rooms at nary an Inn, Boarding House or Brothel anywhere within like a hundred mile radius... With no place to stay, he proceeds to get tanked, lose all his possessions, and wake up the next morning in the bed of, as well as the arms of another man. YIKES! \"What the *@!? did I just do?\" He leaves not knowing how far things went, or even who this other dude is, for that matter. But alas, he returns to become this gay dude's straight roommate (only temporarily, he assures us) and this bizarre mènage à quatre develops between Schwenck, Edgar (gay roomie), longtime police pal (male), and new partner (female). Pretty much every imaginable embarrassing situation that can happen to Schwenck does, and he proceeds thru the picture from embarrassment, humiliation and fervent denials to almost coming to embrace being gay. But Schwencky is straight, and stays true to that till the end. He gets the girl in the end, and the original quartet reshuffle, recouple and drive off into the sunset. Not a bad flick, it's fun watching Christoph squirm and rebuff Edgar, who never seems to give up. Some scenes are pretty graphic, and arguably distateful, to say the least, but you come away liking and maybe even identifying with one (or more) of the quartet, and thinking a bit more about tolerance and understanding. Best luck finding on ebay or something similar, and worth adding to your collection if you are: a) gay, b) female, c) open minded; but don't spend too much. I'll probably not watch the thing repeatedly, but I'll almost definitely pass it along.",
         "Regular Guys starts out with a silly scene about 2 cops undercover and busting someone over an incident I can't even recall. I was thinking I had picked up a very dated & low budget, poorly acted film. What was this silliness? However, as the film progressed I began to like it a bit more. There are some very endearing moments in this film and the actors make their characters very sympathetic. I began to think I had picked out a very unique film. True, some of the production seems very cheaply done and it appears slightly amateurish at times. Can't argue that. But there is something very likable here and I'm glad I saw this. I bought the interpersonal relationships here and really found myself liking these characters but I think the film is poorly executed at times. It's too bad because the actors did a very good job and by the time the film ends I wanted it to keep going. I would enjoy seeing it again despite some of the blatant flaws."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "Bayerischer Rundfunk (BR)",
         "Cobra Film GmbH"
      ],
      "summaries": ["Christoph, cop and self-confident macho, has trouble with his fiance. After a long night he wakes up in the arms of Edgar, a good-looking, gay auto-mechanic. His live gets more and more troublesome after his girl friend throws him out of their apartment and as last resort he moves to Edgars place. Working together with a new, good-looking, very self-confident, female collegue, but living with a good-looking gay guy makes him pretty uncertain about his sexuality and his role as a cop."],
      "budget": 0
   },
   "movielensId": 825,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1996-05-30",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Rolf Silber"],
      "runtime": 100,
      "movieId": 825,
      "title": "Regular Guys",
      "mpaa": "",
      "actors": [
         "Christoph M. Ohrt",
         "Carin C. Tietze",
         "Tim Bergmann",
         "Oliver Stokowski",
         "Rudolf Kowalski",
         "Andreas Pietschmann",
         "Dieter Brandecker",
         "Daniela Ziegler",
         "Ina Weisse",
         "Heinz-Werner Kraehkamp"
      ],
      "imdbMovieId": "0116164",
      "originalTitle": "Echte Kerle",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Christoph, cop and self-confident macho, has trouble with his fiance. After a long night he wakes up in the arms of Edgar, a good-looking, gay auto-mechanic. His live gets more and more troublesome after his girl friend throws him out of their apartment and as last resort he moves to Edgars place. Working together with a new, good-looking, very self-confident, female collegue, but living with a good-looking gay guy makes him pretty uncertain about his sexuality and his role as a cop. Written by Konstantin Articus",
      "tmdbMovieId": 9098,
      "avgRating": 2.69231,
      "releaseYear": "1996",
      "numRatings": 26,
      "posterPath": "/tPU3Qif3wRMOCEpdVMP3NKTvuQx.jpg"
   }
}