{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "opera singer",
            "id": 164920
         }
      ],
      "imdb_id": "tt0030202",
      "video": false,
      "title": "The Great Waltz",
      "recommendations": [],
      "backdrop_path": "/uw7rn8l7ecle8HYzlcOvG3b7Sve.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Poldi Vogelhuber",
               "gender": 1,
               "credit_id": "52fe4683c3a368484e094b2f",
               "name": "Luise Rainer",
               "profile_path": "/kX4vs7uLsRwAV3wRsXlO86Q63MA.jpg",
               "id": 125482,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Johann 'Schani' Strauss II",
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b33",
               "name": "Fernand Gravey",
               "profile_path": "/vhqP79ZpBziHd1N0wbAAK1M0h0H.jpg",
               "id": 30774,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Carla Donner",
               "gender": 1,
               "credit_id": "52fe4683c3a368484e094b37",
               "name": "Miliza Korjus",
               "profile_path": "/iQMMwihkzaTx9CumLlYiPOR1IZm.jpg",
               "id": 235544,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Julius Hofbauer, Music Publisher",
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b3b",
               "name": "Hugh Herbert",
               "profile_path": "/fQz73F4uiu09wQwnDOPdJydeqrE.jpg",
               "id": 34347,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Count Anton 'Tony' Hohenfried",
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b3f",
               "name": "Lionel Atwill",
               "profile_path": "/kZOpzski4M8SZLFNozaAgp7Gbgp.jpg",
               "id": 2495,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Kienzl",
               "gender": 2,
               "credit_id": "540841d8c3a368581b000e9e",
               "name": "Curt Bois",
               "profile_path": "/uw8SYxoA546jt0Or2pAFJbkJR1B.jpg",
               "id": 2313,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Dudelman",
               "gender": 2,
               "credit_id": "540841f3c3a368581e000e04",
               "name": "Leonid Kinskey",
               "profile_path": "/fM1pWZWlFdJZjyEOKSILNjbTYFn.jpg",
               "id": 4120,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Cellist",
               "gender": 2,
               "credit_id": "5408420bc3a3685833000da3",
               "name": "Al Shean",
               "profile_path": null,
               "id": 1027241,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mrs. Hofbauer",
               "gender": 1,
               "credit_id": "5408422dc3a368582c000d17",
               "name": "Minna Gombell",
               "profile_path": "/vmsZN3HHB9G9PsfAU5TUTrFy11f.jpg",
               "id": 32431,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Schiller",
               "gender": 2,
               "credit_id": "54084246c3a3685818000e6e",
               "name": "George Houston",
               "profile_path": "/qwC7YChaTFVOeos1nhY5G9tItKU.jpg",
               "id": 541888,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Vogelhuber",
               "gender": 2,
               "credit_id": "54084264c3a368582c000d1b",
               "name": "Bert Roach",
               "profile_path": "/pbqOEk3wSPJH7XZWEUp1UkZ0cDP.jpg",
               "id": 29987,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Mrs. Vogelhuber",
               "gender": 1,
               "credit_id": "5408427cc3a3685830000daa",
               "name": "Greta Meyer",
               "profile_path": null,
               "id": 977583,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "(uncredited)",
               "gender": 1,
               "credit_id": "594ba5b1925141312700f7dd",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Ship's Officer (uncredited)",
               "gender": 2,
               "credit_id": "594ba5d39251413155010124",
               "name": "Frank Mayo",
               "profile_path": "/3eNNCBwqvJtS1aTqy77mxtIZ3y4.jpg",
               "id": 133277,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4683c3a368484e094b2b",
               "name": "Julien Duvivier",
               "profile_path": "/Hm7rqRuqGLtsUdSTyuDXfvXYk5.jpg",
               "id": 39058,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b45",
               "name": "Gottfried Reinhardt",
               "profile_path": null,
               "id": 127522,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b4b",
               "name": "Samuel Hoffenstein",
               "profile_path": "/erPowu8SyMomovqmEanBavjm8iY.jpg",
               "id": 29596,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4683c3a368484e094b51",
               "name": "Walter Reisch",
               "profile_path": null,
               "id": 12362,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54084162c3a3685833000d90",
               "name": "Tom Held",
               "profile_path": null,
               "id": 1067439,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54084172c3a368582c000d10",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54084182c3a3685830000d9c",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5408419cc3a3685821000dcd",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 2,
               "credit_id": "554b5c5c925141045900110c",
               "name": "Joseph Ruttenberg",
               "profile_path": null,
               "id": 14678,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.218826,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62567,
      "vote_count": 1,
      "budget": 0,
      "overview": "Composer Johann Strauss risks his marriage over his infatuation with a beautiful singer.",
      "similar": [
         45317,
         323677,
         319888,
         10637,
         769,
         1578,
         5915,
         462,
         11202,
         640,
         371638,
         318846,
         389015,
         407445,
         363676,
         227306,
         396371,
         324786,
         369192,
         43959
      ],
      "original_title": "The Great Waltz",
      "runtime": 104,
      "poster_path": "/6O47nbIHbqlwiJSaXP4YAlx01Mn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Loew's Incorporated",
            "id": 31892,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1938-11-04",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Your beating heart,your pounding pulse will tell you it's the most exciting musical love story ever told!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Julien Duvivier",
         "Victor Fleming"
      ],
      "runtime": 97,
      "synopsis": "Johann Strauss II was a gifted amateur composer who worked in a bank. Johann found that he was often distracted by the melodies in his head and would end up writing waltz instead of computing figures on company time. After he got fired, he decided to become a professional composer. Johann and a group of amateur musicians put together a small orchestra and had their début performance in a casino. It was a huge success, both inside and outside of the casino were filled with people dancing to his waltz. One of those people was Carla Donner - the star of the Imperial Opera. Carla liked Johann's music and invited him to play in her lover Count Hohenfried's party. Defying social protocols and tradition, Carla sang to Johann's waltz as a common dance hall singer, and Johann became the most sought-after composer. Having negotiated an unprecedented profitable contract with music publisher Hofbauer, Johann married fiancée Poldi and the couple settled down in a big house. To show his support of the democratic revolution, Johann wrote a march and led the demonstration. Along the way the crowds saw Carla's carriage parked outside the Count's mansion and was about to attack her - the symbol of the corrupted upper-class. Johann came to Carla's rescue and proclaimed her a fellow artist; thus, the Lady Liberty of their demonstration. This saved Carla for the time being, but their luck turned when the military police arrived to break up the demonstration, Johann and Carla were arrested. They managed to escape but couldn't go home as most streets were barricaded, the cab driver took them to the Vienna Woods to rest for the night. Next morning, on their way back to the city, the various sounds of human and animal activities inspired Johann. Together with Carla and the cab driver, he came up with a melody Carla named \"The Tale of the Vienna Woods\". In need of an orchestra collaboration to finish composing this new waltz, they found a country inn that has an orchestra and Johann went to work. Carla didn't go back to the city but stayed with him - the two had fallen in love. But Johann was interrupted by a mob of crowds - the revolution had ended, a new emperor, in support of a constitution, was now in power. Back to the city, Johann continued to produce beautiful music; while his relationship with Poldi was anything but. Johann had started an affair with Carla, and as the Imperial Opera commission him to write a new opera for Carla, the affair became known to everyone. Unaware of Johann's infidelity, a socially-awkward Poldi didn't attend the opening night performance. Count Hohenfried paid her a short visit and gave her the cruel news. Poldi took a gun and rushed to the opera house, just in time to see Johann and Carla together, showered with applause and adoration. Realising that she had already lost Johann to Carla, Poldi asked Carla to look after Johann, congratulated him and went home. As Johann and Carla were about to board the ship heading to Budapest, he found that he couldn't abandon Poldi. He said goodbye to Carla and stayed on the pier for the rest of the night, not wanting to go home. In the morning, the sound of water movements from the boats and the washwomen around him brought back the melody he and Carla came up with in the Vienna Woods. This time, he finished the waltz and changed the name to \"The Blue Danube\".",
      "writers": [
         "Gottfried Reinhardt",
         "Samuel Hoffenstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0030202/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MjY0MTgxN15BMl5BanBnXkFtZTcwMjQzNDA1Mg@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Luise Rainer, Fernand Gravey, Miliza Korjus | See full cast and crew »"],
      "reviews": [
         "I was prepared to find that Julien Duvivier, maestro of such astonishing French pictures as 'Pépé le Moko' and 'Carnet de bal', had sold out completely to Hollywood, but actually 'The Great Waltz' blew me away. Yes, the story is utter hokum and bears only superficial similarity to the actual Johann Strauss II or the the Vienna of his time. Why is that a surprise to some? It's a given! Hollywood was always like that, now as ever. What Duvivier does manage to convey is the dream of Vienna, the illusory magic of the city that was the capital of musical Europe, and thereby of the world. Duvivier made this amazing film with attention to every detail, the smallest character performance, even the extras have obviously been minutely directed. The film is always stylistically innovative, the editing fast-paced and often surprising, the style whirling, ecstatic, dynamic, and at all times slightly camp. There are so many show-stopping scenes in the film that I wouldn't even know where to start listing them. The script is wonderful, the dialogue consistently funny, interiors are luminous, the cinematography revolutionary and clearly related to what Rouben Mamoulian was doing in Hollywood in the early 1930's. The actors? Absolutely great. Fernand Gravey does a fair job, but the two women shine above everything else. Polish coloratura soprano Miliza Korjus sings the Strauss songs in a way that admittedly sound rather corny and old-fashioned today, but as an actress, playing the opera diva that Strauss is two-timing his wife with, she is gorgeously wicked, one of the most glamourous beings even in the Hollywood of the 30's. But even she is overshadowed - by Luise Rainer who, in this picture, can do no wrong in a part that is very, very hard to make substantial. She is Strauss' long-suffering, unselfish wife, but there is absolutely no melodrama in her performance. The evolution of the chararacter that is Poldi Strauss is extremely well-calculated, and she remains the centre, the gravity of the picture. And when we think that now she has suffered long enough, she says, \"Now is not a time to lie down, now is time to act!\". Forget all petty reservations and brace yourselves for a real treat, a film that time has all but forgotten, but a masterpiece none the less.",
         "Perhaps the number one Hollywood musical film of all time. \"Gorgeous Korjus\" was coined and used by Louis B. Mayer to promote her film career, which understandably would be short. Not only is she gorgeous in GW but turns in an excellent acting performance which drew an academy award nomination. Her acting role rivals or exceeds consummate actress and two-time academy award winner, Luise Reiner. Displaying the temperament of a real primadonna, Miss Korjus turns on her good and bad sides when you least expect it. Vocal waltzes are extremely difficult to sing and Korjus with her coloratura soprano does admirably. Frenchman Fernand Gravet is believable as Strauss (as far as the film is believable) and ably supported by the likes of Lionel Atwill and Hugh Herbert along with many others, few of whom have a Teutonic accent, but we still have a romantic view of old Vienna. It is not a factual biography, which is stated at the beginning of the film, but there are elements of truth in the composite of Strauss the Elder and Strauss the younger as performed by Gravet (Strauss the Younger was a womanizer and while married actually had a liaison with an opera singer, among others). The Vienna Woods segment is pure joy. Strauss playing Tales from the Vienna Woods on his violin and Carla Donner singing in accompaniment's, their whirling dancing, ending up on the ground, where Strauss goes no further and wistfully admits \"Carla, I'm married.\" The audience, I think, expects a tantrum from Donner at this revelation, but she gracefully takes it in stride and fools us once again with her unpredictability! This scene, to me, was the high point of an exceptional film of the type we shall never see again.",
         "THE GREAT WALTZ is one of the all-time great musicals with memorable orchestrations of its magnificent music, beautiful, swirling cinematography, Luise Rainer at her heartbreaking best and Miliza Korjus outrageously divine in performance and voice. The plot adroitly mixes music, smaltz and sentiment with several scenes of heartbreaking, dramatic power. This movie is an absolute joy, a treasure to be seen and enjoyed year after year.",
         "Before I started these comments, I first read many of the others made by a wide range of people - I was amazed to find that some were reading far too much into the storyline,( which everyone who has seen the movie knows it is pure hokum) or belittling the film for its treatment of the life of Johann Strauss. Why not go and see it, and enjoy the sheer entertainment of the Music, the acting of Luise Rainer, the voice of Miliza Korjus (who will ever forget her rendition of \"One Day When We Were Young\" - who cares if Strauss did or did not write it!), So \"The Tales from the Vienna Woods\" was written overnight - does it matter that free licence was taken, surely the name of the game is to entertain, and this film does that. Hugh Herbert and Lionel Atwill add fun and spice to one of the more entertaining musicals of the 1930's.",
         "This fictional account of Johann Strauss' life is highlighted by one of the most exquisite scenes in musical history--far from real of course--in which the composer and an operatic diva are driven through the woods in horse and buggy while the countryside comes alive with the sound of music. The pastoral beauty of the scene itself combined with the intricate way 'Tale of the Vienna Woods' is woven into the musical scene (as composer Strauss begins humming the tune along with his diva friend) is just one of the charming highlights of this MGM musical. Swirling waltzes are captured with such superb angles in the Oscar-winning camerawork, it's no wonder David O. Selznick was impressed enough to insist that his own technical staff derive inspiration from viewing the film. Soprano Miliza Korjus does some excellent trills as the operatic diva who steals Strauss from his wife (temporarily) until the obligatory happy ending. Luise Rainer suffers gracefully (in an insufferable role as the wife!!) and Fernand Gravet does well as the composer. His scenes with Miliza Korjus are what makes the film the gem that it is. She all but steals the film and was nominated for a Supporting Actress Oscar and then disappeared from the American scene, returning to Europe to resume her operatic career.",
         "I own a VHS copy of The Great Waltz. I have seen this movie I don't know how many times! I was very young when I saw the movie for the first time, and it made a great impact on me and ever since then, I feel the urge to look and hear the magnificent singer and actress that, in my opinion takes the first place in this movie: MILIZA KORJUS. I have managed to collect ALL her recordings, I think., but I never saw the movie as a political issue or as they say here, as anti Nazi film! Nothing of the sort! To me it's a delightful movie and a great vehicle for the display of the many talents of Miliza Korjus and also for the rest of the cast and the romanticism involved in the whole movie.",
         "Julien Duvivier, the great French director, had a brief career in Hollywood during WWII. Alas, the movies he was involved with, didn't fare as well as the ones he did in France. It must have been difficult for a man of his stature to try his hand at film making in America because of problems with artistic control of his pictures and the way things were done in Hollywood. \"The Great Waltz\" was a fine example of what M. Duvivier could do. This glorious 1938 MGM film was one of the most loved films of that period. Not only that, but even if the subject matter, Johann Strauss' life was not accurate, at least his great music is heard in the film. The exquisite art direction Cedric Gibbons gave the picture and the beautiful costumes from Adrian made this a favorite of the movie going public of that time. The life of the struggling musician who had a lot of talent, but whose music was a departure from what has been heard in Vienna before him, was something movies loved to tell. Whether or not this was a true account of the composer's life, it's still a visually rich film. Fernand Fravey as Strauss gives a good performance. Luise Ranier makes the suffering and self-sacrificing Poldi, one of her best creations. The true star of the film though, is Milizia Korjus, who as the gorgeous soprano Carla Donner steals the show with her singing and her looks. Hugh Herbert, Alma Kruger, Curt Bois, and the rest of the cast do great work for Julien Duvivier. \"The Great Waltz\" is a film that's not seen often these days and it's a shame because it's an excellent excuse for going back to that period and the great music Strauss gave to the world.",
         "My wife and I viewed this picture on TV 9/20/02. The acting by all was so real and the music, the settings, and the singing by M. Korjus so incredibly beautiful it brought tears for the shear emotion as the story unfolded. I recommend this movie to anyone needing an uplifting of spirit, so poignant as to bring tears enough to cry away your troubles and to anyone who enjoys movies of such caliber as are so few these days. Bravo",
         "A very long time ago, I gave up on Hollywood being accurate with biographies let alone bios of composers! So, tonight I sat down to watch TCM's Guest Programmer by a REAL operatic diva, Renee Fleming first choice. I just cannot believe that I have lived 51 years and have never heard of this movie or even seen a snippet anywhere! In just the first exciting music sequence I was witnessing a miracle! I remember so well when the millennium's Moulin Rouge came out a few fuddy-duddy friends of mine called it outrageous because of its frenetic pace! (Apparently, they had never seen THIS movie which was made in 1938 not in 2001!) The frenetic pace of the SUPERLATIVE cinematography alone is worthy of one viewing of this miraculously beautiful movie! All of the principal players were just so good...sure this is an old-fashioned way of acting - so what! (I tell you, some reviewers don't have any idea about the history of acting and film by the way they so trash older movies and their \"quaint\" ways.) Oh yes...and the music, the music, THE MUSIC!!!!!!!!!!! What a glorious discovery! I thank Renee, Robert, TCM and Charles Nelson Reilly (wherever he is) for recommending this movie to Renee! If you don't like this - then you need medical checkup quickly!",
         "As a great admirer of Julien Duvivier and now, at last, having seen The Great Waltz some 60 plus years after it was made I can't help wishing that Duvuvuer had been tempted to Hollywood by something a little more substantial. I don't, of course, know the circumstances but given the horror stories about Hollywood moguls that we were weaned on it's not difficult to imagine a discussion in which the reasoning is 'we're doing a movie about an Austrian waltz king set in Vienna and up to here in schmaltz so why don't we get that French guy who did those things about tough guys in Africa (La Bandera, Pepe Le Moko) and the Popular Front (La Belle Equipe). Great idea, boss, let's get a cable off toot sweet. I wasn't there at the time but with hindsight it's ludicrous that Duvivier followed his masterpiece (just one of his masterpieces actually) Un Carnet du bal with this dross although there is a kind of left-handed logic given that Un Carnet du bal concerned a woman's treasured memories of her first ball where the prevailing mood would have been three-quarter time. Sixty-odd years later trying to look past the wooden Gravet and the 'stage' Austrian accents (ah, Shhsstrrowss) personified by Sig Ruman in the opening scene we're able to salvage the sure-footed direction and directorial touches of Duvivier and see what today looks hokey - the ride in the Vienna woods in which every sound is a musical note contributing to the instant composition Tales Of The Vienna Woods - as the magical sequence it must have seemed to a world hungry for escapism with a major conflict waiting in the wings. Likewise the quicksilver crochets and quavers that dance over an inept bank clerk's ledger in the opening scene - indeed the economy which in that same scene delineates Strauss as a frustrated musician trapped in a world of finance. Known to me more as the wife of another great writer, Clifford Odets, than an actress, Luise Rainer has little to do in the emoting stakes but Duvivier does use her effectively in the scene at the Opera House when he shows us how insignificant is a mere wife against ART, personified in this case by the mighty Opera House, the performers and, of course, Composers. I'm glad I saw it - and indeed now own it thanks to a generous French friend, but I'll be watching both Un Carnet du bal and the film Duvivier made immediately after The Great Waltz, La Fin du jour, much more than returning to this."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["In 1845 Vienna, Johann Strauss II - Schani to his friends - would rather write and perform waltzes than anything else, this at a time when a waltz is not considered proper society music. After he is fired from his clerical bank job because of his preoccupation with composing, he decides to follow his passion and form an orchestra. After some famed opera singers, including Carla Donner, hear his music, they expose Schani's music to the masses, to royalty and to music publisher Julius Hofbauer. As such, Schani becomes the toast of Vienna. With his new found musical fame, Schani's life, which includes his work in the European Revolutions, changes. He becomes torn for his love for his loving and faithful wife Poldi Vogelhuber and his more emotionally passionate but somewhat destructive love for Carla Donner, who herself is involved with Count Anton Hohenfried."],
      "budget": 0
   },
   "movielensId": 82584,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1938-11-04",
      "dvdReleaseDate": null,
      "directors": ["Julien Duvivier"],
      "runtime": 104,
      "movieId": 82584,
      "title": "The Great Waltz",
      "mpaa": "",
      "actors": [
         "Luise Rainer",
         "Fernand Gravey",
         "Miliza Korjus",
         "Hugh Herbert",
         "Lionel Atwill",
         "Curt Bois",
         "Leonid Kinskey",
         "Al Shean",
         "Minna Gombell",
         "George Houston",
         "Bert Roach",
         "Greta Meyer",
         "Bess Flowers",
         "Frank Mayo"
      ],
      "imdbMovieId": "0030202",
      "originalTitle": "The Great Waltz",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["CkvoMajdOtU"],
      "plotSummary": "Composer Johann Strauss risks his marriage over his infatuation with a beautiful singer.",
      "tmdbMovieId": 62567,
      "avgRating": 2.9,
      "releaseYear": "1938",
      "numRatings": 5,
      "posterPath": "/6O47nbIHbqlwiJSaXP4YAlx01Mn.jpg"
   }
}