{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "soul",
            "id": 634
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "supernatural",
            "id": 6152
         },
         {
            "name": "priest",
            "id": 10093
         },
         {
            "name": "religion",
            "id": 11001
         },
         {
            "name": "dean",
            "id": 160450
         }
      ],
      "imdb_id": "tt0094011",
      "video": false,
      "title": "Under the Sun of Satan",
      "recommendations": [
         44102,
         63225,
         113936,
         151307,
         198537,
         66538,
         202776,
         94655,
         79921,
         63230,
         31517,
         16242,
         46817,
         49693,
         92676,
         134625,
         199503,
         64559,
         17376,
         1772
      ],
      "backdrop_path": "/kGMtIwi3Eyg4HoaWusX6qucfllE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Donissan",
               "gender": 2,
               "credit_id": "52fe44729251416c91010f79",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mouchette",
               "gender": 1,
               "credit_id": "52fe44729251416c91010f7d",
               "name": "Sandrine Bonnaire",
               "profile_path": "/i8Os6hHPZKyDQerX4qtG6njCcDN.jpg",
               "id": 19161,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Menou-Segrais",
               "gender": 2,
               "credit_id": "52fe44729251416c91010f81",
               "name": "Maurice Pialat",
               "profile_path": "/ipQZ7kCQeUlnR325MeD9JPg6Wbq.jpg",
               "id": 16988,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "La mère de Mouchette",
               "gender": 0,
               "credit_id": "52fe44729251416c91010f8d",
               "name": "Brigitte Legendre",
               "profile_path": null,
               "id": 1263956,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Cadignan",
               "gender": 0,
               "credit_id": "593562aec3a368599003519d",
               "name": "Alain Artur",
               "profile_path": null,
               "id": 1828860,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Gallet",
               "gender": 2,
               "credit_id": "593562c09251417de2034eba",
               "name": "Yann Dedet",
               "profile_path": null,
               "id": 6318,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Malorthy",
               "gender": 2,
               "credit_id": "593562e4c3a3685a24032b10",
               "name": "Jean-Claude Bourlat",
               "profile_path": null,
               "id": 66270,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Le maquignon",
               "gender": 2,
               "credit_id": "593562fc9251417ddc036e4b",
               "name": "Jean-Christophe Bouvet",
               "profile_path": "/z0QvNiJ2RDtOqOmxSgYm4cEC0jc.jpg",
               "id": 19776,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44729251416c91010f75",
               "name": "Maurice Pialat",
               "profile_path": "/ipQZ7kCQeUlnR325MeD9JPg6Wbq.jpg",
               "id": 16988,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53400b01c3a36830e300127c",
               "name": "Georges Bernanos",
               "profile_path": null,
               "id": 17595,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "53400b12c3a36830eb0012e9",
               "name": "Sylvie Pialat",
               "profile_path": "/2dOh2C7iVKXshtZkJHApGNH2zle.jpg",
               "id": 49067,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53400b1cc3a36830e3001282",
               "name": "Maurice Pialat",
               "profile_path": "/ipQZ7kCQeUlnR325MeD9JPg6Wbq.jpg",
               "id": 16988,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "53400b2ac3a36830cc001368",
               "name": "Daniel Toscan du Plantier",
               "profile_path": "/635p8QihDt4w6GJlnV9dKoZO6o.jpg",
               "id": 23508,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53400b32c3a36830c5001289",
               "name": "Michael Lentz",
               "profile_path": null,
               "id": 36791,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53400b3ac3a36830eb0012ee",
               "name": "Claude Abeille",
               "profile_path": null,
               "id": 1307420,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "53400b42c3a36839a70010e2",
               "name": "Henri Dutilleux",
               "profile_path": null,
               "id": 1307421,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "53400b49c3a36830d300136e",
               "name": "Willy Kurant",
               "profile_path": null,
               "id": 38168,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "53400b50c3a36830eb0012f3",
               "name": "Yann Dedet",
               "profile_path": null,
               "id": 6318,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "53400b5bc3a36830e3001286",
               "name": "Katia Wyszkop",
               "profile_path": "/pKoJs8TOm59C7DLIQAusGG0tDIh.jpg",
               "id": 26098,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "53400b64c3a36830cc001372",
               "name": "Gil Noir",
               "profile_path": null,
               "id": 1307422,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.142761,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 31300,
      "vote_count": 21,
      "budget": 0,
      "overview": "Satan tempts Father Dossignan, who is trying to save the soul of a young girl who killed one of her lovers.",
      "similar": [
         806,
         9946,
         9945,
         9411,
         2275,
         2048,
         207932,
         77949,
         1023,
         41505,
         3594,
         9552,
         686,
         1427,
         769,
         4771,
         75780,
         497,
         600,
         561
      ],
      "original_title": "Sous le soleil de Satan",
      "runtime": 93,
      "poster_path": "/dReLJ3BoNGVIA4ULwX6GPc5B491.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Erato Films",
            "id": 2239,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films A2",
            "id": 875,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Flach Film",
            "id": 8277,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Action Films",
            "id": 21505,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sofica Investimage",
            "id": 21506,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sofica Créations",
            "id": 11256,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1987-05-14",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Maurice Pialat"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Georges Bernanos",
         "Sylvie Pialat"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0094011/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5MzY5MDc2N15BMl5BanBnXkFtZTcwNzY5OTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gérard Depardieu, Sandrine Bonnaire, Maurice Pialat | See full cast and crew »"],
      "reviews": [
         "I'm not quite sure what people mean when they say this film is \"difficult\". On the surface, the film has a very straightforward storyline of a priest (played brilliantly and movingly by Depardieu) struggling with his own demons that materialise internally and externally. From this basic premise the film can be explored from several key standpoints to obtain real insights into subjects such as the power/source of faith, the relationship between thought/belief and one's relationship to the world we inhabit. Moreover, the questioning employed by Pialat and Depardieu means that the path of thought through these issues is profound, intense and disturbing. The film provokes the intellect constantly and I could understand that if there was nothing more to the film, one might say that \"is that it?\" What takes this film much further is the emotional undercurrent - both understated and abyssal, the stunning cinematography and restrained direction. These factors combine to create a complete cinematic experience. One scene stands out in this respect: we watch the priest wander the countryside in a daze and he pauses on the side of a hill, lush with spring grass. Depardieu looks up, eyes searching for insight, an answer, a response. In a brilliant stroke of luck, passing clouds obscure the sun and Depardieu instinctively internalises this shifting light with a simultaneous passing of emotion portrayed through his face and posture. We watch both the internal shifting cloud of emotion and the changing light create a charge and intensity that is rarely seen in cinema. There is an element of the `unknowable' in this scene that still moves me, even after many viewings. I also enjoy making comparison between this film and Dreyer's \"Das Wort\" (The Word), my favourite of Dreyer's works which has some common theme's, explored from different perspectives. A truly great film, worthy of the Palme D'or it won.",
         "I saw the original french version and i must admit dialogues were challenging for me at times. On the background of early 1900's rural France, the movie revolves around the spiritual dilemma of a young priest ( what's the real meaning of service?) under the guidance of a dean, who soon starts to suspect his pupil might be sort of saint...a fool...or both. Pialat explores the thin line behind folly and sainthood. It's all a gray area where shades of gray detract from the meaning of both light & darkness. Overall, not a \"viewer's\" movie...little to see. Dialogues are difficult, and at times intricate; there are no conventional emotions, no plot spins. The \"plot\" is not really such one...there are subplots, such as a young girl with many lovers ( gets pregnant by one, has sex with another while dreaming of reaching Paris to become the mistress of a MP, etc )...there is another subplot about a dying child and peasants' devotion bordering superstition... i wanted to watch this because i wanted to watch another movie by Pialat...his style may not entertain everybody the same way, though. Someone makes a point about Bonnaire being no \"attractive\" lass and here i have to agree ( she's not \"ugly\", yet not attractive as well). The point, however, is that (see the other Pialat's movie \"à nos amours\" where Bonnaire stars again ) that proves the director's dedication to portraying \"real\" people within reasonable circumstances, without Hollywood gimmicks and porn stars wanna-be's eager to show some skin ( i always think: skin is OK, but then got for true porn). I can also guess translations & adaptations may have resulted in a mess.",
         "Wonderful! Fascinating! Bernanos captured with an obvious anti-clerical twist from Pialat. A cult-movie for art-movies amateurs... If you have seen other Pialat's films, you understand the progression of his art. Very honest film that shakes your bones to the core. Sandrine Bonnaire is just perfect and Depardieu's calm and open acting works very well with the character. A dark movie at its best! This is a well-deserved Golden Palm from the 1987 Cannes Festival, handed by Yves Montand, as president of the Jury. What a scandal it was -- giving the palm to an outcast like Pialat. History will remember that Cannes, on its 50th anniversary, tried and succeeded on promoting true art in films.",
         "Bernanos and Pialat. a meeting who becomes mixture of nuances from the both universes. a film for readers in more measure because it seems be a kind of labyrinth. a film for Maurice Pialat fans because his mark is key of strange, almost confuse work. a film about faith, sin and Catholicism. with the shadows imposed by a great French writer and with two actors - Bonnaire and Depardieu - who reveals the delicacy and darkness of a circle without common rules.Pialat himself does a special role. result - almost a poem. a film as a question. that fact does it not the most inspired choice for many. but it may not be reduced as few beautiful scenes or at good acting. so, it is an invitation to discover the book for understand the bitter , cold sense of story.",
         "The novice priest declares himself unable to pursue his calling, given the sinfulness that he speaks of in his parish. But, from the start, he is pouring out his feelings of inadequacy without our seeing anything that he has had to face. It is all mere talk; and his near hysteria might be explained when, after he has collapsed (in a faint, or a fit?), his sympathetic and humble spiritual adviser uncovers the blood-spattered chest--the consequence of his self-flagellation, of which we witness another bout later. Is he fanatical, or mad? We see nothing of the parochial trials, and sickness, endured by Bernanos' Curé de campagne (Robert Bresson's film), faced with hostility and mockery from his villagers. The two traumatic events (Mouchette cutting her throat, and a dying boy \"coming to life\" in the priest's arms) shock us, but do not form an integral part of the curate's spiritual day-to-day experience. They are merely sensational. Depardieu is not convincing as an agonised believer. Yet, in the spontaneous sincerity of his accompanying interview, he appears to draw inspiration from Augustine!",
         "When you are not religious, watching this movie becomes more of a chore than anything. I did go all the way to the end just out of curiosity. The ability to stimulate my curiosity is what made me give it 5 stars. And true, it's well played, well shot, true also that the restraint fits well considering the topic. But... you've got to be a total devout to believe in the miracle of God giving life back to the boy, just because this priest asks for it. Why did he take it in the first place? Anyway, all of this doesn't make any sense in the end. Yes Depardieu is a great actor, yes yes and yes, all of this movie is well made... but the topic ... all those grownup men concentrating on such a huge nonsense? I just can't understand that.",
         "I couldn't relate to this film. It failed to engage me either intellectually, emotionally or aesthetically. The dialogue was very dense and uninvolving. I couldn't connect with and hence care about any of the characters and I'm finding it hard to find much that's positive to say about it. I've read that to understand it properly one needs to be familiar with some of the more obscure aspects of Catholic theology. I'll admit that, as an atheist, I probably am unfamiliar with many of the finer details of Catholicism, but I have also seen many films dealing with religious issues that have touched me because their themes are still universal to the human condition and don't rely on specialised knowledge or beliefs.",
         "As with countless other fine and well-meaning French productions, this one has plenty of intricate dialogue-which is seldom translated in whole. As a result, I am sure that for some people the narrative barely makes any sense; for others it will be unjustifiably dense and even lyric. I am sure some people must love the slow pace and the religious subject matter to the point of exaltation. As it happens with the immensely frustrating film Therese [Alain Cavalier, 90m, 1986], this one never really delivers on its premises/promises. I do not want to give away its really simplistic plot, so won't get into the details of its many faux pas dealing with the simple life of a country faux naif. That said, I just want to add how the film manages to elevate its pretentiousness to the level of art! The viewer is left to feel below the film's main theme and message, mainly on account that it deals with mystical matters not to be understood by the viewing masses-especially by those who watch the film. The point is lost in the main character's constant self-flagellation-physical and spiritual. The, in short, viewer can never identify with Donissan or with Mouchette-or with anyone else in the film. Even Buñuel's The Milky Way [1968] is easier and more fun, and this is a stretch. To be sure, we know what is going on at all times, but it is hard to imagine why is there so much ado about matters that are best left untouched. For a more vivid portray of the struggles of religious significance see Agnes of God [1985], The Last Temptation of Jesus Christ [1988], or El crimen del padre Amaro [2002]. Should you insist in seeing this uneven production, which is only available in a very poor VHS format, go on at your own peril. At least-if it is any consolation-it isn't that long!",
         "Smart, challenging, ultimately unsuccessful film that wowed viewers at Cannes. The film has exquisite acting and some brilliant scenes, but it's too convoluted to make any kind of impact on the viewer. Gerard Depardieu shines in his difficult role as does Sandrine Bonnaire. The best scene in the film is when Depardieu comes across Satan -- chilling.",
         "Pretentious French cinema at best... more likely, a failed attempt at cinema. As a French and a movie lover, I admire many french authors and film makers that are deemed 'difficult' or intellectual (I adore Godard for one). This movie is not a masterpiece of cinema: it lacks all the characteristics of it. The actors are the major problem of the film. Depardieu has no spirituality and it shows. Sure he's a \"nice guy\" in life and he can be very good in lighter roles, but how anyone can find him convincing in this role I can't imagine. Sandrine Bonnaire, apart from the fact that it takes tremendous imagination to believe that she is supposed to be attractive, is not movie actress. Her performance is that of a boring theater player (I caught her several times looking at the audience, waiting for applause). As for the story, it jumps from scene to scene without any sense of continuity or progress, it's mere accumulation that goes nowhere. But then of course it won a Palme d'Or, well that must mean it's good and we're not able to grasp such high and elevated thinking! Sorry I don't buy."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Erato Films",
         "Films A2",
         "Flach Film"
      ],
      "summaries": [
         "Dossignan is a zealous rural priest. The dean Menou-Segrais tries to keep him reasonable. But Dossignan will be tempted by Satan, then will try to save the soul of Mouchette, a young girl who killed one of her lovers.",
         "Dossignan is a zealous rural priest. The dean Menou-Segrais tries to keep him reasonable. But Dossignan will be tempted by Satan, then will try to save the soul of Mouchette, a young girl who killed one of her lovers."
      ],
      "budget": 0
   },
   "movielensId": 82638,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1987-05-14",
      "dvdReleaseDate": null,
      "directors": ["Maurice Pialat"],
      "runtime": 93,
      "movieId": 82638,
      "title": "Under the Sun of Satan",
      "mpaa": null,
      "actors": [
         "Gérard Depardieu",
         "Sandrine Bonnaire",
         "Maurice Pialat",
         "Brigitte Legendre",
         "Alain Artur",
         "Yann Dedet",
         "Jean-Claude Bourlat",
         "Jean-Christophe Bouvet"
      ],
      "imdbMovieId": "0094011",
      "originalTitle": "Sous le soleil de Satan",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["jNWwVmKC9sw"],
      "plotSummary": "Satan tempts Father Dossignan, who is trying to save the soul of a young girl who killed one of her lovers.",
      "tmdbMovieId": 31300,
      "avgRating": 2.76923,
      "releaseYear": "1987",
      "numRatings": 13,
      "posterPath": "/dReLJ3BoNGVIA4ULwX6GPc5B491.jpg"
   }
}