{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "austria",
            "id": 1201
         },
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "isolation",
            "id": 1533
         },
         {
            "name": "house",
            "id": 6095
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "isolated house",
            "id": 172658
         },
         {
            "name": "murder mystery",
            "id": 207046
         }
      ],
      "imdb_id": "tt0061075",
      "video": false,
      "title": "Ten Little Indians",
      "recommendations": [
         24060,
         21153,
         42481,
         41303,
         36678,
         22906,
         31046,
         26592,
         39293,
         41104,
         30856,
         18568,
         72002,
         147787,
         90092,
         50181,
         26370,
         18889,
         18904,
         61483
      ],
      "backdrop_path": "/5MesCGWsHnDcWnT0YVtTt9B64CA.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5376b896c3a368551e000574",
         "content": "The Hills Are Alive With The Sound Of Murder.\r\n\r\nMuch like the filmic adaptations of Agatha Christie's stunning source novel, a literary work that added the killer to serial, the Ten Little Indians rhyme has quite a few versions. I mention this because the core essence of the source, both in written rhyme and filmic celluloid, is always what shines through. The films vary in quality, though each one does bring its own ideas to the adaptation, George Pollock's 1965 version is a dandy, though not perfect by any stretch of the imagination. \r\n\r\nThe story is relocated to a remote snowy mountainside. Ten people have gathered there, either as servants or guests invited by the mysterious U.N. Owen. Once all gathered under one roof, a tape recording reveals that all the guests are guilty of despicable crimes, and thus must pay the price. Cue the now standard formula of each member of the ten getting bumped off as suspicions and panic begins to arise. With each death comes the removal of a model Indian from a circular display laid out on the lounge table. \r\n\r\nThus we have a serial killer whodunit (whosedoingit?) in full effect. The deaths are inventive, with some carrying genuine suspense and chills into the bargain, and although the final reveal lacks credibility, it has the requisite surprise factor to not disappoint genre fans. The beauty here is in the cast list, where for fans of British classic cinema it's a roll call of greats. Stanley Holloway, Wilfrid Hyde-White, Dennis Price (whose visual reactions here are ahem, priceless) and Leo Genn lead the male British front, while Shirley Eaton fights the British girl's corner with sauce and sizzle. Supplementing the Brits for an overseas audience, is pop star Fabian, Hugh O'Brian and Daliah Lavi. The latter of which also raises the temperatures considerably. \r\n\r\nWhere the pic falls down badly, apart from Fabian's poor acting that is, is with the visual ascetic served up by Pollock and his cinematographer Ernest Steward. The mansion where the plot unfolds is ripe for much shadow play and creaky corridors, the story kind of demands that the old dark house staples are adhered to. Sadly this area is rarely born out, making it a very wasted opportunity to lift the film to better heights. Still, as stated previously, the source material is timeless and for fans of such fare it's hard not to feel tingly as the conclusion draws in. \r\n\r\nIf the divisive \"one minute audience break to discuss who we think dunit\" that stops the film before the reveal seems a bit William Castle lite, then so be it, but it's still fun and shows a willingness by the makers to involve the audience fully in the murderous malarkey. I wonder what Agatha made of it?\r\n\r\nAll together now, \"Ten little Indian boys went out to dine; One choked his little self and then there were Nine…\" 7.5/10",
         "url": "https://www.themoviedb.org/review/5376b896c3a368551e000574"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Hugh Lombard",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754db",
               "name": "Hugh O'Brian",
               "profile_path": "/52gQPgr7XomjM0pu6kMT0sOHYFG.jpg",
               "id": 39753,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Ann Clyde",
               "gender": 1,
               "credit_id": "52fe43dfc3a36847f80754df",
               "name": "Shirley Eaton",
               "profile_path": "/spwHh09U8zg6I3Zzgj9Mc6SoTQs.jpg",
               "id": 9909,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Mike Raven",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754ff",
               "name": "Fabian",
               "profile_path": "/zznWM7jaB3nGio4kqPfxhqC1eeq.jpg",
               "id": 39757,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Judge Arthur Cannon",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754e3",
               "name": "Wilfrid Hyde-White",
               "profile_path": "/hBLDxE2Uhf41k5bz0IhmRiKhvPj.jpg",
               "id": 15387,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Dr. Edward Armstrong",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754e7",
               "name": "Dennis Price",
               "profile_path": "/k29Y39ZPSERgbBCsD4b22GwwRNW.jpg",
               "id": 30766,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "General Sir John Mandrake",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754eb",
               "name": "Leo Genn",
               "profile_path": "/eOAv0mHO140nh3KA78AJ7Agwx32.jpg",
               "id": 29655,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Det. William Henry Blore",
               "gender": 0,
               "credit_id": "52fe43dfc3a36847f80754ef",
               "name": "Stanley Holloway",
               "profile_path": "/3pKWIEPNOSD0lMHrK07RYkVyde4.jpg",
               "id": 12727,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Ilona Bergen",
               "gender": 1,
               "credit_id": "52fe43dfc3a36847f80754f3",
               "name": "Daliah Lavi",
               "profile_path": "/xWEOf7X6vovLk05YT14xeZrwv9W.jpg",
               "id": 39754,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Joseph Grohmann",
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754f7",
               "name": "Mario Adorf",
               "profile_path": "/j5PybdSQCAeW0l9VKS147jRRhA0.jpg",
               "id": 10254,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Elsa Grohmann",
               "gender": 1,
               "credit_id": "52fe43dfc3a36847f80754fb",
               "name": "Marianne Hoppe",
               "profile_path": "/80drPXXtIAejvYRpuIEuehH6Uxl.jpg",
               "id": 39755,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Mr. U. N. Owen (voice)",
               "gender": 2,
               "credit_id": "5793129292514169ab0062f9",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754bf",
               "name": "George Pollock",
               "profile_path": "/7Qcv476SOifAEhK02G1q9zZYqmQ.jpg",
               "id": 11118,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43dfc3a36847f80754c5",
               "name": "Agatha Christie",
               "profile_path": "/ODuKn32LKTdE0vdPONk2FEbkcl.jpg",
               "id": 47562,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f80754cb",
               "name": "Dudley Nichols",
               "profile_path": null,
               "id": 13802,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dfc3a36847f80754d1",
               "name": "Ernest Steward",
               "profile_path": null,
               "id": 21602,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dfc3a36847f80754d7",
               "name": "Malcolm Lockyer",
               "profile_path": null,
               "id": 39752,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f8075505",
               "name": "Harry Alan Towers",
               "profile_path": null,
               "id": 29288,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dfc3a36847f807550b",
               "name": "Harry Alan Towers",
               "profile_path": null,
               "id": 29288,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.963775,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 4879,
      "vote_count": 38,
      "budget": 0,
      "overview": "Ten strangers are invited as weekend guests to a remote mountain mansion.When the host doesn't show up, the guests start dying, one by one, in uniquely macabre Agatha Christie-style.It is based on Christie's best-selling novel with 100 million sales to date, making it the world's best-selling mystery ever, and one of the most-printed books of all time.",
      "similar": [
         2832,
         281957,
         445954,
         4771,
         1586,
         395834,
         9654,
         984,
         28355,
         3134,
         10651,
         10285,
         238636,
         357096,
         2749,
         769,
         949,
         979,
         37094,
         9679
      ],
      "original_title": "Ten Little Indians",
      "runtime": 90,
      "poster_path": "/bdb0ZB7t9n6MJC3osookbNrIdhB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tenlit Films",
         "id": 1794,
         "origin_country": ""
      }],
      "release_date": "1965-09-09",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "The Whodunnit Break! A first in motion pictures! Just before the gripping climax of the film, you will be given sixty seconds to guess the killer's identity! The film will pause and on the screen you will see clues to help you decide who the murderer is...We Dare You To Guess!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Pollock"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Peter Yeldham",
         "Harry Alan Towers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061075/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NDM2OTA1MF5BMl5BanBnXkFtZTcwNzc5NjMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hugh O'Brian, Shirley Eaton, Fabian | See full cast and crew »"],
      "reviews": [
         "Ten strangers are lured to a remote mansion on the Austrian Alps in the middle of winter. They have nothing in common except that each of them harbours a guilty secret and that they have all been invited by a mysterious host (whom none of them has met) called Mr U.N Owen. The guests are Judge Arthur Cannon (Wilfrid Hyde-White), Harley Street practitioner Dr Armstrong (Dennis Price), private eye William Henry Blore (Stanley Holloway), actress Ilona Bergen (Daliah Lavi), pop star Mike Raven (Fabian), retired army officer General Sir John Mandrake (Leo Genn), engineer Hugh Lombard (Hugh O' Brien), secretary Ann Clyde (Shirley Eaton) and housekeepers Joseph and Elsa Grohmann (Mario Adorf & Marrianne Hoppe). They are curious and slightly annoyed that their host isn't their to greet them. However, after dinner and cocktails, a tape recorder bursts into life and the disembodied voice of their host accuses each of them of a past crime. Initially, they treat it as a sick joke in the poorest taste. But after Mike Raven has drunkenly sang a rendition of the Ten Little Indians nursery rhyme on the piano, he confesses to a crime before choking on his drink and falling down dead. The others realise that this isn't a joke and that their host is a psychopath delivering retribution for their sins and even more disturbingly, their killer is one of them. In addition, there is a centerpiece on the dining room table, which contains ten figurines and as they are murdered one by one in ways parallel to the old nursery rhyme, the killer removes one figurine from the center piece at a time. Ten Little Indians was the third film version of Agatha Christie's marvelous mystery thriller, which was first published in Great Britain in 1939. Four years later, it was adapted for the stage by the author making its debut at London's St James Theatre in November 1943. It had been previously filmed in Hollywood in 1945 as And Then There Were None (Dir: Rene Clair) and featured an all-star cast (for the time) including Barry Fitzgerald and Walter Huston and in 1949, the BBC produced a TV version starring Bruce Belfrage and Campbell Singer. The 1965 version made a few notable changes, the most significant being the change of setting from an old house on a remote Devonshire island to a mansion on top of the Austrian Alps. The picture was actually shot in an empty mansion in Rush near Dublin, Southern Ireland. The film was produced by Harry Alan Towers whom at this time was enjoying success with the splendid schoolboy's adventure yarn The Face Of Fu Manchu, which starred Christopher Lee as Sax Rohmer's fiendish Oriental mastermind. Interestingly, it was Lee who provided the disembodied voice of U.N Owen on the tape recording heard at the beginning of the film. Towers would subsequently go on to film the story again on two more occasions. First as And Then There Were None (Dir: Peter Collinson 1975), in which the setting was changed yet again to a luxury hotel in the Iranian desert and the second time in 1989 with the drama unfolding from a big game African safari. All in all, Ten Little Indians is quite a good film. The script penned by Towers as Peter Welbeck does reasonable justice to Christie's wonderful source novel and the change of locale does it no harm at all. A marvelous cast was chosen for the film with Wilfrid Hyde-White perfectly cast as the intelligent and resourceful Judge Cannon while Dennis Price offers a fine portrayal as the upper class Dr Armstrong. Leo Genn gives just the right amount of authority to the role of General Sir John Mandrake and Hugh O' Brien is suitably smooth as Lombard and works well with Shirley Eaton's Ann Clyde, the picture's love interest. Also of note is American pop singer Fabian who does well in portraying Mike Raven an updated version of Christie's original character called Anthony Marston in the book. The character wasn't a pop star in the book at all, but he still resembles the way that Christie described him, irresponsible, and whose only interest in life was \"for kicks\" as the film puts it. On the downside, the film lacks the tension and the sense of menace that I was expecting mainly due to an unsuitable jazz style music score and while the black and white camera-work is good, I couldn't help but think that a few more shadows would have helped here and there. Director George Pollock (fresh from shooting the Margaret Rutherford Miss Marple films) shows a steady hand at the helm of the picture and brings the storyline together beautifully but he doesn't bring the same level of charm and well-meshed humor and mystery, which he brought to the Marple series here. Another slight disappointment is the climax, which resembles the happy and romantic one from the stage play. In the novel (I won't give it away for those who haven't seen the film or read the book) but there is no sense of relief at all and as a result the film isn't as dark and surprising as I was hoping it would be. I also felt that the 60-second whodunit break just prior to the ending didn't really fit in the with the general aura of the movie and seemed to be nothing more than a gimmick. Overall, however, this is still the film which I return to of one of my all time favorite mysteries because the cast play it straight here whereas in the 1945 version, they overplayed the comedy meaning that it sat uneasily with the plot and a lot of the film's thrills took place off screen which isn't the case here. And finally, I cannot resist a picture that brings such wonderful actors as Wilfrid Hyde-White and Stanley Holloway together -not in a million years!",
         "Agatha Christie's oft-filmed whodunnit (and dunnit and dunnit!) gets an updating here to the mid 1960's with a pretty odd international cast selection and a less skillful presentation than in the first adaptation, 1945's \"And Then There Were None\". Still, this is better than any of the following versions (two of which were made by this same producer, Harry Towers! Apparently, he liked the story?!) The credits open on a Swiss mountainside with the cast making it's way up to a remote castle. Sleigh ride-a-go go music plays, instantly dating the film even more than its black and white photography. The credits are fun, though, with each actor being shown along with his or her name to help keep everyone straight. Once at the top, the gathering of eight assorted personalities and the two staff members find that they have each been invited there by a person they have never met and that the person wants to pay them back for crimes they've supposedly committed, yet never paid for. Chief people include brylcreamed hunk of man O'Brian, stiff, blonde Eaton, yammering recording artist Fabian, mod-actress Lavi and wry, elderly Hyde White among others. Before anyone can really determine how to get out of the place, the first victim falls dead on the floor. They then realize that they are being offed in the manner of the famed title nursery rhyme. One by one, the murderer knocks them off until the surprise ending reveals how and why it was done. The set up is irresistible and not even a rather lame script, nor some wooden acting can mar it completely. The thing is, in a story like this, the actors are not permitted to display very much of their character, lest they spoil the mystery and ruin the ending. They all have to be simultaneous victims/suspects and all that really leaves is a lot of worried expressions. That said, O'Brian was at the peak of his handsomeness with his parade of macho sexuality \"Love Has Many Faces\" just around the corner. Eaton, one of the most noted Bond girls due to her gold body paint in \"Goldfinger\", doesn't exactly exude screen charisma, but she and O'Brian are attractive in their ski lodge wear. Fabian plays a highly annoying character and does it a bit too convincingly, creating animosity from many audience members. Lavi gets to trot around in some couture clothes while trying to balance a massive, lacquered wig on her head. The butler and housekeeper couldn't be more mismatched as a couple with her looking like his mother (and old enough in real life to be!) Of the remaining male guests, only Hyde White makes much of an impression with his customary glint in his eye, though Holloway has a few nice moments as well. Most versions are now minus the campy \"murder minute\" which gave audiences a chance to try to figure out who the killer was.",
         "The first remake of the 1945 classic \"And Then There Were None\" is a fairly decent effort. While all of the wonderfully sly wit is gone this time, and the locale has been shifted from an island to a mountain resort (resulting in some characters having different nationalities this time) the results are still quite credible. The cast is good, with golden girl Shirley Eaton of \"Goldfinger\" fame looking quite lovely as the female lead. It's also amusing to see \"My Fair Lady\" almuni Stanley Holloway and Wilfrid Hyde-White together again in a completely different kind of film and setting. Just like the original, the identity of the killer (and I won't say who!) comes as a surprise because the performer gives a brilliant performance that makes it hard to link that performer with the one who committs all the murders beforehand. All subsequent remakes of this story have been awful. The original is still the best, but this one is okay to look at.",
         "Also known as \"And Then There Were None\" and other titles, this Agatha Christie murder mystery centers around one of the most clever, if not the most clever, plots of any of her many works. In typical Agatha Christie style, the story twists and turns in unexpected directions, and you either give up trying to identify who the murderer is, or you are surprised that the murderer is someone whom you least expected. It's then fun to go back and see how you missed the subtle clues pointing to the real murderer. The 1966 movie version is often compared unfavorably to the original, 1945, movie version. Frankly, I prefer the 1966 movie, which is more contemporary in style, and the actor's accents are easier to understand. \"Ten Little Indians\" takes place in a castle on a mountaintop in winter. The \"castle\" has an echo which when combined with the cold and lonely atmosphere, and sometimes sinister lighting, makes for a creepy setting. Thankfully, the movie was shot in black and white. The acting is quite good, for the most part. But the main reason to see this movie is because of the unique plot puzzle. The cinema has made many other Agatha Christie movies, two of the best being \"Witness For The Prosecution\" (1957), and \"Murder On The Orient Express\" (1974). But none can compare, in my opinion, with the clever plot of \"Ten Little Indians\".",
         "While the ending of the novel is changed in this 1965 remake of Agatha Christie's novel AND THEN THERE WERE NONE, it's still an OK murder mystery, a kind of modern version of an old dark house chiller, with an excellent cast of UK veterans and US imports Hugh O'Brian and Fabian. A mysterious \"Mr. Owen\" invites ten strangers, all of whom seem to be guilty of some crime, to spend a weekend in an isolated mountain home. They gradually get killed one by one. My wife felt that the only interesting character in the film was the one who is killed first (you'll have to watch it to see who that is), but I found the whole thing to be entertaining and the ending to be surprising (although the clues ARE planted, when you watch it a second time). Like any Harry Alan Towers production, this is low budget but well cast, and once again Towers wrote the script himself under his Peter Welbeck pseudonym. The recent DVD reissue of this includes the infamous \"Whodunit Break\" (which appeared at the film's climax in its theatrical run but was cut from all TV prints) as an \"extra\" but does not edit it back into the film, which is good because it would make second and third viewings of the film painful. Watch that scene once, marvel that anyone would ever attempt anything so cheesy, and then watch the uninterrupted movie again. Nice to see Shirley Eaton as always (The Girl From Rio and Su-Muru), Hugh O'Brian is a charming and masculine lead, Fabian is entertaining, and the British veterans are as colorful as you'd expect, although some Americans may have trouble telling them apart initially, except for Dennis Price. Worth renting, but I can't say it's worth fifteen dollars. Maybe $8.99 or so.",
         "It's only fair to mention that I saw the 1945 adaptation of this same story before seeing this film, so obviously the plot and characters were very familiar to me before watching. There were some changes between the two versions, however, which helps to keep things fresh...although most of the changes were for the worst. Rather than being set on island, this version sets the story on top of a snow covered mountain; while several of the characters have either had their professions changed or have been made younger than in the earlier version. The film does at least stick more rigidly to the nursery rhyme at the centre of the story. The basis of the story is the same as in previous versions, however, and we focus on ten people that have been invited to stay at a house owned by a Mr U. N. Owns. Shortly after their arrival they are played a tape made by the mysterious host; accusing them all of murder. One by one they are picked off and it's not long before the remaining guests realise that their host is amongst them. The film feels very upper class and all the guests are well dressed and polite. The script is very similar to the earlier adaptation and so I would imagine that both versions stick very closely to the original literature. The cast is rather good and each actor fits into their role well. Standouts for me include Daliah Lavi, who plays an actress and is very sexy - and Mario Adorf who plays the butler. Eurocrime fans may recognise him as the pimp from the masterpiece The Italian Connection. The deaths are rather well handled and we see a bit more than we did in the earlier version; although 'less is more' is still very much the order of the day. Deaths include stabbing, falling off a cliff and someone has a stuffed bear dropped on their head. I was hoping that the film may have changed the ending, but unfortunately it sticks to the original story on this point so it wasn't much of a surprise for me. Still, this is a rather decent adaptation of the classic story; although I'd certainly recommend 1945's And Then There Were None over this version.",
         "And then Agatha Christie, a great writer, thought of a rich, suspenseful, and thrilling story like this. This movie version is an excellent adaption of the story with ten strangers come to a ski resort which seems haunted at first turns out to be the scene of a crime. Which of the ten committed it? Well you'll have to see the movie. This film is beautifully filmed with the acting superb definitely with the Goldfinger girl Shirley Eaton. I'll make sure I add this movie to my classic film collection.",
         "If you enjoy crime mystery movies this is one to see. Based on a novel by Agatha Christie, it tells the story of ten people, all unknown to each other, that get trapped and isolated in a sort of castle on top a mountain where they have been invited by a mysterious host they don't know either. They soon realize the idea for their presence there is none other than to be executed one by one as a punishment for unclear circumstances that hurt and killed people in each one's past. They also realize that the avenging murderer is one of them, but who? Deaths start and it comes to the point in which no one -sill alive of course- trusts no one and everyone suspects everyone. The mystery's disclosure at the very end of the film doesn't lack surprise and goes along with the previous entertaining situations. A rather unpretentious remake of \"And There here were None\" released in the 40's, this 1965 version turns out really good and stands far better than others that followed (in 1974 with Oliver Reed and Elke Sommer and in 1989 with Donald Pleasence and Brenda Vaccaro). The dark atmosphere -the shooting was made in black and white- is good enough and interest doesn't fall along the whole picture, perhaps because the events move fast and the film's running time is perfect. No doubt the very good performances of such experienced actors as Leo Genn (the General), Wilfrid Hyde White (the Judge) and Sterling Holloway (the detective) help a lot too. Hugh O'Brian and Shirley Eaton (a former Bond girl) are correct in their not much demanding roles). If you didn't read Christie's novel you will enjoy the film and its mysterious plot, and if did read it you will enjoy the murderer's handling of facts in order to accomplish his sinister plan. Some too casual and forced situations -necessary to sustain the plot and usual in Miss Christie's novels- do not affect the picture in all which is a real good one in its genre.",
         "The 1965 film is enjoyable and entertaining, but it is worse in some respects and better in some respects than the book and 1945 film. They are all best discussed together. Unfortunately, neither Christie nor the filmmakers succeeded in turning this captivating but confining plot idea into a truly fulfilling story. Once the book establishes its clever, imaginative premise, the story becomes thin and formulaic. The characters are superficial, and there is no lead character to care about. There are only two real plot twists. One creates a major logical problem, which the book acknowledges and tries to overcome by weakly suggesting that the ploy would trick or \"rattle\" the murderer. Neither the book nor the films has anything serious to say about the powerful themes of survival, justice, and criminality that are at the heart of the story. The 1945 film, and to a lesser extent the 1965 film, develop the plot better in some ways than the book. While as tightly written, the 1945 film is richer than the book in deductive theories, in taking stock at each stage of the story, and in survival techniques. Its dialogue seems sharper than the book's and provides some memorable lines. Both films play the Ten Little Indians nursery rhyme on the piano, which brings it to life and sets the stage for what is to come. Both films have strong casts. In the 1945 version, many characters seem as smart, strong, or distinctive as in the book, or more so. They are more entertaining. Generally, the films do a better job than the book of showing the characters interact. Except for the 1989 movie, the films make more of an effort to explain the relationship that develops between two characters. In the 1965 film, the characters are also well-cast, especially the doctor, judge, Blore, and general. Some are more feisty than in the book or other films, like the maid, butler, and conceited actress Ilona. Only in this film are the maid and butler convincingly menacing. Fabian is obnoxious as a re-named Marston, but he is supposed to be. The film places the character in a dissolute career, and he gives the best piano rendition of Ten Little Indians. The 1965 film livens up the methods and depictions of the murders. It changes some words of the nursery rhyme, but it closely adheres to its own version, right down to a bear statute toppled onto one character. Interactions between the characters are more heated and less restrained than in 1945, and should be, given the events. However, the 1965 film is not as tightly and richly told, nor as well-acted as the 1945 version. Hugh O'Brian and Shirley Eaton are appealing and have strong screen presence. But their Lombard and Vera seem relatively superficial and wooden. He does not give as smart and layered a performance as Louis Hayward, nor is she as strong as June Duprez. Dennis Price and Wilfrid Hyde-White each strike a better balance between seriousness and playfulness in their roles than did Walter Huston and Barry Fitzgerald, but are not as vigorous, commanding, and entertaining. Ilona is amusing, but exaggerated, and displaces the spinster Brent, a distinctive character. The 1965 film tries to show the killings on screen in a visually interesting way. This can be dramatic and vividly convey murderous host Owen's malice. But it can also make the murders seem implausible, as when Owen brandishes a hypodermic needle from across a room at one fully aware victim, who simply sits there, mouth gaping. The book sketches the guests' past crimes in summary fashion. They vary widely in originality, depth, and genuineness. The films handle the crimes even less effectively. The 1945 movie presents the general and his past crime in an obscure, lifeless way; even the weak 1989 film does better. The 1945 version waters down Brent's past crime. It makes a ludicrous change to the judge's, which is fortunately changed back in 1965. The 1965 film changes Lombard's past crime, and even more harmfully the general's, to something trite and unexplained. To no effect, in 1965, Lombard is changed from explorer to engineer. In changing the story to allow characters to survive, both the 1945 and 1965 films distort characters' identities and/or crimes in fundamental ways. In the process, they replace the book's most complex and interesting past crime with one that is bland, superficial, and false. This confuses the meaning of the host's actions, although it does suggest, but not develop, a new theme of false accusation not present in the book. Generally, the attempts made in both early films to make the characters entertaining come at the expense of their plausibility as villains and of the story's seriousness. Characters confess their secrets and treat the horror unfolding around them as if it were a parlor game. Mischa Auer's farcical, clownish performance is a disaster. The character was poorly drawn to begin with, and the 1945 film does a particularly poor job of presenting his past crime. This is only the most extreme example of a general problem with taking such a lighthearted approach to a fundamentally serious story. Attempts to make characters comical or appealing also sap the suspense in the 1965 version. Worst of all, in 1945, the climactic scene in which Owen's identity, means, and motives are revealed is short, sedate, droll, and unsatisfying. In 1965, the final scene has more explanation, but remains thin and undramatic. In both films, Owen has a weary, rational, amiable armchair chat with the final victim precisely when the character should come alive as someone triumphantly and credibly capable of inflicting such horror. It is left to the otherwise flawed 1974 version to capture more of the tone and intensity of the book and to the generally inept 1989 film to provide an ending that is dramatic, reflects that a deadly serious killer has been at work, conveys a sense of Owen's menace and lunacy, and most fully explains Owen's behavior.",
         "Ten Little Indians may not be the best or most faithful Agatha Christie adaptation, but I've always enjoy it. The problem with Ten Little Indians is that it suffers from one of the same flaws that plague most films based on a Christie work \u0096 plot holes. The viewer is required to accept some of the most astounding coincidences in order to move the plot along. How does the killer seem to know exactly how everyone will respond to a given situation? If you stop and think about it, you'll quickly realize it's all fantasy with little in the way of reality. For example, when the eight \"little Indians\" split up in pairs to search the house, how fortunate for the killer that every person loses his/her partner thereby throwing suspicion on everyone. That doesn't mean it's not a lot of fun, but you've got be willing to make some mighty big leaps in logic. The thing I enjoy most about Ten Little Indians is the ensemble cast. For the most part, it's made up of some terrific character actors given a chance to shine on their own. Leo Genn, Stanley Holloway, Wilfrid Hyde-White, and Dennis Price are all an absolute joy and more than make up for the leaden performances of Hugh O'Brian and Shirley Eaton. It's too bad these two have more screen time than any of the other actors."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Tenlit Films Ltd."],
      "summaries": [
         "Up to a house high on a mountain top have been invited ten people who are strangers to each other. When they are all gathered, they hear from their host that each one of them has in someway caused the death of an innocent person and that justice had not be served in their cases. There are eight guests and two servants there for the weekend, but one by one, they are being knocked off according to the poem of \"Ten Little Indians\". As the number of survivors decreases, they begin to believe that the killer is one of the group, but are unable to decide on which one he or she may be.",
         "Eight disparate people, who have never met each other or their host, are invited to an all expenses paid weekend house party at the luxury mountaintop mansion of the wealthy U.N. Owen. Unless one is an experienced mountain climber, the mansion is accessible only via gondola. Those eight are Dr. Edward Armstrong, actress Ilona Bergen, private detective William Blore, Judge Arthur Cannon, Owen's new assistant Ann Clyde, engineer Hugh Lombard, General John Mandrake and pop singer Mike Raven. Even Ann and the two housekeepers, husband and wife Joseph and Elsa Grohmann, have never met Owen. Upon their arrival, Owen is nowhere to be seen. However, he leaves them a tape recorded message stating that each of them, including the Grohmanns, is responsible for the death of an innocent person or has caused murder. All around the mansion are references to the nursery rhyme Ten Little Indians, including a miniature statuary of ten little Indians. After one of the guests dies from arsenic poisoning, he who admitted before his death his guilt in the incident mentioned on the tape, one of the Indians from the statuary goes missing. The remaining nine guests, who are stranded for at least two days since the gondola has broken down for the weekend, know that Owen's mission is to kill them all, a missing Indian on the statuary a sign that yet another one of the ten has died. As they search the mansion and find no trace of anyone else, they come to the realization that Owen is one of them. This discovery leads to suspicion of the others as Owen as they try to evade Owen's planned end for them. But as one by one the guests are killed, it narrows down the one who is Owen.",
         "A group of strangers, ten in all, are invited by a Mr. Owens to spend a weekend at his remote mountaintop home. After dinner, they learn via a tape recording that they've been invited to the house to pay for their crimes. The accusations are well-founded and unable to leave the house, the guests are being killed off one by one. The private detective in the group thinks that their host is likely hiding in the house somewhere. Judge Arthur Cannon thinks the killer is a member of the group and he proves to be correct.",
         "Agatha Christie tale of 10 people invited to an isolated place only to find that an unseen person is killing them one by one. One of them?"
      ],
      "budget": 0
   },
   "movielensId": 8291,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-09-09",
      "dvdReleaseDate": "2006-03-14",
      "directors": ["George Pollock"],
      "runtime": 90,
      "movieId": 8291,
      "title": "Ten Little Indians",
      "mpaa": "",
      "actors": [
         "Hugh O'Brian",
         "Shirley Eaton",
         "Fabian",
         "Wilfrid Hyde-White",
         "Dennis Price",
         "Leo Genn",
         "Stanley Holloway",
         "Daliah Lavi",
         "Mario Adorf",
         "Marianne Hoppe",
         "Christopher Lee"
      ],
      "imdbMovieId": "0061075",
      "originalTitle": "Ten Little Indians",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["KobbZ8VDI00"],
      "plotSummary": "Ten strangers are invited as weekend guests to a remote mountain mansion.When the host doesn't show up, the guests start dying, one by one, in uniquely macabre Agatha Christie-style.It is based on Christie's best-selling novel with 100 million sales to date, making it the world's best-selling mystery ever, and one of the most-printed books of all time.",
      "tmdbMovieId": 4879,
      "avgRating": 3.61555,
      "releaseYear": "1965",
      "numRatings": 238,
      "posterPath": "/bdb0ZB7t9n6MJC3osookbNrIdhB.jpg"
   }
}