{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "little people",
            "id": 33873
         },
         {
            "name": "anime",
            "id": 210024
         }
      ],
      "imdb_id": "tt1568921",
      "video": false,
      "title": "The Secret World of Arrietty",
      "recommendations": [
         12429,
         16859,
         83389,
         10515,
         15370,
         37797,
         37933,
         81,
         11621,
         8392,
         4935,
         149870,
         15283,
         128,
         242828,
         14069,
         110420,
         12477,
         28874,
         149871
      ],
      "backdrop_path": "/7UfW01brClXNFNNMCwjbuISbVEO.jpg",
      "revenue": 145570827,
      "reviews": [{
         "author": "Andres Gomez",
         "id": "5307142dc3a36854860002cb",
         "content": "One of the most delicate and visually gorgeous movies from studios Ghibli with a great celtic OST to remember.",
         "url": "https://www.themoviedb.org/review/5307142dc3a36854860002cb"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Arrietty (voice)",
               "gender": 1,
               "credit_id": "52fe4801c3a36847f8153cc1",
               "name": "Mirai Shida",
               "profile_path": "/pCS5YQSbXsLmxdPVoD8ngyAMkNl.jpg",
               "id": 227611,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Shô (voice)",
               "gender": 2,
               "credit_id": "52fe4801c3a36847f8153cc5",
               "name": "Ryunosuke Kamiki",
               "profile_path": "/4YtBdxJ7nTv6CuMvxIA6skfqczn.jpg",
               "id": 225730,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Pod (voice)",
               "gender": 2,
               "credit_id": "52fe4801c3a36847f8153cc9",
               "name": "Tomokazu Miura",
               "profile_path": "/lAO4PsJOPMYH08KIe8FEWaFtWyP.jpg",
               "id": 33134,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Spiller (voice)",
               "gender": 2,
               "credit_id": "52fe4801c3a36847f8153ccd",
               "name": "Tatsuya Fujiwara",
               "profile_path": "/xPFYGeg1tE4e21AnQGuwbbHNXgB.jpg",
               "id": 31078,
               "order": 3
            },
            {
               "cast_id": 1011,
               "character": "Sadako Maki (voice)",
               "gender": 0,
               "credit_id": "52fe4801c3a36847f8153ce7",
               "name": "Keiko Takeshita",
               "profile_path": "/6CW9S4ZAozhns0UvT2GiIToFWUS.jpg",
               "id": 548758,
               "order": 5
            },
            {
               "cast_id": 1012,
               "character": "Haru (voice)",
               "gender": 1,
               "credit_id": "52fe4801c3a36847f8153ceb",
               "name": "Kirin Kiki",
               "profile_path": "/coAuKp7a67X44gyqJwVYTK4urVk.jpg",
               "id": 43663,
               "order": 6
            },
            {
               "cast_id": 1024,
               "character": "Homily (voice)",
               "gender": 1,
               "credit_id": "59bf62cdc3a3682feb00dd62",
               "name": "Shinobu Ōtake",
               "profile_path": "/uKyprFZ0hY3ta14M43WNqnLtYnP.jpg",
               "id": 545825,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4801c3a36847f8153cb1",
               "name": "Hiromasa Yonebayashi",
               "profile_path": "/wmHPe8gTwjXYfnIBmMVEpA6DVyz.jpg",
               "id": 144476,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4801c3a36847f8153cb7",
               "name": "Hayao Miyazaki",
               "profile_path": "/1OBQPIwR88n49oAEzk47k0fhhOV.jpg",
               "id": 608,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4801c3a36847f8153cbd",
               "name": "Mary Norton",
               "profile_path": null,
               "id": 27814,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4801c3a36847f8153cd3",
               "name": "Toshio Suzuki",
               "profile_path": "/k5YYt3VYjCEGRP4eCPx9bCLNtE4.jpg",
               "id": 1417,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4801c3a36847f8153cd9",
               "name": "Rie Matsubara",
               "profile_path": null,
               "id": 548754,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4801c3a36847f8153cdf",
               "name": "Cécile Corbel",
               "profile_path": null,
               "id": 548755,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 15.093288,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 51739,
      "vote_count": 877,
      "budget": 37000000,
      "overview": "14-year-old Arrietty and the rest of the Clock family live in peaceful anonymity as they make their own home from items \"borrowed\" from the house's human inhabitants. However, life changes for the Clocks when a human boy discovers Arrietty.",
      "similar": [
         8392,
         351460,
         64686,
         430447,
         346,
         616,
         68730,
         81,
         16859,
         34584,
         4935,
         2454,
         120,
         121,
         411,
         630,
         11430,
         8247,
         9016,
         12155
      ],
      "original_title": "借りぐらしのアリエッティ",
      "runtime": 94,
      "poster_path": "/A4w9oSNQUwtkaucy3K7LbSngKrk.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": "/dT3UbXjca6TClutHJtr7GhkRALP.png",
            "name": "Studio Ghibli",
            "id": 10342,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Buena Vista Home Entertainment",
            "id": 11200,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hakuhodo DY Media Partners",
            "id": 11846,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mitsubishi Shoji",
            "id": 20191,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nippon Television Network (NTV)",
            "id": 20192,
            "origin_country": ""
         }
      ],
      "release_date": "2010-07-16",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "Do not be seen by humans. That's been the law of children of the underfloor.",
      "adult": false,
      "homepage": "http://disney.go.com/official-sites/arrietty/index",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hiromasa Yonebayashi"],
      "runtime": 94,
      "synopsis": "Before surgery for his heart, a young boy named Sho is sent to his family's estate to rest by his Aunt. The estate is is comprised of a small home, amid a sprawling green landscape. During his first moments on the grounds, Sho views the house cat named Niya looking at something in some plants. After Niya leaves, Sho catches sight of what appears to be a minature human. This is Arrietty, the daughter of a family of 'Borrowers' that live in a dwelling under the house's floorboards. Arrietty returns to her parents, where her father Pod informs her and her mother Homily about Sho's arrival. Though Homily fears for their safety, Pod assures the family of Sho's condition, and that they should be alright. Arrietty is relieved, as her father had intended to take her on her first 'borrowing' within the walls of the home. Later on that evening, she accompanies her father on a quest to obtain a cube of sugar, and some tissue paper. The cube of sugar is obtained from the kitchen, but for the tissues, Arrietty and Pod climb to the house's second floor, where they make their way through an intricate dollhouse, and into a guest bedroom. The two attempt to get the tissue paper, but Arrietty freezes when it seems that Sho has seen her! In her attempts to leave, she drops the sugar cube. As she and Pod leave, Sho addresses her, asking if she is like the little people that his Mother told stories about. When they return empty-handed, Pod makes up an excuse that his light gave out. The next day, Arrietty is surprised when the boy stops near a grate near their home, and leaves a cube of sugar, and a small note. Arrietty tells her parents about this, and Homily is informed by Pod that knowledge of their presence may mean they will have to leave their home. Arrietty ponders what to do, and returns to the sugar cube. Upon reading the note (\"you left something behind\"), she takes the items, and climbing up to the second floor, addresses Sho through his window. Returning the cube, she requests that he leave their family alone. However, the moment is interrupted when a crow attempts to eat Arrietty, and ends up stuck in the wire mesh of the window. Sho manages to rescue Arrietty from falling, and hides her as the housekeeper named Haru comes in, managing to get the crow loose. After she leaves, Sho realizes that Arrietty has snuck off. Attempting to return home, she encounters Pod, who informs her and Homily later on, that they will have to move. In the evening, Sho has dinner with his Aunt and Haru. Sho's conversation turns to the dollhouse, and his Aunt explains that their father told her and Sho's Mom that it was made for the little people that he had seen. After dinner, all three go upstairs and observer the detailed intricacy of the house. Later on, Arrietty and Homily work on stitching sacks to carry belongings, when Pod is returned home with the help of another Borrower named Spiller. Pod has twisted his ankle, and Spiller was able to help him get home. The existence of another Borrower fills Arrietty and Homily with hope that they aren't the last of their kind, and Spiller agrees to help them find a new place. After he leaves, Pod explains to Arrietty that before she was born, there were 2 other families of Borrowers that lived in the house. One of them disappeared, and the other moved away. Suddenly, the dwelling is shaken as the ceiling is removed. Though it seems that they have been discovered, it is actually Sho, who removes the family's small kitchen, and replaces it with the one in the dollhouse upstairs. However, the gesture of kindness does nothing more than help speed up the family's feelings to leave. After recovering from his sprain, Pod leaves to search out Spiller and a new place, while Homily continues to pack. Meanwhile, Arrietty finds Sho out in the garden with Niya. Though Sho seems happy to have gifted the kitchen to the Borrowers, Arrietty confesses that his knowledge of their existence has caused her family to prepare to move away. Sho asks if he can look at her, to which she doesn't say anything, as it makes no difference anymore. He tells her she's beautiful. Then he asks questions about Borrowers and says that there must be very few left and soon there will be none, that's fate. To which Arrietty gets upset and says it's his fault they have to leave, but they're going to survive, they are not going to die. Sho appologizes and says that she's right, he's the one who's going to die. Tells her about his heart condition and hopes she can forgive him, for everything. Arrietty is taken aback by this confession and seems deeply affected and saddened to find out about his sickness. Haru finds the Borrowers' home, with Homily in the dollhouse kitchen, and takes her and puts her in a jar, making sure she can breathe in there. Then she calls a pest control company saying she wants trapping service for something in the house that she doesn't want killed. When Arrietty finds that her mother was taken she goes to Sho and he helps rescue her. He also takes the dollhouse kitchen back in the dollhouse in his room, so when Haru tries to prove what she saw, she has nothing. Arrietty's family leaves. They are followed by Niya, the cat, who then goes back and brings Sho to say goodbye. He brings a sugar cube as a gift, and Arrietty gives him her hair clip, for good luck with his oncoming heart surgery. The Borrowers are sailing away in a teapot with Spiller. Arrietty looks sad and Spiller awkwardly offers her a fruit. He's very happy when she takes it. A fish swimming in the shallow water catches her interest, seeming huge next to them. The film ends on a serene, yet kind of sad, note.",
      "writers": [
         "Mary Norton",
         "Hayao Miyazaki"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1568921/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxNjk3OTYyODReQTJeQWpwZ15BbWU3MDgyODY2OTY@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bridgit Mendler, Amy Poehler, Will Arnett | See full cast and crew »"],
      "reviews": [
         "I went into this film with very limited expectations. I'm not especially a fan of animated movies, and have only seen a small handful of anime productions. So it came as a very unexpected surprise to discover that I absolutely loved this movie. It just seemed to get everything pretty much right. The visual artistry was quite beautiful, with a great deal of invention in the scenes where the little Borrowers navigate through the wide expanses of the house they live underneath. The music was quite stunningly appropriate, with the lilting Celtic sound just perfect in tone for this melancholic story, with some lovely vocal work too. And these images and sounds were combined together into a simple narrative that had an enormous amount of heart to it. I felt a warm buzz long after leaving the theatre. The Borrower Arrietty is a beautiful film. I cannot really find fault with it. So from this reviewer who has very limited knowledge of anime I give it a near perfect nine.",
         "Now, unless you live in Japan and actually made it to one of the opening showings, I'm probably the only person reading this who has watched Arrittey so far. As such, I'm going to try my best to review the movie without giving any real spoilers away. And the first thing I have to say is, I thought Arrietty the Borrower was a wonderful movie. The entire film had this amazing feeling of being both unique from other Ghibli movies while still maintaining the parts that make almost all of the Studio's films so great. On the one hand, it had the huge imagination and fully realized and fantastically detailed world of a Miyazaki movie. On the other hand, it had a unique feeling of bittersweet melancholy and wonderful character interactions somehow unlike most of the films that have come before it. While Miyazaki's screen writing clearly had some great effects on the movie, I could really feel the new directorial style of Yonebashi shining through. And it was so hard to believe this was his first film; I often feel like I should give Miyazaki Goro some slack for Earthsea because it was his first movie, but Arrietty just seemed so well thought-out and put together comparatively. This really makes me beyond excited to see what Yonebashi does in the future. There are many aspects of the film that deserve mention for how damn well-done they were; the beautiful animation, the strong voice-work, the great characters, the fantastic music. What is easily one of the standout points of the movie was how incredibly immersive the tiny world of the Borrowers was. Every part of their home, located beneath a pile of unused bricks stored under the human house, is made of small everyday items we hardly think about forgot junk that the Borrowers used so well as tools, furniture, decoration, everything. The sheer size of everything in comparison to them is striking, creating a strange world of adventure and dangers that are really just the most common, ignored of things to us humans. Perhaps my favorite scene is one where, very mild spoilers here, Arrietty's father takes her borrowing for the first time. They walk nimbly across nails sticking out from the foundations of the building, use construction staples as ladders, bouldering over the (to them) boulder sized junk lost between the walls of the house. Far bellow a few mice, the size of lions, scurry in the gloom, their eyes burning red. When Arrietty and her father final exit from between the walls into the darkened kitchen at night, the sheer enormity of the room, the intense sound of the looming and massive refrigerator, the sheer walls that compromise the sides of cabinets, they all take the breath out of both Arrietty and the viewer. That entire scene, where they use ingeniously use tiny household items to scale the counters to raid for sugar cubes a third their size, is simply amazing to watch. So many magical scenes like this made up the entire movie, but that was perhaps the best of them all. The characters are for the most part wonderful as well, though in some ways more subdued than Miyazaki tends to make his own. Arrietty is another in the long line of string Ghibli heroines, but like all of them manages somehow to be unique and wonderful all by herself. She's a young girl who's confident, kind, and capable, but is still unsure of herself at time. Sho, the young human she meets and the other main character, is a very strong character as well, his weak body and strong spirit in conflict, with a air or both peace and melancholy about him (like much of the movie, really). Another one of my favorites was Arrietty's father, who was both strong and quite, but in his own gruff way very kind and a great father. The rest of the cast is very good, though not quite as memorable. As for the music for by Cécile Corbel, I'll admit that at first I was a little skeptical, but in the end the music fit the movie incredibly well and became another fantastic Ghibli soundtrack (which says something when you're included in the ranks among Hisaishi Joe). I love Celtic music myself, but those without that bias (the other 10 people I went with) all thought the music was one of the high points in a movie with a lot of really good points to discuss. This really was an amazing first outing for Yonebashi as a director, and really one hell of a movie. My only complaints are that perhaps at times it seemed to slow down during the second half, but in the end it turned out so well I can hardly fault it for that. The movie had a sort of bittersweet feel that I really can't think of another Ghibli movie to compare to. Sad, joyous, and beautiful, Arrietty the Borrower is the newest Ghibli classic.",
         "In a world engulfed by Kevin James comedies and ghastly and unnecessary reboots, the public is honoured with the animated Arrietty: a heavenly and gentle tale inspired by Mary Norton's novel 'The Borrowers'. Arrietty Clock is a 14 year-old girl who lives with her family underneath a home inhabited by humans. The Clock family borrows items it needs to survive from the people living 'above' and love their beautiful, delicate home. However, when a young boy arrives (Shô) to stay with the human family, Arrietty is accidentally discovered by him. Due to fears of borrowers being seen and captured by human beings, the family fear for her safety. Shô finds himself fascinated by Arrietty and a bond builds between the pair, breaking the boundaries between human and borrower. Arrietty is an intimate and emotional anime resembling the style of Spirited Away. Arrietty is an intimate and emotional anime resembling the style of Spirited Away. The film has currently been released in two languages: Japanese and English. The UK version has voice casting from Saoirse Ronan and Mark Strong, whilst the US version stars Will Arnett and Amy Poehler. What Arreitty has is heart � it cares for its viewers and expresses this with irrevocable beauty. All viewers, young and old, will be unable to help being swept up in this animated treasure and taken aside by just how visually, narratively and emotionally stunning it is. Arrietty is the cinematic equivalent of whatever one believes to be the definition of 'beautiful'. Hiromasa Yonebayashi's animation, aided by manga artist, film director and animator Hayao Miyazaki, swallows the screen in a sea of plush foliage, raindrops and climbing vine. Every individual item is intrinsically detailed from a microscopic teapot to a leaf swaying in the wind. The artistic nature of Arrietty is a marvel of dedication and effort. This film is certainly the best animated film of 2011. Furthermore, the film features rounded and wonderful characters, all of whom have an important role to play. Arrietty is a great role model for children, particularly young girls. She cares and wants to support her family, she's strong, hard-working, determined and she isn't prejudiced. She understands Shô and learns to enjoy his company. Regardless of the reality, the film's heroine provides plenty of positive energy and a great moral compass. Arrietty is a love-letter to childhood enchantment, to that feeling of awe and magic and the belief in another. Verdict: ●●●●● Sumptuous and marvellous storytelling aided by eye-watering beauty, Arrietty is simply sublime. Read more reviews on www.theupcoming.co.uk",
         "Sitting in the theater yesterday, I found myself peering up into the endless shadowy heights of a vast cavern, listening to the booming, deafening echo of a faraway...ticking clock. The dark cavern was the bedroom of our supporting lead, Sho, a boy with a brave but rapidly failing heart; but at the moment, I was standing in the lovingly handmade boots of our heroine and main character, Arrietty the Borrower. It was her first time exploring a human habitation, no small task when you stand barely as tall as a child's finger, and it was impossible not to feel some of her sense of awe and wonder at the gigantic world unfolding around her. This newest Ghibli film is filled with such tiny people, but nevertheless stands a cut above the studio's recent releases (\"Howl's Moving Castle\", \"Tales from Earthsea\", even \"Ponyo\"), delivering a warm and evocative experience that stays with the viewer long after leaving the theater. Pacing and plot have been stumbling blocks for Ghibli in recent years, with their otherwise delightful films spinning wildly out of control in visually fascinating but bewildering finales. \"Arrietty\" thankfully breaks this pattern. The film is beautifully paced and stays true to the spirit of its source material, establishing an engaging world and then carrying the viewer through a well-crafted tale that twists here and there without flying off the tracks before coasting to an ending that borrows nicely from the original while adding a few touches that feel just right. No incomprehensible final act here, just satisfying storytelling. However, what really makes the film a winner, in my opinion, is its masterful use of atmosphere. The sense of the balmy, lazy, sun- and rain-drenched Japanese summertime is beautifully conveyed and pervades every scene, helped along by Corbel's warm and wistful Celtic-styled soundtrack and gentle vocals, but just as memorable and far more unique is the sense of sheer scale. Since the beginning of filmmaking, plenty of movies have tackled the special effects challenge of portraying tiny people in a human-sized world, but although they've integrated their miniature stars more and more skillfully into their surroundings, few have given such a sense of the sheer size of those surroundings from the heroes' vantage. There's no such disconnect here, and Ghibli uses the versatility of animation to their full advantage. The view as Arrietty peers over the edge of a kitchen cabinet is dizzying. Scenes of climbing inside the hollow wall joists feel as hazardous as a documentary on spelunking. Coming in from the rain, Arrietty impatiently brushes clinging water droplets as big as her hands from her hair and clothes. The rustling of Sho's clothing as he stands or sits is like the unfurling of a schooner's sail in the wind, and speaking human voices (although not pitched down to the uncomfortable point that full realism might require) are sometimes underscored with an unsettling rumble. I left the film with a heightened awareness of my own vast(?) size, scanning around me for spots where a Borrower might hide in the theater lobby or creep out to fetch stray popcorn kernels. Inhabiting this gorgeous world are plenty of charming characters: brave and spirited Arrietty, who shinnies up curtains like a monkey and draws her borrowed pin to stare down danger with a sound like Errol Flynn unsheathing a blade; her hard-working and stoically affectionate father, Pod, and fretful but loving mother, Homily; the young human Sho who longs for a friend as he ponders the possibility of his own extinction as well as the Borrowers'; his gentle-spirited aunt and their grubby-fingered housekeeper, who both have their own reasons to wish to see a \"tiny person\"; and an unexpected visitor who brings startling news to Arrietty's family. Fans of the book series will be delighted with the film's respectful and vivid adaptation of Norton's work--I know I was. (Without spoiling too much that hasn't been shown in the trailers, I have three words for those in the know: Spiller. Stream. Teapot.) And those unfamiliar with the material will find plenty to love in this version. It's hard to believe that this confident, solid work is the first film of a freshman director. For the first time in several years, I feel real confidence in the ability of Studio Ghibli to live strongly beyond its celebrated founders' legacies. Here's hoping this little film is a huge success, as it so richly deserves to be.",
         "This was stunning. I saw it just days after going to the Ghibli Museum in Japan, and it was breathtaking. I'm glad since I loathed the last Ghibli film I saw (Pom Poko). Arriety is the exact cure needed for such loud and obnoxious 3D CGI movies that come out every other week. It's quiet and full of soul. There are moments here that you wouldn't even get in a live action movie. Subtle moments of life and nature, that the animators could have saved time and money by not including them. Luckily for us, the details are all present. A shot lingers just long enough for a ladybird to take flight, or the mother to stir her tea after a conversation. What Ghibli understand, more than anyone, is that kids don't need bright/crass/non stop films. The quiet nature of Arriety is so relaxing, with gorgeous music from Cecile Corbel. First time director Yonebayashi shows that Ghibli has much more life and talent to give. I was very familiar with The Borrowers, and was a bit disappointed I was getting something original from Ghibli. I'd already seen the excellent TV Mini-series and the over-the-top American film with Goodman. Ghibli have taken everything great about the story, and toned down the designs and motives, making this a realistic and engaging fantasy. The father is stoic and caring. Arriety is adventurous, but never annoying. Her heart is in the right place, but she doesn't get into a ridiculous amount of trouble. Being Ghibli we get a lovely little cat character, Niya. The designs are ace, and the world of the borrowers and the human beans merge beautifully.",
         "http://bit.ly/qEdJCp You can't beat hand drawn animation. No matter how realistic your computer generated image is or how much the train conductor looks like Tom Hanks, you can't really compete with the beauty of Ghibli's animation. And that really comes across when seeing this new offering on the big screen. Along with some descent English dubbing and the humour that always accompanies tiny people with giant sugar cubes, Arrietty is the usual charming goodness from team Ghibli. Arrietty is The Borrowers (in fact many cinemas are calling it just that) Tiny people live under the floorboards of a house where a young boy with a heart condition is gathering some much needed rest before his impending risky operation. They hide themselves from us humans waiting until night to sneak into our homes and 'Borrow' the things we wont miss, like sugar cubes and tissues. The majority of the fun in this film comes from watching the tiny borrowers clamber around the shelves using string to rappel off cupboards. Olivia Colman (Peep Show, Hot Fuzz) Is brilliant as the panicky Mum of Arrietty constantly fretting about the humans and her daughter running off all the time. Geraldine McEwan (Miss Marple) is also great as Haru, she is a classic creepy Ghibli old lady and some of the noises she makes are making me laugh just now thinking of them. It's easy for kids to follow and endlessly beautiful to watch. Not really surprising that they have done it again and thanks to Pixar dropping the ball (again) with Cars 2, Oscar this year please? See http://brotherscinemazov.blogspot.com/ for more on all things film.",
         "A \"smaller-scale\" Ghibli movie than what we're used to, but a good one. The Secret World of Arrietty is the story of a family of \"borrowers\" a tiny race of people who live within the homes of ordinary humans and who are supposed to stay hidden from them at all times.  It's visually as beautiful as you'd expect from Ghibli, with even simple backgrounds looking as lovely as a painting. Instead of the fantastical lands of most Ghibli films like Spirited Away or Howl's Moving Castle, The Secret World of Arrietty is set in an ordinary home. But the simple beauty of everything and seeing the lovingly-drawn detail in everyday items from the view of smaller eyes makes this one of the more memorable Ghibli movies from a visual standpoint, in my opinion.  As for the story, it's simple and effective, and deals with nothing more than the human occupants of a home, including a young boy with a heart condition, and the family of borrowers that also lives there unknown. Arrietty herself, the daughter of the family of tiny people, continues the tradition of fantastic female characters that comes from Studio Ghibli.  This isn't an action-packed movie with a grand climax or anything like that, but I found it satisfying and pleasantly watchable. Arrietty left me with good feelings and avoided being heavy-handed with messages as some Ghibli movies can tend to do. I liked it a lot (better than Howl's Moving Castle and Tales from Earthsea, if not quite as much as Ponyo), and I'll be happily seeing it again at the theater when it comes out in the U.S. ",
         "A great film. I agree mostly with the 10/10 reviews above. Excellent artwork, great attention to the details of the lives of 'The borrowers' and their habitat. The music by Cécile Corbel was great, especially in a Japanese theatre where they bother to do decent sound calibration and have great dynamic range (unlike the UK); I did at points feel like it had been inserted rather forcefully and that integration with the general BGM could have been smoother. As a side note I have read a lot of complaints about Cécile Corbel's music for this film saying that the Japanese accent is terrible and it's not traditional but would like to point out that just because someone may enjoy traditional Japanese culture doesn't mean that modern Japanese culture does not appreciate foreign talent and that foreign culture plays a huge role in the modern Japanese lifestyle. I would not down-rate this film on sound alone, though feel it falls short of a 10/10 in the way that the story played out. The ending to the film attempts to be highly emotional, which I would expect, but for the wrong reasons. It implies a serious bonding of spirits between Sho and Arietti which wasn't allowed to develop during the film and so rather than the bitter-sweet feeling described in a previous review, it ended rather bitterly with Sho essentially being abandoned rather hastily with a clear emphasis on the potential relationship between Arietti and Spiller. All this resulted in the feeling of a shallow story with no discernible morals behind it, which far be it from a happy ending, in the original story morals were present; giving the story a reason why it was worth telling. So I'm giving this film an 8, it's a visual and aural masterpiece, but the 'borrowing' of the story, with no attempt to correctly adopt it for film and no show of a true understanding of its meaning leaves me content that I've seen a very impressive artistic demo.",
         "As another user from Japan, who was able to see the movie, I have a few fair things to say. The movie in general was excellent. For those concerned parents out there, this movie is fully suitable for children. The beginning has beautiful music, but like some Gibli films, the into is kind of long. It is implied/mentioned in the Beginning the the boy, Sho, is suffering from some kind of Heart problem, and that he is resting at his Grandparents house before he goes into surgery to hopefully correct the problem. Although, a beautiful movie, is it also kind of a sad one too. Aside from Sho having a Heart problem, you have the little family trying to survive on what they can find from the house. Within the first scene or two, Sho makes contact with Arretty, telling her he knows who she is, and that she should not be scared of him, and that he means no harm. At first Arrietty is scared of the boy, and is hesitant to talk back to him, but through the kind gestures he makes, and the fact that he saved her life from a crow, she begins to trust him. Throughout the movie, the relationship between them both builds up. Towards the ending, Sho's Grandmothers maid (I think she is a maid, possibly a friend), suspects something is happening with Sho and these \"Little People\" that she recalls his mother talking about ages ago. As a result, she takes things into her own hands to try to find these people. Eventually she finds Arrietty's mother under the floorboard. As a result she takes her and locks her up in a jar. it is at this point the movie can get a bit sad. In light of this, Arrietty goes to Sho to ask for help, discovering he's been locked in his room by the maid, he climbs out the window from his second floor room to get downstairs. After searching in the shelves and cupboards, he takes Arrietty to the Pantry where she finds, and is reunited with her mother. As a result of this, the family is forced to leave their home and find a new place to live. In the final scene, just before they are about to leave, Arrietty sends Sho's cat to him, to bring him to her. In the early morning hours, Sho runs through the back yard/garden, where he finally reaches Arrietty. As they say their final good byes, Sho thanks her, and tells her that because of her, he feels better about going into surgery. Overall. I give this movie a 10/10",
         "Let me start off by saying that the film is not a masterpiece - the storyline, development, interactions and plot is rather dull, simplistic and boring - this is not a film to appease fans of complex dramas. Why do I give this film an 8/10, then? The reason why, is because this is not a film intended to be thought-provoking or philosophical - this is a film about the existence of a world entirely parallel to ours, a view of our daily life from a different perspective. It's an adventure into the unknown, an insight into a culture so similar yet so mysteriously different. It is a typical Studio Ghibli piece in this regard, and that is a Good Thing. The presentation of the film is brilliant and worked very well. The magnitude and immersion with which the Borrowers' forays into our daily lives is shown never ceased to impress me. The visuals, artwork, animation, sound and music played together perfectly. Overall, the film is colorful, cheery and entertaining. If you watch it with high expectations you'll be disappointed, but you won't regret relaxing and enjoying it."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Studio Ghibli",
         "Dentsu",
         "Hakuhodo DY Media Partners"
      ],
      "summaries": [
         "14-year-old Arrietty and the rest of the Clock family live in peaceful anonymity as they make their own home from items that they borrow from the house's human inhabitants. However, life changes for the Clocks when a human boy discovers Arrietty.",
         "In Tokyo, the boy Sho has a heart condition and is neglected by his parents. He moves to the house of his Aunt Sadako and her housemaid Haru to wait for a heart surgery, but he is depressed with the absence of his mother. Meanwhile the fourteen-year-old Arrietty lives on the underground of Sadako's house with her father Pod and her hysterical mother Homily. They are Borrowers, tiny people that collect simple things they need in the house. Sho sees Arrietty on the garden and during the night, she participates for the first time of a harvest with her father. Arrietty accidentally drops a sugar cube in Sho's bedroom, but on the next morning Sho leaves the cube near a window in the basement. Arrietty's parents decide to move to another place since they have been discovered by an inhabitant of the house. But there is the menace of Haru that wants to capture the tiny people.",
         "The Clock family are four-inch-tall people who live anonymously in another family's residence, borrowing simple items to make their home. Life changes for the Clocks when their daughter, Arrietty, is discovered."
      ],
      "budget": 0
   },
   "movielensId": 83132,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2010-07-16",
      "dvdReleaseDate": "2012-05-22",
      "directors": ["Hiromasa Yonebayashi"],
      "runtime": 94,
      "movieId": 83132,
      "title": "The Secret World of Arrietty",
      "mpaa": "G",
      "actors": [
         "Mirai Shida",
         "Ryunosuke Kamiki",
         "Tomokazu Miura",
         "Tatsuya Fujiwara",
         "Keiko Takeshita",
         "Kirin Kiki",
         "Bridgit Mendler",
         "Moisés Arias",
         "Tom Holland",
         "David Henrie",
         "Will Arnett",
         "Carol Burnett",
         "Amy Poehler",
         "Saoirse Ronan",
         "Luke Allen-Gale",
         "Olivia Colman",
         "Mark Strong",
         "Shinobu Ōtake"
      ],
      "imdbMovieId": "1568921",
      "originalTitle": "借りぐらしのアリエッティ",
      "genres": [
         "Fantasy",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["3tVTwN4a0No"],
      "plotSummary": "14-year-old Arrietty and the rest of the Clock family live in peaceful anonymity as they make their own home from items \"borrowed\" from the house's human inhabitants. However, life changes for the Clocks when a human boy discovers Arrietty.",
      "tmdbMovieId": 51739,
      "avgRating": 3.80627,
      "releaseYear": "2010",
      "numRatings": 1435,
      "posterPath": "/A4w9oSNQUwtkaucy3K7LbSngKrk.jpg"
   }
}