{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cat and mouse",
            "id": 15076
         },
         {
            "name": "privacy",
            "id": 18419
         },
         {
            "name": "surveillance",
            "id": 18420
         },
         {
            "name": "road movie",
            "id": 167043
         }
      ],
      "imdb_id": "tt1395183",
      "video": false,
      "title": "Erasing David",
      "recommendations": [],
      "backdrop_path": "/e3VvC7y5ItMcnt6CSNjkM9l84gp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46b69251416c9105d3ad",
               "name": "David Bond",
               "profile_path": null,
               "id": 1209090,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b69251416c9105d3b3",
               "name": "Ashley Jones",
               "profile_path": "/jGS7DXtEb9KUD21SdvVJoRadm3u.jpg",
               "id": 1093888,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.602941,
      "production_countries": [],
      "id": 38409,
      "vote_count": 3,
      "budget": 0,
      "overview": "David Bond lives in one of the most intrusive surveillance states in the world. He decides to find out how much private companies and the government know about him by putting himself under surveillance and attempting to disappear, a decision that changes his life forever. Leaving his pregnant wife and young child behind, he is tracked across the database state on a chilling journey that forces him to contemplate the meaning of privacy and the loss of it.",
      "similar": [
         9798,
         156022,
         920,
         773,
         296099,
         340485,
         4147,
         594,
         11282,
         41513,
         50456,
         201088,
         100042,
         72559,
         19908,
         291870,
         137094,
         212778,
         138832,
         582
      ],
      "original_title": "Erasing David",
      "runtime": null,
      "poster_path": "/ohRcmMUfv2usUYShh8dRcLXnIWH.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2009-01-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "He has nothing to hide but does he have nothing to fear?",
      "adult": false,
      "homepage": "http://www.erasingdavid.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "David Bond",
         "Melinda McDougall"
      ],
      "runtime": 59,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1395183/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MDYyMDAxN15BMl5BanBnXkFtZTcwODAwNDIyMw@@._V1_SY317_CR207,0,214,317_AL_.jpg",
      "actors": ["Stars: Frank M. Ahearn, David Bond, Phil Booth | See full cast and crew »"],
      "reviews": [
         "The description of this film refers to the hot issue of privacy, especially with the fast growing number of social interaction websites in mind. These websites leave too much opportunities for people to publish personal details, which may come to haunt them sooner or later. Any means to make people aware of the underlying risks can be considered useful and should be judged on their educational merits. As a former (retired) security consultant I know how difficult it is to make people aware of issues like these. On the other hand, Internet providers and social websites do everything in their power to downplay these problems. The privacy policy of e.g. Facebook is infamous in being much longer than the American Constitution, even more uninviting to read from A to Z, and not easily understood in all its intricacies. There are a three scenes that may achieve some awareness, and are worth mentioning for that reason. Firstly, main character David takes a lot of trouble in finding out how much details are kept by institutions he knowingly has contacts with, like schools, government, telephone companies, etcetera. He asks them to print everything they have about him, to envelope it and to send it to him. After making categories he finds out, much to his surprise, that by far the largest pile is what is kept by private companies. Obviously, he has agreed to that in the past, but forgot that. Also is unclear what he agreed to precisely. There seem to be no limits to what they can do with the data. Secondly, there was a discussion with his wife when he wanted to withhold his signature for enrolling their child in the fingerprint system that the school just bought. School managers he spoke expected a lot of the new system, but failed to see the issues set out by David. His wife had a similar \"what harm can be in that\" attitude, and his explanations were as seeds falling on unfruitful land (as worded in the New Testament). Thirdly, near the end of the film, David sees with his own eyes how much data the two private investigators had collected about him in a few weeks time. It included information that he did not know even existed, or that he himself had forgotten a long time ago. Nearly everything was obtained legally and from publicly available sources. Only one thing (the hospital appointment) was the result of social engineering. Absolutely no hacking was involved in the search. Overall, the film is a constant mixture of three interleaving story lines: earlier research by David, the chase by two hired detectives to find out his whereabouts, and some interviews with experts in the field. Throughout, there is a high percentage of viewer education, which may be considered \"boring\" by many people but unavoidable to get the main issues across. The same \"boring\" characterization may apply to David's own research, but it is a somewhat dramatized hence much less \"teacherish\". The actual chase carries the film. Though not ended the way I expected, it can be applauded as a very good attempt to make the whole film acceptable for average viewers. But still, one may ask what the ideal target group is for this movie. It does not look commercially viable to run it in a normal theater. Similarly, it seems too long to get it programmed on a public TV channel. In general, I cannot think of an opportunity to show it to a broad audience. If all else fails, can it then serve its purpose as part of an educational program in a school?? Maybe it can work, especially when followed-up by a discussion or writing an essay. As I said, every chance to educate younger people on this, is worth every effort.",
         "Ever worried about the way that almost all organisations seem to gather data on you regardless of whether or not it is needed? Of course, they can claim to be gathering it \"just in case\", but in case it's in your interests that they need it, or only in theirs? These issues are explored in David Bond's frustrating documentary, in which he examines how much information \"they\" have about you by going on the run and challenging a firm of private detectives to track him down. The problem with this exercise is that it's a bit like playing hide-and-seek; you can always win by running into the next field, but that's not the game: David is eventually caught, but only by committing an elementary error, turning up for a pre-booked appointment. Meanwhile, there's a lot of David expressing his paranoia to the camera, which seems a little forced since the only thing that will happen if he's caught is the end of the film (and indeed, had he stayed clear, the point of the film would have been lost). There is also some research, but even that is a little annoying: he visits a school to observe how pupils are tracked, but we never see him asking the teachers to justify this. There are two things going on in our society, I think: we trade privacy for convenience, and others steal our privacy because it's too convenient, and easy, for them to do so. But 'Erasing David' is little more than a gimmick; it won't tell you much that you don't already know.",
         "There's no denying that our lives are more exposed now more than ever before. With surveillance cameras on almost every block in the city, security cameras in every store, ATM cameras, traffic cameras, people with camera cell phones, it's amazing that we don't know where every single person is at any given moment. Add to that the GPS systems, cell tracking devices, credit card purchases and social media sites such as Myspace, Facebook, Linkedin and Twitter and the whole world can see where you are and what you're doing at all times. It's like a 24/7 peep show, my friends. David Bond decided that he was going to try and live off-the-grid. Not an easy task. He lives in the UK and the UK is the 3rd most watched country in terms of surveillance (behind China and Russia). He hires two professional private investigators (Gowlett and Mee) to track him down and find him -- all they are given is his name, the rest is up to them. A camera crew follows the detectives while David has his own handy Steadicam to document his actions. Before David starts kicking rocks, he takes us all the way up to three months before the initial hiring of the detectives. The documentary is edited so that it plays some scenes from months ago to what's happening right now, so pay attention to the words superimposed on the screen or you'll lose yourself. It gives us a peek behind-the-scenes at how certain companies use our data that we provide to them. David also interviews several people on the topic of privacy and what we can do to try and protect ours. He finds out... not much, actually. It's mind-boggling just how much data Amazon.co.uk keeps on it's customers, a \"doorstop of information\" David calls it. You'll probably already know a lot of the things about privacy that are pointed out in this documentary, but it's still very well worth watching. In one of the months prior to this little experiment, he even interviews people about identity theft and the problems that they've encountered because someone has the same name as them. And a lot of these so-called errors could be blamed on the government itself, but even when it's their problem, ultimately, it's still your problem. David surprised me when, on the run, he would check into certain websites that the detectives set up for him to log into -- they told him it's a site that shows where they think he is, yeah right. Come on David, use your head. He even goes completely backwoods by trying to hide out in a remote hooded hut, but abandons the notion after only a few days stating that he's supposed to be trying to live a normal life, not one of a recluse or hermit. Another thing I found humorous about the documentary is the state of paranoia that David shows, constantly looking over his shoulder and absolutely certain that everyone is following him and watching his every move. I won't tell you if David succeeds on his mission or not, you're going to have to watch it on your own. You'll be shocked at times and might even want to make a few changes about how you handle certain things from now on. It's a very compelling documentary that is also very funny in certain places, I especially liked the bit where David refuses to sign some nursery papers for his daughter because they want to share her data with other government agencies. \"What if sand-eating becomes illegal?\" More reviews at www.soveryterry.com Final Grade: B",
         "I guess the idea of the film is suppose to make people aware of our digital footsteps, how easy it is for specialists to track us down. I was really expecting a chase down like one of those Bourne Identity movies, where the specialists track him down via many means but in the end he was actually chased down via good old fashion detective work and human error. It does raise certain very valid points though - on how we should question what data is held about us and why they need it. Overall, this is a decent film but don't expect a suspense chase down like a typical Hollywood movie.",
         "David wants to find out how much information about him is just hanging around in the world. He leaves his pregnant wife (with her consent, thankfully) and hires two private detectives to hunt him down. We follow David in his escape from the world and the detectives across Europe intermixed with flashbacks from before his vanishing act, where we see how much information every single institution has on him and the rest of his family. In the beginning, one gets a creepy feeling that companies and institutions and the government keep all sorts of records, and that it's just too easily available for \"the wrong people\" to get their hands on. As the movie nears its middle, it becomes apparent that the detectives are not relying on all this available technology, but on basic, nose-to-the-grindstone, garbage-digging, surveillance detective work. The end is rather unsurprising, but what is mentionable is the gradual paranoia that engulfs David. Even when he is hiding in a ruin in a field miles from nowhere and hundreds of miles from civilization, he thinks they're right around the corner. It gives a good insight into what people on the run must be feeling. All in all a good \"documentary\", but just not that gripping.",
         "I liked this. I feel that I need to add some comments in response to some of the reviews. This film has been made by someone who wanted to carry out an experiment. It is clearly something he was intrigued about and an issue close to his heart. It was a way of expressing his own way of thinking and doesn't need the question asked about what the target audience is. This was aired on More4 which carries many documentaries so I guess that is the target audience. It is what it is and needs no more analysis than of the portrayal of the subject. I think the target audience is neither here nor there."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Green Lions"],
      "summaries": [
         "David Bond lives in one of the most intrusive surveillance states in the world. He decides to find out how much private companies and the government know about him by putting himself under surveillance and attempting to disappear - a decision that changes his life forever. Leaving his pregnant wife and young child behind, he is tracked across the database state by two ruthless private investigators, on a chilling journey that forces him to contemplate the meaning of privacy - and the loss of it.",
         "Director David Bond finds out how much private companies and government know about him by attempting to disappear. Tracked by two ruthless private investigators, his chilling journey forces him to contemplate the loss of privacy."
      ],
      "budget": 0
   },
   "movielensId": 83138,
   "movielens": {
      "languages": [""],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": null,
      "directors": ["David Bond"],
      "runtime": 0,
      "movieId": 83138,
      "title": "Erasing David",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1395183",
      "originalTitle": "Erasing David",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "David Bond lives in one of the most intrusive surveillance states in the world. He decides to find out how much private companies and the government know about him by putting himself under surveillance and attempting to disappear, a decision that changes his life forever. Leaving his pregnant wife and young child behind, he is tracked across the database state on a chilling journey that forces him to contemplate the meaning of privacy and the loss of it.",
      "tmdbMovieId": 38409,
      "avgRating": 2.72727,
      "releaseYear": "2009",
      "numRatings": 11,
      "posterPath": "/ohRcmMUfv2usUYShh8dRcLXnIWH.jpg"
   }
}