{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "japanese culture",
         "id": 10564
      }],
      "imdb_id": "tt0049784",
      "video": false,
      "title": "Early Spring",
      "recommendations": [
         28272,
         45935,
         41292,
         55192,
         4024
      ],
      "backdrop_path": "/a2Vz0MyeJ8Cws3xgCyjhBkcOhNI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Masako Sugiyama",
               "gender": 1,
               "credit_id": "52fe43ebc3a368484e005ed5",
               "name": "Chikage Awashima",
               "profile_path": "/wEx5TrA1a2NibEPhiRXM8g6CGme.jpg",
               "id": 213495,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Terumi Aoki",
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005ed9",
               "name": "Takako Fujino",
               "profile_path": null,
               "id": 213496,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Shoji",
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005edd",
               "name": "Ryô Ikebe",
               "profile_path": "/eRWlwQDqDz0nDV7CZ5O4aRNekOf.jpg",
               "id": 131202,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005ee1",
               "name": "Daisuke Katô",
               "profile_path": "/rZGOg4xRkDTVMdGCzMhswioT4pU.jpg",
               "id": 7457,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Chiyo Kaneko",
               "gender": 1,
               "credit_id": "52fe43ebc3a368484e005ee5",
               "name": "Keiko Kishi",
               "profile_path": "/zE7A2jFhypHNFsP3066Nj199MFF.jpg",
               "id": 122828,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Yukiko Kawai",
               "gender": 1,
               "credit_id": "52fe43ebc3a368484e005ee9",
               "name": "Kuniko Miyake",
               "profile_path": "/zLBRUKTnAcaTFcCT5gKUXs6XeRV.jpg",
               "id": 131016,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kiichi Onodera",
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005eed",
               "name": "Chishû Ryû",
               "profile_path": "/ocEzSylcvsKIKw8LciHEA3E1LEG.jpg",
               "id": 33135,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Tamako",
               "gender": 1,
               "credit_id": "52fe43ebc3a368484e005ef1",
               "name": "Haruko Sugimura",
               "profile_path": "/g4ro32UO0Aob9QtLAVAXI9oOKZT.jpg",
               "id": 131013,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Taizo Aoki",
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005ef5",
               "name": "Teiji Takahashi",
               "profile_path": null,
               "id": 213493,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Koichi Kitagawa",
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005ef9",
               "name": "Masami Taura",
               "profile_path": "/hlZWGed90SzjP52593jS1ZM8fhN.jpg",
               "id": 213494,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Customer in 'Blue Mountain' milk bar",
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005efd",
               "name": "Eijirō Tōno",
               "profile_path": "/p27Dd2L0rBEun5JwPYuXHmUQ9ok.jpg",
               "id": 106165,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Shige Kitagawa",
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005f01",
               "name": "Kumeko Urabe",
               "profile_path": "/ouqaV2IjEgBoBLgz62S47NEezT.jpg",
               "id": 123858,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Yutaka Kawai",
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005f05",
               "name": "Sô Yamamura",
               "profile_path": "/rdnPm1VDk0Q0EfTCFRU3N0YniK5.jpg",
               "id": 68411,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ebc3a368484e005ecb",
               "name": "Kogo Noda",
               "profile_path": "/gK4hSppQWVZab0Y1LL4pg7UcSsf.jpg",
               "id": 131010,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005ed1",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005f0b",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005f11",
               "name": "Shizuo Yamanouchi",
               "profile_path": null,
               "id": 552000,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005f17",
               "name": "Kojun Saitô",
               "profile_path": null,
               "id": 993587,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ebc3a368484e005f23",
               "name": "Yoshiyasu Hamamura",
               "profile_path": null,
               "id": 552002,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5717be629251413d300031f7",
               "name": "Yûharu Atsuta",
               "profile_path": null,
               "id": 552001,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.088048,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 20531,
      "vote_count": 7,
      "budget": 0,
      "overview": "A young salary man and his wife struggle within the confines of their passionless relationship while he has an extramarital affair.",
      "similar": [
         127533,
         63493,
         11676,
         20942,
         39111,
         234701,
         37873,
         182827,
         27197,
         326333,
         234693,
         241950,
         254123,
         173056,
         67966,
         43313,
         396121,
         48353,
         269011,
         258727
      ],
      "original_title": "早春",
      "runtime": 144,
      "poster_path": "/6C310Rti2NU1f0PC0300DrYFAEm.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Shôchiku Eiga",
         "id": 5070,
         "origin_country": ""
      }],
      "release_date": "1956-01-29",
      "vote_average": 8.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Yasujirô Ozu"],
      "runtime": 144,
      "synopsis": "A young salary man and his wife struggle within the confines of their passionless relationship while he has an extramarital affair.",
      "writers": [
         "Kôgo Noda",
         "Yasujirô Ozu"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0049784/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNDExNDE4Nl5BMl5BanBnXkFtZTcwMjA4MDUwNw@@._V1_SY317_CR118,0,214,317_AL_.jpg",
      "actors": ["Stars: Chikage Awashima, Ryô Ikebe, Teiji Takahashi | See full cast and crew »"],
      "reviews": [
         "Soshun aka Early Spring (Yasujiro OZU, 1956) This was made after a more than two-year gap following his preceding film, \"Tokyo Story\" (during which period he spent a lot of time working on a film that was to be directed by Kinuyo Tanaka -- which had become bogged down by all sorts of business politics). Ozu re-visits the world of the young \"salaryman\" for the first time since the 30s -- and doesn't particularly like what he finds. Ozu looks at the corrosive impact of the transition to a corporation-centered existence on white collar working men. Shoji Sugiyama (Ryo IKEBE) and Masako (Ckikage AWASHIMA) have been married around 7 or 8 years, but are childless (their only son having died several years earlier). Shoji has shifted his focus to his career and pretty much disregards his wife (or at least takes her very much for granted). After Shoji becomes involved in dalliance with a co-worker, Chiyo, better known as \"Goldfish\" (Keiko Kishi), Masako decides she's had enough... This film is one of Ozu's most earnest. While there are some touches of humor (for instance, Shoji's reunion with his army buddies, after which he is followed home by two of them), the overall tone is serious. Kumeko Urabe provides some earthy practicality as Masako's mother (now a noodle shop vendor -- unclear what she did prior to her husband's death years before) and Chishu Ryu (as Shoji's mentor, in business exile in the boondocks -- but not entirely regretting it) provides quasi-paternal guidance. This film teaches a message Japan largely ignored, business relationships are not an adequate substitute for family ties. With the recent recognition (in Japan) of the phenomenon of \"death by overwork\", the message of the film might be considered especially timely.",
         "Early spring is a time to renew one's hopes, to believe once again that happiness is possible. Sometimes that hope takes the form of betrayal: an extra-marital affair may appear to be the answer to a life that is insufferably routinized and devoid of the thrill of adventure. The \"salaryman\" (in the US: \"white-collar worker\") is someone especially vulnerable: he enters the corporation filled with hope for his future, but, we are told, he soon discovers only disillusionment and \"dissatisfaction\" (a word that surfaces throughout the film). There are, of course, the blandishments of Japan's new consumer society: Note the presence of posters advertising foreign destinations throughout the film (Paris, Colombia, Finland); and note the reference to the withering of the plum trees (Japan's own) on a rich man's estate while bouganvilleas (a foreign import) thrive. But there's little to indicate that Ozu thinks these foreign bagatelles can bring happiness. Indeed, the film has a spareness about it, reflecting a world that has yet to become hopelessly cluttered with objects, which is, as we know too well, the other (the American) solution to dissatisfaction and disillusionment in human relationships and work. Each character tries to shape a life of work and relationships into something satisfying, but there's no simple formula to be found here for happiness in the modern world. There is only the dignity (or lack of dignity) of each individual in their attempt to find happiness. Ozu has brought to life characters who never gush in emotion, who don't even touch one another in the most intimate of reunions (the final husband and wife scene), and whose very restraint makes us feel all the more strongly about them. We feel honored to have shared a part of their lives.",
         "\"Early Spring\" is one of the lesser-known Ozu films, but it is worth watching to complete his view of post-war Japan, and the complexities of returning to daily life. When \"Early Spring\" was released, Japan was two years into its independence from American occupying forces. Tokyo and other major cities were rebuilding. Lives were getting back to some kind of order -- and with that, the challenges of dealing with a group think society also were present. The relationships in this movie show the influence traditional Japan still held on modern life. The closeness of the wife and her mother; the courtesy that the husband shows the mother in law, even as he simply drops his clothes to the floor for his wife to pick up; the traditional house with few conveniences. For anyone interested in Japanese cuisine, the preparation of oden (a kind of winter stew) is a textbook lesson, but it also weaves in with the plot. \"Early Spring\" lacks the humor and grace of \"Early Summer\" and it is not as masterful as \"Tokyo Story\" but it offers an interesting look at the lives of the young salarymen and office girls, at a time when Japan's post-war culture was solidifying. It would be interesting to see a remake, because Japanese life has changed, and yet has remained much the same.",
         "Ozu's genius is to examine universal human dilemmas (tension with aging parents in Tokyo Story; mid-life crisis and boredom with the routines of job and marriage in Early Spring) in a way that is firmly rooted in a specific time and place--Japan in the post-war period. We learn much about Japanese life in the early years of the boom: the look of homes and offices, the way people commemorate the happy and sad events of their lives, how people eat in a noodle shop, a dying man's way of facing death, playing mah-jong, the switch from western to Japanese clothing for different moods and times of day. The camera moves hardly at all and records everything carefully and beautifully, almost like an ethnographic documentary, from its location near the level of a tatami mat. The vistas of office corridors and train lines are breathtaking, not boring. The plot is both moving and slow-moving, a lyrical and thoughtful Japanese version of The Seven Year Itch (married salary worker tempted by flirtatious fellow commuter). Ozu makes traditional values seem convincing and necessary--he doesn't hit us over the head with family loyalty but portrays it as an essential part of life that the protagonist ultimately embraces voluntarily and with full understanding of its meaning, though not without a sense of loss and resignation. Only a filmmaker of Ozu's stature could make me tearful with joy at the sight of a brickyard!",
         "I have seen quite a few of Yasujiro Ozu's films and while I enjoyed this film, it is not among his best--mostly because of its sluggish pacing. If the film had about 20 minutes cut from it, I really think it would have worked better. Now I am not against long films--provided they merit the additional time. This is one of the few Ozu films I had to force myself to finish, as I found it hard to concentrate on what was occurring--a first for one of his films. The film is set in a Japanese company where there are lots of lower to mid-level drones doing their jobs. The theme, at times, is that no matter how hard you work and devote yourself to your job, you will one day die...and most likely not appreciated or sufficiently recompensed for your hard work. A depressing view, to be sure, as the film was apparently trying to make a point about alienation during the industrial age (a common theme in Ozu films). In addition to this theme, there is another plot involving one of the workers having an affair with a co-worker. What actually made this pretty interesting and poignant is that the man's marriage was already in trouble, as their son had died several years ago (as a small child) and the couple became distant in the aftermath. Also interesting is the reaction of the man's co-workers when they think they've discovered the affair (though they still aren't sure). The men all seem to condemn them very quickly and say this is disruptive to the company. BUT, they also later sound incredibly envious of the couple! Additionally, instead of confronting both of them, they only invite in the woman---an interesting double standard. Overall, the film is typical in style to what you'd expect from an Ozu film. The camera remains stationary and slightly lower than the actors and there are no lens movements. Instead, scenes change by cuts, not by a roving camera. Also, the film's subjects are the countless lower-level white collar workers. Atypical is the film's slow pace (slow even for Ozu) as well as the subject matter--adultery is not something he talked about often. So is it worth seeing? Well, anything by Ozu is worth seeing as far as I am concerned. Just don't expect quite the same magic and poignant moments like you'd find in such classics as FLOATING WEEDS or LATE SPRING.",
         "I consider Yasujiro Ozu one of the worlds most significant and distinctive directors, a man who eschews false dazzle in favor of examining the human condition, human relationships; most of his films are quietly incisive portraits of people coming to conclusions and making decisions which will permanently affect their lives. Ozu imparts subtlety to his characters, his sense of time and place are impeccable, and his respect for his characters unparalleled. All of that said, I think that Early Spring is one of his least effective--one easily sees the point he makes about corporate behavior and marital infidelity, but this one, rather than quietly contemplative, struck me as merely slow. The characters too often lack any redeeming qualities, and yet we are apparently supposed to care about them for more than two hours, difficult when there is so little to work with--Early Spring is certainly not a stinker, by any means, but for me, a lesser Ozu, and if you want to start with something more characteristic, begin with either version of Floating Weeds, or with his masterpiece, Tokyo Story.",
         "The cover of the DVD I rented gave away too much of the plot. I'll try to avoid doing this. The characters in \"Early Spring\" talk explicitly about jobs and families, so I'll take that as a cue to do the same. \"Early Spring\" feels rough -- mostly drab scenery, stark conflicts, and direct behavior. The movie begins with a long stretch of static scene-setting, and then abruptly becomes event-rich. I won't detail the plot, but will say that it and the characters and their actions are completely believable. Nothing is exaggerated or simplified to artificially enhance the drama or make a point. Many of the characters are recent arrivals to the middle class, thanks to jobs on lower rungs of corporate offices. Business and personal lives are realistically interconnected, which is rare in movies. (Exceptions that come to mind are \"The Sopranos,\" \"The Apprenticeship of Duddy Kravitz,\" and movies by the Dardenne brothers.) Even when there is a collegial work atmosphere, the jobs can be punishing. The people don't fail to appreciate the benefits, and memories of poverty are fresh enough to keep them from romanticizing the alternatives. Orwell wrote that Dickens pointed to problems of capitalism, but offered no systematic program to fix them, and that the latter may be depth rather than shallowness. You could say the same about Ozu. \"Early Spring\" ends, not unlike Chekhov's \"The Duel\" and \"Uncle Vanya,\" with resignation to circumstances, but also rebuilding and a sense of the redemptive value of work.",
         "This is the story of a married office-worker in Tokyo having an affair with a typist from the office, but do not expect a movie about illicit love and overwhelming passion. For Ozu, the story of the affair serves only as a framework for a portrayal of the life of ordinary white-collar workers. And what a bleak portrayal it is! In Ozu's vision, to be an office-worker means going through a mind-numbing routine every day for little pay, waiting on a promotion that may never come until you leave empty handed on the day of your retirement, and should the rumor spread that you're bonking your stenographer, you risk being banished to the Japanese equivalent of Siberia. So all-encompassing is the grip of the corporation on the characters in this movie that events such as pregnancy and death are almost exclusively discussed in terms of money earned and time clocked. Even the affair itself seems less motivated by desire as by a need to alleviate the drudgery. While this examination of working life is, at 143 minutes runtime, just a tad too long and never reaches the emotional depth found in Kurosawa's Ikiru, another movie about an ordinary guy stuck in a meaningless job, it's nevertheless interesting to see that compared to Kurosawa's movie, Ozu, often considered the most conservative of great Japanese filmmakers, has made a much more overt and damning criticism on the Japanese work-ethic. ***",
         "Early Spring came between Ozu's incredible masterpieces Tokyo Story and Tokyo Twilight. No surprise then, that it kind of falls flat in places. It's by no means a bad film, but it adds a bit too much complexity, making the focus confusing at points. The film starts as a comment on the salary man. The opening scenes are both funny and sad, as we see the empty streets of Japan gradually fill with men and women in white shirts. They all come together at the subway station, and then we see two men in an office building looking down at the madness below. These are the kind of details one must love about Ozu. It is all represented there on the screen, and without many words we know what is going on. As the film continues we see the workers on their breaks and finally arranging a weekend trip. On this trip is where the real story begins. A young married man named Shoji is attracted to a young girl nicknamed \"Goldfish\". They are unable to hide their attraction, as their colleagues start spreading rumors and noticing the smiles between the two. Eventually they give into their temptation. It's the effects after this betrayal that are the key focus. The young girl is surprised that she develops emotions, while Shoji is instantly ashamed of himself. His guilt soon grows, and he avoids his wife. Because of this his wife begins to suspect he is cheating on her. The film shows how destructive guilt can be. As Shoji tries to keep his mind off the affair, he ends up forgetting the anniversary of his son's death. The film is too long for its material. There simply isn't enough going on in the middle, and too much at the beginning and end. What it does offer is Ozu's look at relationships without the arrangement of a marriage. Instead, this shows the hard work and commitment a marriage takes. A theme that was handled a lot more competently and economically in his next feature.",
         "The first impression I had of this masterpiece of Ozu's production was a both nostalgic and familiar one. However, this is not a feeling of an old and ended passed time but the somehow sad premonition of the society we still live in. At the beginning Sugiyama couple wake up with an alarm and the wife starts her duties while the man is going to get the train bound for Tokyo. And the train itself, that opens this movie, gives us the idea of a time no more natural but subjugated to work and money. Another thing that suggests this mood is the job of the main character of this story, Mr. Sugiyama. He works in a busy and big office in Tokyo as salary man. He is nothing without a company that can provide him a sum of money to live. A salary. We can understand it when Sugiyama speaks to two of his former comrades that are artisans, that's to say people still making something tangible. More simple minded but also less stressed and unconscious of the future. The Japanese salary men, especially in this movie filmed soon after the WWII, seem young students without concerns. They eat near the imperial palace as in school trip and they organize a day-trip to sea, a noodle party and, this the main point of the movie, romance between them. The romance that so develops between Sugiyama and Kingyo, the young and single female secretary of the company the main character works in, is the symbol of a new generation. People far from house, without material skills and less practical and patient. As children of a new future. The one made by train, timetables, offices, papers and ties we, as well as Japan, nowadays live in. The betrayed wife of Sugiyama, after her discovery of the relation of the husband, decide to leave him in order to make him concern. However, after the solicitations by her mother and the old colleague of his husband decide to come back to him, transferred in Okayama for three years. This shows how the maybe old fashioned and domestic patience can resolve things in order \"to not make them more difficult than they are\" as the mother of Mrs Sugiyama says. Because as the colleague suggest \"these are proofs that can enforce the couple and not make it end\". At the end the couple decide to stay together after all happened in a town of offices and business but no patience and warmth. Not as in their final destination Okayama. A city below chimneys and so more practical but also more traditional and patient. Ozu seems to say us that the patience that helped Japanese people during war and natural disasters, the one which the foreigners still today admire the most, can be blown away if the practical and stoic spirit loses the strength in front of a crazy rush for money. The money itself the samurai of old Japan despised. This movie so can be read as the warning of an father in front of a son that is going to became adult and the leader of a new generation. We have a sort of Tokyo Story without the two old parents as main characters. However, also here, the wise and elder helps the younger. The gloomy smoker mother and the humble smiling colleague. Japan should have seen this movie more before the bubble era, the crazy consumer tendencies and today lack of identity among many of its people. That time was early spring but now we are already in full summer."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Shôchiku Eiga"],
      "summaries": ["A young man and his wife struggle within the confines of their passionless relationship while he has an extramarital romance."],
      "budget": 0
   },
   "movielensId": 83193,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1956-01-29",
      "dvdReleaseDate": "2007-06-12",
      "directors": ["Yasujirō Ozu"],
      "runtime": 144,
      "movieId": 83193,
      "title": "Early Spring",
      "mpaa": null,
      "actors": [
         "Chikage Awashima",
         "Takako Fujino",
         "Ryô Ikebe",
         "Daisuke Katô",
         "Keiko Kishi",
         "Kuniko Miyake",
         "Chishu Ryu",
         "Haruko Sugimura",
         "Teiji Takahashi",
         "Masami Taura",
         "Eijirô Tôno",
         "Kumeko Urabe",
         "Sô Yamamura"
      ],
      "imdbMovieId": "0049784",
      "originalTitle": "早春",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young salary man and his wife struggle within the confines of their passionless relationship while he has an extramarital affair.",
      "tmdbMovieId": 20531,
      "avgRating": 3.78125,
      "releaseYear": "1956",
      "numRatings": 32,
      "posterPath": "/6C310Rti2NU1f0PC0300DrYFAEm.jpg"
   }
}