{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt1157694",
      "video": false,
      "title": "The Order of Myths",
      "recommendations": [
         125673,
         49457
      ],
      "backdrop_path": "/1ajDg46Ds6ZyepHQAo5O3Qtbd5T.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe460b9251416c7506b291",
            "name": "Margaret Brown",
            "profile_path": "/ijpQTx7XnsH0rLiGUHeO2i67tfE.jpg",
            "id": 216925,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.157025,
      "production_countries": [],
      "id": 14639,
      "vote_count": 3,
      "budget": 0,
      "overview": "In 2007 Mobile, Alabama, Mardi Gras is celebrated... and complicated. Following a cast of characters, parades, and parties across an enduring color line, we see that beneath the surface of pageantry lies something else altogether.",
      "similar": [
         11421,
         376660,
         112160,
         376867,
         244772,
         258480,
         43923,
         8967,
         598,
         773,
         858,
         14,
         11216,
         141,
         634,
         401898,
         298312,
         391713,
         84892,
         398818
      ],
      "original_title": "The Order of Myths",
      "runtime": 97,
      "poster_path": "/hPMZprxA9rTolJUpiQ7Z6XkkEci.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2008-07-05",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.theorderofmyths.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Margaret Brown"],
      "runtime": 97,
      "synopsis": "This film does a credible job of showing how Mardi Gras has progressed, or not progressed, in Mobile, Alabama which is the city where the first US celebrations started in 1703. Much is made of the segregated societies, both black and white, still wanting to keep their groups separate and it gives the wrong idea to a lot of people who have seen it. The Globe and Mail in Canada says: \"A study of community ritual, pomp and camaraderie, 'The Order of Myths' also gradually unveils the startling connections between the two communities, where the great-grandchildren of slaves and the great-grandchildren of slave owners still live highly segregated lives.\" This is patently untrue of the city and it's citizens. True, Mardi Gras groups, all but a couple of them, are segregated by race but it is what each society wants for themselves. Freedom of Assembly is a basic tenet of our Constitution and both races, as private organizations, are free to admit whomever they please. Mobile has had a very diverse city and county government for decades and currently has a black mayor, Sam Jones, elected by a wide margin in the last balloting. He is well liked by most everyone in the city as far as I know and will be a shoo-in next time. The movie presents all the parades and balls as just silly merrymaking but with it's emphasis on racial segregation gives the impression of Mobile having separate water fountain, back of the bus, Old Time Southern Democrat forced segregation.",
      "writers": ["Margaret Brown"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1157694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MjI3NzY5Nl5BMl5BanBnXkFtZTcwMzk0NTEwMg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "If you think racial segregation is a thing of the past in the good 'ole U.S. of A, \"The Order of Myths\" should disabuse you of that notion right quick. It's a little known fact that the Mardi Gras in Mobile, Alabama is the oldest such celebration on American soil, predating the one in New Orleans by a number of years (some date it to as far back as 1699). Of far more interest and note is that, to this very day, the Mobile Mardi Gras is presided over by a pair of kings and queens - one white, the other black - with the balls and parades largely segregated along racial lines as well. Margaret Brown's fascinating and eye-opening documentary focuses on the history of the event, along with the intense behind-the-scenes preparations for the celebration in 2007. Brown interviews the respective kings and queens, as well as many of the designers and planners responsible for pulling the event off year after year. Brown also chronicles the many \"mystical\" organizations who donate money and manpower to the cause (the oldest being The Order of Myths, from which the movie derives its title). Brown has opted not to use narration in her film, preferring to let the people she's interviewing speak for themselves, some articulately, some seemingly unaware of how exactly it is they are coming across - or perhaps they do and just don't care. Yet, no matter how desperately we may want to concentrate solely on the pomp and spectacle of the occasion or to join in the celebration, the images of rooms full of white people and rooms full of black people can't help but color our perception and diminish our enjoyment of the carnival as a whole. Still, it would be easy, I suppose, for outsiders to feel smugly superior to the people on screen, not only for their racist and, in some cases, sexist attitudes, but for their allegiance to traditions that may strike many of us as hopelessly outdated and silly. But Brown avoids turning her movie into an excuse for Southern-bashing and post-Bellum condescension by trying to honestly examine the roots and heritage of the community she's chronicling, not excluding the ugly side as well - the slave trade, the lynchings (including one as recently as 1981), the historic influence of the KKK. So, based on this film, can we conclude that present-day Mobile is a hotbed of racists and bigots? Well, it does have an African-American mayor, and there does appear to have been some small movement towards integrating the festivities in recent years. But in this post-Obama era, it might be incumbent on the fine folk of Mobile, in this one respect at least, to make a little effort to join the rest of us here in the 21st Century. A must-see film.",
         "Writer/director Margaret Brown gives an excellent picture of the Mardi Gras traditions in Mobile, Alabama. Along the way she also gives a very good picture of black/white relations in the South even to this day. Most people think of New Orleans when they hear Mardi Gras, but the fact is that Mobile's traditions date to before New Orleans was a city. Mardi Gras is still mostly a Southern tradition, even though it has spread to Texas, San Diego and St. Louis. It's rich history came over from Europe in the 18th Century to Mobile, New Orleans, and Biloxi, Mississippi, where I am familiar with it, having lived there for a few years. Make no mistake, you can't just walk into the white organizations, even if you are white. You have to have familial connections back to the origins of the city. It is a closed society made up of a lot of former slave owners. Brown weaves the story of slaves into her story of the city and the Mardi Gras traditions. It was an excellent peek into some of the traditions of the organizations, both black and white, and of the Mobile society.",
         "I had no idea that Mobile, Alabama had the oldest Mardi Gras celebration in the nation. Well before New Orleans was even founded, Mobile was already doing their best to live it up before Lent. And, while it's not as big as the one in New Orleans, it is a big to-do--with incredibly lavish costumes, floats and pageantry. However, it also is a giant anachronism--with TWO celebrations--one that is all-black and one that is all-white! In the 21st century, this seems very weird--and highly reminiscent of the recent film \"The Help\"! In many ways, it's a self-imposed continuation of the old 'separate but equal' notion. This film is in some ways quite sad. Seeing the two events being so distinctly separate is a sad reminder that you can't legislate decency--and a lot of folks STILL are hanging on to their racist roots. However, and this came late in the show, there are FINALLY some signs that this situation is changing a bit. See the film and see what I mean. The show is quite good and I like how they simply let everyone talk without commentary--to let the viewer see it and draw their own conclusions. Well worth seeing and I hope folks outside the USA understand that this is NOT indicative of country--just one small backward portion that is finally starting to move into the 21st century. By the way, throughout the film many people talk about tradition and reconnecting with their history yet NEVER mention slavery. It's obviously the elephant sitting in the room.",
         "This near-perfect documentary explains the history of the oldest Mardi Gras in America, in Mobile, AL, as well as the current state of traditions in that Southern city. Mardi Gras balls and parade presentations are still almost exclusively segregated. The major strength of this film is that it seems like anyone (black, white, elderly, very young, official and amateur) will talk freely to director Margaret Brown. Compelling interviews, all-access footage, captivating cinematography, and a good score are the major highlights. This film is highly recommended. It will hold your interest and keep you talking about deep issues afterward. Congratulations to the crew, as this is one of those films that any trained filmmaker would have loved to have made this well.",
         "Thoughtful and quietly disturbing as opposed to having the more open rage of most documentaries dealing with modern racism. In Mobile Alabama, 2007, there are still two Mardi Gras celebration, one white, one black. The weirdly uncomfortable anachronism of two 'separate but equal' parades and balls is defended (primarily by the whites) as preserving history, and as not racist, but somehow more inclusive. And it does seem like both sides of the color line are in no rush to lose their own celebration for fear of being swallowed by the other. This is a far more subtle and complex study of the nature of race relations in America than we usually get to see. It's clear that one day the wall will come down. We see the King and Queen of the black Mardi Gras visit the white celebration, and vice versa -- marking tentative and deeply awkward steps to the time when a future generation will marvel that there ever were two Mardi Gras. But for now we also see how deeply race has split and wounded the town, so that it's almost as though two worlds exist in different dimensions in one space, occasionally seeing each others ghosts as they float by each other.",
         "I love the South dearly because of its flawed but rich past, and this film captures the beauty, complexity, and even the shame of the South in way that only a great documentary can. On the surface, its a film of two Mardi Gras parades---one white and one black---in Mobile, Alabama, which is the site of the oldest parade of this type. This account of moneyed white elites and earnest striving blacks, both proud of their history, and looking for a kind of middle ground in the face of a dark past is a poignant portrayal of a unique slice of America life. Watch it and draw your own conclusions about race relations. You'll be happy you took the time, and you'll be better off for the experience.",
         "From a daughter of this most interesting city, a love letter as only someone who knows the place could give it to us. An interesting lesson in the evolution of cultural mores and standards over time. Lots of Mardi Gras fun! The inside view of a most interesting event. History, alcohol, well-dressed ladies and gentlemen, incidents of the past remembered and others happening in front of you. Well worth the time of anyone who wishes to understand people better. The picture follows a season of celebration in a community steeped in tradition. Interwoven (mostly quite smoothly) is some context of these traditions told of as they would be to a youngster or trusted stranger, and implied by countless actions observed on the screen. Toward the end it becomes clear that things do change, however slowly. Segregation, for instance, even as ritual, will come to an end. If there is a lesson implied it may be to preserve what you love while remembering everything you can.",
         "This was a great film and quite illuminating. Technically, it was very well made. The editors of the film deserve a lot of praise - being able to pull out so many nuanced details, from real life nonetheless!, and piece them together into an overarching story that coalesced so well is no small feat. For that alone they deserve much praise. The storyline itself is fascinating - an in-depth analysis of Mobile, Alabama's segregated Mardi Gras celebrations. I agree with another reviewer who said that the class aspects deserved more analysis (but perhaps that would have bogged down the message?). I can't help but walk away from this movie (and the Q&A) feeling like the black people of this town are pleading (screaming if they could), to have the white people just TALK to them about the need for better integration. But the whites just keep turning a deaf ear to them. During the Q&A, almost every black person who stood up to talk into the mic (on stage and in the audience), brought up this need to TALK about the issue. And almost every white person who spoke up ignored these requests. The whites in the audience asked about the technical aspects of the film, congratulated the filmmaker - one man clearly tried to start a conversation by asking the filmmaker's intent, but even he fell flat because he wasn't pointed enough. Even the self-described liberal woman of the high-society group didn't acknowledge these requests to talk. Instead she rambled on and on about superficial things that were important to *her* (like how it felt to have a camera stuck in her face). The filmmaker herself also wouldn't talk a firm stand on where she stood. And that's a damn shame, because let's face it - the white people of this town are the ones who have the power. They are the ones who need to step it up. Over and over in the film, we heard the black people saying they WANT to integrate. Any statements opposing this were all hearsay - never once a black person say on camera that they didn't want to. So as it stands, it is up to the white people of this town to respond. And I hope they do.",
         "This film honestly looks at the accepted \"segregation\" of \"America's oldest Mardi Gras celebration.\" Tradition runs deep in the 307-year-old port city of Mobile, and the residents like it that way. As a native Mobilian who happens to be black, no one could tell me anything different about the differences between the pageantry of the King Felix III's (the white king) court and King Elexis I's (the black king). It's an unspoken truth. However, someone not familiar with Mobile culture, may find this appalling and racist. There were parts of the film that seemed to only speak to the natives of Mobile. For example, \"old society\" Mobile prides itself in thinking it is more progressive than other southern cities. There are several incidents in the film that indicate this same \"myth,\" such as the white queen declaring her liberal political stance, or the wide acceptance of Mobile's first black mayor, Sam Jones. The filmmaker even seems to carry this myth herself, since she, as a white society member, is sympathetic towards the black society. Her moves, however, are still seen as progressive. In Mobile, racism is something polite society does not discuss, white or black. The film displays so much emphasis on race, that it only occasionally touches on Mobile's true social problem, classism. Several of the white krewe members mention how \"closed\" the societies are to non-bluebloods, regardless of color. In both societies, you have to be the right kind of black or white person. Although the whites hold on to this idea more than the blacks, krewes are slow to open up to the idea of anyone joining, versus crossing color lines. As a coda, the film opens up to the idea that society in Mobile is slowly, but progressively changing for the better. Both sets of royalty get along fine, based on the love of Mardi Gras and tradition. And in the end, everyone has bons temps.",
         "In itself, this is not a bad film. It offers, what I'm sure many white people will feel, a completely unbiased view on the segregation in Mobile, Alabama. I beg to differ. What is perhaps the films greatest strength and its greatest weakness, is that the maker comes from a 'prominent' white family (read: most likely deeply conservative) with still a lot of economic power (read: used to have many slaves in the past). This is why I'm suspicious of the films' unbiasedness. However, there are ominous indicators that the maker is really trying to be as open-minded of her background. Of this, the mentioning of the trees is the most poignant. A VIP white man, is explaining that they really like trees, because of tradition and so on. He seems to be completely unaware that trees in the Deep South symbolize lynchings of blacks. It's rather insensitive. It's like stressing the fact to Jews that Germans really like to cook their food on gas. In itself there's nothing wrong with that statement, but you catch my drift. The fact that the makers choose to put this in, seems to say that she's not afraid to mention the darker parts of her past. Or, the more depressing explanation would be that the maker herself is not aware of the fact that trees and the South stand for lynchings. Also, the similarity between all the Mardi Gras Orders and the KKK is high. It doesn't require a lot of imagination that the KKK took symbols and rituals from these Orders. And it wouldn't surprise me to learn that many of these Orders had been highly instrumental in oppressing the African American people. The end of the film is even more sinister. It is revealed that the grandfatherly man who is interviewed throughout the film is in fact the grandfather of the filmmaker. His last line is: \"For what I am about to say, you have to stop recording\" And indeed, the credits start rolling at that point. Now, in any other film this would have seemed a triumph of respect of privacy over the present day omnipresent eye of the camera. But in this case I imagined that he would tell her all sorts of horrible stuff that the Order of Myths used to do. In closing, I am reasonably sure that the filmmaker was trying for a balanced view and she might have achieved that, within her capabilities. Insofar as anyone can be impartial, she might have come closest. She seems to be best embodied by the Prodigal Liberal daughter, who returns to embrace her deeply conservative \"heritage\". However, it's ultimately a quite depressing film and subject, since all the white people are a.) insisting that they don't wanna change anything and b. are saying that black people WANT to be segregated themselves. We never hear the black people say that, actually. And c.) the black people don't seem very confident in their ability to change things, and seemed to have completely settled in their subservient role. Definitely a case of \"Even Obama can not\", in the sense that even an Obama-presidency won't change this in any, any way."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Folly River Films",
         "Lucky Hat Entertainment",
         "Netpoint Productions"
      ],
      "summaries": [
         "Mobile, Alabama, 2007: the oldest Mardi Gras in the United States is a study in Black and White. Groups prepare coronations, parades, balls, and revelry. White and Black communities have separate royal courts and separate events. People comment on these vestiges of segregation, some critical and some okay with it. The Black king and queen come to the coronation of the White royal couple, and the White king and queen join the celebration at the Comrades party, a primarily Black event. City patriarchs agree to do more together, and the city's youth seem to want more interaction as well. The film explores possible contradictions between preserving traditions and putting the old Mobile behind them.",
         "In 2007 Mobile, Alabama, Mardi Gras is celebrated... and complicated. Following a cast of characters, parades, and parties across an enduring color line, we see that beneath the surface of pageantry lies something else altogether."
      ],
      "budget": 0
   },
   "movielensId": 83291,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-07-05",
      "dvdReleaseDate": "2009-01-13",
      "directors": ["Margaret Brown"],
      "runtime": 97,
      "movieId": 83291,
      "title": "The Order of Myths",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1157694",
      "originalTitle": "The Order of Myths",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "In 2007 Mobile, Alabama, Mardi Gras is celebrated... and complicated. Following a cast of characters, parades, and parties across an enduring color line, we see that beneath the surface of pageantry lies something else altogether.",
      "tmdbMovieId": 14639,
      "avgRating": 3.78571,
      "releaseYear": "2008",
      "numRatings": 7,
      "posterPath": "/hPMZprxA9rTolJUpiQ7Z6XkkEci.jpg"
   }
}