{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0056308",
      "video": false,
      "title": "Only Two Can Play",
      "recommendations": [
         29589,
         131787,
         30446,
         91261,
         44134,
         53016,
         131045,
         41430,
         33245,
         26635,
         44257,
         28567,
         80151,
         68440,
         46270,
         42122
      ],
      "backdrop_path": "/wFPw3KHkWGvlc1k9AoZP5YNLkHD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Lewis",
               "gender": 2,
               "credit_id": "52fe48acc3a36847f81737ed",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe48acc3a36847f81737f1",
               "name": "Mai Zetterling",
               "profile_path": "/2Ap4dJLZLOSlrYWlj5XRoi9KNjO.jpg",
               "id": 55156,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jean Lewis",
               "gender": 0,
               "credit_id": "52fe48acc3a36847f81737f5",
               "name": "Virginia Maskell",
               "profile_path": "/eCXKz4vv7lJFjt3Q85hJSEcu5DE.jpg",
               "id": 151040,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vernon",
               "gender": 2,
               "credit_id": "52fe48acc3a36847f81737f9",
               "name": "Raymond Huntley",
               "profile_path": "/txL0IXHSd70qIAGsGytEjcSL9g2.jpg",
               "id": 87071,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Salter",
               "gender": 2,
               "credit_id": "52fe48acc3a36847f81737fd",
               "name": "John Le Mesurier",
               "profile_path": "/42H9hrRtpFrQ7LFlBr8AnHfgDnr.jpg",
               "id": 14264,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gareth L. Probert",
               "gender": 2,
               "credit_id": "52fe48acc3a36847f8173801",
               "name": "Richard Attenborough",
               "profile_path": "/Abo8fAcdruACs344ut6PNSKH7N4.jpg",
               "id": 4786,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Girl Playing Tennis",
               "gender": 1,
               "credit_id": "59ed39e8c3a3685204019b15",
               "name": "Marie Devereux",
               "profile_path": "/ttJ5DjoosWWa75SPUCaEzrYZ1DZ.jpg",
               "id": 89901,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe48acc3a36847f81737e9",
            "name": "Sidney Gilliat",
            "profile_path": null,
            "id": 14292,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.812601,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 54723,
      "vote_count": 11,
      "budget": 0,
      "overview": "John Lewis is bored by his librarian's job and henpecked at home. Then Liz, wife of a local councillor, sets her sights on him. But this is risky stuff in a Welsh valleys town - if he and Liz ever manage to consummate their affair, that is.",
      "similar": [],
      "original_title": "Only Two Can Play",
      "runtime": 106,
      "poster_path": "/lyGbBjmLR56To2aEsX3cFx9QFmI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1962-01-19",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sidney Gilliat"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Bryan Forbes",
         "Kingsley Amis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056308/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDk3MzY2NTkxM15BMl5BanBnXkFtZTcwMDk0NzAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Sellers, Mai Zetterling, Virginia Maskell | See full cast and crew »"],
      "reviews": [
         "This an unconsidered little pearl and indicates where British film comedy might have gone in the 60s and 70s had it not tumbled into the abyss of the Carry On series and the Neanderthal Confessions of a Window Cleaner/Driving Instructor etc. The former was bad but the latter made Sid, Kenneth and co look like the RSC. This Sellers vehicle on the other hand, from a book by Kingsley Amis, is tightly written,well acted and genuinely funny. Apart from Sellers, Richard Attenborough is particularly good as Probert the belligerent Welsh bard who in deference to his role model has no intention of going gentle into that good night. His acerbic exchanges with Sellers' librarian are the highlights of the film. And unlike practically( I must exclude Shirley Eaton!) any female who ever appeared in either of the horrendous series mentioned above Mai Zetterling is sexy and believable. A great treat for a rainy afternoon and a chance to reassess whether Sellers' best work was in Strangelove and the Cloiseau films or were some of his earlier more understated characterisations actually superior.",
         "'Only Two Can Play' varies uncertainly between sex farce and comedy of manners, but it's an excellent film which gives Peter Sellers a better chance than usual to create a three-dimensional character, rather than relying on putty noses and showy accents. Talking of which: This film takes place in South Wales, and I was distressed by the pushmi-pullyu accents of several of the main characters. Sellers, Virginia Maskell and Richard Attenborough all have a go at doing Anglo-Welsh accents, but none of them manage to be consistent. The authentic Welsh Valleys accent of the excellent character actor Kenneth Griffith (as Sellers's workmate) only emphasises the other actors' dodgy accents. Mai Zetterling's Swedish accent hovers incongruously above the proceedings. (The dialogue establishes her as a war refugee.) Also, the unbilled child actress who plays Sellers's daughter Gwyneth has a very strong North Wales accent, which contrasts rather jarringly with the voices all round her. Refreshingly, this child actress gives an excellent performance. Rather delightfully, 'Only Two Can Play' was actually filmed in South Wales, and it did my heart good to see the graceful hills and row houses of this region as it looked in the early 1960s. This film is full of tiny pleasures, celebrating the British way of life in this post-war period. Little details like the bag of salt inside the packet of crisps, a dialogue reference to conkers (a game which English schoolboys play with chestnuts), or a glimpse of a 1960s page-three girl well and truly pleased me. Even the toilet with the flush-chain next to the washbasin (something which I remember all too painfully) brought back a nostalgic smile to me, now that I no longer have to face this horror in my daily reality. Also, the dialogue includes some delightful figures of speech which are authentic to the period but which are no longer heard in modern Britain ... such as when Sellers nervously admits he has \"a case of the screaming ab-dabs\". 'Only Two Can Play' has a very coherent and believable plot, which is no surprise as this film is based on a novel by Kingsley Amis. Sellers plays John Lewis, an assistant librarian who has a chance for a promotion (and a much-needed rise in wages) if he has an affair with Liz Gruffydds-Williams (played by the very sexy Mai Zetterling), the wife of the local council chairman. Lewis and his wife Jean (the beautiful Virginia Maskell) live in a walk-up flat, sharing a bathroom with all the other tenants. When Jean learns that her husband is cheating on her (or at least trying very hard to do so), Virginia Maskell's reaction is very believable and touching. Full disclosure: I briefly worked with Miss Maskell a few years after she made this film; she was a profoundly talented actress but extremely insecure with it. Her ultimate plunge into depression and suicide was a great tragedy. A fine contingent of British supporting actors are here, including John Le Mesurier ... who seems to have got a look-in during every important English comedy film of this period. Graham Stark, whom I usually find very funny, does an oddly unpleasant turn here as some sort of ill-defined pervert whose precise kink is never established. Raymond Huntley (as the councillor) and Meredith Edwards have too little to do. Richard Attenborough gives an excellent performance as a poncy intellectual, looking like a cross between George Orwell's \"fruit juice-drinking, sandal-wearing\" pseud and Rolf Harris. When Sellers refers to Attenborough as 'the Catcher in the Rye' I nearly died laughing. This film is not (and doesn't try to be) one of Peter Sellers's slapstick-fests: instead, it's a character study which gives Sellers a chance to show off his **acting** talents rather than his powers of mimicry. SLIGHT SPOILERS: American audiences won't get all the references here. After Sellers breaks off his affair with Zetterling, she acquires a very servile boyfriend whom Sellers suggests she should bring to Cruft's: this is an annual London dog show. The very last shot in the film contains a sight gag which is funny and poignant both at the same go. To strengthen his marriage, Sellers chucks his library job and operates a travelling library (a bookmobile) so that he and his wife can drive through the Welsh countryside together, bringing books to villagers. As they drive down the road, we see a large letter \"L\" affixed to the rear mudguard of their van. British viewers will recognise this as a learner's plate, which student drivers are required to display. Viewed symbolically, it's a sweetly funny joke: librarian Sellers is still learning his way on the road of life, but now he and his wife are taking that journey together. I'll rate 'Only Two Can Play' 9 out of 10, with only a few examples of bad shot-matching to deprive this movie of a perfect 10. This movie is an excellent change of pace for Peter Sellers.",
         "\"Only Two Can Play\" is a slice of life comedy made in 1962. Based on a novel by Kingsley Amis, it concerns an assistant librarian, John Lewis (Peter Sellars) who has a chance at a better position and a raise, contingent upon him sleeping with the council chairman's wife (Mai Zetterling). He has a beautiful if exhausted wife at home (Virginia Maskell) and children, and the confines of his home are a little tight and chaotic. Lewis attempts to make a go of the affair, with humor and poignancy as the result. This is a very well acted film, and a very satisfying one. Sellars wasn't a huge star yet, but all the elements are there. Mai Zetterling, primarily remembered today as a director, was a marvelous actress and very sexy. In her book, \"All Those Tomorrows\" she describes her experiences living with Tyrone Power and being madly in love with him for several years. That was some life she had. This was the last film Virginia Maskell would make for a time - she married after this movie and did very little until 1967. Sellars tried to get her replaced in the film, but the director refused. It seems odd, because she was very good. After the birth of a child in 1967, she became acutely depressed and ultimately overdosed on antidepressants. A sad end for a fine actress. The rest of the cast is excellent as well. A very good film, well worth seeing.",
         "Peter Sellers was always at his best in this type of local comedy. His randy Welsh librarian, frustrated with his dead-end job, has a part-time job as a reporter on the local newspaper, doing reviews of the local repertory theatre. We see his dreary home life; his long-suffering wife - a lovely performance from Virginia Maskell; his interchanges with his hypochondriac neighbour - Kenneth Griffiths. Enter the glamorous Mai Zetterling, wife of the local big-wig (Raymond Huntley)and Seller's life is catapulted into confusions. A chance of promotion - in exchange for sexual favours with Mai - catapults him into a sequence of very funny situations. One, a confrontation with an avant-garde poet/playwright - a beautiful cameo role by Richard Attenborough - is hilarious and the whole film progresses at a very satisfying pace, never descending in to farce. It would be nice to have it available in DVD format. It is a much better example of some of Seller's work, such as the farcical Pink Panther froth.",
         "This is a terrific example of a number of little English gems that Sellers made before his international stardom as Inspector Clouseau in the Pink Panther. The writing and directing are wonderful as is the great black and white cinematography that captures a dismal Welsh mining town. See it if you can find it.",
         "I was not surprised to see that this movie was based on the black humour of Kingsley Amis. Do not expect from Sellers the slapstick farce of the Pink Panther days or the sparkling multiple personalities of the \"Mouse that Roared\" or the radio Goon shows. Instead, here is a believable person whose comedy arises from his all-too-human reaction to the situation in which he finds himself. The \"usual suspects\" put up fine character performances, there are funny moments enough. If the movie is not quite the comic equal of \"I'm All Right Jack\", or other Sellers movies of the early 60s, perhaps it is because the comedy and its resolution are a little too conventional to show Sellers at his best. It is still worth watching to see Sellers at his best as a serious actor. As another comment mentioned, the black-&-white filming is also just right for the subject.",
         "I remember seeing this on late night when I was about 10 and along with The Mouse that Roared turned me into a Peter Sellers fan for life! I really prefer his early British films, although he was great in Strangelove and as Clouseau. I'm Allright, Jack is a particular favorite, along with The Naked Truth, Heavens Above!, The Smallest Show on Earth, and Carleton Browne of the F.O. This is a sly, personal film about marriage and infidelity and it was nice to see director Mai Zetterling in a role that suited her. With all the blockbuster junk-filled spectacles, there will always be a place for wonderful little films like this.",
         "This is an excellent film which is true-to-life without being showy or melodramatic. Although definitely a comedy it makes great play of the depressing and restricted life of the central character, particularly the crowded and noisy family home and the lack of privacy and comfort resulting from shared bathrooms (Sellers adjustment of the air-freshener when his landlord comes out of the toilet makes any verbal comment redundant). As a librarian myself I can relate to the professional setting and the dull routine of lending and shelving stock. Graham Stark's Mr Hyman is typical of some of the characters public libraries seem to attract. I remember a man like this who used to visit a library I once worked in. His speciality was putting a small mirror on the floor so he could look up women's skirts. The film makes no attempt to make adultery look romantic. Here it is a guilt-ridden farce full of betrayal and exploitation. It's a fine moment when Liz dumps her lapdog on Sellers and he realises he is just another accessory to her lifestyle (her 'bit of rough' to balance Bill's smoothness maybe?). Sellers attempt at adultery is all the worse because his wife is far from unattractive. Tired and worn down by family responsibilities perhaps, but practical and supportive. Virginia Maskell makes Jean's helplessness in the face of Liz's glamour extremely poignant indeed. It's a tragedy that this fine actress would reach a point in her own life when she couldn't see a way out. Sellers himself is still just on the verge of international stardom. He looks like a normal human being, not the stick thin Hollywood type he became (Sellers lost his natural chubbiness throughout his career, as he got thinner he got unhappier). He is also still a character actor, rather than a caricature who says things like 'heump' and 'beumb'. His John Lewis is totally believable.Some critics have ridiculed the idea that Sellers was ever an actor, they say he was only a mimic with a slim talent for funny voices. This film shows how wrong they are.",
         "Mai Zetterling was a member of that very exclusive club - the female actor/director/writer sorority.Her curse - if indeed that it be - was that she possessed great physical beauty as well as intellectual and artistic distinction:and in a society obsessed with physiognomical appearance her other attributes were very often considered to be of secondary importance. It is ironic then,that in \"Only two can play\",she is cast as by far the strongest and smartest character - Mrs Gruffyd - Williams. Strong,smart and very sexy,she is clever enough to hide the first two and flaunt the third.Mr Peter Sellers as John Lewis the oversexed librarian is in thrall to her from the moment they meet.Imprisoned in a dreary flat and an equally dreary marriage,a victim of his libido,Lewis is desperately seeking a little spice. Rather than a film of the sixties, this is very much a film of the fifties.It negotiates the labyrinthine complexities of post world war two British society skilfully,following the guidelines set down by Kingsley Amis(a determinedly 1950s man) in his novel.Adultery is contemplated,even attempted but never actually committed. Set in Wales,a country that at the time was considered to be even more prudish than middle - England ,the film pokes fun at social and intellectual pretensions as personified by Mr Kenneth Griffith and Sir Richard Attenborough respectively.The social and sexual aspirations of Mr Peter Sellers' character are gently mocked too. It contains a fine portrait of a woman whose life is crumbling round her as she desperately struggles to keep it all together that is worthy of a less light-hearted context.The late Miss Virginia Maskell reminds us with her portrayal of Lewis's wife that adultery may be a game that only two can play,but others are always on the sidelines. Mr Sellers' career went global soon after this,his roles gradually degenerating until they became merely exercises in virtuoso mimicry. I personally found his performances in \"Dr Strangelove\" detracted from its efficacy,and once he donned the white mac and alpine hat of Inspector Clouseau he never again played a character that was a recognisable human being.The role of John Lewis has a depth and truth he was not to find again,demonstrating the full range of his skills as an actor.It is a matter of regret for me that \"Being There\" is apparently widely accepted as his best work and \"Only two can play \" is virtually unknown.In a perfect world the reverse would hold good.",
         "I saw the film again quite recently and, despite its age it still cracks me up. It must have been difficult for Sellers to contain his enthusiasm playing Lewis, but he manages an appropriately subdued character, bubbling under with sardonic humour and sarcasm. His wonderful treatment of his co-worker, Jenkins, is beautifully sarcastic, yet well meaning, whilst his loathing of Probert is obvious but a little understated. The slightly obvious ploy of the theatre fire whilst he is otherwise engaged, followed by his newspaper criticism next day, still remains hysterically funny. This is one of Sellers best outings, despite the many excellent films he made during his sadly curtailed life."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Vale Film Productions",
         "British Lion Film Corporation"
      ],
      "summaries": ["John Lewis is bored by his librarian's job and henpecked at home. Then Liz, wife of a local counciller, sets her sights on him. But this is risky stuff in a Welsh valleys town - if he and Liz ever manage to consummate their affair, that is."],
      "budget": 0
   },
   "movielensId": 83464,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-01-19",
      "dvdReleaseDate": null,
      "directors": ["Sidney Gilliat"],
      "runtime": 106,
      "movieId": 83464,
      "title": "Only Two Can Play",
      "mpaa": "",
      "actors": [
         "Peter Sellers",
         "Mai Zetterling",
         "Virginia Maskell",
         "Raymond Huntley",
         "John Le Mesurier",
         "Richard Attenborough",
         "Marie Devereux"
      ],
      "imdbMovieId": "0056308",
      "originalTitle": "Only Two Can Play",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "John Lewis is bored by his librarian's job and henpecked at home. Then Liz, wife of a local councillor, sets her sights on him. But this is risky stuff in a Welsh valleys town - if he and Liz ever manage to consummate their affair, that is.",
      "tmdbMovieId": 54723,
      "avgRating": 2.83333,
      "releaseYear": "1962",
      "numRatings": 3,
      "posterPath": "/lyGbBjmLR56To2aEsX3cFx9QFmI.jpg"
   }
}