{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "philosophy",
            "id": 490
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "fire",
            "id": 657
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "camera",
            "id": 1925
         },
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "earthquake",
            "id": 3521
         },
         {
            "name": "society",
            "id": 3679
         },
         {
            "name": "anarchist",
            "id": 5879
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "games",
            "id": 6186
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "feminist",
            "id": 11718
         },
         {
            "name": "relationship",
            "id": 14534
         }
      ],
      "imdb_id": "tt0064296",
      "video": false,
      "title": "Eros + Massacre",
      "recommendations": [
         79860,
         105833,
         340448,
         35075,
         54421,
         134769,
         281122,
         49695,
         263197,
         52717,
         78450,
         60971,
         36281,
         99600,
         104241,
         104239,
         166092,
         64441,
         53806,
         164585
      ],
      "backdrop_path": "/aCj9skRHyLR977nBMJlp24vJqKs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Noe Ito/Mako Ito",
               "gender": 1,
               "credit_id": "52fe498ec3a368484e131665",
               "name": "Mariko Okada",
               "profile_path": "/r2c6eBfR4qaY29zfn7NrIGSN4uz.jpg",
               "id": 108018,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sakae Osugi",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131669",
               "name": "Toshiyuki Hosokawa",
               "profile_path": null,
               "id": 150306,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Itsuko Masaoka",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13166d",
               "name": "Yûko Kusunoki",
               "profile_path": null,
               "id": 110303,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Akiko Hiraga",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131671",
               "name": "Kazuko Ineno",
               "profile_path": null,
               "id": 1100377,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jun Tsuji",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131675",
               "name": "Etsushi Takahashi",
               "profile_path": null,
               "id": 81279,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Wada",
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131679",
               "name": "Daijiro Harada",
               "profile_path": "/vUHAPmFCAXzwOUgzR5BKfYbTu6K.jpg",
               "id": 40452,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe498ec3a368484e131661",
               "name": "Yoshishige Yoshida",
               "profile_path": "/4B4FmzBB9oOr8GRfFrMe9FCfBNe.jpg",
               "id": 110519,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe498ec3a368484e13167f",
               "name": "Yoshishige Yoshida",
               "profile_path": "/4B4FmzBB9oOr8GRfFrMe9FCfBNe.jpg",
               "id": 110519,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe498ec3a368484e131685",
               "name": "Masahiro Yamada",
               "profile_path": null,
               "id": 1136955,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe498ec3a368484e13168b",
               "name": "Motokichi Hasegawa",
               "profile_path": null,
               "id": 1199753,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe498ec3a368484e131691",
               "name": "Toshi Ichiyanagi",
               "profile_path": null,
               "id": 1089018,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.337604,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 78117,
      "vote_count": 11,
      "budget": 0,
      "overview": "Two interwoven stories. The first is a biography of anarchist Sakae Osugi which follows his relationship with three women in the 1920s. The second centers around two 1960s students researching Osugi's theories.",
      "similar": [
         276,
         1024,
         1259,
         1643,
         24420,
         44214,
         38,
         86331,
         28468,
         27022,
         979,
         1903,
         8834,
         226,
         27066,
         223,
         149870,
         9285,
         705,
         316021
      ],
      "original_title": "エロス＋虐殺",
      "runtime": 215,
      "poster_path": "/vbNDSmtMjbZnnfMchb5HKCSlOM1.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gendai Eigasha",
            "id": 13246,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bungakuza",
            "id": 22677,
            "origin_country": ""
         }
      ],
      "release_date": "1969-10-15",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Yoshishige Yoshida"],
      "runtime": 202,
      "synopsis": null,
      "writers": [
         "Masahiro Yamada",
         "Yoshishige Yoshida"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0064296/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODk1OTMzOTc1NF5BMl5BanBnXkFtZTcwMDU0MTMzMQ@@._V1_.jpg",
      "actors": ["Stars: Mariko Okada, Toshiyuki Hosokawa, Yûko Kusunoki | See full cast and crew »"],
      "reviews": [
         "Yoshida's Eros Plus Massacre is an AMAZING example of what narrative cinema can do with time and space, establishing characters that exist in a world of their own and yet feel very real (and are in fact based on some real people.) Ito Noe and Osugi Sakae were lovers and friends who fanned the flames of anarchist and leftist controversy during one the Taisho era (Japan's Weimar or Roaring 20s.) Noe was a writer who became Osugi Sakae's, an anarchist revolutionary and writer, lover. They were murdered by the state police after the Kano earthquake of 1923 (which was, in some ways and places, blamed on anarchist, immigrants, and other illogical things.) Yoshida places us in the present day through rebellious college students, one an extremely sexual female who plays games with police and film directors the entire movie, the other a nearly impotent young man who is obsessed with current events and fatalism. They replay the Taisho events in their imaginations, which we are privy to, until the imaginations begin to take place within their own reality. Soon, the two are intertwined, and we're asked as viewers to deal with some improbable and unforgettable situations that question our role as a passive audience. The story and characters of both time periods are engrossing, and combined with Yoshida's radical compositions and a combination of subdued \"historical\" music and late 60s trippy rock, you're thrown into a delightfully open ended plot which you'll have a hard time shaking. Yoshida's debt to Alain Resnais is on full display here. The film is a near sister to Last Year at Marienbad and Muriel. Antonioni's desolation films also come to mind, particularly The Eclipse. Yoshida's place in the Nuberu Bago (the Japanese New Wave) was cemented when David Desser named his book about the movement after this film, and its worth the advertisement. This is available in Japan without subs, and you can probably find it somewhere in the trading world with English subtitles, but it needs a proper DVD release (along with EVERY OTHER YOSHIDA film.) Highly highly recommended to any film fan with an open mind.",
         "Possibly one of the most ambitious works in the entire Japanese New Wave, and certainly Kiju Yoshida's most experimental film (to date). As Yoshida and lead actress Mariko Okada said when they gave their rather extensive introduction to the film, what they wanted to achieve with it was to not just portray the protagonist's history as an event of the past but rather place both his story and struggle and the audience on a same temporal plain. The results might have been a lot more successful for its time of release, but it's still a fascinating effort all along. Essentially, the film treats the work and death of anarchist Sakae Osugi as seen through the eyes of two characters in different timelines, being his long-time lover Noe Ito (Mariko Osada) and a teenage couple living out his \"free love\" revolution, going over his biography, who discuss and propose different scenarios that may have happened during his life, such as a notorious event when he was stabbed by his wife which is replayed and deconstructed in an almost Rashomon-like fashion. Yoshida mentioned in his introduction that he wanted to structure the film like a dream, in a place where we could flow freely from past to present and back again but in a manner that seemed to make a narrative/structural sense, like how we forget of these lapses while we dream even though they were there. I found it interesting how he made reference to these two timelines as almost separate events joined through a mere montage trick, however, when the actual way he solves this temporal obfuscation is by blending both timelines within the same mise-en-scene, like these characters and stories are merely a panel away from each other. The modern-day characters are surrounded by the locations that Osugi once inhabited, whereas the love triangle developed between Noe, Itsumi (a former lover of Osugi) and the revolutionary occur in locations that are highly artificial and clearly modern, but which also reflect Osugi's ever-growing disdain towards the world he lives in and his conceptions of \"free love\". It's this quality of juxtaposing temporalities is what gives it a more oneiric feeling to me than the mere disjointed structure with which this story fledges out. Another point of interest which struck me as odd considering the way Yoshida introduced his film is that, whereas he appeared to act very reverently towards the anarchist and how he seemingly was interested in conserving his ideology and not reducing the man to yet another historical figure of whom to make another biopic from, there seemed to be a pretty critical, even satirical tone held throughout to his ideology. There are some sequences within where he freely speaks of his notions of love and government, but these come as firstly apparently shallow, and secondly as little more than a lot of charlatanry. He speaks and writes a lot about these ideals but later says he's unable to defend them publicly because he's constantly surveilled, while on other sequences he seems to completely alter or even outright reject his ideals just to make an argument to defend his love (or lack thereof) to a woman or another. On the other hand, the students doing the investigation are also living in a time where much of Osugi's conceptions of love are coming to fruition, but they do so from the hands of people who seem to do that as a means to clash against the past and little more, and whose musings sound a lot like the classic college lefty monologues which just repeat vapid speeches and ideals against the \"system\" while drinking a can of Coca-Cola and wearing Levi's jeans and Nike trainers. In a sense, I feel the film is a deliberate case study on the vanity and frivolity in revolution, all the while not taking away merits from the essence of these movements' essential ideals. There is, I believe, one problem that defines just why this film was not the masterpiece that so many of Imamura's films were, and that's a problem with the aesthetic. The visuals in this film, the very complex narrative structure, they're all fascinating elements on their own accord, and it's likely that the film would have never been this wonderful without them, but unlike the work of the aforementioned filmmaker, all of this aesthetic innovation appears as a forced, individual element in the film. You never feel like it is something that blossoms naturally from the development of the themes and ideas, or from the position of the characters themselves. Often you're drawn into just how amazing the form is, to the point that you occasionally forget what is going on. It's like both what is being told and how it's being told exist in two very different through equally mesmerizing plains. Also, the way in which the present is depicted in the film is something that refers a lot back tot he time it was made, and nowadays one can't help but feel like the film is a product of its time as opposed to the timeless products of Imamura, Teshigahara, Shinoda, Kobayashi and the likes. Either way, it's an excellent film all around, certainly the best, the most complex and enlightening work I've seen of Yoshida, a definitive milestone for anyone interested in the 60's Japanese scene.",
         "The film narrates two parallel stories:one about two deceased lovers(Noe and Osugi) and the other about a super erotic twenty years old female student who meets a gay student and a policeman who accuses her of prostitution.This woman is interested in characters of Noe and Osugi,representatives of feminist and anarchist movements of the early twentieth century Japan,and tries to find out the secret of their life. Osugi is an anarchist who believes in \"free love\" and keeps a wife and two lovers by the same time.He believes that if the persons are financially independent,live separately and respect the liberty of others(including free sexual relationships),they can live in peace while polygamous,but finally he quites the others for Noe,the one who revives the revolutionist in him. The erotic student and her friend are always playing games,suspending in a desperate emptiness of the time and space.The man has an obsession of burning and the woman wants him to burn her,and in a symbolic scene,they burn together in a fire which the woman has made by her stockings. The film uses a lot of symbolical and expressionistic scenes and lighting to show the meaning of emptiness and sexuality.It is a combination of artistic scenes rather than a classic film with a linear story.we can see the trace of theater and photography in many scenes. It is a different film which remains in mind.",
         "This one, plus Oshima's Koshikei (Death by Hanging, 1968), Matsumoto's Bara no Soretsu (Funeral Parade of Roses, 1969), Shinoda's Shinjû: Ten no amijima (Double Suicide, 1969) and Terayama's Den'en ni shisu (Pastoral : to Die in the Country, 1974), are maybe the great accomplishments of the Japanese New Wave. Here, Yoshida starts the last political trilogy about Japanese Past and Present (Eros plus Massacre, Heroic Purgatory and Coup D'etat) using a distinctive aesthetics proving that his Cinema contains some sort of a Metamorfosical ethic. In fact, the movie builds an omnipresent dialectic between spectator and characters. History and Symbolic Representation. According to Pascal BONITZER, the \"plus\" of the tittle is a metonymy for the movie relation and revelation: \"You must play too, because you can't dominate it. You must attach, dis-attach, and transform one and another: «Eros» and «Massacre». The spectator is the local of application. The spectator is the plus (+).\"",
         "Eros Plus Massacre by Yoshishige Yoshida is considered to be his masterpiece and the peak of the Japanese New Wave (Nuberu Bagu), a movement that Yoshida himself never considered to be a part of. The film lasts 3 1/2 hours and may be the most experimental and ambitious of all of Yoshida's 1960s works. A bunch of things are discussed in the film, most notably anarchism, existentialism and feminism. It's the first installment in Yoshida's Trilogy of Radicalism, followed by Heroic Purgatory and Coup d'etat. It tells two stories - one fictional, one biographical - the latter concerns the Japanese anarchist Sakae Osugi and is set in the 1920s. It's centered about his theories, ideas and relationships with three women - his wife, his first lover (who tries to kill him), and his second lover Noe Ito (played by Yoshida's wife Mariko Okada). The second story is intercut with the first, is fictional, and is set in the '60s, following a young female student named Eiko who researches Osugi's life. We follow her relationship with three men (similar to Osugi's three lovers), a pyroman called Wada who joins her in her research, a suicidal film director and a policeman who investigates her in suspicion that she's connected to a ring of prostitution. The way the stories are connected is very, very loose and feels like a dream. Similar actions are repeated in both time periods, characters from the two periods interact with each other in oniric sequences, etc. From what I gathered from it, the major point of the film is showing that history may be nothing like people imagine or romanticize it. Truth is illusive, complicated and ambiguous. The scenes set in the '20s usually show the characters through various mirrors, or obstructed by objects such as furniture, walls or doors. One scene in particular, showing Ito meeting the staff journalist of the Seito compound, shows the two women in the inverted reflection of themselves in the lake. The other theme of the film may be Eiko and Wada's struggles to keep their idealistic image of Osugi true, because his revolutionary ideas and principles mean nothing in their time, when his thoughts aren't considered radical anymore. The two students spend a lot of time playing with fire. This radical \"game\" is what took the lives of Osugi and many others in the first place. Eros Plus Massacre relies heavily on contrasts to tell its story. The differences between the two times are put further into life by contrasting '60s rock with '20s traditional music with orchestral elements, the '60s contemporary flats and urban life with the '20s simple houses and gardens. The majority of time spent on Osugi's story shows characters endlessly talking, while the '60s story puts an emphasis on (weird) things actually happening. Eiko and Wada spend some of their time reenacting the lives of martyrs, anarchists and revolutionaries - the most famous of these scenes climaxes with them faux-crucifying themselves. The cinematography is out of this world. It's one of the most beautiful black and white films ever made, period. The way characters are put into frame, the lighting, the shadow play - holy sh*t. Almost every frame is a work of art, and some are literally unforgettable. Even though the story is quite grim, the angelic, white glow predominates almost every shot and makes the film that more unique. Characters are separated by walls, pillars, window frames, etc., to accentuate their isolation (esp. Ito and her husband) in typical Yoshida fashion. It seals the deal on Yoshida being one of the finest aesthetes of Asian cinema. The opening scene is one of the best film intros I've ever seen - in this 5-minute scene, Eiko interviews Ito's daughter (also played by Okada) in the most stylish, theatrical and impactive manner. It's a highly immersive cold opening, typical for many Yoshida's films, and just plain rocks overall. Some may not like that it's a bit self-indulgent but I guess that's just what you have to expect from a film like this. Because of its lengthy runtime (200 min.), it may often lose you, or you may find it too cryptic and complex. Despite this, it's a VERY unique movie that'll stick with you for a long time. The title probably describes the two stories - Osugi's somber tale of political turmoil (Massacre) and Eiko's erotic vignettes (Eros). While Osugi is violently assassinated, Eiko enters the story by having sex with a man and later masturbating in the shower. Meanwhile, Osugi does some time in prison, has a football match played over his ashes and gets his near-fatal encounter with his lover Rashomonically played out in several different potential situations. Osugi is shown as a hypocrite because he stands for financial independence,nd yet he's financially suppported by his wife. Meanwhile, Eiko is all for free love, but charges it to other men, seeing as she's a prostitute in her free time. This is the first Yoshida picture to be released outside Japan and had to be cut from 202 to 166 minutes (pity they didn't cut out more :D) for international release. Although it's considered to be Yoshida's best movie, I disagree. I think that the man has some better ones (he is a genius, after all). It can also be really confusing if you decide to watch it without knowing what's it about beforehand. Unfortunately, like all of Yoshida's films, it doesn't have a Criterion release... Yet. Give this movie any adjective and it fits. Lyrical, haunting, boring, erotic, entertaining, unnerving, hypnotic, pointless, poignant, whatever. @Carvalho, the actress who played Eiko is called Toshiko Ii. Not sure why she's unlisted here, but anyway, I added her now.",
         "In the 20's, the anarchist revolutionary Sakae Osugi (Toshiyuki Hosokawa) is financially supported by his wife, the journalist Itsuko Masaoka (Yûko Kusunoki) and spends his time doing nothing but philosophizing about political systems and free love and shagging his lovers Yasuko (Masako Yagi) and the earlier feminist Noe Ito (Mariko Okada). He conveniently defends three principles for a relationship between a man and a woman: they should be financially independent (despite he is not); they should live in different places; and they should be free to have intercourse with other partners. In the present days (1969), the slut twenty year-old student Eiko Sokuta has an active sexual life having sex with different men. She has a freak friend named Wada (Daijiro Harada) that is obsessed for fire and they usually play weird games using a camera while they read about Osugi and Ito. \"Erosu Purasu Gyakusatsu\" a.k.a. \"Eros Plus Massacre\" has just been released in Brazil and I immediately bought this DVD for my collection. Unfortunately I can not understand the hype surrounding this film, and I was absolutely disappointed after watching it. The cinematography and framing are wonderful; the angles of the camera are unconventional; the acting is great; however the messy and prolix screenplay ruin the good aspects of this feature. The cult director Yoshishige Yoshida is unable to use an adequate narrative for entwining two parallel stories, one of them based on a true story of a man and three women ahead of the time living a free love among them in times of repression, and an empty couple in the late 60's when the movement of free love is worldwide. Yoshida does not develop the background of the Japanese society in the 20's and limits to the repetitive situations of jealousy and despair of the women in love. After 210 minutes running time (the DVD has intermission), the boring and never-ending story is not totally clear for the viewer. This feature should have been edited and reduced of at least 120 minutes since the situations are very repetitive. Last but not the least, the actress that performs Eiko is very sexy and beautiful, but her name is not listed in IMDb. My vote is four. Title (Brazil): \"Eros + Massacre\"",
         "When I was recommended a 180+ minute Japanese biopic about someone I had never heard of, directed by someone I was not aware of and made in perhaps my least familiar era for film (the 60's), my first reaction was \"what did I ever do to you?\" However, now that those 180+ minutes are lodged - deeply, I might add - in my memory, I would have to say that I did not receive a burden, but instead a big favor. Eros Plus Massacre provided a unique and challenging experience. If anything, it shook my perceptions of the biopic format. The subject of Eros Plus Massacre is Sakae Osugi (1885-1923), a Japanese radical who advocated anarchy and a way of life that went against as many social norms as possible. This lifestyle included refusing to work, not paying taxes and free love with as many partners as possible. The film covers the period when Osugi established his philosophy to when he practiced it and the moment when his radical views got the better of him: he died at the hands of a police squad, who beat him, his lover � fellow practitioner Noe Ito � and young nephew to death. While the film relies on the rise and fall story structure conventional to biopics, how it goes about telling this story is far from conventional. The plus in the title, for instance, is relevant: the film is roughly divided into halves, the aforementioned incident with the police � better known as the Amanasu Incident � serving as the first half's climactic moment, while the second half focuses on an intriguing and contentious incident where Osugi was stabbed by another, jealous lover, a moment that is repeatedly reinterpreted Rashomon-style. Free love, refusing to obey the man, embracing alternative philosophies: is this the early 20th century, or is it the 60's? Yoshida expresses these similarities by making it appear that the film is under the direction of a student couple who are just as promiscuous, freewheeling and philosophical as Osugi and his lover. The film shifts between scenes with Osugi and the students without a moment's notice, the connections between them not becoming entirely clear until later. Whether due to Yoshida's directing style or my own unfamiliarity with the subject, I first assumed that the students were the young Osugi and Ito, and that the film was taking the kind of broken time line narrative approach that Tarantino would likely cite as an inspiration. The director's use of music, however, eventually made it all clear: the Osugi scenes use traditional Japanese instruments while the student ones are filled with psychedelic rock. Most of the film consists of conversations between the two couples, set against a series of distinctive, disparate (and very sparsely populated) set pieces, ranging from a garden-secluded traditional Japanese home to the underside of a massive highway system. While the truth may be that the director could not afford to hire any extras to fill these backdrops, their emptiness actually works to accentuate the characters' isolation as well as how their self-centered philosophies made the world seem like their own personal playground. In this way, the film reminded me a lot of Antonioni's L'Avventura in its emptiness, attitude towards the subjects' listless behavior (and perhaps in its repetition). Is a life of anarchy sustainable? Do our social norms like gainful employment, marriage, etc. exist solely to empower the elite? The film leaves the answers to such questions up to the viewer, and while Osugi's ways led to his demise, the incident is presented in a very matter-of-fact manner. Even so, this hands-off approach does not always work in the film's favor. As I mentioned with my initial confusion over the use of the students, there are a few moments that would come across as obtuse or extraneous even to the Osugi scholar. There were also scenes that, while impressive aesthetically, did not really add anything new to the picture of Osugi's psyche. Still, it is all material that I wish more films these days would contain, or at least attempt to mimic.",
         "The opening sequence is framed an cut in such a modern way that you would think that you are in a movie of the present. It totally graps your attention and doesn't let go till the end. If you have any chance to see this movie in the original 202min. cut - use it !!"
      ],
      "genres": [
         "Biography",
         "Drama",
         "Fantasy",
         "History"
      ],
      "productionCompanies": [
         "Gendai Eigasha",
         "Bungakuza"
      ],
      "summaries": [
         "In the 1920s, the anarchist revolutionary Sakae Osugi is financially supported by his wife, journalist Itsuko Masaoka. He spends his time doing nothing but philosophizing about political systems and free love and visiting with his lovers Yasuko and the earlier feminist Noe Ito. He conveniently defends three principles for a relationship between a man and a woman: they should be financially independent (despite the fact that he is not); they should live in different places; and they should be free to have sex with other people. In 1969, twenty-year-old student, Eiko Sokuta is sexually active with various men. Her friend, Wada, is obsessed with fire and they usually play odd games using a camera while they read about Osugi and Ito.",
         "Two interwoven stories. The first is a biography of anarchist Sakae Osugi which follows his relationship with three women in the 1920s. The second centers around two 1960s' students researching Osugi's theories."
      ],
      "budget": 0
   },
   "movielensId": 83569,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1969-10-15",
      "dvdReleaseDate": null,
      "directors": ["Yoshishige Yoshida"],
      "runtime": 215,
      "movieId": 83569,
      "title": "Eros + Massacre",
      "mpaa": null,
      "actors": [
         "Mariko Okada",
         "Toshiyuki Hosokawa",
         "Yûko Kusunoki",
         "Kazuko Ineno",
         "Etsushi Takahashi",
         "Daijiro Harada"
      ],
      "imdbMovieId": "0064296",
      "originalTitle": "エロス＋虐殺",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["NWVrSxivE1Y"],
      "plotSummary": "Two interwoven stories. The first is a biography of anarchist Sakae Osugi which follows his relationship with three women in the 1920s. The second centers around two 1960s students researching Osugi's theories.",
      "tmdbMovieId": 78117,
      "avgRating": 3.41667,
      "releaseYear": "1969",
      "numRatings": 6,
      "posterPath": "/vbNDSmtMjbZnnfMchb5HKCSlOM1.jpg"
   }
}