{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "sadness",
            "id": 1647
         },
         {
            "name": "lake",
            "id": 1889
         },
         {
            "name": "forest",
            "id": 5774
         },
         {
            "name": "cult",
            "id": 6158
         },
         {
            "name": "grief",
            "id": 9872
         }
      ],
      "imdb_id": "tt0278413",
      "video": false,
      "title": "Distance",
      "recommendations": [
         105179,
         336776,
         54690,
         160075,
         57859,
         211579,
         85550,
         27245
      ],
      "backdrop_path": "/z5THNarDLAQ4sOOAcRyEbsATqQs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Atsushi",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032943",
               "name": "Arata Iura",
               "profile_path": "/95AJsxMrzI0N9VLvhyawqL7EHEl.jpg",
               "id": 82540,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Masaru",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032947",
               "name": "Yusuke Iseya",
               "profile_path": "/5GhcLQLicLe8xdJlnV7ic7Dtjr5.jpg",
               "id": 70209,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Makoto",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e03294b",
               "name": "Susumu Terajima",
               "profile_path": "/oZPxC2TvOu9DeeVUg38P043ItpJ.jpg",
               "id": 4990,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Kiyoka",
               "gender": 1,
               "credit_id": "52fe44b6c3a368484e03294f",
               "name": "Yui Natsukawa",
               "profile_path": "/y49Kk0dslXP0zXJjUYKB9X7Jbk9.jpg",
               "id": 13280,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sakata",
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032953",
               "name": "Tadanobu Asano",
               "profile_path": "/zlZsST8s1Apm6D6bCyYeWrCKZCy.jpg",
               "id": 13275,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Azusa",
               "gender": 0,
               "credit_id": "54b7035bc3a3686c71000784",
               "name": "Azusa Takehana",
               "profile_path": null,
               "id": 1178878,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tamaki",
               "gender": 2,
               "credit_id": "54b703659251411d790008e2",
               "name": "Ken'ichi Endô",
               "profile_path": "/aifZwBDDgNNhBiz8UfzppwhX5Zf.jpg",
               "id": 35642,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Miyamura",
               "gender": 0,
               "credit_id": "54b7036d9251411d730008ce",
               "name": "Seminosuke Murasugi",
               "profile_path": "/vgQ1UWEmRaxxKRa6YrRjJDMBw0V.jpg",
               "id": 587656,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Detective Kikuma",
               "gender": 0,
               "credit_id": "54b70377c3a3686c6f000898",
               "name": "Baijaku Nakamura",
               "profile_path": "/4GyXoSxexM9EUMWexfTY2plz6eu.jpg",
               "id": 1267701,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Yuko",
               "gender": 1,
               "credit_id": "56941e7fc3a3680ea3000060",
               "name": "Ryō",
               "profile_path": "/oQ0o73MGCYs8jvoOcGBJniJrxWl.jpg",
               "id": 121786,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Masaru's elder brother",
               "gender": 0,
               "credit_id": "54b7038bc3a3686c5f000865",
               "name": "Kanji Tsuda",
               "profile_path": "/5SF6Pb7axi78uknOGWB0eF4Beam.jpg",
               "id": 13256,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Makoto's ex-wife",
               "gender": 0,
               "credit_id": "54b703939251411d66000885",
               "name": "Yorie Yamashita",
               "profile_path": null,
               "id": 555256,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "54b7039ac3a3686c6f0008a3",
               "name": "Ikuji Nakamura",
               "profile_path": "/e8RikCYZqyoIo1ExMnC52xNuTRC.jpg",
               "id": 135200,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e032939",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a368484e03293f",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58a6b384c3a36866c7005f7b",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58a6b3a19251417427005c74",
               "name": "Yutaka Yamazaki",
               "profile_path": "/gW8dR1Tb06MVqqG9e8Cayym4OBy.jpg",
               "id": 25646,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58a6b3c3c3a36866de0052c6",
               "name": "Keiko Mitsumatsu",
               "profile_path": null,
               "id": 93071,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58a6b3d192514174420056d1",
               "name": "Toshihiro Isomi",
               "profile_path": null,
               "id": 20703,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58a6b3efc3a36866de0052d3",
               "name": "Masayuki Akieda",
               "profile_path": null,
               "id": 1087687,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58a6b438c3a368672e005b59",
               "name": "Akira Saito",
               "profile_path": null,
               "id": 552516,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58a6b4539251417427005cdc",
               "name": "Yutaka Shigenobu",
               "profile_path": null,
               "id": 553115,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.895074,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 25051,
      "vote_count": 11,
      "budget": 0,
      "overview": "On the eighth anniversary of a cult's failed chemical attack on Tokyo and their subsequent mass suicide, family members of those affected gather at the cult's former base on the shores of a lake to observe the anniversary of their loved ones' deaths.",
      "similar": [
         1429,
         334541,
         10795,
         428449,
         1579,
         3170,
         11036,
         119450,
         470,
         58595,
         75174,
         318781,
         6947,
         240,
         390062,
         50837,
         395834,
         281957,
         25643,
         1369
      ],
      "original_title": "Distance",
      "runtime": 132,
      "poster_path": "/wyAwtWVlHvrZkCkPEzMa0s5puXg.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2001-05-26",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.kore-eda.com/distance/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hirokazu Koreeda"],
      "runtime": 132,
      "synopsis": null,
      "writers": ["Hirokazu Koreeda"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0278413/",
      "coverLink": null,
      "actors": ["Stars: Arata Iura, Yûsuke Iseya, Susumu Terajima | See full cast and crew »"],
      "reviews": [
         "This film explores the developing relationships between five individuals in their late twenties. The group is linked by being related to people who were part of a tragic suicide/terrorist cult in Japan. I am a big fan of realism in cinema, and this one didn't disappoint. Most of the film is set deep in the forest. It follows the group as they pay their yearly respects to those lost in the suicide. After finding themselves stuck in the woods, they are forced to take refuge in a nearby hut which was previously inhabited by the cult members. Much of the movie contains stunted and realistic dialog between the group, talking about the cult and touching on philosophy. Their is so much authenticity in the way they act that you feel as though you are part of the group, listening to the conversations. There is some plot although I was a bit lost until I read other IMDb comments afterwards. I also felt it ran a bit long towards the end (around 150 minutes). But there are three elements in this film that made it enjoyable for me: it was focused on a small group of individuals, it was realistic, and it had great acting.",
         "looking at SSTOCKER1's question and YAKUZA BENGOSHI's comments on the movie, I'd like to offer my take on Koreeda's great exercise of Dogma-style film-making. That said, I don't think it is necessary for us to \"get\" the story just by identifying the roles of the characters. For example, YAKUZA BENGHOSHI proposes that the mysterious arson/impostor is the son of the cult-leader. But is that a necessary assumption? Does he have to be the son of the leader to feel that kind of emotional attachment to the clan? And aren't most members to cult-groups considered \"children\" to their respective leaders? (e.g. Guyana, Waco, and Serin gas attack in Japan) The mysterious impostor (played by ARATA)was, if nothing else, at least the link to more than one of the dead members whose relatives joined him on this particular memorial outing. Remember, he is the childhood friend to one of the dead member's brother--medical student,as well as being a friend to the dead female member--Yuko, to whom he claims as his sister. Could he be a recruiter who introduced the cult to 2 of the dead members (i.e. the lifeguard's brother, and the dead flower-shop girl)? What if he was also the one assigned to light the fire to which many of the cult members were killed by? The scene by the river with our mystery man discussing his faith with Yuko seems to propose the idea that this WAS her introduction to the cult. Notice the scenes showing his use of photo-shop to paste himself into the girl's family photo, along with short clips of the mystery man burning photos in the back of the hut (in flash-back form) were both inserted thru-out the film. The consistent association with fire (i.e. the act of burning)could possibly imply his motive at the gathering as his way to rid his guilt for having to end his friends' lives... by helping the others find closure, he ends up resolving his own pain--having met the family of the dead, he finds relief & a way to move on. Notice all the dead cult members in the story joined the clan b/c of being lost (e.g. loss of love or lack of self-worth)... that is, except for the lifeguard's brother who thought the clan offered a way for him to justify his existence and talent as a physician. The housewife felt abandoned by her husband, her companion lacked self-esteem... the flower-shop girl couldn't deal with her brother's suicide, and the teacher felt confined by the existing education system, thinking it hindered his good will and talent to benefit society, etc... Whereas we don't really know why Mr. Imposter became a member. He seemed to have been ambivalent to his purpose in life, and perhaps he felt the cult was the only place where he found a sense of purpose. We know he wanted to heal people, and we know he felt the cult was the answer and antidote to the others'pain. so many questions to a great story that probably didn't warrant having to endure the first 20 minutes to the film (which showed the group getting lost in the woods)... but if you can survive the first 20 minutes, the rest is all worth the wait... DISTANCE (2001) is not as good and entertaining a film as AFTERLIFE (1997), but Koreeda managed to show again how good stories don't need a huge budget, sets, and lots of CG gadgets to turn into a great piece of cinema. can't wait to see his latest film - NOBODY KNOWS (2004)",
         "Forget Dogma 95. This is real fiction. A stunning picture about a group of people touched by a tragedy: The killings of the Supreme Truth sect and their subsequent collective suicide. Amazing cinematography, superb acting. A must see film.",
         "Hirokazu Kore'eda's creative career continues to evolve, and this expansive and meditative drama may be my favorite among his films thus far. All of the Japanese films I've seen that would seem to psychologically touch upon the Aum Shinrikyo gas attacks in Tokyo 10 years ago do so in oblique fashion, turning into great meditations on the idea of some unseen and unexpected terror arising from within, and what that says about a society (not necessarily just Japanese society) that likes to think of itself as secure and a success - most of Kyoshi Kurosawa's films beginning with CURE do this, as does Shinji Aoyama's EUREKA. Hirokazu Kore'eda's DISTANCE is perhaps the most suggessful example of this reflective sub-genre, examining the whys and hows of society's darkest impulses, when those impulses happen to surface unexpectedly. In this rather lean, Dogme-like film, individuals who lost loved ones to a cult-inspired act of terror and mass suicide, gather for a memorial reunion at the place their loved ones died (a former cult compound in a remote location), only to meet the cult's lone survivor. The idea of blame falls away very quickly, replaced by a more meditative sense of trying to logically and emotionally comprehend an event that is literally incomprehensible; thematically this film has an intense global relevance, perhaps more now than when first released. Kore'eda's shifts between hand-held cameras (the actual story) and more polished/composed flashback sequences (watch for a brilliant restaurant scene) illustrating the allure of the cult to it's former members is dazzling, blending the techniques used in his earlier AFTER LIFE and MABOROSI. Kore'eda's roots are in documentary film-making, and a fairly unique style has evolved from that background (one can trace that style through the two earlier features; here it really begins to coalesce into something personal and unique): like Errol Morris, Kore'eda prefers the unobtrusive, allowing characters to reveal themselves in fairly relaxed fashion, with many precise insights emerging during quiet, seemingly random moments. This makes for film-making that is languid in tempo, enigmatic and elliptical in narrative structure (certain characters here actually seem to become more inscrutable as the film progresses), but when it works - and it works very well here - the results are mesmerizing. Like Kore'eda's other work, there's a fairly limited commercial appeal in this extraordinary film; 5 years on it has no distribution in the US, which is very unfortunate - I think a lot of American viewers would be quite stunned by this film, given the opportunity to see it. This one is worth the hunt.",
         "This comment is to answer the question posed by sstocker1 and contains a significant spoiler. I recommend skipping the rest of this comment as well as all of sstocker1's comment if you want to avoid spoilers. **** The man who poses as the son of one of the victims and the brother of one of the cult members is the son of the cult leader. I presume his motivation in presenting himself in those false identities was to better understand his father's actions by being able to get closer to the people who were most impacted by his father -- namely the poisoning victims and cult members -- than he otherwise would have been able to do. I interpreted the burning the pictures of his family and the dock at the end as being indications that he was ready to move on (burning the photos) and that he won't be returning to the lake on subsequent anniversaries (burning the dock).",
         "I love Koreeda -- \"Afterlife\" and \"Maborosi\" are two movies I'll watch over and over, and Afterlife actually changed the way I look at my own life. But I don't understand what happens at the end of DISTANCE. I've read all the other members' comments, and none of them really seems to work for me. Even if the mystery man is the cult leader's son and he's only pretending to be the dead girl's brother, who's the old man he visits at the hospital, whom he claims as his father, although he isn't? Who's the family whose photo he assembles on his computer? And how long has he been friends with the other pilgrim to the pier? And why make the point that the ashes of the cult members were never found? (Normally, I wouldn't even worry about that, but in a movie this bewildering it's hard to know what is or isn't important.) Anyway, that's enough of that. For most of this film I was completely engaged. The long setup pays off by delivering the characters to a sort of enchanted forest, where they shelter in the cottage that housed the cult to which their dead brothers, sisters, wives, etc., belonged -- and with them is the man who fled the cult before it committed its crime, who betrayed them. The night passes in alternations of rain and moonlight and the people gather, regather, make fires, and smoke (and smoke) and very slowly begin to try to make some sense out of the mystery that crashed over them and washed away the people they loved and thought they knew. Every element in this section of the film, which fortunately is the longest, works to put you into the rooms these isolated people briefly share, to put you into the rhythms of their conversations and the pauses that punctuate them, and to give you the feeling that you have been part of this improbable, somehow magical, night. The acting, the hand-held camera, the mostly natural light, the absence of any kind of frills, focuses you on the extraordinary actors and beyond them, to the reverberations of fading tragedy that vibrate through these lives like a gong. And then, when the film's characters finally return to the garish, amphetamine-paced hurry of their daily lives, for just a moment you realize what drove the cult into the forest in the first place. It's a great film with an absolutely impenetrable final 15-20 minutes. I'd love to hear some other theories. I don't suppose Koreeda has written anything about it.",
         "Distance Three years after an apocalyptic cult released a biological weapon that killed hundreds and wounded thousands four relatives of people killed in the attack attempt to come to terms with what happened. While the nation mourns the deaths of the victims these four try to come to terms with the deaths of some of the cult members. Stranded in the woods where the cult had lived and where their relatives ashes were scattered, after their car is stolen they are forced to spend the night with one of the few survivors of the cult. There is much talk and reflection as the quartet attempt to find out what drove their loved ones to take part in such a terrible act. This is a film that will enthrall some and drive others to pull their hair out as conversations seem to trail off and people seem to speak haltingly. We catch glimpses of the past in flashback as each person reflects on when their loved ones were still alive and we see the events filtered with the knowledge of what came after. Things are not always spelled out and its not always clear who is who or what is going on. It's a film you have to work with. Personally I'm not sure what I make of this film. I like the realness of it, but there are times when I feel as though it's more than a bit contrived, never to the point of being bad, but just so its slightly disappointing (that something that gets so much right can be so lumpy at times) Still it makes you feel and makes you think about things more than most films these days. Worth seeing, especially if you're interested in seeing a film that deals with subjects that are pressing in today's world.",
         "Contains Spoiler!! I don't get this movie. I patiently sat through it, waiting for the punchline. There's seems to be one, but I'm not sure what it is. Four people make an annual pilgrimage to a spot in the mountains where a cult group lived. Three years previously, the cult had put a genetically engineered virus in the water supply. The idea apparently was to kill off everyone in Japan and then repopulate it with cult members. The virus killed a few people and poisoned thousands, but instead of living and taking over, most of the cult members died. The people making the pilgrimage are family of the deceased cult members, except for one guy, who claims to be a brother of one of the women but isn't. Who is he? What is he doing there? What's his relationship with the old man in the hospital? Why does he burn the pier at the end of the movie? If anybody out there knows, I'd appreciate it if you wrote your explanation in this comments section. For everyone else, check out Koreeda's other movies-Mabarosi or Afterlife-but skip this one.",
         "This movie has things in common with a mystery, because its constructed sort of like a puzzle, where you figure out what is going on and what has led up to the current situation mostly through a series of terse and vivid flashbacks. A fair amount of your brain power will be engaged in that process. This structural mechanism is appropriate however for compression, and *is* done very well, in the sense that it cleverly anticipates your speculations, and it is interesting rather than overly difficult or trying. As other comments here indicate however, the ending will not necessarily resolve all your questions, and personally toward the end I felt a growing unease that this would be the case, which unfortunately it was. I personally don't think resolution has to be counter to realism or realistic impact or whatever, that viewers going away satisfied isn't a compromise, necessarily. From the title, and from the introducing-characters period of the movie, I took the movie to be about alienation. Nobody really connects. Nobody is ever really talking about the same thing, nobody establishes rapport -- its all social awkwardness. It has that painful quality to watch which is simultaneously interesting and makes you wince. Of course as it develops your perception of social disconnection moves from awkwardness to alienation to family breakup to of course mass murder and suicide. So the whole thing starts to get to you that way, building slowly, the horror of everyday life you can't not look at thing. Some people called it slow, I didn't find that, it kept my attention. My contribution to explaining the mystery character is that there is no explanation, that this just completes the sense of alienation the film is trying to inspire.",
         "Don't look here for answers to 9/11 or the Aum incident. Best tries for that would be read Haruki Murakami's \"Underground\" (Vintage International 2001) or see Shinji Aoyama's \"Eureka.\" \"Distance\" has two significant sets. First is a dirt road through a skyless (camera doesn't look up) forest. A group connected in various ways with former Aum members, come to honor the tragedy but stranded by a car breakdown, take forever deciding whether to walk backward or forward. Suspense builds, a little like that around the host and guests unable to leave in Buñuel's \"Exterminating Angel.\" The sole Aum vet among them (he got out before the serin) offers a third option, essentially go sideways (almost as if Buñuel's crowd had decided to walk out toward the camera or away from it through a wall), leading to the second significant set, a not quite barracks-like abandoned Aum building. Discussion there, centering on the building's dispersed inhabitants, reminds of the Aum member interviews in the second half of \"Underground.\" The ending's ambiguous, so ambiguous that four months later, I can't remember it other than in images. What I do recall is Director Kore-eda speaking after my screening. Though he'd been forthcoming throughout the rest of the Q and A, when two or three people challenged the ending he began excusing and apologizing, seeming to second-guess his edits. I'm not sure he should have apologized. Strictly in images, the film has a beginning, center, and end: the road in; the bright (even at night electrically and the bridge and lake that figure in one of the tales are more brightness) heart of darkness; the road out. Last thing I remember, though I'm not sure it was right at the end, is a bright, franchise-looking shop, one of the group running in to get something."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "CineRocket",
         "Distance Project Team",
         "Engine Film"
      ],
      "summaries": ["Members of a cult, modeled on Aum Shinrikyo, sabotage a city's water supply, then commit mass suicide near the shores of a lake. Family members of the perpetrators meet at the lake to observe the anniversary of their loved ones' deaths."],
      "budget": 0
   },
   "movielensId": 83583,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2001-05-26",
      "dvdReleaseDate": null,
      "directors": ["Hirokazu Koreeda"],
      "runtime": 132,
      "movieId": 83583,
      "title": "Distance",
      "mpaa": "",
      "actors": [
         "Arata Iura",
         "Yusuke Iseya",
         "Susumu Terajima",
         "Yui Natsukawa",
         "Tadanobu Asano",
         "Azusa Takehana",
         "Ken'ichi Endô",
         "Seminosuke Murasugi",
         "Baijaku Nakamura",
         "Ryō",
         "Kanji Tsuda",
         "Yorie Yamashita",
         "Ikuji Nakamura"
      ],
      "imdbMovieId": "0278413",
      "originalTitle": "Distance",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Four people make an annual pilgrimage to a spot in the mountains where a cult group lived. Three years previously, the cult had put a genetically engineered virus in the water supply. The idea apparently was to kill off everyone in Japan and then repopulate it with cult members. The virus killed a few people and poisoned thousands, but instead of living and taking over, most of the cult members died.",
      "tmdbMovieId": 25051,
      "avgRating": 3,
      "releaseYear": "2001",
      "numRatings": 11,
      "posterPath": "/fJoOwsJqsGJLOLhWd9Vn1jgYGJY.jpg"
   }
}