{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "eroticism",
            "id": 1664
         }
      ],
      "imdb_id": "tt1314652",
      "video": false,
      "title": "The Housemaid",
      "recommendations": [
         87295,
         103750,
         72442,
         108972,
         10355,
         29972,
         122611,
         413745,
         126432,
         107540,
         133983,
         39021,
         25658,
         18422,
         89501,
         121795,
         293476,
         133601,
         133603,
         98631
      ],
      "backdrop_path": "/uEqHsBP3LgyXuQH6cHoQiW7uFyV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Eun-yi",
               "gender": 1,
               "credit_id": "52fe46b4c3a36847f810dac3",
               "name": "Jeon Do-yeon",
               "profile_path": "/mCXpVsHZq1UMxm1S7dgtsnZsCuq.jpg",
               "id": 20737,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Hoon",
               "gender": 2,
               "credit_id": "52fe46b4c3a36847f810dac7",
               "name": "Lee Jung-jae",
               "profile_path": "/8CbYAYNVa8nZhCrbXGEihAnMGd9.jpg",
               "id": 73249,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Hae-ra",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810dacb",
               "name": "Seo Woo",
               "profile_path": "/qKAM0TTv7xoxlUkZX8J2cHEMbMR.jpg",
               "id": 115291,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Byeong-sik",
               "gender": 1,
               "credit_id": "5319c4e892514177ab0026d2",
               "name": "Youn Yuh-jung",
               "profile_path": "/dkK7xEsBwRYWiSZXikgOEy7oAc4.jpg",
               "id": 1080935,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Hae-ra's Mother",
               "gender": 1,
               "credit_id": "57c9b8079251415e9f001e8c",
               "name": "Park Ji-young",
               "profile_path": "/wrXitjj4YZlUdgqOXXbnqhHKxnw.jpg",
               "id": 1673497,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Nami",
               "gender": 1,
               "credit_id": "560d788cc3a368680b009b63",
               "name": "Ahn Seo-hyun",
               "profile_path": "/6clumbtJbR8cOEakvsJ3tyExGj7.jpg",
               "id": 1304602,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Eun-yi's Friend",
               "gender": 1,
               "credit_id": "59c1995a9251412beb003385",
               "name": "Hwang Jeong-min",
               "profile_path": "/eKD0YL9E72a3JCECIL9ipVTTQvw.jpg",
               "id": 1891352,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Obstetrician",
               "gender": 1,
               "credit_id": "57e0f1149251410455004630",
               "name": "Moon So-ri",
               "profile_path": "/7ZM0ClQnS3A4kyhaInI8fvTCKJJ.jpg",
               "id": 83122,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "57e0f123c3a3685402004726",
               "name": "Jin-ah Kim",
               "profile_path": null,
               "id": 231509,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Herbal Medicine Shop Doctor",
               "gender": 0,
               "credit_id": "57e0f131c3a368540200472d",
               "name": "Tae-back Chae",
               "profile_path": null,
               "id": 1682484,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Chief Secretary",
               "gender": 0,
               "credit_id": "57e0f13fc3a36853eb00463a",
               "name": "Jeon Sin Hwan",
               "profile_path": null,
               "id": 1274619,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Driver",
               "gender": 0,
               "credit_id": "57e0f1509251410457004399",
               "name": "Sang-min Noh",
               "profile_path": null,
               "id": 1682485,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Security",
               "gender": 0,
               "credit_id": "57e0f15ec3a36853eb00464a",
               "name": "Soon-kyu Jang",
               "profile_path": null,
               "id": 1682486,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Security 2",
               "gender": 0,
               "credit_id": "57e0f16c9251410455004663",
               "name": "Yong-jae Cho",
               "profile_path": null,
               "id": 1682487,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Yoga Instructor",
               "gender": 0,
               "credit_id": "57e0f17992514104570043b1",
               "name": "Lim Hyun-Kyung",
               "profile_path": "/tVEoNnAvqz845jzyDES17t2EQLX.jpg",
               "id": 1334550,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b4c3a36847f810dabf",
               "name": "Im Sang-soo",
               "profile_path": "/w60YCJsIUY2qSwAOAFXvCCvxHND.jpg",
               "id": 132452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810dad9",
               "name": "Im Sang-soo",
               "profile_path": "/w60YCJsIUY2qSwAOAFXvCCvxHND.jpg",
               "id": 132452,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b5c3a36847f810dadf",
               "name": "Kim Ki-young",
               "profile_path": null,
               "id": 1043312,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.719305,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 45202,
      "vote_count": 80,
      "budget": 4000000,
      "overview": "A man's affair with his family's housemaid leads to a dark consequences. Eun-yi is hired as an au pair for Hae-ra (pregnant with twins) and her rich husband Hoon. Eun-yi's primary task is watching the couple's young daughter, Nami. Eun-yi is eager to connect to Nami, who gradually warms to her. Hoon begins to secretly flirt with Eun-yi, enticing her with glasses of wine and his piano playing, and they eventually begin a sexual relationship. Despite the affair, Eun-yi is still warm and friendly to Hoon's oblivious wife, Hae-ra. She even expresses enthusiasm and delight at the progress of Hae-ra's pregnancy.",
      "similar": [
         27066,
         4507,
         28468,
         37265,
         283227,
         1259,
         36630,
         884,
         2149,
         402,
         263472,
         843,
         1440,
         35685,
         14174,
         109729,
         638,
         796,
         22705,
         10998
      ],
      "original_title": "하녀",
      "runtime": 106,
      "poster_path": "/fBpYdZmVFoaYSht0umAea5cXAWU.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sidus",
            "id": 3657,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sidus FNH-Benex Cinema Fund 1",
            "id": 81593,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Michigan Venture Capital",
            "id": 81594,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CJ Venture Investment",
            "id": 9102,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stareast Digital Laboratory",
            "id": 81595,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hanwha Entertainment Fund No. 1",
            "id": 81596,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mirovision",
            "id": 5748,
            "origin_country": ""
         }
      ],
      "release_date": "2010-05-13",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "When Opportunity Knocks, Answer at Your Own Risk",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sang-soo Im"],
      "runtime": 106,
      "synopsis": "Eun-yi, a middle-aged divorcee, is hired as an upper class family housemaid. But soon enough, master of the house Hoon takes advantage of his social position by slipping into her sheets. Hoon's visits become frequent and Byung-sik, an old housemaid, reports the affair to Hae-ra's mother, Mi-hee, who plots to give Hae-ra the control over her husband. Soon Eun-yi miraculously becomes pregnant and wants to keep the baby. This is discovered by the family and she's forced to have an abortion by Mi-hee despite Eun-yi's plea to let her keep the baby and leave the house. Mi-hee's plot backfires when Hoon scrutinizes her for terminating his child, even if that child is conceived illegitimately. Her forced abortion turns Eun-yi's mental condition for the worst and she decides to take the matter into her own hands.",
      "writers": [
         "Ki-young Kim",
         "Sang-soo Im"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt1314652/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NzY2Njk3NF5BMl5BanBnXkFtZTcwNzM0MDMzNA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Do-yeon Jeon, Jung-jae Lee, Yeo-jeong Yoon | See full cast and crew »"],
      "reviews": [
         "The buzz on this film is ringing out loud. A remake of the original film by Kim Ki-young, widely considered one of the top Korean films of all time, this updated version by Im Sang- soo is a lot more revealing and explicit in nature for the modern audience probably sensitized to it, being one of the films selected for competition at this year's Cannes Film Festival, and its two limited screenings during our Korean Film Festival were one of the earliest to have sold out. Needless to say it makes good sense for a commercial release here. The premise is simple, where Eun-yi (Jeon Do-yeon) got invited by Byung-sik (Yun Yeo-Jong) to serve in an uber-rich household made up of three members - the master of the house Hoon (Lee Jung-jae), his very pregnant wife Haera (Seo Woo) expecting a pair of twins due anytime soon and hence the need for an extra help around the house, and their daughter Nami (Ahn Seo-hyeon) with whom Eun-yi forms a strong friendship with, since a child is non-judgemental on someone's background and social standing. As much as most would like Eun-yi, a divorcée, to enter the household and see an opportunity to seduce Hoon, this is not that movie, and neither was that the motivation at all. We see the fairly impoverished background that Eun-yi came from, and living amongst the rich and powerful provided a chance to live the high life, since the family is extremely wasteful. With Byung-sik showing her the ropes necessary to do her job, from the bowing to the serving, the cleaning and being at the beck and call of the household members, the hardship probably is well worth it for the perks that come with the job, ones that are beyond the reach of ordinary folks. So when things turn, you'll find yourself wondering the exact motivation she allowed herself to open up (pardon the pun) to the come hither of the master of the house, who has a penchant for alcohol and being brought up with a silver spoon, there's no such thing as a No to any of his request, although on the outside he may be that rich gentleman, it's not far- fetched to think that these folks would consider money as the basis for all things going their way, and money being the basis to bail themselves out of trouble, and to keep the mouth of others shut. Money as the root of all evil, probably couldn't be more true here if those with the means decide to abuse it, given the mindset of theirs that they can always get away from the blame game. But what's more engaging in the film is the power play amongst the characters, who are well, mostly female, fawning over the attention, the riches and the ability of what the man in their life can offer. There's Byung-sik being extremely envious with her protégé she introduced to the household, being the unjaded hard and younger worker who earns the trust of the family, and probably she had wanted to show the young upstart her place in the hierarchy established. And of course the main cusp of the problems Eun-yi will face stem from the child in her, threatening the balance of power especially that of mistresses and maid, with stuff that's what television melodramas get made of. To the audience, we don't feel that Eun- yi is of the scheming type, but to the other women, here's a chance of their objectives being detailed by something most unfortunate, a major threat that can come sooner or later in their lives that they have to act, and stop now. Jeon Do-yeon deserves all the acting accolades she has received thus far for her role, and we feel the pain she has to go through in having traumatic experiences forced upon her just because she's in no position to bargain, until the defining moment in the finale where she gains the upper hand but at what a price at scarring the family for life. I haven't seen Lee Jung-jae in action since Il Mare, and here he does an about turn in a negative role that portrays the caddish behaviour of someone who has it all, while the young Seo Woo portrays the wife that's quite reasonable to begin with, that typical tai-tai but with innocence, until hell hath no fury like a woman scorned. It is the power struggles and the changing of the household dynamics that makes The Housemaid an engaging watch as we witness an internal rot that was waiting to happen. While it may not reach the heights of Kim Ki-young's original, Im Sang-soo's version still keeps things tight and is a wonderful exploration of how perceived threats redefines relationships especially that amongst those with material benefits. Recommended!",
         "This movie is a remake from a film of the same name released back in 1960 but both movies are quite different and don't have the same story line. In the original feature, the housemaid seduces a composer and menaces his family until a bloody ending. In the new version, the sexually predatory femme fatale has become a poor and naive girl that gets seduced by an arrogant, cold and pitiless rich man. When she gets pregnant, the host family wants to get rid of her. But neither several attempts on her life nor money can't convince the young woman that wants to keep her child. She even ignores good advices from several friends and colleagues and decides not to quit the powerful family. When abuse, hatred and pressure reach their highest point, the young woman seeks for justice and has to fight not only a very influent and wealthy family but also her inner demons. The strong points of the movie are definitely the portrait of the clash between rich and poor in modern South Korea and the quite credible acting. I also liked the movie for its artistic approaches. The opening scene shows a scene in the middle of a big city and portrays the everyday life in South Korea before a young and unknown woman commits suicide. Her story remains untold but the idea of showing a lost soul within a big and vivid crowd is an interesting symbol for the main story of this feature. It's the same thing with the final scene of the movie that works like a picture. It portrays a very superficial family portrait where frustration, resignation and sadness is covered by tasty champaign, luxurious decorations and expensive gifts. This last image resumes the entire movie in a short and visual way. It was a good idea to keep those scenes as they add something special to the feature. Even though the acting in this movie is done rather well, I couldn't get any connection to any of the portrayed characters. While this kept me away from entirely enjoying the feature, I now think that this was the intention of the movie maker. Everybody does some big mistakes in this movie and shows his or her negative sides. Of course, some characters are worse than others but in the end they all ran blindly into tragedy. The problem I have with the movie is that there are many lengths. It is all quite slow paced and also very predictable. The movie has some dramatic and melodramatic scenes but it lacks of true suspense. Some critics called this movie a flamingly sexy soap opera but I definitely can't agree on that. I actually think that this film is misunderstood by many Western critics. The sex scenes are cold and at some points even disgusting. I think that the director wanted to show us that even in normally exciting and positive moments, the characters are brutal and emotionless. This fits well to the rest of this coherent and quite detailed movie but none of the characters has any kind of sex appeal. Another point I have mixed feelings about is the main character of the housemaid. Even the actress said in an interview that she still doesn't quite now who she portrayed. This mysterious image is intriguing first but gets quite frustrating in the end. Some actions of the housemaid are not only naive but are simply not logical at all. Especially the final scenes felt like a letdown in my humble opinion. The ending is definitely the only truly surprising element of the movie and gets therefor some credit from me but it somehow feels hardly credible. I would even call the ending unreal and didn't quite enjoy it. In the ending, this movie is hard to sit through. It has many lengths, lacks of true emotions and has a weird disappointing ending. On the other side, it's an interesting portray of modern society in South Korea and convinces with many artistic elements. The movie feels like its characters as it is sophisticated but somewhat lacks of depth. Anybody who's looking for a sexy thriller or a twisted crime flick will be quickly disappointed. This movie is for those who look for an artistic drama only. I recognize the good intentions and efforts made by the makers of this movie but I didn't like it enough to truly recommend it or watch it again in the end.",
         "One evening in a busy city center, a restaurant worker, Eun-yi, witnesses a young woman preparing to throw herself from the upper floor of an apartment block, and the incident leads her to change her way of life. She takes the position of housemaid to a wealthy tycoon, who lives in a luxurious residence with his beautiful pregnant wife, their precocious young daughter and a strict housekeeper. Eun-yi likes the job, but it's soon apparent she and her handsome employer are attracted to one another - and one night he shows up in her room, offers her wine and commands her to pleasure him orally. Later he adds a bonus to her salary, and Eun-yi is not displeased when he returns on a subsequent night to have sex with her. Unfortunately the housekeeper observes them and informs her boss's wife - whereupon the wheels of intrigue are set in motion with a vengeance. The luminous De-yeon Jeon portrays Eun-yi as a character full of interesting contradictions in an assured, sensitive performance, and the first half of 'The Housemaid' is filmed in a sumptuous style of Korean noir that provides a fine showcase for her acting skills. Each scene is beautifully composed and shot at a measured pace - but as the conspiracies and chicanery accumulate in the second half, the film transforms into Gothic melodrama - until the final moments when it descends into the lurid Grand Guignol of Asia Extreme. It's a disappointing conclusion to a story that had promised far greater substance and sophistication.",
         "In this remake of a popular 1960 Korean film of the same name, Jeon Do-Yeon plays the titular character, Eun-yi, who is hired as an upper class family housemaid, tasked to take care of the family's small daughter and her pregnant mother, Hae-ra (Seo Woo). Overseeing her efforts is Byung-sik (Yun Yeo-jung), an older housemaid who has been with the family for a long time and holds many secrets. Hoon (Lee Jung Jae), the master of the house, takes advantage of his social position and begins a secret affair with Eun-yi. Once it is discovered Eun-yi may be pregnant, Mi-hee, Hae-ra's mother, plots a way to get rid of Eun-yi's unborn baby despite Eun-yi's wish to keep it and leave the house. While the original film was a suspense thriller, this one isn't quite as easy to pinpoint. While there are aspects of an erotic thriller, this film is partly a character study and a satire about class struggle. The film starts off with a random suicide as a girl jumps off a roof onto the busy street. This event isn't really related to the main plot, unfortunately (which I admit would have been more interesting to follow up on). The scene portrays a cold, apathetic society as kids pull out their cell-phones to take a picture. Thus, the film starts off with a bit of a dark, off-kilter, cynical feel. One of director Im Sang-soo's previous films, The President's Last Bang, was a satire focusing on the assassination of the dictatorial Korean president Park Chung Hee. While this film isn't particularly comedic as that film, it has elements which seem heavy-handed and too outrageous to take seriously. As a thriller, it isn't very convincing. One of the obvious problems is the portrayal of Eun-yi, who is shown here as sympathetic, naïve, and more of a victim, the opposite of the original. Unlike the rich folks, who eventually take advantage of her, she is likable and kind. Jeon Do-Yeon does well with the role that is written for her. As good and fine as she is in almost every role she plays, it truly would have been something special to see her play a really mean, nasty character�there is no doubt it would have been a wonderful departure and a suitable challenge for this talented actress. Then again, I suppose it's like asking Natalie Portman to play Annie Wilkes from Misery. It's just unimaginable. Would it have been cool to see? Of course. The real villain role is given to Hae-ra's mother, Mi-hee. She plays the all-too-familiar \"evil stepmother\" role that appears to frequent Korean TV dramas as of late. Yun Yeo-jung is memorable as the older housemaid, Byung-sik, who remains constantly interesting and complex. Lee Jung Jae plays the rich master role with aplomb and brings subtlety to what is relatively a simplified and underused character. Advertisement The film has some great visuals, particularly the interiors of the mansion, full of deep reds and whites. The camera work is hand-held and rougher near the beginning, particularly in the street scenes, and becomes more static and calculated as the film focuses more on the rich family. The film is sexually-charged and the seedy nature of the relationship between Eun-yi and Hoon, along with their motives, is never quite explained. The story is overly simple, I felt, and I expected more twists, more believable characterization, more thrills, or something. The problem with satire is that it often pulls the audience away from fully engaging with the story or the characters, an issue that doesn't particularly work in a thriller. Perhaps it might have been better if this had not been a remake. I would guess that the fear of comparison with the original could bring a director to go the complete opposite direction in the newer film or try to turn what may be a simple story into high art (and appear intelligent). I just wish they'd just make it better by changing the name, the plot, and�well, simply being a whole new film. I suppose on the positive side, a remake does introduce a new generation of audiences to check out the original. In this particular case, I'd love to see the original just to see how much better it is than this film.",
         "For once a remake that's not a blueprint of a classic movie with its integrity taken from it to cash away on its acclaim. This I watched the following day from watching the 1960 one, a bit sceptical I must admit. That turned out to be unwarranted as this adaptation is more inspired by than copying the original. What we get here is a uncharming view of the nouveau riche and the naive housemaid picking up what is thrown to her. The direction is amazing, location is stunning, sultry sex-scenes abound, clever plot and a breathtaking ending is some of the things this movie will reward you with. All main actors/actresses fit their role perfectly.",
         "Beware. Spoilers ahead. Kim Ki-young's The Housemaid (1960) shocked audiences half a century ago for its bold, disturbing look at lust, greed, and revenge. It centered on a family whose husband was seduced by a maid he had hired to help with housework. The devious maid wielded sexual control over the husband, ill-treated his materialistic pregnant wife, and their two children � a crippled daughter, and a mischievous boy, causing despair and anguish to everyone. The film then spiraled into unimaginable depths that explored the worst of human nature, climaxing with an ending that was as shocking as it could get. Im Sang-soo, the director of the remake, takes Kim's material and gives it a modern reworking. The result is very disappointing, considering that it is based on a source material. The story and characters are generally quite poorly developed. This is because the characters now take on reverse personalities: The husband now seduces the maid, who reciprocates the action by complying with his sexual needs. Furthermore, the maid is portrayed as innocent while the wife's malleable character is easily taken advantage of by others. The couple also has a daughter without any kind of disability. All these changes point to some very serious flaws in the film � the near absence of sexual tension, shallow character development, and the surprisingly lackluster storytelling that grinds along laboriously. Worse, every scenario seems to occur conveniently so as to push the narrative along, rather than as a result of genuine expression of character motivation. In the original, the piano took on an added significance, that of a tool for seduction, but in Im's film, it is merely a prop. The filmmakers have also taken the misstep of shooting the film in a setting of luxury. The characters are very rich, snobbish, and lead extravagant lives. They can force people to do what they want, and solve problems with money. Therefore, there is no real danger that their lives would turn for the worse. This is in direct contrast with Kim's film, whose work had a deep, consistent feeling of dread, which is translated visually by depictions of the maid's diabolical intentions. The stinging social commentary about men's infidelity does not surface here. Is it because times have changed? If anything, Im's The Housemaid promotes male chauvinism, and in an indirect way, female victimization. Before the cringe-worthy final sequence that \"reeks\" of Park Chan-wook-style surrealness, there is a disturbing scene of the maid hanging herself and then burning to death in front of the terrified family. Her motivation to commit suicide is not fleshed out very meaningfully, leaving the film to end in a whimper. Emotionally shallow and vacant, The Housemaid's saving grace is its quite admirable camera-work that moves in a slow, deliberate style. How did this film even get into Cannes? It is a question only the jury could answer. My advice is to skip this and watch the original. You will be greatly rewarded for doing so. SCORE: 5/10 (www.filmnomenon.blogspot.com) All rights reserved!",
         "A South Korean soap opera, The Housemaid is a combination of Fatal Attraction, In the Mood for Love, and myriad other adultery thrillers. Its sensual sheen and quiet sexuality underpin a grim war between servants and the ruling class with no one winning. Adapted from an earlier Korean version by director Sang-soo Im, it tells of naïve Eun-yi (Jeon Do-yuon) being hired as a maid in a wealthy household, whose head, Hoon (Jung-Jae-Lee), takes her as a love interest while his pregnant wife comes to term and the other ladies gradually find out that Eun-yi is pregnant as well. While the house is meticulously modern and opulent, an undercurrent of evil runs through it as if it were a Poe tale. Although at times Housemaid moves slowly, especially in the mid section, no audience could be indifferent to the haughty treatment of the servants by the rich, who treat them as you might think Thomas Jefferson treated his own slaves, with decorum but decidedly selfish and cruel. Eun-yi is not totally innocent, for she enjoys the master's attention, and Hoon can be partially forgiven because of the harpies like his wife and mother-in-law, who treat him like a child, or in the case of his wife, ignore his sexual needs except to create children. That he plays a mean classical piano and drinks wine like an aristocrat used to the fineness of wealth, Hoon is partially an animal of the lowest order, giving in to his appetites protected by his wealth and his ladies. The final moments are the payoff as most everyone in not spared humiliation or violence. Although the connection between the opening and closing is a bit too much of a figurative and literal connection, The Housemaid holds up admirably as Gothic horror in a modern Asian setting replaying the themes of class conflict and revenge.",
         "On the surface this is a remake of the 1960 Korean classic with the same title. The simple plot remains the same: a housemaid cum nanny hired into a rich family in anticipation of a second childbirth becomes sexually involved with the master and gets herself pregnant. The protagonist's character, however, has been completely reversed. In the original, the protagonist Eun-yi was a scheming villain that purportedly caused the audience to scream \"Kill the bitch\". In this updated (cell phone included) version, she is somewhat of an enigma but with one distinct, clear attribute � complete incapability of any malice. The slow-burn drama happens almost entirely in the plush mansion � a jaw-dropping set design in its own right. The simple ensemble of support characters comprises the superficially charming and talented master, his young, pretty and pregnant (with twins) wife, their innocent pre-teen daughter, the typical sultry matron-type housekeeper and, later, his young-looking mother-in-law who arrives on the scene to \"protect\" her pregnant daughter. The story unfolds slowly, minimalistic and almost uneventful: master's \"taking\" of Eun-yi, discovery of the pregnancy, the three women ganging up on her, master's unconcerned, callous reaction and the dramatic, climatic finale that is stunning more in the sense of being farcical than being nerve-shattering. So what is the point? The fascination of this movie rests with Cannes Best Actress Jeon Do-yeon's portrayal of the protagonist that takes the word enigmatic beyond its usual definition. As I mentioned, this character seems almost entirely incapable of malice. While there are examples aplenty throughout the movie, one of the best is when she is repeatedly slapped, with the three women surrounding her. She seems devoid of the normal reaction of anger (a natural reflex even if one acknowledges being in the wrong) but simply enquires why. Although she is not exactly carnal Snow White (being a divorcée), the sexual liaison is initiated entirely by the master. Most intriguing is her facial expression during the first of such encountera when master starts to fondle her body. At times, Eun-yi displayed such a childlike simplicity that she almost looks like a simpleton and then there seems to be a part of her mental working that one cannot fathom. I have posted over 800 IMDb user reviews and watched a lot more but I have never come across a character quite like this one. Other things critics have pointed out is the anti-rich subtext (quite a savage attack on the contemptible rich), or an exercise in Hitchcock style. But by far the focus is on Jeon Do-yeon.",
         "Lim Sang-Soo's \"The House Maid\" is why we have cinema. Lim Sang- Soo masterfully retells Kim Ki's original tale (1960) with imaginative alterations capturing a striking balance between eastern and western cultures. It is the sort of film, a thriller that excites the audience to no end. Lim Sang-soo has already acquired significant commercial and artistic notoriety for his movies \"Girls' Night Out\", \"Tears\", \"A Good Lawyers Wife\", \"The Presidents Last Ban\" that expertly critique Korean society. He uses his movies to explore the political and sexual tensions and repressions built into Korean Society. He is renowned for his remarkable ability to bring a richly textured and multi-layered story to the screen. Lim Sang-soo's film is indulgent in a plethora of tastes that can be summarized by two scenes. The older housemaid Haera (Seo Woo); swirling, sniffing, and drinking her wine roughly, professionally and for the purpose of being drunk. In perfect contrast is Hoon (Lee Jung-jae) the young renaissance man, head of his household, artfully, ceremoniously twirling his wine glass. Not a drop is spilled between the two. Hoon is a wealthy, accomplished and powerful man with tremendous confidence and precision in everything he does. He is used to getting his way. Eun-yi (Jeon Do-youn, Cannes winner Secret Sunshine), is a somewhat pure yet damaged working class maid from a much lower social status than Hoon who initially seems to be an easy conquest. Such is not to be the case. Lim Soo-sang is a creative genius behind the camera putting his unique stamp on the film. The film leaves no scene blemished. A clever, sensuous and sensual tale is spun that is a delight to watch. A beautiful love story blossoms and we find ourselves beginning to anticipate a sour turn. Heads up and thumbs up. Engrossing to the bitter end. -Ottaviano Romano",
         "This reminded me of Ki-duk Kim films and the visual style of Park Chan-wook films. It's basically a remake of the 1960's movie, that basically has to do with the downfall of a housemaid from working in some rich guy's house. Although the 2010 version differs from the original in many aspects, but that doesn't necessarily mean a bad thing because it has it's own style to hold it's own. Jeon Do-Yeon plays a sweethearted and kind housemaid that grew up in a harsh environment and tries to make a living by becoming a housemaid. Her performance was amazing and Seo Woo did a decent job of playing the spoiled brat as always. And later gets tormented by the wife and the wife's mother of the house, in a very vicious manner. In fact the whole family is crazy except the daughter. This is a dark movie with a handful of sex scenes and graphic parts. There are few foreshadowing in this, but the end irritated me, because karma does not come into play. But it just shows the dark side to reality. 7.9/10"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Sidus FNH-Benex Cinema Fund 1",
         "Michigan Venture Capital",
         "CJ Venture Investment"
      ],
      "summaries": [
         "Eun-yi is a playful young woman, a good match for a job as nanny to a precocious child, Nami, the daughter of a wealthy couple, Hae-ra and Hoon. Hae-ra will soon have twins as well. The majordomo, Mrs. Cho, is the household's cold stone center. Before long, Hoon seduces Eun-yi, and when Mrs. Cho tells Hae-ra's mother about the affair, Eun-yi is up against women with wealth, power, and no conscience. Can Eun-yi maintain her dignity and perhaps even put the family in their place?",
         "Mrs. Cho, the majordomo for wealthy young couple Goh Hoon and Goh Hae-ra, dislikes her job. She treats it in a cold, straightforward fashion, while slyly tries to take whatever advantage she can out of the Goh's lavish lifestyle. Because Hae-ra is pregnant with twins - which would be the Goh's second and third children - Mrs. Goh is tasked with hiring a housemaid whose duties largely would be to take care of the Goh's young daughter, Nami, help Hae-ra with the pregnancy, take care of the twins when born, and cook and serve meals. Mrs. Goh hires Lee Eun-yi, a young woman who works at a street food stall. After being ensconced in the job and the household, Eun-yi, who likes the job, succumbs to Hoon's sexual advances, the two who begin an affair directed solely by Hoon, and which results in Eun-yi getting pregnant. All the adult women of the house - Hae-ra, Hae-ra's mother, and Mrs. Goh - end up finding about the affair and the pregnancy. Each of the three has a slightly different reaction to the news, and what they believe they need to do to restore what was the on the surface family harmony. In turn, Hoon and more importantly Eun-yi, have their own responses to what is happening in the house.",
         "A man's affair with his family's housemaid leads to a dark consequences."
      ],
      "budget": 0
   },
   "movielensId": 84137,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2010-05-13",
      "dvdReleaseDate": "2011-06-07",
      "directors": ["Im Sang-soo"],
      "runtime": 106,
      "movieId": 84137,
      "title": "The Housemaid",
      "mpaa": null,
      "actors": [
         "Jeon Do-yeon",
         "Lee Jung-jae",
         "Seo Woo",
         "Youn Yuh-jung",
         "Park Ji-young",
         "Ahn Seo-hyun ",
         "Hwang Jeong-min",
         "Moon So-ri",
         "Jin-ah Kim",
         "Tae-back Chae",
         "Jeon Sin Hwan",
         "Sang-min Noh",
         "Soon-kyu Jang",
         "Yong-jae Cho",
         "Lim Hyun-Kyung"
      ],
      "imdbMovieId": "1314652",
      "originalTitle": "하녀",
      "genres": [
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": ["r62pj3gRc9k"],
      "plotSummary": "A man's affair with his family's housemaid leads to a dark consequences. Eun-yi is hired as an au pair for Hae-ra (pregnant with twins) and her rich husband Hoon. Eun-yi's primary task is watching the couple's young daughter, Nami. Eun-yi is eager to connect to Nami, who gradually warms to her. Hoon begins to secretly flirt with Eun-yi, enticing her with glasses of wine and his piano playing, and they eventually begin a sexual relationship. Despite the affair, Eun-yi is still warm and friendly to Hoon's oblivious wife, Hae-ra. She even expresses enthusiasm and delight at the progress of Hae-ra's pregnancy.",
      "tmdbMovieId": 45202,
      "avgRating": 3.31481,
      "releaseYear": "2010",
      "numRatings": 54,
      "posterPath": "/fBpYdZmVFoaYSht0umAea5cXAWU.jpg"
   }
}