{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt1098199",
      "video": false,
      "title": "Corto Maltese: The Ballad of the Salt Sea",
      "recommendations": [
         43071,
         60290,
         60291,
         60221,
         61018,
         60805,
         21174,
         76190,
         80861,
         32873,
         38954,
         80857,
         70927,
         14088
      ],
      "backdrop_path": "/rlOcI7OCVAYCtffjaa33W7RN04h.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Corto Maltese (voice)",
               "gender": 2,
               "credit_id": "52fe461cc3a368484e07f425",
               "name": "Richard Berry",
               "profile_path": "/5StfjUYCE89Jpi4qjALDguXl3CQ.jpg",
               "id": 35896,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Raspoutine (voice)",
               "gender": 2,
               "credit_id": "52fe461cc3a368484e07f429",
               "name": "Patrick Bouchitey",
               "profile_path": "/eKW0Wr6Elo4Bm8grOz35CO7I1pa.jpg",
               "id": 35911,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Pandora (voice)",
               "gender": 1,
               "credit_id": "52fe461cc3a368484e07f42d",
               "name": "Barbara Schulz",
               "profile_path": "/7MjKdkEkouRBYUzsr5aVG1idrMG.jpg",
               "id": 81786,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe461cc3a368484e07f433",
               "name": "Richard Danto",
               "profile_path": null,
               "id": 230853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe461cc3a368484e07f439",
               "name": "Liam Saury",
               "profile_path": null,
               "id": 230854,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe461cc3a368484e07f43f",
               "name": "Hugo Pratt",
               "profile_path": null,
               "id": 101144,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe461cc3a368484e07f445",
               "name": "Jean Pécheux",
               "profile_path": null,
               "id": 230855,
               "department": "Writing",
               "job": "Scenario Writer"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 0.431779,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 60213,
      "vote_count": 12,
      "budget": 0,
      "overview": "In 1913, laconic sea captain Corto Maltese, adrift in the Pacific, gets rescued by his bandit friend Rasputin who's taking two rich shipwrecked teens to an island where his boss the Monk will hold them for ransom. WWI complicates things.",
      "similar": [],
      "original_title": "Corto Maltese: Una ballata del mare salato",
      "runtime": 90,
      "poster_path": "/gYZp1Lfuvrj86ssNSPx3x61CfhA.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
         "name": "StudioCanal",
         "id": 694,
         "origin_country": "FR"
      }],
      "release_date": "2003-01-01",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/luyYXzd2pfeC34kFkCdwKHN3DCQ.jpg",
         "name": "Corto Maltese",
         "id": 266846,
         "poster_path": "/tYxPyLfKHMxlLJEotSg2wyHAUKN.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Richard Danto",
         "Liam Saury"
      ],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Hugo Pratt",
         "Jean Pécheux"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1098199/",
      "coverLink": null,
      "actors": ["Stars: Jacques Bouanich, Marc Chapiteau, David Le Rheun | See full cast and crew »"],
      "reviews": ["Circa 2002, several French and Italian production companies and TV channels joined forces to create an animated series of shorts and features based on the adventures of popular Italian comic book character Corto Maltese, a laconic adventurer and former sea captain who in 1910s and 1920s travels Europe and its colonies, as well as the rest of the world, and witnesses first hand the many horrors and atrocities that the brutal bloody history of the early 20th century had to offer, from World War I to various civil wars, communist revolutions and other rebellions. This is why the comic book was (and still is) very popular in Europe, but is virtually unknown in the US. His stories usually have a basic formula - Corto is hired, convinced or has reasons of his own to go to a certain exotic location where treasure, people or mystery await, but gets caught up in local infighting on the way there and becomes a witness to history. With the help from the people he meets along the way, he eventually reaches his goal, only to discover that the trip was more interesting than the destination. The spirit of this formula is kept in this story, but the structure is stagnant (there are very few locations) and the story is holding back (even turning into a daytime soap for a moment). Corto himself is a nice, trustworthy, tall, thin, slick, charming man with a very sentimental and laconic view of life, who easily makes friends and can handle himself in most fights, although on occasion he does act brash and bites off more than he can chew. Corto has no problems with violence or killing when deemed necessary, but he is disturbed by death and pain of the innocents. He often tries to help those oppressed or in need he meets on his journeys, which often gets him into serious trouble. However, he never fights lost battles and has a distinctive sense of self-preservation, as well as lots of acquaintances and luck. The ladies are often attracted to his charm, attitude and willingness to take action, but also to his slight naiveté that sometimes they and even some of his temporary allies try to take advantage of. However, Corto is no James Bond and while he often cares about his female companions in a platonic way, he rarely beds the girl, unless he's actually interested in her. He builds a friendly relationship with the girl here as well, but since she's a teen, thankfully it remains sentimental and not romantic or sexual. One could call him the European Indiana Jones, although Corto, as a fan of poetry and art, has only superficial knowledge of archeology, kills somewhat more indiscriminatingly, often waxes poetic and his world is much more adult, dramatic and darker than Indy's with little to no magical, fantastical or sci-fi elements. Corto Maltese and The Ballad of the Salt Sea is chronologically Corto's first adventure set before all of his other animated adventures. However, this isn't really Corto's adventure. For the most part, he's just in the background trying to protect the two teen heirs of a rich Australian industrials, kidnapped by Rasputin, from said bandit and on occasion even themselves. The focus is much more on the kids themselves and their attempts to adapt to the situation and escape. There's also not much adventuring here, save for the escape attempts and Corto's attempts to protect them from the crazy Russian's bad temper. Most of Corto's adventures are like a cross between an old b&w Hollywood epic adventure combined with the sensibilities of a serious historian. Although Corto's feats may seem ridiculous at times, the locations he visits and the events he witnesses are presented in a highly atmospheric, quite brutal and often realistic way with a touch of comical, while the slow depressing intensity of the adventure never dissipates. The stylistic brooding conservative art design is quite atmospheric, very faithful to the comic and the animation looks less cheep than it is. You'd never guess the films were partly animated in North Korea (no joke). However, this film is closer to a slightly darker teen adventure than some brooding contemplation about the nature of the world or WWI. Not that they didn't try, but only traces of the true tense Corto experience remain. Murderous Rasputin is literally the only one who presents a real threat on the whole island, even though it's the hub of pirates. A common problem with Corto's franchise is pacing. Some less relevant moments will be covered in detail, while other more important ones will be simply brushed over. There's a whole secondary plot here about a German submarine officer that focuses on honor, duty and the beastly nature of war, but it has absolutely nothing to do with the main plot and this B plot remains underdeveloped throughout, even though in theory it's much more poignant than the A plot. Secondly, the tone is sometimes off, mostly because of Corto's friend Rasputin who sometimes serves as the comical relief in these adventures, but often acts completely amoral, and in the case of this movie - straight up evil, yet Corto always manages to make peace and remain friends with him which makes Corto, who's more or less a moral man, a complete hypocrite. Not to mention that at this stage of his life, Corto technically works with Rasputin for a gang of thieves and cutthroats led by the always masked \"Monk\". In the end, this is a passable Corto adventure, but it's not a good introduction to Corto, and should be seen only after you've seen his classic adventures like the ones in Siberia or Samarkand. The movie is available on DVD in Europe and has optional English subtitles, so folks from the US can import it. You can also get \"Corto Maltese - Collector's Edition\" that's in English and contains all of Corto's animated adventures."],
      "genres": [
         "Animation",
         "Adventure",
         "Crime",
         "Drama",
         "War"
      ],
      "productionCompanies": ["StudioCanal"],
      "summaries": [
         "In November of 1913, laconic sea captain Corto Maltese is left adrift in the middle of the Pacific. A boat captained by his traitorous bandit friend Rasputin who looks like an exact duplicate of the infamous historical figure, comes across him and rescues him. Corto finds that he's not the only one Rasputin rescued from the sea. Two shipwrecked teenage cousins, Pandora and Cain Groovesnore of the fictional rich industrial Australian Groovesnore family, are on board as well. Rasputin rescued them when their boat sank and is now holding them hostage for ransom. He is about to reach the island of Escondida, a fictional island located in the middle of the Pacific Ocean near the British Pitcairn Islands, that's not on any known map or nautical chart, where his crime boss, a secretive hooded figure known as \"the Monk\", resides. It turns out that the Monk apparently has some sort of history with the two young captives and he orders the highly unstable trigger-happy Rasputin to hold and protect the two. Corto befriends the kids and protects them from Rasputin. As WWI breaks out, the Monk and Rasputin's protection deal with the local corrupt German submarine officer attracts attention from the allied armies. On top of that, the nationalists among the island natives decide the time is right to unite the local islands, Corto falls of a cliff and is presumed dead, Rasputin becomes insubordinate and starts killing people and the kids try to escape with the help of a sympathetic native.",
         "In 1913, laconic sea captain Corto Maltese, adrift in the Pacific, gets rescued by his bandit friend Rasputin who's taking two rich shipwrecked teens to an island where his boss the Monk will hold them for ransom. WWI complicates things."
      ],
      "budget": 0
   },
   "movielensId": 84192,
   "movielens": {
      "languages": [
         "Français",
         "Español"
      ],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Richard Danto",
         "Liam Saury"
      ],
      "runtime": 90,
      "movieId": 84192,
      "title": "Corto Maltese: The Ballad of the Salt Sea",
      "mpaa": null,
      "actors": [
         "Richard Berry",
         "Patrick Bouchitey",
         "Barbara Schulz"
      ],
      "imdbMovieId": "1098199",
      "originalTitle": "Corto Maltese: Una ballata del mare salato",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1913, laconic sea captain Corto Maltese, adrift in the Pacific, gets rescued by his bandit friend Rasputin who's taking two rich shipwrecked teens to an island where his boss the Monk will hold them for ransom. WWI complicates things.",
      "tmdbMovieId": 60213,
      "avgRating": 3,
      "releaseYear": "2003",
      "numRatings": 5,
      "posterPath": "/gYZp1Lfuvrj86ssNSPx3x61CfhA.jpg"
   }
}