{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0184115",
      "video": false,
      "title": "The Little Thief",
      "recommendations": [],
      "backdrop_path": "/hcGYYKBUKSoWBCXKV1TKeErF0vT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Esse",
               "gender": 2,
               "credit_id": "52fe4b9dc3a36847f820c215",
               "name": "Nicolas Duvauchelle",
               "profile_path": "/6StoEPDKOHIqidJnWPDVOF8gmbr.jpg",
               "id": 81054,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "L'oeil",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c219",
               "name": "Jean-Jérôme Esposito",
               "profile_path": "/mSMumoLGw55Jxi4EV8DYbYSgLKh.jpg",
               "id": 1064454,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chacal",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c21d",
               "name": "Martial Bezot",
               "profile_path": null,
               "id": 1064455,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mathias",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c221",
               "name": "Jean-Arnaud Dalomba",
               "profile_path": null,
               "id": 1064456,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4b9dc3a36847f820c225",
               "name": "Jo Prestia",
               "profile_path": "/7ZF93XBMOF5Mr6F22YKGnzM4QMp.jpg",
               "id": 14610,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Leila",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c229",
               "name": "Ingrid Preynat",
               "profile_path": null,
               "id": 1064457,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tina",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c22d",
               "name": "Véronique Balme",
               "profile_path": "/8BzX78nSpZeoYhFatz54ggRufWv.jpg",
               "id": 21667,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Vampire",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c231",
               "name": "Olivier Gerby",
               "profile_path": null,
               "id": 1064458,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sandra",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c235",
               "name": "Emilie Lafarge",
               "profile_path": null,
               "id": 1063388,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Le chef boulanger",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c239",
               "name": "Dominique Abellard",
               "profile_path": null,
               "id": 1064459,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "L'employé de la boulangerie",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c23d",
               "name": "Gilbert Landreau",
               "profile_path": null,
               "id": 1064460,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Barruet",
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c283",
               "name": "Yann Trégouët",
               "profile_path": "/xag61GRROGkeRZhrfCzQmjg9zl5.jpg",
               "id": 72592,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c243",
               "name": "Gilles Sandoz",
               "profile_path": null,
               "id": 41792,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c25b",
               "name": "Pierre Milon",
               "profile_path": null,
               "id": 17393,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4b9dc3a36847f820c261",
               "name": "Catherine Pujol",
               "profile_path": null,
               "id": 1029516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c267",
               "name": "Jean-Robert Thomann",
               "profile_path": null,
               "id": 1064488,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c26d",
               "name": "Antoine Carrard",
               "profile_path": null,
               "id": 1064489,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c273",
               "name": "Cécile Bergès",
               "profile_path": null,
               "id": 1064490,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b9dc3a36847f820c27f",
               "name": "Erick Zonca",
               "profile_path": "/j7KH9JZDY7ExyKgEQoFWYSha1d1.jpg",
               "id": 19377,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57393c43925141496300042e",
               "name": "Virginie Wagon",
               "profile_path": "/oky9XPOE7xTgHyPmo6QwF5DYULm.jpg",
               "id": 19376,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57393c4b92514136560008b5",
               "name": "Erick Zonca",
               "profile_path": "/j7KH9JZDY7ExyKgEQoFWYSha1d1.jpg",
               "id": 19377,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57393c59c3a3681333000467",
               "name": "Pierre Chevalier",
               "profile_path": null,
               "id": 1620811,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "57393ca49251412341000cda",
               "name": "Jean-Jacques Ferran",
               "profile_path": null,
               "id": 32507,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "57393c6f92514136560008bc",
               "name": "Cristina Zonca",
               "profile_path": null,
               "id": 1620818,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57393c76c3a368316200000d",
               "name": "Cécile Bergés",
               "profile_path": null,
               "id": 1590618,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57393c7e9251417917002dd1",
               "name": "Laurence Grosjean",
               "profile_path": null,
               "id": 1620819,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57393c8a9251412070001a18",
               "name": "Pierre Olivier Persin",
               "profile_path": null,
               "id": 1620820,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57393c96925141603600000e",
               "name": "Cristobal Matheron",
               "profile_path": null,
               "id": 1620821,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "57393cadc3a36813e2000471",
               "name": "Raphaël Girardot",
               "profile_path": null,
               "id": 1620822,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "57393cb5c3a36813e2000477",
               "name": "Philippe van Herwijnen",
               "profile_path": null,
               "id": 989114,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.657696,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 116751,
      "vote_count": 2,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Le petit voleur",
      "runtime": 63,
      "poster_path": "/fIs4wpQALMcEMy2Ksd4sAS6yugy.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "La Sept-Arte",
            "id": 11332,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Agat Films & Cie",
            "id": 6519,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-12",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Erick Zonca"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Virginie Wagon",
         "Erick Zonca"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0184115/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NzE3Njk4Nl5BMl5BanBnXkFtZTcwNjMzNjQ5MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Nicolas Duvauchelle, Yann Trégouët, Jean-Jérôme Esposito | See full cast and crew »"],
      "reviews": [
         "First film I've seen for 2000 Singapore International Film Festival. A short film at only 65 minutes but effectively delivered. It does not comment, preach nor interpret any of the protagonist's actions. All that is left to the audience as the character goes through the ascension and spiraling descent of a thug at odds with society, his partner in crime & inevitably, the underworld itself. One can't help but sympathise with him at certain points but one cannot shake the doubtful feeling that he's not that hapless but actually cold blooded and ruthless too. Interesting film - definitely fodder for thought.",
         "This is an austere flick,devoid of embellishment which never tries to please you,audience.As an user wrote, a drop out remains a drop out,though the movie is ,in a certain way,circular ,and its ending is \"back to square one\" The hero's name (or nickname?) is \"Esse\" which means \"hook\",these hooks used by butchers. Comparing him to Jean -Pierre Léaud is an insult because Nicolas Devauchelles has nothing of Truffaut's protégé's affectation and mannerism (when dubbed in English,Léaud is certainly more palatable).He is more bressonesque ,as an user has already pointed out.The director's film is made of small sequences ,without any dramatization.Even the final attack refuses the show ,even if you will probably have to look away.These vignettes involve prostitution,thefts,boxing and even helping old ladies.The running time is probably the shortest of all contemporary French works :65 min. There are French people who are not romantic ,you know.",
         "This is basically the story of a scally lad who becomes involved in theft. My first reaction was that this lad must be a bad lot. Hang on a minute. This lad also helps people. He accompanied an elderly lady to and from the bank where she drew out some money, made no attempt to rob her and then rufused to accept any payment for his efforts. At the end of the film he sent off some money in order to make recompense for his criminal thieving activities. I ended up thoroughly liking this guy and classing him as a good 'un. One of my all time favourite films.",
         "This film, the second feature film by Erick Zonca, has a very rough, unrefined edge to it. Even more so than his first feature `The Dream Life of Angels'. The style is very similar, the loose camera, the natural settings (very French cinema) but the writing seemed to be lacking a great deal of compassion and depth that `..Dream Life..' had. At first this put me off a bit, but after some consideration of the subject matter, I think what Zonca has done is something truly unique. In `..Dream Life..'(A wonderfully acted and written film, better all around than `The Little Thief'.) our main character and main supporting character are both female. I believe this is the reason for the film having more emotional depth. The journey of life we go on with these female characters is much more emotional motivated, and while we see that the characters are disturbed, they are by no means ignorant. The same basic ideas are present in both films, (just like in Zonca's short film `Alone') the characters are trying to find themselves, and how they fit in and try to become a part of life. But the reason `Little Thief' lacks this depth of emotion is because our main character `Esse' lacks it as well. He is totally ignorant, as are all the characters around him. Here, Zonca has created a totally dominating, masculine world. All the characters are male, and have no concern or understating of themselves emotionally. They spend their time trying to prove to each other who is strong, who has more power. So as we watch `Esse' spend his time thieving and learning how to box, we have no window into his thoughts, we just WATCH him slowly throw his life away. So, here we have two films with very similar subject matter, even similar type of characters, but two totally different ways of telling a story. For this reason I liked `The Little Thief' and think what Zonca has done here is genuine. For what the film did lack in emotional depth on screen, it defiantly made up for it by evoking some powerful emotions from its audience members. (There is one very disturbing scene that stuck with me for a few days after, I don't want to be a spoiler, so that's all I'll say.)",
         "This is short, sharp, fast paced and touching story about an evil which hunts ( or try to hunts ) the heart of young boy. He wants to have money right now, in an easy way. As we all want. So, he starts to steel. Sure, someone can say, I know how it will end. But the way the Zonca gets you there will make you surprise. It's amazing and unbelievable that in a such a short time the movie goes, you get involve, thrilled and upset. It's a real must for every screenwriter and director ( no mention movie goers, they have their likes and dislikes in genres ). French movie in it's best. Superb cast of youngsters characters.",
         "`Stories of childhood have often been tempered with the melancholic yearning of lost innocence (as in Louis Malle's Au Revoir Les Enfants) or the profound weight of human misery (as in Robert Bresson's Mouchette).' -- An opinion in a filme web -- This filme has a twin called `Alone'about a young girl trying to survive.In LE PETIT VOLEUR the protagonist is a boy in a similar circumstance.Here we follow Esse (Nicolas Duvauchelle)after losing his job he tells his girlfriend, Sandrine, he doesn't intend to be anyone's slave.but after he made love to her,Esse steals her money, then he decided to move to another city only to begin a career as a rough boy who belongs to nobody. He is now apprentice in a Marseille gang that specializes in burglary, prostitution . We see Esse in a boxing gym pretending to be a fighter,there's a humorous scene where Esse is at the bathroom doing boxer' movements' with his fists, knocking everything he has in front of him, suddenly he accidentally knocked his eyes to the door,as a fighter, he is that bad. The most interesting scene of the filme is when Esse has to lookout to an ailing elderly woman who turns out to be the mother of his boss and we witness his desperate bad action.-who got to do with this old woman ( also disturbing as' his punishment.'). -I won't tell no more-. Erick Zonca after the success of La Vie Rêvée des anges,returns with intensity to tell a story about youth desperation in a gray environment.some compared his filmes with the great ROBERT BRESSON,I think that is a right remark Little thief and La vie. has similar endings both protagonists return to a work place why?maybe to Esse is because life on the streets was to tough for him and this work place seem a `safe' one BUT that doesn't mean they are `saved'. Zonca likes to show the misfits, trying to adapt themselves in a tricky system . Nicolas as Esse is a natural actor, he looks like LEO DI CAPRIO but at times reminded me to Antoine Doinel (Jean-Pierre Leaud),that confused young boy of Francois Truffaut masterpiece ' The 400 Blows', that is the biggest compliment I can say. 8/10",
         "long time since I've seen this movie (probapsly about a year or two). You like spie-derr-man?! This is die-hard material. A very modern way of film making. The French aren't that trivial, you know, and I wouldn't like to be the protagonist of this feature. It's a joker in his adolescence years who boasts about his capabilities towards a girl of his age. He enters hard reality in his romantic egocentric young romantic view of the world. Criminality isn't that easy, you know. Myself, I've tried it (in a modest way: non organised stealing). But what this boy encounters puts yer nose down on the facts. No romanticised view on the world here! This is true! In the end you get to learn that debate is more constructive than doin'things by yourself. And all the while it's not a lesson!!!",
         "This movie tells in one hour more then other movies tell in two hours. This movie shows us the story of a young drop-out who becomes a member of a gang in Marseille. As in the movie 'la vie rêvée des anges', Zonca is rather deterministic. Once a drop-out, you'll always be a drop-out...",
         "Great movie, go with the emotions a a petty thief and criminal, seeing him going from excitement to dispair. Crime doesn't pay, and what a harsh and upclose way of showing this. Typical French 'feel' to it, and added some realism. Nicolas D. currently acting in Levis commercial."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Agat Films & Cie",
         "La Sept-Arte"
      ],
      "summaries": ["A young man from the countryside of Marseille comes to the city, hoping to find a job. But circumstances will drive him to become a robber."],
      "budget": 0
   },
   "movielensId": 84453,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1999-09-12",
      "dvdReleaseDate": null,
      "directors": ["Erick Zonca"],
      "runtime": 63,
      "movieId": 84453,
      "title": "The Little Thief",
      "mpaa": "",
      "actors": [
         "Nicolas Duvauchelle",
         "Jean-Jérôme Esposito",
         "Martial Bezot",
         "Jean-Arnaud Dalomba",
         "Jo Prestia",
         "Ingrid Preynat",
         "Véronique Balme",
         "Olivier Gerby",
         "Emilie Lafarge",
         "Dominique Abellard",
         "Gilbert Landreau",
         "Yann Trégouët"
      ],
      "imdbMovieId": "0184115",
      "originalTitle": "Le petit voleur",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 116751,
      "avgRating": 3.33333,
      "releaseYear": "1999",
      "numRatings": 6,
      "posterPath": "/fIs4wpQALMcEMy2Ksd4sAS6yugy.jpg"
   }
}