{
   "tmdb": {
      "original_language": "zh",
      "keywords": [{
         "name": "china",
         "id": 478
      }],
      "imdb_id": "tt0111424",
      "video": false,
      "title": "The Day the Sun Turned Cold",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mother",
               "gender": 0,
               "credit_id": "5867d574c3a36877e6000295",
               "name": "Siqin Gaowa",
               "profile_path": "/aeHrjycGrc31WaVozdoAXxrbrgz.jpg",
               "id": 1118783,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Guan Jian",
               "gender": 2,
               "credit_id": "5867d5819251413be50002a7",
               "name": "Tou Chung-Hua",
               "profile_path": "/8qCMvsIZflLs5BUR8ysTseOzuCR.jpg",
               "id": 1366128,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Father",
               "gender": 0,
               "credit_id": "5867d58a9251413bd60002b3",
               "name": "Ma Jing-Wu",
               "profile_path": "/7kGZQBWfm9c9FUIe6H9MzM7OebE.jpg",
               "id": 1139069,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lover",
               "gender": 2,
               "credit_id": "5867d5b09251413bea0002bc",
               "name": "Wei Zi",
               "profile_path": null,
               "id": 1396646,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Young Son",
               "gender": 0,
               "credit_id": "5a6c19b00e0a265f1000520e",
               "name": "Shu Zhong",
               "profile_path": null,
               "id": 1967723,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Captain",
               "gender": 0,
               "credit_id": "5a6c19c1925141076c000318",
               "name": "Li Hu",
               "profile_path": null,
               "id": 1967724,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4756c3a36847f81301c3",
               "name": "Yim Ho",
               "profile_path": "/2NRKTeOU4g7fRpKVyKUnF8EdjQE.jpg",
               "id": 146295,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57e33f04c3a36875a100170a",
               "name": "Otomo Yoshihide",
               "profile_path": "/5epq4PakBlXIBrHc1fGkrdgjCCD.jpg",
               "id": 1316840,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5896101ac3a36822e0008a55",
               "name": "Hou Yong",
               "profile_path": null,
               "id": 72023,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.159536,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 48144,
      "vote_count": 2,
      "budget": 0,
      "overview": "Guan Jian wants to report the murder of his father who died 10 years ago. The alleged murderer whom Guan Jian accuses of the crime is his own mother.",
      "similar": [
         746,
         10110,
         311324,
         55292,
         291805,
         978,
         140300,
         9502,
         1735,
         956,
         714,
         843,
         4588,
         1494,
         7549,
         12289,
         31439,
         875,
         14202,
         9746
      ],
      "original_title": "天國逆子",
      "runtime": 99,
      "poster_path": "/loQea7CiBv6VevsU70vGpqj6AQM.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pineast Production",
         "id": 100202,
         "origin_country": ""
      }],
      "release_date": "1994-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ho Yim"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Hing-Dong Wong",
         "Ho Yim"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0111424/",
      "coverLink": null,
      "actors": ["Stars: Gaowa Siqin, Chung-Hua Tou, Jingwu Ma | See full cast and crew »"],
      "reviews": [
         "This film is a drama of great emotional depth. We can feel the conflict in the young man who feels he must act to inform on his mother. His devotion to an often stern father is equal to the love he also feels for his mother. The motivations of all the characters are very clear if one follows the story closely. This is a powerful film of conflicting emotions. The young man must know for sure how his father died and this is the method he takes to find out. The film is a beautiful piece of cinematic art with a great film score. The direction is flawless and the ending is surprising. I can not even imagine any American director with the ability to tell a story of such depth with such intense feeling and truth. Highly Recommended. A Masterpiece. 10 out of 10",
         "\"The Day the Sun Turned Cold\" is a well related tale of one man's conscientious 'betrayal' of his mother. Years after the fact, Guanjian (Tao) approaches the police to inform them that he suspects his mother may have poisoned his father. The young, first born son insists they investigate his claims. The cast are particularly strong, especially Gaowa Siqin as the woman accused of this dreadful deed. Yong Hou uses his camera to bring us some stunning images of a stark winter in Northern China, and editor Wong Yee Shin keeps the narrative tight and the story interesting. Director Ho Yim never provides reasons or even excuses as to the behaviour of Guanjian, nor does he supply us with answers to the many questions Hing-Dong Wong's script poses. As an audience we are left to decide what we think of a young man who would turn on his mother to honour his father's memory. Yim's telling, controlled direction and the thoroughly enjoyable cast keep us very interested. Monday, May 19, 1997 - Hoyts Croydon",
         "This film is emotionally wrenching to watch. It asks tough moral questions of both its characters and the audience. Does the truth set you free? Do we really know what we know? And does punishment really pay for a crime? This is an intense study of conflicted loyalties and the ultimate emptiness of revenge. Beautifully filmed and acted, it tells its story with a limited number of characters against the backdrop of a threadbare rural village. Almost everything about this film is the opposite of the Chinese Spectacle or martial arts films we usually get to see in North America. Powerfully directed throughout, this is truly a dramatic and cinematic masterpiece.",
         "The Day the Sun Turned Cold is a film about a son turning his mother in for the suspicious death of his father 10 years ago. It relives his earlier life through his storytelling flashbacks to the police officer, along with revisiting his childhood home in which almost all the members of his family are still there. The mother, having had a hard laborious life,being married to a unfeeling stern man, accidentally falls upon this caring person who somehow shows her that she is still able to live a happy life. The son, whom resents her for betraying his father, never forgives her. That seems to be why it lead to his reporting of the suspected crime 10 years later. But upon seeing her again in the present day, he does not see the adulterous woman he remembers her to be, but more of whom she really is, the mother that raised him, still living the simple rural life she has always lived. The film does seem a little forced when things gets explained and justified at the end of the movie. Maybe it could have been told or implied in a less direct way. The characters are complex, with non of them being morally right or wrong. The mother character was beautifully portrayed by the actress Gaowa Siqin. Could this be modern China's interpretation of don't go digging up past atrocities, since they were all done with the best of intentions and the good of the country in mind? To sum it up, a intriguing film that is worthy of viewing.",
         "This was a very good movie about a son who suspects that his mother may have had a hand in the death of his father ten years earlier. It's unclear if he is driven by his conscience or revenge (I think even the character doesn't know why), but he decides to go to the police to report his suspicion. The film is told with the effective use of flashbacks as the young man relays the details of his father's death to the stoic police chief. There are numerous twists and turns in the plot leaving the final outcome difficult to guess. It moves along slowly, unraveling little pieces of the puzzle, so it will require a little patience. The film poses interesting moral questions without heavy-handedly coming down on any side. The performances are worthy all around, but especially Gaowa Siqin, as the mother. Definitely recommended, especially if you are a fan of Chinese films. It doesn't have the pizazz and magnificence of some of Zhang Yimou's work, but it's engaging little story makes it well worth checking out.",
         "This slow paced hard to swallow melodrama fails to give any hint at why a son would turn his own mother in to the police, what one might think it wanted to handle. The characters lack psychological consistency ; they are as thin as the plot. What's left? A few glimpses at smoky cold North China country life."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": ["Pineast Production"],
      "summaries": [
         "Guan Jian wants to report the murder of his father who died 10 years ago. The alleged murderer whom Guan Jian accuses of the crime is his own mother.",
         "Based on real events in China 1988, a son (Chung-Hua Tao) has to come to terms with the implications of informing that his mother (Gaowa Siqin) may have murdered his father ten years ago to police, a crime that will undoubtedly carry the death sentence."
      ],
      "budget": 0
   },
   "movielensId": 845,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1994-01-01",
      "dvdReleaseDate": null,
      "directors": ["Yim Ho"],
      "runtime": 99,
      "movieId": 845,
      "title": "The Day the Sun Turned Cold",
      "mpaa": "",
      "actors": [
         "Siqin Gaowa",
         "Tou Chung-Hua",
         "Ma Jing-Wu",
         "Wei Zi",
         "Shu Zhong",
         "Li Hu"
      ],
      "imdbMovieId": "0111424",
      "originalTitle": "天國逆子",
      "genres": [
         "Mystery",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Guan Jian wants to report the murder of his father who died 10 years ago. The alleged murderer whom Guan Jian accuses of the crime is his own mother.",
      "tmdbMovieId": 48144,
      "avgRating": 3.36667,
      "releaseYear": "1994",
      "numRatings": 75,
      "posterPath": "/loQea7CiBv6VevsU70vGpqj6AQM.jpg"
   }
}