{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "health",
            "id": 3721
         },
         {
            "name": "junk food",
            "id": 7151
         },
         {
            "name": "food industry",
            "id": 15178
         },
         {
            "name": "fast food",
            "id": 157748
         },
         {
            "name": "mcdonald's restaurant",
            "id": 161956
         }
      ],
      "imdb_id": "tt0390521",
      "video": false,
      "title": "Super Size Me",
      "recommendations": [
         1430,
         1777,
         2359,
         1781,
         13007,
         18570,
         1776,
         8193,
         16070,
         22074,
         1779,
         501,
         9675,
         9388,
         2295,
         2260,
         9012,
         23128,
         1667,
         13016
      ],
      "backdrop_path": "/6arEx60KIFN2v8NZTpIBfpX7oEN.jpg",
      "revenue": 28575078,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44efc3a36847f80b2a5f",
               "name": "Morgan Spurlock",
               "profile_path": "/w5ZPlIuRAUp4OUDrCdNVMoYNzTi.jpg",
               "id": 57492,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself (as Daryl M. Isaacs MD Internal Medicine)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a63",
               "name": "Daryl Isaacs",
               "profile_path": null,
               "id": 57493,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Herself (as Lisa Ganjhu D.O. Gastroenterologist & Hepatologist)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a67",
               "name": "Lisa Ganjhu",
               "profile_path": null,
               "id": 57494,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself (as Steven Siegel MD FACC Cardiologist)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a6b",
               "name": "Stephen Siegel",
               "profile_path": null,
               "id": 57495,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Herself (as Bridget Bennett R.D.)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a6f",
               "name": "Bridget Bennett",
               "profile_path": null,
               "id": 57496,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself, exercise physiologist",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a73",
               "name": "Eric Rowley",
               "profile_path": null,
               "id": 57498,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself, former editor, Walking",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a77",
               "name": "Mark Fenton",
               "profile_path": null,
               "id": 57499,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Herself - Morgan's Girlfriend (as Healthy Chef Alex)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a7b",
               "name": "Alexandra Jamieson",
               "profile_path": null,
               "id": 57500,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Himself (as John F. Banzhaf III)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a7f",
               "name": "John Banzhaf",
               "profile_path": null,
               "id": 57502,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself (as Dr. David Satcher)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a83",
               "name": "David Satcher",
               "profile_path": null,
               "id": 57503,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Herself (as Dr. Lisa Young)",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a87",
               "name": "Lisa Young",
               "profile_path": null,
               "id": 57504,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a8b",
               "name": "Kelly Brownell",
               "profile_path": null,
               "id": 57505,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a8f",
               "name": "Jacob Sullum",
               "profile_path": null,
               "id": 57506,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a93",
               "name": "Tommy Thompson",
               "profile_path": null,
               "id": 57507,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2a97",
               "name": "William J. Klish",
               "profile_path": null,
               "id": 57508,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44efc3a36847f80b2a9d",
               "name": "Morgan Spurlock",
               "profile_path": "/w5ZPlIuRAUp4OUDrCdNVMoYNzTi.jpg",
               "id": 57492,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a36847f80b2aa3",
               "name": "Morgan Spurlock",
               "profile_path": "/w5ZPlIuRAUp4OUDrCdNVMoYNzTi.jpg",
               "id": 57492,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2aa9",
               "name": "Joe Morley",
               "profile_path": null,
               "id": 57509,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a36847f80b2aaf",
               "name": "Morgan Spurlock",
               "profile_path": "/w5ZPlIuRAUp4OUDrCdNVMoYNzTi.jpg",
               "id": 57492,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44efc3a36847f80b2ab5",
               "name": "Heather M. Winters",
               "profile_path": null,
               "id": 57510,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2abb",
               "name": "Scott Ambrozy",
               "profile_path": null,
               "id": 57511,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2ac1",
               "name": "Stela Georgieva",
               "profile_path": null,
               "id": 57512,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44efc3a36847f80b2ac7",
               "name": "Julie Bob Lombardi",
               "profile_path": null,
               "id": 57513,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.649162,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9372,
      "vote_count": 644,
      "budget": 65000,
      "overview": "Morgan Spurlock subjects himself to a diet based only on McDonald's fast food three times a day for thirty days without exercising to try to prove why so many Americans are fat or obese. He submits himself to a complete check-up by three doctors, comparing his weight along the way, resulting in a scary conclusion.",
      "similar": [
         3034,
         1694,
         399055,
         9738,
         9426,
         126889,
         384521,
         336843,
         18111,
         305091,
         9383,
         3035,
         22825,
         4961,
         9488,
         31417,
         19901,
         23943,
         415086,
         11429
      ],
      "original_title": "Super Size Me",
      "runtime": 100,
      "poster_path": "/9J2cYFtYRplFnHgn8V5ntCZEHut.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kathbur Pictures",
            "id": 8735,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Samuel Goldwyn Films",
            "id": 9118,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Con",
            "id": 8736,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Studio On Hudson",
            "id": 8737,
            "origin_country": ""
         }
      ],
      "release_date": "2004-01-17",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Super Size Me Collection",
         "id": 475802,
         "poster_path": null
      },
      "tagline": "The first ever reality-based movie ... everything begins and ends in 30 days!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Morgan Spurlock"],
      "runtime": 100,
      "synopsis": "As the film begins, Spurlock, age 32 at the time the movie was filmed in 2003, is physically above average, as attested to by three doctors (a cardiologist, a gastroenterologist, and a general practitioner), as well as a nutritionist and a personal trainer. He enlists all three to track his health during the month-long binge. All of the health professionals predict the \"McDiet\" will have unwelcome effects on his body, but none expects anything too drastic, one citing the human body as being \"extremely adaptable.\" Prior to the experiment, Spurlock ate a varied diet but always had vegan evening meals to appease his then-girlfriend (now wife), Alexandra, a vegan chef. At the beginning of the experiment, Spurlock, who stands 6 feet 2 inches (188 cm) tall, had a body weight of 185.5 lb (84.1 kg). Spurlock starts the month with breakfast near his home in Manhattan, where there are an average of four McDonald's (and 66,950 residents, and twice as many commuters) per square mile (2.6 km²). He also elects to ride in taxis more often, since he aims to keep the distances he walks in line with the 5,000 steps (approximately two miles) walked per day by the average American. Spurlock has several stipulations which govern his eating habits: He must fully consume three McDonald's meals per day (at breakfast, lunch, and dinner time). He must sample every item on the McDonald's menu at least once over the course of the 30 days (he managed this in nine days). He must only ingest items that are offered on the McDonald's menu. This includes bottled water. Any and all outside consumption of food is prohibited. He must SuperSize the meal when asked, but only when asked. He is not able to SuperSize by his own accord. He will attempt to walk about as much as a typical U.S citizen, based on a suggested figure of 5,000 standardized distance steps per day,[5] but he did not closely adhere to this, as he walked relatively more while in New York than Houston. Day 2 brings Spurlock's first Super Size meal, at the McDonald's on 34th Street and Tenth Avenue, which happens to be a meal made of a Double Quarter Pounder with Cheese, Super Size french fries, and a 42 ounce Coke, which takes 52 minutes to eat. He experiences steadily increasing stomach aches during the process, and promptly throws up in the McDonald's parking lot. After five days Spurlock has gained almost 10 pounds (4.5 kg) (from 185.5 to about 195 pounds). It is not long before he finds himself with a feeling of depression, and he claims that his bouts of depression, lethargy, and headaches are relieved by a McDonald's meal. One doctor describes him as \"addicted.\" He has soon gained another 8 pounds (3.5 kg), putting his weight at 203.5 lb (92 kg). By the end of the month he weighs about 210 pounds (95.5 kg), an increase of about 24.5 pounds (about 11 kg). Because he could only eat McDonald's food for a month, Spurlock refused to take any medication at all. At one weigh-in Morgan lost 1 lb. from the previous weigh-in, but it was hypothesized by a nutritionist that he had lost muscle mass, which weighs more than an identical volume of fat. Spurlock's girlfriend, Alexandra Jamieson, attests to the fact that Spurlock has lost much of his energy and sex drive during his experiment. It was not clear at the time if Spurlock would be able to complete the full month of the high-fat, high-carbohydrate diet, and friends and family began to express concern. In Day 21, Spurlock has heart palpitations. Consultation with his concerned internist, Dr. Daryl Isaacs advises him to stop what he is doing immediately to avoid any serious health problems. He compares Spurlock with the protagonist played by Nicolas Cage in the movie Leaving Las Vegas who deliberately drinks himself to death over a similar time period. Despite this warning, Spurlock decides to continue the experiment. Spurlock makes it to day 30 and achieves his goal. In thirty days, he \"Supersized\" his meals nine times along the way (five of which were in Texas, three in New York City). All three doctors are surprised at the degree of deterioration in Spurlock's health. One of them states that the irreversible damage done to his heart could cause a heart attack even if he lost all the weight gained during the experiment. He notes that he has eaten as many McDonald's meals as most nutritionists say the ordinary person should eat in 8 years (he ate 90 meals, which is close to 8 years of eating it once a month). Findings Text at the conclusion of the movie states that it took Spurlock 5 months to lose 20 pounds (9 kg) and another 9.5 months to lose the last 4.5 pounds. His girlfriend Alexandra Jamieson, a vegan chef, began supervising his recovery with her \"detox diet,\" which became the basis for her book, The Great American Detox Diet. \"The bottom line, they're a business, no matter what they say, and by selling you unhealthy food, they make millions, and no company wants to stop doing that.\" The movie ends with a rhetorical question, \"Who do you want to see go first, you or them?\" with a cartoon tombstone for Ronald McDonald (\"1954-2012\") as a backdrop. The cartoon of the tombstone originated in The Economist where it appeared in an article addressing the ethics of marketing toward children. In the DVD release of the movie, a short epilogue was added about McDonald's discontinuation of the Super Size option six weeks after the movie's premiere, as well as its recent emphasis on healthier menu items such as salads, and the release of the new adult happy meal. However, it is shown that the salads can contain even more calories than hamburgers, if the customer adds liberal amounts of cheese and dressing onto them prior to consumption. It is claimed by McDonald's that these changes had nothing to do with the film. Another issue that Spurlock focuses on is the way McDonald's targets young children with ads before the kids themselves realize how harmful the food is. In the movie, Spurlock jokes that he will battle the socialization of his children by punching them in the face every time they pass a McDonald's so that the golden arches do not elicit happy memories",
      "writers": ["Morgan Spurlock"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0390521/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyOTk4MjIxOF5BMl5BanBnXkFtZTcwMzk1NTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Morgan Spurlock, Daryl Isaacs, Chemeeka Walker | See full cast and crew »"],
      "reviews": [
         "Living with his vegan girlfriend, Morgan Spurlock decides to try and eat McDonalds for every meal for a month. At the same time he reduces the amount of exercise and walking to match that of the 'average' American to make for a fair experiment. After an initial bit of sickness he gets to enjoy the food and eats it three times per day. However after a week or two, his doctors begin to notice significant increases in body fat, cholesterol and blood pressure. Interspersed with this are interviews with experts on the nutritional value, marketing and impact of McDonalds and fast food generally. Several years ago I read the book Fast Food Nation and basically that ended my interest in the main fast food outlets and saw my consumption of processed foods drop quite a bit. I did not become a born again Christian and still eat rubbish food and am no role model for healthy living! However, what I have notice in the press and in the audiences for this film is a rather smug 'look at them' attitude as if this has no impact in Europe and Americans are some sort of freak show and nothing to do with us. This film may focus on McDonalds because it is the world leader in fast food which is high in saturated fats but if all you take from this film is pleasure at seeing McDonalds taking a kicking then you are missing the point. The film was challenging to me and I hope it was to many viewers \u0096 but I have not eaten in McDonalds or Burger King since 2001 and a bad bout of food poisoning in early 2003 ended my ability to enjoy KFC. So why did I find it challenging? Well, because like many others, I eat too many saturated fats and, regardless of where they come from (oven foods, ready meals or fast food) I need to cut them down. Spurlock sends this message in a really entertaining way while also having good digs at McDonalds. His relaxed style is refreshing and allows the facts to speak for themselves. He clearly doesn't like fast food as a concept but he is no Michael Moore and is only slightly biased. He is certainly a lot more interesting than his vegan girlfriend who is one of those overbearing self-righteous types who look down their nose at anything. His good humour makes the film but it is the documentary rather than the gimmick that kept me watching. The facts on obesity do speak for themselves and they are frightening and all the more so when you actually sit and think about what you eat \u0096 sweets, colas, ready meals, crisps, processed foods; whether it is salt, saturated fats or sugar, any of these foods spells trouble if they are not part of a balanced diet. My only fear of this film is that many viewers will look at McDonalds and say 'they are to blame, lets get them' and simply ignore that it is very easy to eat an unhealthy diet \u0096 go to any supermarket and you'll find 'easy' food served up quickly but without the things your body needs. I was challenged because I can easily veg out for several days and be too tired to cook decent food and this reminded me why I need to \u0096 hopefully many viewers will take that challenge and not just turn from one fatty diet (McDonalds) to another (ready meals). I personally didn't find the film as funny nor as shocking as many commentators have said it was but it was still consistently entertaining and interesting, true not the most scientific of experiments but that is not the point. True, very few people eat McDonalds every day but many, many people do eat foods high in saturated fats everyday even if they are not all happy meals and, in this way, maybe Spurlock's experiment wasn't so far-fetched and, lets be honest, like their own lobbyist said \u0096 McDonalds are part of the problem. That the film has had an impact is undeniable \u0096 the super size option has been removed and how many salads did you see in McDonalds this time last year? It may seem unfair and I can understand why McDonalds has been quick to counter it and call it unfair and, in a way it is unfair \u0096 why should they carry the whole blame for an overwhelming surge in unhealthy eating, but I suppose that's what you get for being the market leaders! Overall this was a very entertaining film that mixes its gimmick well with humour but also a good core of a documentary with interesting talking heads who don't rant or rave but simply look to the figures in most cases. However, I would say this; if you only see this film to sneer at those visibly unhealthy or to tear a strip off McDonalds then you are missing the bigger point \u0096 it is easy to eat unhealthy, cheap food no matter what brand it is \u0096 eating it every day and having a poor diet is a major problem and, if nothing else this should challenge all of us to look at our own habits and not just point and laugh at others.",
         "Fast food is good. I freely admit to running through fast food drive-thrus (Wendy's, Taco Bell and McDonald's being my top 3) often, sometimes several times a week. And I'm not the only one. I'm also one of the many millions of people in the country who are, uh...not thin. Think there's a connection? In \"Super Size Me\", a documentary from talented debut filmmaker Morgan Spurlock that manages to be both entertaining and horrifying, he attempts to draw a parallel between the fast food culture we live in and the rampant (and ever-increasing) rate of obesity in America. To do this, he launched into a little science experiment. A 33 year-old New Yorker in excellent health, he would eat nothing but McDonald's for an entire month, to gauge the effects on his body. Breakfast, lunch, and dinner at McDonald's and whenever they asked him to supersize, he would have to accept. Before starting, he consulted three doctors, a cardiologist, a gastroenterologist, and a general practitioner, all of whom said this experiment obviously wouldn't be GOOD for him, but that the damages would be minimal. Instead, the results were pretty shocking. Spurlock gained almost 30 pounds (over 10 in the first week), saw his cholesterol skyrocket, and experienced frequent nausea, chest pains, mood swings and loss of sex drive. During this month he also drove around the country, interviewing several different people on the topic (including a \"Big Mac enthusiast\" who has eaten over 19,000 Big Macs). His research on our fast food culture definitely yields some interesting information, especially when he interviews a group of 1st-graders, and more of them can identify Ronald McDonald than Jesus or George Washington. \"Super Size Me\" isn't perfect. It's a little repetitive and has a certain thinness to it (no pun intended!) that prevents it from being one of the truly great comedic documentaries of recent years like \"American Movie\" or \"Bowling For Columbine\". But even if it falls short of greatness, it's an entertaining and thought-provoking film (especially if you're, uh...not thin). Spurlock is a witty and engaging host (sort of like Michael Moore but not as much of a windbag), and I also liked his girlfriend (a vegan chef!) who looks on his experiment with a mixture of amusement, horror, and dismay. Just like we do.",
         "I had a report to do on childhood obesity, and I could use this documentary as one of my resources. May I say that I was glad that I watched this film. It is very terrifying what the fast food industry has done to this country. I'm not trying to bad rap them, they're a business. That's what they do, they try to make money. Do I agree with all the law suits going on with people blaming McDonald's and Burger King for making them fat? No, nobody is shoving the food down their throats. But there are so many people out there that are heavy users of fast food, and this documentary shows what the damaging effects can be of eating fast food. I gave up fast food, and have not had any for over a year now, and my health has boosted up majorly. Watching this film might make you want to stay away from the fast food restaurants, but if not, it'll make you think more about what you are eating. 10/10",
         "This documentary film by Morgan Spurlock asks the intriguing and topical question: What would happen to a normal 33-year-old man in perfect health who stands six feet two and weighs 185 pounds if he ate nothing but McDonald's fast food for thirty days? Well, it is not recorded that he shrunk. In fact, Spurlock, forsaking his vegan girlfriend's healthy cuisine, gained about 25 pounds and saw his cholesterol level shoot up to dangerous levels as he huffed and puffed his way three times a day through myriad Big Macs and fillet o' fish sandwiches, milk shakes, sodas, fries and other not-so-delicate items from the menu of the world's largest purveyor of fast food. He had hired three doctors and a registered dietician to check his vital signs and give him a thorough physical exam prior to this experiment in not-so-fine dining. Before the gorging was done all three doctors and the dietician advised him in the most uncertain terms for the sake of his health to stop eating the sugar-laden, fat-smeared, nearly fiber-free \"diet.\" But Spurlock, trooper that he is, amid the McTingles and the McPukes, hung in there until the very end. I can report that he survived the experience. Whether the viewer will is another matter. If you yourself (God help you) are seriously overweight you might want to pass on this excruciatingly detailed misadventure under the Golden Arches. All that fat slapping against those waddling thighs (Spurlock mercifully fuzzed out the faces of his subjects, allowing us only body shots), all that jiggling flesh under those XXXL garments might be too uncomfortably close to home for some sensitive viewers. But was this a fair test of the harmful consequences of eating Happy Meals and being super sized? After all, Spurlock eschewed exercise during the experiment, and of course nobody (?) actually eats every meal at McDonald's as Spurlock did. Furthermore he actually doubled his normal caloric intake from about 2500 calories a day to about 5000. Regardless I think we can say that his experience was indicative. The real question to be asked here (and Spurlock asks it) is whether McDonald's (or as some have dubbed thee) whether McDeath's can be or should be held responsible for the epidemic of obesity that is sweeping the country. Spurlock implies that McDonald's should be held responsible at least for its advertising aimed at children. I agree with this. But I also think that adults ought to know what they are doing. If they choose to chow down at a place that loves to super size and under nourish them, perhaps they themselves should be held responsible for the consequences. However, some people feel that the advertising has been so insidious for so long and the food so addictive to susceptible individuals that McDonald's ought to be taken to court just as the tobacco companies have been. For more information on the epidemic, its consequences, and what can be done about it, I refer the interested reader to The Hungry Gene: The Science of Fat and the Future of Thin by Ellen Ruppel Shell; Fat Land: How Americans Became the Fastest People in the World by Eric Critser; and Fast Food Nation: The Dark Side of the All-American Meal by Eric Schlosser. Schlosser appears in one of the bonus features being interviewed by Spurlock. This interview is one of the highlights of the DVD. Schlosser is articulate, candid, and very well-informed. Spurlock of course is a performer as well as a film maker. His directorial style owes something to that of Michael Moore, and his playful on-camera muggings remind me of Ian Wright of PBS's Globe Trekker series. See this as an introduction to this most serious threat to the nation's health, especially as it affects children. Morgan Spurlock is to be commended for bringing the reality of the epidemic to the attention of the general public. By the way, \"McTingles\" are those highflying, scary feelings you get after rapidly injecting massive amounts of pure sugar and caffeine into your system, usually by gulping your way through a 64-ounce McCola--and to think when I was a kid, Coca-Cola came in six-ounce bottles. How ever did we survive? \"McPukes\" are self-explanatory. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "Greetings again from the darkness. My daughter and I have been anxiously awaiting the release of this film since first reading about it months ago. Director (and lab rat) Morgan Spurlock takes on a fast food exclusive diet for 30 days and fills us in on the painful steps and sickening conclusion. Many have attacked Spurlock for picking on McDonalds or for not selecting the healthiest thing possible at every meal. These people are missing the point. He explains in the movie that McDonalds is the selection because they so dominate the fast food scene in the world and especially in Manhattan (where he lives). He also explains his meal selection by showing that most McDonalds orders include burgers and fries. Personally, I wondered more about his numerous milk shakes and parfaits. These seem to be the items that were a bit extreme. For the most part, Spurlock does an excellent job proving that we eat too much fast food, that it is very harmful to our bodies, and that there is evil at work conditioning kids that fast food is real food. The most frightening part of the story was the school cafeteria segment showing how kids eat when parents are not around and when school administrators pay no attention. This is the crux of our problems. The Georgetown professor compared it to the early candy cigarettes that condition kids that cigarettes create happiness. The same can be said for fast food and its happy meals and playgrounds. I did not agree too much with the doctor's comparison of Spurlock to Nic Cage in \"Leaving Las Vegas\". Cage's character was trying to commit suicide, while Spurlock was running an experiment and even considered quitting when the doctors were begging him to. Overall, a nice documentary without the total disregard for decency and the truth shown by Michael Moore in most of his films. I believe this should be required viewing for all junior high and high school students, as well as all expecting parents. This could be an educational tool to convince people to put a little more effort into their health.",
         "\"Supersize Me\" is an original, humorous, disgusting, shocking, and -- overall -- scary film. Spurlock takes us on a whirlwind tour of the downfall of American health through poor nutrition, padding a lot of information with anecdotal footage of his own foray into a McDonald's-only diet. What amuses me about the negative \"reviews\" for this film at IMDb is how the majority of the naysayers focus on exactly one thing: Spurlock's 30-day McDonalds binge. Heck, you could pick that much out of the trailer, and write a slanted review based solely on the imperfections of that particular plot device as an overall impact study and call it a day. I wouldn't be a bit surprised to find out that's what's happening, either. Certainly, anyone who's watched the political BS pour in to commentary for Michael Moore's documentaries knows how it's done. However, if you actually take the time to watch the film, you'll see something quite different emerge: a pattern of childhood indoctrination, poor nutrition, inadequate exercise, and skyrocketing obesity rates, that's sweeping this nation like a plague. Spurlock's self-afflicted experiment is, as I've mentioned, a continuity device that unifies the broad range of the film within a single case study. In the total scope of what's addressed in this film, it's a relatively small part, and many decry it as unrealistic. But Spurlock never claimed it was entirely realistic! He says as much in the film: he ate as much McDonalds in a month as *nutritionists* recommend one eat in 8 years or more. However, the problem is, a lot of Americans are eating as much fast food in a year as he ate in a month. What is the net effect going to be after five years? After 10? Spurlock further restricts himself to an AVERAGE amount of walking exercise, typical for our national population. The problems he exhibits after 3 weeks on this diet are NOT unique, they are the ones that people around the country are exhibiting in spades: weight gain, fatty liver, depression, inactivity. It cannot be overemphasized that this condition is widespread. Those arguing \"personal responsibility\" have to answer the question of how it is that suddenly, over the last 30 years, so many people have \"chosen\" a life of sickness and self-destructive addiction over one of health and common sense. The effect of mass-media indoctrination is an obvious factor, and the film addresses it well. Spurlock also takes us behind the scenes at school lunchrooms and gymnasiums around the country, where we find out a little bit of what's been happening to the kids of America. Is the \"french fry\" truly the only vegetable we can afford to serve to school kids, aside from the dubious catsup? How children could be expected to show \"personal responsibility\" above and beyond that exhibited by their likely-obese parents in such an environment of brand franchising, 2nd-rate meal \"programs\", and cutbacks in PE/recess time is a matter that I invite all fast-food apologists at IMDb to explore. For pure entertainment value, I have to deduct points for an uneven pace (especially near the end) and insufficient exposition from some of the people in the film. Still, \"Supersize Me\" stands as an indictment of the prepackaged food industry, its marketing hype, and its congressional lobbyists. It also serves as a warning to Americans trapped in demanding low-activity jobs which leave little time for lunch or exercise: don't eat the fries! 8/10",
         "Morgan Spurlock undoubtedly aspires to follow in the path of Errol Morris, Roger Moore, Joel Sucher and other leading documentarians. A young man with an adoring and beautiful girlfriend, he decided to unmask the evil of fast food and its impact on an increasingly obese America. That Americans eat too much fast food - too much of any kind of food - and eschew exercise is hardly news. But a full-scale documentary examining sloth by the bucket-full focusing on one major commercial phenomenon hasn't been done before. Spurlock decided to eat at McDonald's and only McDonald's for a full month. That's three meals a day with no other food source. Before launching on what actually was a death-defying trip (literally since for variety he consumed Mickey D's food in Texas, L.A. and a lot of other places) he had a full baseline workup with a cardiologist, a gastroenterologist and an internist who gets more screen time than his medical colleagues-he gravitates between being supportive and alarmist, the latter increasingly the right response to Spurlock's bizarre quest. Spurlock also has a nutritionist/dietician and a physical trainer to keep tabs on him. The only specialty missing, in retrospective one who might have been useful, was a psychiatrist. His girlfriend, a vegan chef no less, looks forward to the month with a mixture of humor and alarm. \"Supersize Me\" has lots of scientific information on the nature of fast food and its impact on an America that eats out more than it dines at home, a change from a past where mom or a wife faithfully prepared most meals. Nutritionists decry the change in our culture, educators point out the impact of fast food in school cafeterias on kids' health, a former Surgeon General gravely decries the menace and the usual person-on-the-street suspects shock viewers by their bumbling inability to define such terms as \"calories.\" A food industry spokesman is blithely unaware that he is being set up to look like an ass. And, of course, there are multiple shots of Spurlock vainly connecting with polite drones at McDonald's HQ seeking an interview which never comes. Does this all sound familiar? Spurlock's month-long consumption of McDonald's products gets old fast although he and the director try to add some novelty like showing him vomiting after downing a supersized meal. Periodic visits to get his bloods and body checked reveal the insidious impact of a bizarre diet. His puzzled internist tells us several times he's never before seen a liver compromised by a high fat diet. The problem, though, is that Spurlock is like those laboratory rats who develop arcane tumors after consuming the equivalent of something that no human could ingest in ten lifetimes. His peregrination from one Mc D's to another becomes boring as his health is clearly threatened and he stubbornly refuses medical advice to give it up. The best part of \"Supersize Me\" is the well-presented information on schools and fast foods and how a few are resisting the commercial tide that aims junk at kids from kindergarten through high school. Even inmates, we're told, can be well fed at no greater cost than the fat-laden diets these essentially sedentary wards of the state have shoveled at them. Technically, this is a well-filmed documentary with creative use of multiple images and graphs. I hope Spurlock has more ideas for documentaries. He's had a lot of time to think about it-an epilogue informs us it took him almost a year to regain his former fitness and health thanks, partially, to his vegan lover's detoxification diet. Oh, and McDonald's is phasing out supersized meals, a minor withdrawal in a serious public health war. 7/10.",
         "Super Size Me is a great documentary. Enlightening and informative, it uncovers the fast food industry's conspiracy, that it's not about the people they serve, but its about the money we give them. They manufacture and process foods so that we HAVE to have more. \"You just can't eat one chip\" isn't just good marketing - they really put stuff in the food, even in our meat, to make it more addictive! The food industry in general is just another self-seeking money making machine, no better than the big companies that outsource their manufacturing to inhumane sweatshops in third world countries. They exploit the poor to feed their gluttonous and materialistic appetites. It took a lot of courage to go through with this experiment, risking your own body for a greater cause. This film will hopefully help change the way the fast food industry thinks and operates, exposing the conspiracy. If nothing else, Super Size Me will inspire you to eat right, exercise, and possibly become a vegan. At the least you'll be motivated to eat better. Though the film is a bit slow at times, considering the content, it's definitely worth seeing. As a result of watching this movie, I don't want to eat fast food EVER AGAIN!!!! We need more films and books like this one. Anyone who cares about what goes on in the world should see this film. I highly recommend it.",
         "If there was ever any doubt that Americans on the whole are not the sharpest knives in the utensil drawer, the massive success of \"Super Size Me\" at the box office settles it. I've wanted to write a review on this ridiculous film ever since I was forced to watch it in a college health course many years ago, but frankly there are so many things wrong with it that it was too daunting a task; since these complaints have already been mentioned in a host of other user comments, the best I can do is try to catalogue them in a single list, henceforth: THINGS WRONG WITH 'SUPER SIZE ME': 1) Spurlock ate 5000 calories per day, for 30 days, with no exercise. The last person to go on this diet was Jabba the Hutt, and that was a long time ago in a galaxy far, far away. Obese people generally become obese over long periods of time. What Spurlock did here is basically a suicide diet; whatever conclusions he reached about the devastating effects of fast food were at best irrelevant or dishonest. 2) Not to mention he was eating the SAME foods every day, limiting the types of nutrients he received. The *only* people to do this wind up dead or in hospital beds, as almost happens to him in this film. 3) Spurlock was a vegan before starting this experiment, meaning his body was completely unprepared for the insane amounts of sugars and fats he suddenly thrust upon it. No wonder his liver failed. 4) The film makes no attempt to actually *connect* the obesity epidemic with fast food, although this is implicitly assumed from the very beginning. Not once does Spurlock bother giving us information as to what exactly the average obese person is eating, much less whether it has anything to do with their weight (you may have heard the saying about correlation not being equal to causation). Fast food has been around since the 1950s, yet the obesity phenomenon did not appear until the 90s, a strong indication that other factors such as genetics and extremely sedentary lifestyles are to blame (and yes, as the film points out, food portions at these restaurants have increased, but surely not to the point where they alone are responsible for the Goodyear-blimp levels of bodily girth seen today). 5) The food at McDonald's is not unhealthy. I know that sentence may blow a mind or two, but the idea that a low-fat diet and increased fruit and vegetable intake is good for your health is a *myth* that was debunked in 2006 by three large studies undertaken by the American Medical Association (all readily available online). Spurlock's personal health crash was obviously caused by the first three points mentioned above. It's not as if we're living in Upton Sinclair's time where rat parts are ending up in our hamburgers; we actually have an FDA these days which determines the food we eat will not make us sick. Eat more, weigh more; eat less, weigh less; eat a variety of foods, receive a variety of nutrients: that is all anyone really needs to know about nutrition. (There's a ludicrous addendum to the DVD of this film called \"The Smoking Fry\" in which Spurlock puts McDonald's French fries in a jar, and after 10 weeks, they have not decomposed: this is supposed to be \"proof\" that they are some kind of devil food that will wreak havoc on your body. When I saw this in my college class, some dolt remarked, \"If they're not decomposing in the JAR, you really have to wonder what they're doing in your BODY.\" Well, what do you THINK they're doing, genius? Dancing? Your body simply absorbs the nutrients it can use and discards the rest, like it does with anything else. You don't need to be terrified of fried potatoes.) 6) The film is shoddily made. It adopts the same smug, juvenile, provocative tone of Michael Moore's documentaries, but whereas Moore is actually (I'll admit) a talented filmmaker who can create moods by editing his scenes together effectively, Spurlock simply throws a bunch of abrasive cartoon imagery and pop music together which never adds up to a coherent style and is more or less an insult to the form. So there you have it, all the most egregious problems with this film in a single package. And yet for some reason, none of these were enough to stop it from getting rave reviews, box office success and an Oscar nomination, leading me to wonder if I could have similar success making a documentary wherein I bash my head repeatedly against a wall for 30 days and prove that doing so leads to brain damage; not only would I probably be drowning in laurels, but I'd be well prepared for a long and fruitful career in Hollywood. I give this failure of a film 0/10.",
         "When I first heard about Morgan Spurlock's 2004 documentary \"Super Size Me\", I was pretty jaded, because common sense would dictate that if one eats fast food, they are going to have weight and health issues. Indeed, this is what happened to Spurlock, however the magnitude of the health deterioration was astounding. Presented in a sometimes humorous format, \"Super Size Me\" is an experiment conducted by Spurlock in which he would only eat McDonald's food, three times a day, with the caveats that he would have to eat everything off the menu at least once, and that he would limit his exercise to the amount of exercise the \"average\" American gets per day. Therefore, if he is nearing his walking limit for the day (measured by a pedometer he wears) he would have to grab a cab or find another way to get from A to B without walking. Predictably, he gains a lot of weight, (though the rapidness of the weight gain is alarming \u0096 at first, 10 pounds in one week) but it is his actual health tests that are the most frightening. By the end of the second week, his doctors, who originally approved his experiment (with some reservation, naturally) were practically begging him to stop. Other than the experiment itself, \"Super Size Me\" is peppered with facts about the fast food industry and various interviews with industry insiders. I definitely found the film enjoyable, and somewhat informative (though having read Eric Schlosser's Fast Food Nation, a lot of the information was old news) but there was something missing that is hard to grasp; perhaps the film needed a little more substance and cold hard facts instead of watching him constantly eat. However, it is my understanding that the supplemental materials on the DVD are extremely informative and even include an interview with Schlosser, so perhaps more insight could be found there. Spurlock is a great presenter, however, because he is just a regular guy who has a great amount of charm and good camera presence. He was entertaining and likable enough to really illicit concern when his health was so obviously starting to become effected. Ironically, his girlfriend (and now wife) is a vegan chef, so it was mildly humorous to watch her preparing a detox menu for him using the most apropos vegetables to clean out his system. The aim for most documentaries is to present a thesis and then not only prove it, but provide supporting evidence. Though the thesis of \"Super Size Me\" was kind of a foregone conclusion, Spurlock manages to provide us with supporting evidence that doesn't make the entire film one big \"Well, duh!\" which is what I kind of expected, going into the film. If you have seen or plan to see this movie and are interested in the subject matter, I would highly recommend reading Schlosser's Fast Food Nation to gain even more insight on the business of fast food. It's a very interesting read and would make a good companion piece to this documentary. 6/10 --Shelly"
      ],
      "genres": [
         "Documentary",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Con, The",
         "Kathbur Pictures",
         "Studio On Hudson"
      ],
      "summaries": [
         "Several legal suits have been brought against McDonald's Restaurants that they are knowingly selling food that is unhealthy. Some of the court decisions have stated that the plaintiffs would have a claim if they could prove that eating the food every day for every meal is dangerous. As such, documentarian Morgan Spurlock conducts an unscientific experiment using himself as the guinea pig: eat only McDonald's for thirty days, three meals a day. If he is asked by the clerk if he would like the meal super sized, he has to say yes. And by the end of the thirty days, he will have had to have eaten every single menu item at least once. Before starting the experiment, he is tested by three doctors - a general practitioner, a cardiologist and a gastroenterologist - who pronounce his general health to be outstanding. They will also monitor him over the thirty days to ensure that he is not placing his health into irreparable damage. He also consults with a dietitian/nutritionist and an exercise physiologist, the latter who also deems him to be above average fitness. As it mimics the lifestyle of those who eat fast food, he will also do no exercise for the thirty days, limiting himself to under 5,000 steps per day (the approximate equivalent of 2½ miles). These health and medical experts have some predictions about his general health and wellness by the end of the experiment. His vegan chef girlfriend also has some predictions about how this experiment will affect his mood and therefore their relationship. As he goes through the experiment, he speaks to a number of people - many experts in their respective fields - on the pros and cons of the fast food lifestyle. Just over halfway through the experiment, it is evident that even the experts can be wrong, and not in a good way.",
         "Why are Americans so fat? Two words: fast food. What would happen if you ate nothing but fast food for an entire month? Filmmaker Morgan Spurlock does just that and embarks on the most perilous journey of his life. The rules? For 30 days he can't eat or drink anything that isn't on McDonald's menu; he must wolf three squares a day; he must consume everything on the menu at least once and supersize his meal if asked. Spurlock treks across the country interviewing a host of experts on fast food and an equal number of regular folk while chowing down at the Golden Arches. Spurlock's grueling drive-through diet spirals him into a physical and emotional metamorphosis that will make you think twice about picking up another Big Mac.",
         "In 2002, director Morgan Spurlock subjected himself to a diet based only in McDonald's fast food three times a day for thirty days and without working out. His objective was to prove why most of the Americans are so fat, with many cases of obesity. He began the shootings submitting himself to a complete check-up with three doctors, and along the weeks, he compared his weight and results of exams, coming through a scary conclusion.",
         "Documentary filmmaker Morgan Spurlock makes himself a test subject of this documentary about the commercial food industry. Rigorously eating a diet of McDonald's fast food, three times a day for a month straight. Spurlock is out to prove the physical and mental effects of consuming fast food. While doing this, Spurlock also provides a look at the food culture in America through it's schools, corporations, and politics as seen through the eyes of regular people and health advocates. \"Super Size Me\" is a movie that sheds a new light on what has become one of our nation's biggest health problems: obesity.",
         "While examining the influence of the fast food industry, Morgan Spurlock personally explores the consequences on his health of a diet of solely McDonald's food for one month."
      ],
      "budget": 65000
   },
   "movielensId": 8464,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-01-17",
      "dvdReleaseDate": "2004-09-28",
      "directors": ["Morgan Spurlock"],
      "runtime": 100,
      "movieId": 8464,
      "title": "Super Size Me",
      "mpaa": "PG-13",
      "actors": [
         "Morgan Spurlock",
         "Daryl Isaacs",
         "Lisa Ganjhu",
         "Stephen Siegel",
         "Bridget Bennett",
         "Eric Rowley",
         "Mark Fenton",
         "Alexandra Jamieson",
         "John Banzhaf",
         "David Satcher",
         "Lisa Young",
         "Kelly Brownell",
         "Jacob Sullum",
         "Tommy Thompson",
         "William J. Klish"
      ],
      "imdbMovieId": "0390521",
      "originalTitle": "Super Size Me",
      "genres": [
         "Documentary",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["LOvrkkj_T-I"],
      "plotSummary": "Morgan Spurlock subjects himself to a diet based only on McDonald's fast food three times a day for thirty days without exercising to try to prove why so many Americans are fat or obese. He submits himself to a complete check-up by three doctors, comparing his weight along the way, resulting in a scary conclusion.",
      "tmdbMovieId": 9372,
      "avgRating": 3.53731,
      "releaseYear": "2004",
      "numRatings": 11324,
      "posterPath": "/9J2cYFtYRplFnHgn8V5ntCZEHut.jpg"
   }
}