{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "secretary",
            "id": 11677
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0034078",
      "video": false,
      "title": "Rage in Heaven",
      "recommendations": [
         48156,
         25735,
         29257,
         68976,
         37504,
         27034,
         25498,
         25689,
         26663,
         27446,
         26220,
         26948,
         26666,
         44101,
         26805,
         84364,
         29467,
         35957,
         59165,
         34752
      ],
      "backdrop_path": "/qisQjDTcJXq3JBTfiQluc0fpBGX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Philip Monrell",
               "gender": 2,
               "credit_id": "52fe44739251416c91011285",
               "name": "Robert Montgomery",
               "profile_path": "/f4VuWDEgs4X5FKCWaGezqJGTqzE.jpg",
               "id": 19406,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Stella Bergen",
               "gender": 1,
               "credit_id": "52fe44739251416c91011289",
               "name": "Ingrid Bergman",
               "profile_path": "/jXEE0P6705JbMAJ2nwtHjmqkd5F.jpg",
               "id": 4111,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Ward Andrews",
               "gender": 2,
               "credit_id": "52fe44739251416c9101128d",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mrs. Monrell",
               "gender": 1,
               "credit_id": "52fe44739251416c91011291",
               "name": "Lucile Watson",
               "profile_path": "/lph8cxn8qWFyt39tG68mfO2AyY8.jpg",
               "id": 83260,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dr. Rameau",
               "gender": 2,
               "credit_id": "52fe44739251416c91011295",
               "name": "Oskar Homolka",
               "profile_path": "/jhKFc29QjUTfgqNMQqpAO79swQq.jpg",
               "id": 29661,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mr. Higgins",
               "gender": 2,
               "credit_id": "52fe44739251416c91011299",
               "name": "Philip Merivale",
               "profile_path": "/d5yMCa4qCUIZdTB82ME1Q7Vewph.jpg",
               "id": 105007,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Ramsbotham",
               "gender": 0,
               "credit_id": "52fe44739251416c9101129d",
               "name": "Matthew Boulton",
               "profile_path": "/xtYte3vjCSrDcbFBfbJifkrU5CN.jpg",
               "id": 102888,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Clark (butler)",
               "gender": 2,
               "credit_id": "52fe44739251416c910112a1",
               "name": "Aubrey Mather",
               "profile_path": null,
               "id": 85937,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Solicitor-General (as Frederic Worlock)",
               "gender": 2,
               "credit_id": "52fe44739251416c910112a5",
               "name": "Frederick Worlock",
               "profile_path": "/oCQAanAc665NeE5allgEMit3wiY.jpg",
               "id": 14509,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Bardsley",
               "gender": 2,
               "credit_id": "52fe44739251416c910112a9",
               "name": "Francis Compton",
               "profile_path": null,
               "id": 117199,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Mr. Black",
               "gender": 2,
               "credit_id": "52fe44739251416c910112ad",
               "name": "Gilbert Emery",
               "profile_path": "/gKJeGDvOVIHqmtjdED9X6hfYsK.jpg",
               "id": 95757,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Durand (as Ludwig Hart)",
               "gender": 0,
               "credit_id": "52fe44739251416c910112b1",
               "name": "Ludwig Hardt",
               "profile_path": null,
               "id": 127524,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Proprietor with Telephones (uncredited)",
               "gender": 2,
               "credit_id": "53fb009a0e0a267a6600710e",
               "name": "George Davis",
               "profile_path": null,
               "id": 120701,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Court Clerk (uncredited)",
               "gender": 2,
               "credit_id": "5a22b0e90e0a264cca0b53f1",
               "name": "John Burton",
               "profile_path": null,
               "id": 103657,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44739251416c91011269",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44739251416c9101126f",
               "name": "James Hilton",
               "profile_path": null,
               "id": 33273,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44739251416c91011275",
               "name": "Gottfried Reinhardt",
               "profile_path": null,
               "id": 127522,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44739251416c9101127b",
               "name": "Bronislau Kaper",
               "profile_path": null,
               "id": 14861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44739251416c91011281",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44739251416c910112b7",
               "name": "Christopher Isherwood",
               "profile_path": "/t6IW6anuyFykWllFnZhkrO5cxZt.jpg",
               "id": 66779,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44739251416c910112bd",
               "name": "Robert Thoeren",
               "profile_path": null,
               "id": 3157,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53fb002c0e0a267a750071e0",
               "name": "Harold F. Kress",
               "profile_path": null,
               "id": 7510,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53fb00400e0a267a78006fe0",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "53fb00560e0a267a750071e6",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "53fb006b0e0a267a78006fe6",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [],
      "popularity": 1.157048,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31324,
      "vote_count": 7,
      "budget": 0,
      "overview": "Robert Montgomery plays a jealous man who plots to fake his death and incriminate his wife's suspected lover.",
      "similar": [
         996,
         12102,
         50546,
         51828,
         46705,
         664,
         513285,
         247,
         38167,
         9667,
         6075,
         4944,
         6637,
         9472,
         38,
         59,
         69,
         116,
         319,
         597
      ],
      "original_title": "Rage in Heaven",
      "runtime": 85,
      "poster_path": "/s2rdNZS8ZIi5wTLWKPY5QVZIeTS.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1941-03-07",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "W.S. Van Dyke",
         "Robert B. Sinclair"
      ],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Christopher Isherwood",
         "Robert Thoeren"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034078/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwMTUzMDk3MV5BMl5BanBnXkFtZTgwOTU5NTAyMTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Montgomery, Ingrid Bergman, George Sanders | See full cast and crew »"],
      "reviews": [
         "James Hilton was not a great novelist, but he was a popular one in the 1930s and 1940s, and two of his books have managed to become minor classics. Both also were the basis of popular films: LOST HORIZON and GOODBYE MR. CHIPS. But, oddly enough, they were not the only Hilton novels that made it to the screen, nor the only two that became classic films. RANDOM HARVEST can be added to his novels that became film classics. And he also wrote his \"Crippen\" novel, WE ARE NOT ALONE (which starred Paul Muni and Dame Flora Robson), and this film, RAGE IN HEAVEN. In story it actually resembles RANDOM HARVEST a bit: In that film Ronald Colman is an amnesiac from World War I who escapes from an asylum, and eventually turns out to be the head of a large industrial empire. In RAGE IN HEAVEN Robert Montgomery is a paranoid who flees an asylum in France, and turns out to be the head of a large industrial empire. But Colman's character is intelligent and fair minded - a good boss. Montgomery is argumentative, harsh, and (ultimately) incompetent and cowardly. One can say that RAGE IN HEAVEN is the dark side of RANDOM HARVEST. Robert Montgomery's film career is one of the most aggravating in Hollywood history. He built up a career in the 1930s playing cads and bounders in MGM comedies, with an occasionally good comic hero role (THE LAST OF MRS. CHEYNEY and TROUBLE FOR TWO come to mind). Then he got the plum role of the psychopathic Danny in NIGHT MUST FALL, and an Oscar nomination for best actor in 1937. But he did not get the Oscar (Spencer Tracy did). I have always suspected that had Montgomery won the Oscar he deserved to his name would be properly remembered today, as more than just a good actor who was the father of television's \"Samantha\", Elizabeth Montgomery. Instead, while he still had some good parts later in his career (many as a director and producer, as well as actor), he never got the recognition he thoroughly deserved. It is obvious that RAGE IN HEAVEN was meant to be a follow-up \"psycho\" role for Montgomery, following Danny. But Phillip Morell is not as well done as Danny, probably because NIGHT MUST FALL was a play by Emlyn Williams originally, and so it was easier to transfer it to the screen than Hilton's novel. But then, LOST HORIZON, MR. CHIPS, and RANDOM HARVEST were well done screenplays too. Danny (for all his murderous habits) has his human moments, but Phillip doesn't. Phillip is always under-spoken and wide eyed. He always is on the verge of exploding (and similarly of collapsing - witness the moment the Union leadership force their way into his office to confront him over his unwillingness to settle the labor impasse, and how he just collapses and runs out yelling, \"Give them whatever they want!\"). A modern treatment might develop his mania somewhat. It is obvious that Hilton understood what paranoids were capable of - the business about the hidden confession in the diary rings true - but it is still not developed enough for the audience to understand. We know that Phillip's father was insane (and committed suicide) but more details are needed. It was Ingrid Bergman's third or fourth American film. She was slowly inching her way to real stardom (she had touched it opposite Leslie Howard in the Hollywood version of INTERMEZZO), but her performance, while natural, is not very memorable. George Sanders again demonstrates his dependability in any role, here as a good guy almost destroyed by his mad friend. Oscar Homolka does a good job as the asylum head, whose assistance to Bergman saves Sanders in the end. It is not as good a film as it should have been with a better laid out script, but it is watchable one or two times.",
         "I usually don't agree much with Leonard Maltin, but he knew what he was talking about with this stinker. If it wasn't for the presence of such great actors like Robert Montgomery, George Sanders, and Ingrid Bergman, this would surely be a total bomb. First of all, Montgomery and Sanders play against type: Montgomery is a brooding British aristocrat who suffers from suicidal tendancies. Sanders is his long-time friend who is as noble as he could be. They are both in love with Ingrid Bergman, a sweet young thing who marries Montgomery before she is aware of his psychosis and Sanders' love for her. Montgomery is instantly paranoid and jealous, and invites Sanders up for a visit to test his wife's fidelity and his friend's loyalty. This leads to actions that will forever change all of their existences. The synopsis doesn't sound bad, but don't let that fool you. This is not your typical MGM glossy love triangle. Although it does fall under the \"A\" category, it is perhaps one of their worst disasters of the \"golden era\" (falling into the category of \"Parnell\", \"Desire Me\", and \"The Kissing Bandit\"). Montgomery, who had earlier played a psychotic character in MGM's \"Night Must Fall\", is plagued with melodramatic lines that would scare off any young heroine. How Ingrid Bergman couldn't see through him is beyond me. Bergman, at the beginning of her successful American career, was on loan to MGM for this film (and \"Dr. Jekyll & Mr. Hyde\" the same year), and should have thought twice about accepting. According to Robert Osborne of \"TCM\", the film did so bad during its first release that several years later when Bergman was a major star, MGM repackaged it, and released it so people would think it was a brand new film. She isn't bad in it (whenever was she bad?), but it was the type of film which could have done irreparable damage to her career. The best of the leads is George Sanders, coming off many a scoundrel role. He is totally believable, and this did make a nice change of pace for him. In the supporting role of Montgomery's matronly mom, Lucille Watson does all she can to inject her usual wisdom, but is wasted as the bedridden matriarch. My biggest complaint with this is the fast conclusion which rushes towards its finish with such disbelief that the viewer can't help but say, \"OK, that was ridiculous!\". The film might have ranked a measly two stars if it had thought about a different way to wrap up a story which was already unbelievable. I watched in disbelief as the writers hastily threw away the story and what little credibility there was before my eyes. All this on an \"A\" picture meant to showcase major stars. 'Tis pity she's a flop.",
         "This film, based on a James Hilton novel, is not often seen these days. In part, the material Christopher Isherwood extracted from the book doesn't make a good movie. As directed by W. S. Van Dyke, the film seems to have been sabotaged by its star, Robert Montgomery, who made no secret he didn't want to be in the picture. It's a shame because the rest of the players are evidently acting in a different movie. The melodrama has some interesting things going for it. First there is the luminous appearance of Ingrid Bergman in her third Hollywood film. Also, George Sanders has one of the best roles he ever played in the movies. Both Ms. Bergman and Mr. Sanders are the reason for watching. Lucile Watson, Oscar Homolka and Philip Merivale, among others, make great contributions to the film. While this is not by any means a horrible film, it could have been improved if only Mr. Montgomery, a welcome presence in any movie, would have done a better job inter acting with the rest and following direction.",
         "Altho this film came from MGM, it is nothing more than a B quality Warners film. The plot is implausible and absurd, especially in the scenes where we're asked to believe Montgomery's character suddenly steps in as CEO of a major industry his family owns and is allowed to continue until he alienates the workers to the point of rebellion. Utter rot! And the suicide plan Montgomery devises for himself is just movie nonsense, as is the chase to Paris to find the bookbinder who has Montgomery's diary. The best laugh here is Oscar Homolka as Dr. Rameau, the psychiatrist. He looks like an ape-man. Everyone involved with this film should be ashamed. It's a waste of one's time to watch it. In her autobiography, Ingrid Bergman explains that Robt. Montgomery came to her before shooting on \"Rage\" began and said, \"I'm very sorry to do this to you, but I'm forced to do this movie, so I intend to just say the lines but not act.... I'm not going to do what they tell me to do. I'll listen, but I shan't take any notice.\" He explained to Bergman that he had pleaded with MGM to have some time off from making films, but MGM put him right in to \"Rage.\" Montgomery couldn't afford suspension because he had a family and a large house to maintain. Montgomery explained to both Bergman and George Sanders that his revenge on MGM would be to take no direction and deliver all his lines flatly. Bergman writes, \"The director would explain what he wanted to Bob, and Bob would look up at the sky as if he wasn't hearing a word, and the director would say, 'Now, Bob, have you understood what I'm talking about?' Bob would answer, 'Now are we going to shoot this scene? Right; let's go.\" And Bob would go straight into this blah-blah-blah act of his, no inflections, nothing, same speed, same pace.\" Bergman said, \"George Sanders was fed up with the whole thing and most of the time he slept. He would come out from his dressing room yawning, do his little bit, and go back to sleep again. He couldn't care less about it; just another bad movie.\" Bergman, new to Hollywood, tried her best, tho she disliked director Van Dyke and tried to get Selznick to have Van Dyke replaced or have herself taken off the film. Selznick would do neither. So Bergman confronted Van Dyke, who was surprised when she told him her complaints. He said, \"Oh! All right. I don't know how, but I will try and change.\" In his review of this film in The New York Times, Bosley Crowther did an extraordinary thing for the time by including a final paragraph in his review which read, \"It has been reported from Hollywood that Mr. Montgomery was compelled to play this role as 'discipline' for some things he said in public about motion pictures. That may be an explanation for the general obtuseness of the film....\" On the set, on the screen, \"Rage in Heaven\" was a bad experience.",
         "I guess I'll be the resident moron of this film's comment section. I liked Rage in Heaven. It was entertaining, interesting, and involving. I realize Robert Montgomery phoned in his role. His complete detachment makes the character evil rather than sick, and one cannot feel sympathy for him, if we were ever supposed to. The biggest problem is that his flat line readings and cool demeanor make it unbelievable that Bergman married a man so completely lacking in self-esteem, charm, and ardor. The very young, pre-superstar Ingrid Bergman is marvelous - very fresh and vibrant in the beginning, her personality becoming more somber after a short time being married to Montgomery. And who can blame her. George Sanders is excellent, his portrayal possessing all the charm and passion Montgomery lacks. As far as this plot being contrived, perhaps, but it was also clever. The original ending of \"Fatal Attraction\" was based on the same idea. Seen in today's modern perspective \"Rage in Heaven\" is most interesting. The obsession that Phillip had for Wade - very bizarre indeed!",
         "A somber-hued melodrama whose psychology is more compelling than its dramaturgy, Rage in Heaven sounds many of the minor-key motifs and dark timbres that would shortly coalesce into the noir cycle. Its most striking aspect has to be its acceptance of its disturbed central character as a given, without attempting to supply a neat, reassuring `explanation.' The story � set in England, for no good reason � opens with a teasing prelude at a French insane asylum. But soon, in London, we meet up with Robert Montgomery as he meets up with old chum George Sanders and whisks him off to the country house of Montgomery's widowed mother (Lucile Watson), who in ailing health has retained the services of a companion (Ingrid Bergman). Though Bergman and Sanders generate some electricity, when he departs she marries Montgomery. This proves ill-advised. Montgomery, who reluctantly has taken charge of the family's steel works, shows himself to be not only incompetent, irrationally jealous and vindictive, but also self-loathing, desperately insecure, and (as it turns out, like his father) suicidal. He requires unquestioned obedience, even at the risk of running his business into the ground � or poisoning his marriage. He lures back Sanders in order to validate his suspicions of an affair between his wife and his best friend but, when no evidence emerges, devises a fiendish plot to ruin all their lives. His plans almost succeed, but for an eleventh-hour deus ex machina, in the person of the head of that sanitarium in the outskirts of Paris. Though somewhat cleverly contrived, the ending remains a contrivance yet doesn't quite invalidate the movie's dark vision (perhaps owing more to Christopher Isherwood, who wrote the screenplay, than to James Hilton's novel). Montgomery elects to play a charming villain, as he did in Night Must Fall, perhaps unsure of just how to depict a deranged psyche (he wasn't far off the mark). Sanders gets wasted as a square-rigger, which was never his long suit. That leaves the radiant Bergman, two years before Casablanca assured her stardom, handed the thankless world of the loyal, longanimous wifey. In this flawed but unsettling and precocious melodrama, it's she who utters the final benediction. That benediction lingers in the mind as an enlightened touch � and a far cry from the black/white mentality of today's thrillers, which view psychological aberration as just a more heinous kind of evil, and so a further justification for triumphantly exterminating the evildoers.",
         "One of James Hilton's lesser novels got a lesser production from MGM with his Day Of Reckoning becoming Rage In Heaven. This has to be one of the few instances where a psychiatrist saves the day. I think it ironic that Robert Montgomery got cast in the lead here against his usual type. It must have been an easier sell to Louis B. Mayer to cast him after having proved his acting chops in Night Must Fall. Playing another charming maniac got Montgomery an Academy Award nomination in that film. So Mayer having been convinced was less reluctant to have him cast here. When we first meet Montgomery we find him inside an insane asylum in France and while his doctor, Oscar Homolka is discussing his case, Montgomery up and escapes from the place. Making it back to Great Britain he goes back to his mother's place and Lucille Watson as the mother welcomes him, not knowing of his hiatus in the booby hatch. She's got a nice new secretary/companion in Ingrid Bergman and Montgomery likes her lot. She likes George Sanders his good friend and incidentally it was Sander's character name under which Montgomery was in the asylum under. Montgomery woos and wins Ingrid, he's now running Watson's factory and that makes him a big man and no doubt helps his cause with Ingrid. Sanders is now working for him. But this Othello has his own Iago inside him provoking the green eyed monster without any outside provocation. When Bergman turns to Sanders after one of Montgomery's inexplicable rages, Montgomery conceives a diabolical plot to frame Sanders for his own murder. That's the best part of the film, there's no way Sanders could have or should have gotten out of it. Especially without Montgomery to be questioned. I liked the fact that both Montgomery and Sanders were playing against type. Sanders is a good guy, one of the few films he's not working any angles. Ingrid was steadfast and loyal, her part's not that much of a stretch for her talents. I won't give away the ending, but let me say it was way too contrived and coincidental. Rage In Heaven does not belong in the top tier of films for any of the three leads.",
         "RAGE TO HEAVEN is an MGM B-film masquerading as an A-film, with a preposterous script and a very detached looking ROBERT MONTGOMERY playing a role he says he was \"forced\" to play. At least INGRID BERGMAN and GEORGE SANDERS do more than walk through their paces. Sanders plays a decent guy, for a change, although most probably the casting would have been better if he had been in the Montgomery role. The story is a triangle involving a man with a past and two people victimized by him being released from an asylum. As it is, this is old-fashioned melodrama with a Gothic touch, which unfortunately went through three directors. Woody Van Dyke was able to finish the film while on a 14 day leave from the Marines, which accounts for the hurried look of the film's last twenty-five minutes in which all of the final incidents are played at a frantic pace. This becomes so annoying that it's hard to judge the film as anything other than a B-film in search of a decent director, a happily cast leading actor and a script that makes sense. Richard Thorpe had to be called in to finish whatever remaining footage Van Dyke did not shoot. ROBERT MONTGOMERY did himself no favor by deciding to play his role by the numbers, just to get even with the studio. The film suffers badly from his lack of participation. If ever an actor phoned in his role, this was it. Worth a look as a curiosity piece--and at least fans of Bergman or Sanders should find their roles satisfying enough. But the absurd abruptness of the final scenes is really disconcerting. Oscar HOMOLKA gets the award for Biggest Ham Acting as a doctor who holds the secret to Montgomery's past. He makes the role a mixture of comic parody and overly theatrical ham--just another factor that throws the whole film off balance.",
         "First, the cast: Robert Montgomery - one of my all-time favorites, does a serviceable job here, although at times, he plays it too flat. This psycho character is very different from the one he played in Night Must Fall (see that film instead), yet at first, he downplays it too much, even when he is supposed to be upset or angry. As the film goes on, his performance gets much better (he pulls off the paranoia and obsession with ease). Montgomery looks a little tired and haggard, but this befits the character, and he works well with both Ingrid Bergman and George Sanders. Montgomery is always interesting to watch, whatever the role, due to his very nuanced performances. Pay particular attention to the way he moves his eyes to convey so much. His role as Philip in Rage in Heaven is no exception. Ingrid Bergman - wow, is she great! Bergman is a very natural actress who rarely puts a foot wrong. Unfortunately, this role is kind of a waste for her, because it mostly consists of reacting to the two male leads. Despite this, every emotion is played to perfection, and her beauty in this film is outstanding. To me, she got a little masculine looking as time went on, but I adore her looks here - it is very easy to see why the men, Philip and Ward, fell in love with her character Stella. To be punny, it is a Stellar performance. Simply but, Bergman is like a breath of fresh air. George Sanders - this is one of the earlier films of his that I have seen. God, he was handsome! I love his voice, too. It was nice to see him in a decent-guy role for a change. I like the fact that both he and Montgomery were playing against type in this movie. He is another actor that never ever gives a bad performance. Plot problems: Too sketchy in some areas, and WAY too `convenient' in others. The ending was particularly guilty of contrivance. A previous reviewer claims that the ending negates the rest of the film - this is not so, but it certainly does it no favors, either. Another problem - WHY was Philip SO SO SO obsessed with and jealous of Ward Andrews (Sanders' character)? The extent of this was not really explained. Also, the `mob scene' was laughable. A three year old would not fear this group!! Oscar Homolka as the doctor might as well have been wearing a clown suit - a farcial, downright silly performance that the director should have reigned in not a little bit - although his scene in the bookstore was very cute. Bottom line: watch it for the acting, but check your faith in a coherent plot-line at the door. p.s.: CATS, beware: Bob Montgomery abuses YET ANOTHER feline in this film!!!!!",
         "\"Rage in Heaven\" belongs to the spate of Freudian movies of the forties: Hitchcock's \"spellbound\" Lang's \"secret beyond the door\" Tourneur's \"cat people\" Stahl's \"leave her to heaven\" Siodmak's \"dark mirror\" ,the list is endless. \"Rage in heaven\" is an excellent underrated thriller.Although Philip's mother part is underwritten ,she predates the Hitchcockian mums ,those of \"Notorious\" \"Strangers on a train\" \"Marnie\" etc.Robert Montgomery whose character is the most interesting portrays a rich kid,probably victim of his over possessive mother -\"he's more attractive than Ward\" - A selfish paranoiac man who will not be satisfied till he destroys everything.His behavior makes sense:the cat,then the best friend (the enemy ,for his wife is in love with him),the wife and finally himself ,the doctor explains. The screenplay might not be thoroughly original,but \"Leave her to heaven\" (1946) borrows Gene Tierney's diabolical suicide from it,and the final search has something of Cornell Woolrich (aka William Irish) ,notably his \"phantom lady\". Three excellent actors,and a gripping story: you will not waste your time."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Old friends Ward and Phillip both become smitten with Phillip's mother's attractive young secretary Stella. But Stella marries Phillip and stands by him as his behavior becomes more and more erratic and his jealousy of Ward increases.",
         "Stella Bergen, the personal secretary and companion to widowed Mrs. Monrell, accepts the marriage proposal of Mrs. Monrell's son, Philip Monrell. Both the proposal and its acceptance are a bit of a surprise since Philip seemed to encourage a relationship between his childhood friend, Ward Andrews, and Stella. Stella seemed equally as interested in pursuing that relationship with Ward. After Stella and Philip get married, Philip assumes the lead management role in the family's steel business, which had previously been run by his mother following his father's death. The way that he runs the business and the marriage bring to the surface insecurities in Philip. Philip's behavior becomes increasingly erratic, which belies the true nature of what Philip's plans are for himself, Ward and Stella. A Dr. Rameau, who knew Philip when Philip was passing through Paris, may be able to shed some light on the proceedings."
      ],
      "budget": 0
   },
   "movielensId": 84691,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1941-03-07",
      "dvdReleaseDate": null,
      "directors": ["W.S. Van Dyke"],
      "runtime": 85,
      "movieId": 84691,
      "title": "Rage in Heaven",
      "mpaa": "",
      "actors": [
         "Robert Montgomery",
         "Ingrid Bergman",
         "George Sanders",
         "Lucile Watson",
         "Oskar Homolka",
         "Philip Merivale",
         "Matthew Boulton",
         "Aubrey Mather",
         "Frederick Worlock",
         "Francis Compton",
         "Gilbert Emery",
         "Ludwig Hardt",
         "George Davis",
         "John Burton"
      ],
      "imdbMovieId": "0034078",
      "originalTitle": "Rage in Heaven",
      "genres": [""],
      "youtubeTrailerIds": ["1O0ZXvkQ0Xs"],
      "plotSummary": "Robert Montgomery plays a jealous man who plots to fake his death and incriminate his wife's suspected lover.",
      "tmdbMovieId": 31324,
      "avgRating": 2.83333,
      "releaseYear": "1941",
      "numRatings": 3,
      "posterPath": "/s2rdNZS8ZIi5wTLWKPY5QVZIeTS.jpg"
   }
}