{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "graduation",
            "id": 3687
         },
         {
            "name": "punch",
            "id": 4359
         }
      ],
      "imdb_id": "tt0036818",
      "video": false,
      "title": "The Punch Bowl",
      "recommendations": [
         6155,
         4645,
         11872,
         9497,
         7281,
         4695,
         67354,
         11869,
         4544,
         852,
         9805,
         5465,
         8366,
         10626,
         11877,
         5999,
         102691,
         37991,
         9547,
         9252
      ],
      "backdrop_path": "/kc4h5di5XGHjC0DB2bCUD2Amfnn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Dr. Johannes Pfeiffer/Hans Pfeiffer",
               "gender": 2,
               "credit_id": "52fe4286c3a36847f8025b8b",
               "name": "Heinz Rühmann",
               "profile_path": "/z40v3xiLAwIKMBUYYh41aXuWmAR.jpg",
               "id": 12745,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Eva Knauer",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b4f",
               "name": "Karin Himboldt",
               "profile_path": "/6NEI5RLpQpU7Jc7ngbheq3CDbp9.jpg",
               "id": 13374,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Marion",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b53",
               "name": "Hilde Sessak",
               "profile_path": "/Judjitj6H3j6AXqpgYZmt7Y0TL.jpg",
               "id": 13375,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Professor Crey, genannt Schnauz",
               "gender": 2,
               "credit_id": "52fe4286c3a36847f8025b57",
               "name": "Erich Ponto",
               "profile_path": "/oWRihwVCrOPvLHrQuR2FCNdiCfB.jpg",
               "id": 13376,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Professor Bömmel",
               "gender": 2,
               "credit_id": "52fe4286c3a36847f8025b5b",
               "name": "Paul Henckels",
               "profile_path": "/zhobicq3xGKwQed7jddckd0sjHl.jpg",
               "id": 13377,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Gymnasialdirektor Knauer, genannt Zeus",
               "gender": 2,
               "credit_id": "52fe4286c3a36847f8025b5f",
               "name": "Hans Leibelt",
               "profile_path": "/5TUZC4mS01QyestHz47o4hzUeyg.jpg",
               "id": 13378,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Oberlehrer Dr. Brett",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b63",
               "name": "Lutz Götz",
               "profile_path": "/lxzG5huoeUj3ko1nIcbTOZWBGmh.jpg",
               "id": 13379,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Rosen",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b67",
               "name": "Hans Richter",
               "profile_path": "/kREYw1p3JElSldqrHellG4XEaog.jpg",
               "id": 13380,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Rudi Knebel",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b6b",
               "name": "Clemens Hasse",
               "profile_path": "/eVS2qqQjxptCVEQrYQZhSjAHdbl.jpg",
               "id": 13381,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Streber Luck",
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b6f",
               "name": "Rudi Schippel",
               "profile_path": "/mrTaiFJBj972iYqwJ72OS7zuBx5.jpg",
               "id": 13382,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Haushälterin bei Crey",
               "gender": 1,
               "credit_id": "55099c0fc3a3682b43003680",
               "name": "Hedwig Wangel",
               "profile_path": "/wL2adQBENLAJ9Me3VHRPt9kFsjF.jpg",
               "id": 28128,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Witwe Windscheidt",
               "gender": 1,
               "credit_id": "55099c2292514130b40034fe",
               "name": "Anneliese Würtz",
               "profile_path": null,
               "id": 1136804,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Frau Direktor Knauer",
               "gender": 1,
               "credit_id": "55099c32c3a3682b46003697",
               "name": "Margarete Schön",
               "profile_path": null,
               "id": 550724,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Herr Oberschulrat",
               "gender": 2,
               "credit_id": "55099c44c3a3682b4c003bdd",
               "name": "Max Gülstorff",
               "profile_path": "/eQK7VtDhbB3dh41bvxpDGOK2q6s.jpg",
               "id": 47213,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Musiklehrer Fridolin",
               "gender": 0,
               "credit_id": "55099c5492514110cc0039b9",
               "name": "Egon Vogel",
               "profile_path": null,
               "id": 50607,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Kastellan Kliemke",
               "gender": 0,
               "credit_id": "55099c7a92514130b400350b",
               "name": "Ewald Wenck",
               "profile_path": null,
               "id": 47132,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Mitglied der Bowlenrunde",
               "gender": 0,
               "credit_id": "55099ca892514110cc0039c4",
               "name": "Albert Florath",
               "profile_path": null,
               "id": 46704,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Mitglied der Bowlenrunde",
               "gender": 0,
               "credit_id": "55099cb5c3a3684a8600082e",
               "name": "Karl Etlinger",
               "profile_path": null,
               "id": 46736,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Mitglied der Bowlenrunde",
               "gender": 0,
               "credit_id": "55099cd8c3a3682b460036aa",
               "name": "Georg H. Schnell",
               "profile_path": null,
               "id": 9843,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Mitglied der Bowlenrunde",
               "gender": 0,
               "credit_id": "55099d1992514110cc0039d2",
               "name": "Georg Vogelsang",
               "profile_path": "/NOzGikpT9tuv6UkagaSZ7rFDWx.jpg",
               "id": 49232,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b75",
               "name": "Helmut Weiss",
               "profile_path": null,
               "id": 13383,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b7b",
               "name": "Heinrich Spoerl",
               "profile_path": null,
               "id": 13384,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b81",
               "name": "Werner Bochmann",
               "profile_path": null,
               "id": 13386,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4286c3a36847f8025b87",
               "name": "Ewald Daub",
               "profile_path": null,
               "id": 13387,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4286c3a36847f8025b91",
               "name": "Heinz Rühmann",
               "profile_path": "/z40v3xiLAwIKMBUYYh41aXuWmAR.jpg",
               "id": 12745,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.224682,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 878,
      "vote_count": 50,
      "budget": 0,
      "overview": "Die Feuerzangenbowle from Director Helmut Weiss is based on the novel by the same name from Heinrich Spoerl and Hans Reimann that has turned into a cult German film. The film tells the story of a writer Johannes Pfeiffer who goes undercover as a student in a high school after his friends told him that he missed out on a great life experience since he was home schooled.",
      "similar": [
         2105,
         9611,
         15037,
         22897,
         9451,
         17130,
         19840,
         10342,
         113947,
         352186,
         26626,
         24021,
         621,
         26688,
         25188,
         51122,
         374458,
         33435,
         376078,
         47817
      ],
      "original_title": "Die Feuerzangenbowle",
      "runtime": 97,
      "poster_path": "/hpnng8FEULQpDmkqQf196jkmNFp.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Deutsche Filmvertriebs GmbH",
            "id": 618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Terra-Filmkunst GmbH",
            "id": 619,
            "origin_country": ""
         }
      ],
      "release_date": "1944-01-28",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Helmut Weiss"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Heinrich Spoerl"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0036818/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMjc2MTI2NF5BMl5BanBnXkFtZTYwODE0Mjc4._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Heinz Rühmann, Karin Himboldt, Hilde Sessak | See full cast and crew »"],
      "reviews": [
         "Die Feuerzangenbowle is based on the familiar and often-filmed story idea of pupils playing various tricks and jokes on their teachers. An easy excuse for an avalanche of slapstick one might think and indeed we get our fair share. The twist in the story is the leader of the pack, the major cause of the teachers' headaches: Johannes Pfeiffer. He is not a real pupil at all, instead a successful playwright with a PhD. One evening at the pub his friends discover that he never went to a school but was educated privately. Their stories of their boyhood years (and a bit too much alcohol) persuade him to see for himself and 'be a boy again'. Die Feuerzangenbowle is the second film version of Heinrich Spoerl's novel. Heinz Rühmann played the lead in both films, which is somewhat surprising as they have been made ten years apart. Therefore he is a bit too old for his role now but still manages to pull it off quite convincingly. The film was made in 1944, so it is a bit astonishing that the Nazi censors were prepared to pass a film with such an anti-authoritarian message. To keep them happy, Spoerl created one character, the teacher Brett, who displays authority and firmness and whom the pupils blindingly obey -- the sort of person you can easily imagine being in charge of an SS regiment. Still, Spoerl uses this very character to deliver a political message: when the teachers discuss how to get hold of the culprit of the most recent outrageous trick, one suggests that \"there is always a 'friend' willing to talk\", a clear reference to the wide-spread culture of denunciation in Nazi Germany. Brett replies \"I hope we don't have any friends like this in our school.\" Die Feuerzangenbowle is very well made and today enjoys a cult status in Germany (the 1944 version that is). However, most of the humour would not travel well at all, especially the clever use of accents and dialects is virtually untranslatable; a non-native speaker -- even somebody with a fair knowledge of German -- would miss most of it when watching the original.",
         "That a over 50 year old movie would make students of all faculties pour into the campus theatre year after year is a phenomenon. The secret of this films huge success is the message which hardly anybody is able to miss - that school in spite of all the hard work was fun! Remembering one's own school time will cause an emotional state of well-being, and there you have it! Aside from these factors, the movie's humor is timeless, the actors were very talented and their characters just wonderfully weird. Many people have seen this movie so often they can speak every line - and with larger audiences, the film is starting to evolve into an interactive experience à la Rocky Horror Picture Show, with the audience shouting at the characters and carrying alarm clocks, candles and flashlights into the theatre to switch on in the exact right moment. If there is one true German cult movie - this is it!",
         "I've just seen this movie with several german friends and, although my German is really poor and there were no subtitles (only a good friend helping me to understand it), I found it quite a sweet classic film which I feel really happy to have discovered. The simple and yet funny story about a man that \"returns\" to childhood in order to make all sorts of jokes to the grownups is just so well carried out that, despite not even being german-speaker, can be easily watched with a smile on the face. Sure enough, most of the jokes can't be understood for non-german speakers (and sometimes not even for german themselves!) but the performers play sincerely great roles and at many times a face is worth a thousand words. To sum up, a film I would like to see once again (I hope next time with subtitles, at least ;) and quite a cult-movie in its home country, where many people watch it as a tradition once a year... It's tender, it's sweet, somehow naïve... Eine wuenderschoene Filme, wuerde ich sagen!",
         "Even though filmed as the second world war came to a close my home country managed to sedate people not on the front yet with this humorous masterpiece that is still astonishing 56 years after its release. if it wasn`t for the nazis, this movie with Heinz Rühmann in his genuine role would have been celebrated world wide right away. it has all the wit of the 'good side' of German culture and somehow manages to leave out anything 'political' by a far cry. just a plain great amusing movie that features infantile friendship and adventure and all the fun of being young while never getting rid of the stains of being a movie people were meant to view to forget the crazy war out there.",
         "Germany was losing the war, its cities were being bombed to smithereens, so it's easy to see why Goebbels felt the need for quality escapist entertainment like this gentle, funny school comedy. Heinz Ruhmann plays a successful writer who was educated by tutors and never attended school, and who decides to return to his hometown disguised as a pupil to find out what he missed. What ensues is a lot of sweet-natured tomfoolery, with lots of tricks played on the teachers - something which nearly got the film banned because of its supposedly 'anti-authoritarian' tendencies. There's no real message except that 'schooldays are the best days of your lives', and perhaps that's its secret - for it remains among the most popular of all film comedies in Germany and is cult viewing around Christmas time. Ruhmann is in his element in this film, but particular mention should go to the wonderful Erich Ponto as the eccentric chemistry teacher, who is quite best thing in the film.",
         "\"Die Feuerzangenbowle\" is an adaption of a novel by Heinrich Spoehrl. And it is perhaps the best comedy which ever was made in Germany. There are many jokes and funny scenes in this movie. For example \"Pfeiffer\" with three \"f\" one before the \"ei\" (or in English \"egg\") and two after the \"ei\". The entire cast is top notch. Heinz Ruehmann is one of my favorite actors. And one of his films \"The Captain of Koepenick\" received an Oscar nomination.",
         "\"Die Feuerzangenbowle\" is absolutly one of the Best Movies ever and the Best German Movie at all. In my personal Ranking the \"Feuerzangenbowle\" is under my TOP 8 Movies. Between \"The Life of Brian\" it's the funniest Movie. It's made during the II. World War near Berlin. At one Time the British and US-Bomber came and at the other Time this Movie was made. Such a funny Movie in such a Dark Time. In the Beginning the Movie was forbidden by the Nazis but the they need every Laugh for the poor German Humans. The Cast of this Movie it outstanding in the German History. There are not only Stars, no - but every Character is perfect casted. The leading Man Heinz Rühmann is the Best Actor in the History of German Movies. And here he has his Best Part before his Character-Time from the End of the 50s to the End of the 60s. He played the leading Role in the Oscar nominated Movie \"The Captain of Koepenick\" and a supporting Role - his only Hollywood Movie (he was too old this Time and don't wanted to leave Germany for longer Time) - Stanley Kramer's \"The Ship of Fools\". The \"Halliwell's\" means, he is Great in this Movie. It's truly sad for non-German speaking Persons that they can't see his Movies (you can but at the most important Countries like USA, UK, Canada, France, Japan and Australia are non-English or non-Motherlanguage not often shown and seen) sorry for my bad English (I learn and try - learning by doing)",
         "It's such a shame that turner classic movies are politically correct against buying the north American rights with subtitles to further explore third Reich cinema on their channel on TCM import. Why? Cause they are afraid because of Hitlers legacy, they are afraid they may not get the audience they hope for.They are afraid that viewers will get mad at Douglass Sirk and Ingrid Bergman for doing anything under Hitler Remember how they reacted against Her and Roberto? they are afraid of that.I think. This is one picture that they should of been already showing on TCM import. This would not offend the target they serve only moderate fans of classic film as much as us fans of history. There is hardly any political propaganda here. I didn't under stand German except for words like \"Pheelite\",.But the plot is the nature of the good old days of high school and it's antics.Mr Heinz Ruhmann portrays a successful person, Johannes Pfiffer, who's at a secret club meeting at a German pub, Three old Elderly men in the back of the pub. Sitting around a big punch bowl drinking possibly hot whiskey or brandy. They are discussing things and secrets,including stale wart character actor Albert Florath.Then comes in Johannes successful joining in the gang. Whether this is a form of masonic organization is not understood.Well they start talking about the good old days in high school. All of a sudden he realizes he has missed the fun of going to high school, since he took private classes.So he decides to fool everyone about his age and go back to high school. This is funny consider he's not a teenager any more and no one seems to question him. He rooms near the school run by Hedwig Wangel, who played Zarah Leander's assistance and friend in The way of Freedom. His girl friend Marion , Played by Hilde Sessack, worries that he has gone so she finds out where he went.The funny thing about this picture besides everyone is younger than Ruhmann and every one hates school. Hans Richter is the worse. There's one moment where he throws a spit ball at Erich Pronto, who plays the teacher,. He then forces all the students to open up their pads to see he did it but the bell rings so he get by.There's a funny antic that Heinz and fellow student , both are adults,Rudi Knebel played by Clemmens Hasse. Where they sneak a sigh in front of the schools before everyone comes to school , claiming that it's closed for the day due to some problem. Everyone believes it.This angers the school faculty . Hannes Falls in love with the daughter,Eva, played by Karen Himbolt, of the Gymnastic Director Zues.Marion finds the redneck town and finds Hannes and tries to convince, after a night of passion, to give all this up. But he changes his mind. He decides to do one big prank for some reason I don't understand. He gets the girls from the neighboring school to get together with the boys at his school dancing in the class.Erich Pronto is over sleeping and late for class.Then he comes in Impersonating the chemistry professor. .Then bad things happen when a visiting district school manager shows up with the faculty . Then he's forced to actually play the professor until then real Pronto shows up. He then admits being a grown up and Lets Zues know he's in love with his daughter. The only confusing part it comes back to the original scene at the bar. Was this a drunken dream?",
         "Classic Heinz Rühmann vehicle with Rühmann very good and funny as Hans Pfeiffer. This is an entertaining film to be sure, but it can not begin to compete with the 1st adaptation of the material (So ein Flegel,. 1934, q.v.); by staying more closely to the original set-up of the story than the first version, the film is also a bit stuffy at moments and hardly more than a series of comic situations. Helmut Weiss' direction is good routine, but misses the talent to make into great comedy. The biggest disappointment may be the main supporting cast with good actors like Erich Ponto and Paul Henckels. I can not know what assignment the director gave them, but they act like hams thereby killing off any humour in their parts; Hans Richter as one of the other pupils did a much better same job in \"Unser Fräulein Doktor\" (1940, q.v.). Also watch for some latent (though by now innocent) Nazi-propaganda here. In a conversation between two teachers, one of the old guard and the other of the new, there is talk of the arrival of new times (\"Die neue Zeit\") when the older one says to the younger that now his time has come with introducing new teaching methods. Too far fetched? In a couple of scenes before this talk we see a disciplined class with the younger teacher saying to Rühmann: Bei mir nicht - Not with me, with the old guard you may do what you want, but not with me, in my class is order (not verbatim). Again remade into a terrible film in 1970 by Helmut Käutner."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Terra-Filmkunst"],
      "summaries": [
         "Hans Pfeiffer and some of his friends are drinking \"Feuerzangenbowle\". Talking about their school-time they discover that Hans never was at a regular school and so, as they think, missed an important part of his youth. They decide to send him back to school to do all the things he never could do before.",
         "A successful writer, home-schooled in his youth, masquerades as a student at a secondary school to experience all the fun and pranks he missed out on."
      ],
      "budget": 0
   },
   "movielensId": 84884,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1944-01-28",
      "dvdReleaseDate": null,
      "directors": ["Helmut Weiss"],
      "runtime": 97,
      "movieId": 84884,
      "title": "The Punch Bowl",
      "mpaa": null,
      "actors": [
         "Heinz Rühmann",
         "Karin Himboldt",
         "Hilde Sessak",
         "Erich Ponto",
         "Paul Henckels",
         "Hans Leibelt",
         "Lutz Götz",
         "Hans Richter",
         "Clemens Hasse",
         "Rudi Schippel",
         "Hedwig Wangel",
         "Anneliese Würtz",
         "Margarete Schön",
         "Max Gülstorff",
         "Egon Vogel",
         "Ewald Wenck",
         "Albert Florath",
         "Karl Etlinger",
         "Georg H. Schnell",
         "Georg Vogelsang"
      ],
      "imdbMovieId": "0036818",
      "originalTitle": "Die Feuerzangenbowle",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Die Feuerzangenbowle from Director Helmut Weiss is based on the novel by the same name from Heinrich Spoerl and Hans Reimann that has turned into a cult German film. The film tells the story of a writer Johannes Pfeiffer who goes undercover as a student in a high school after his friends told him that he missed out on a great life experience since he was home schooled.",
      "tmdbMovieId": 878,
      "avgRating": 3.68,
      "releaseYear": "1944",
      "numRatings": 25,
      "posterPath": "/hpnng8FEULQpDmkqQf196jkmNFp.jpg"
   }
}