{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "oil well",
         "id": 176344
      }],
      "imdb_id": "tt0046425",
      "video": false,
      "title": "Thunder Bay",
      "recommendations": [
         43046,
         53202,
         51476,
         53714,
         27999,
         27263,
         35543,
         36516,
         62648,
         24468,
         27035,
         42295,
         51467,
         129047,
         24790,
         84364,
         59870,
         111066,
         62661,
         74012
      ],
      "backdrop_path": "/webUHBQvaT02D3u492fp9X6lqTP.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53899bc8c3a3680b03000b83",
         "content": "Boiling Oil.\r\n\r\nThunder Bay is directed by Anthony Mann and written by Gil Doud and George W. George. It stars James Stewart, Joanne Dru, Dan Duryea, Gilbert Roland and Jay C. Flippen. Music is by Frank Skinner and cinematography by William H. Daniels.\r\n\r\nOffshore oil drillers set up base at Port Felicity, Louisiana and find the town’s shrimpers are not at all happy about this threat to their livelihood. Conflict and affairs of the heart do follow.\r\n\r\nOne of the eight films that James Stewart and Anthony Mann made together, Thunder Bay was relevant in topicality upon its release, and remains so today. Whilst lacking the psychological smarts that the duo’s Western productions had, it’s a handsome production with the expected qualities in front of and behind the cameras. There’s a lot of talky passages, which given the subject matter pulsing away at the core is understandable, but Mann ensures that action and suspense is never far away. It all builds to a crescendo, with loose ends and quibbles conveniently tied up in a Hollywood bow, but such is the skills of actors and director it rounds out as good and thorough entertainment. 7/10",
         "url": "https://www.themoviedb.org/review/53899bc8c3a3680b03000b83"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Steve Martin",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ebff",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Stella Rigaud",
               "gender": 1,
               "credit_id": "52fe46439251416c9104ec03",
               "name": "Joanne Dru",
               "profile_path": "/f2Zi7xK4mOdQiTkSzIRaAAY7DhS.jpg",
               "id": 30296,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Teche Bossier",
               "gender": 0,
               "credit_id": "52fe46439251416c9104ec07",
               "name": "Gilbert Roland",
               "profile_path": "/ofMih1UHoO2zXXbBhtxRLB66xev.jpg",
               "id": 29273,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Johnny Gambi",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec0b",
               "name": "Dan Duryea",
               "profile_path": "/577hAUPy04u98IwsHKO2rQriJ2e.jpg",
               "id": 64212,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kermit MacDonald",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec0f",
               "name": "Jay C. Flippen",
               "profile_path": "/gioapO1wsvHUH9cLmlxsWK6HaSx.jpg",
               "id": 3338,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Francesca Rigaud",
               "gender": 1,
               "credit_id": "52fe46439251416c9104ec13",
               "name": "Marcia Henderson",
               "profile_path": "/tNyKVsHmXiwFnzpFbWXyzOo6oHK.jpg",
               "id": 101176,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Phillipe Bayard",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec17",
               "name": "Robert Monet",
               "profile_path": null,
               "id": 117520,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dominique Rigaud",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec1b",
               "name": "Antonio Moreno",
               "profile_path": null,
               "id": 30555,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Rawlings",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec1f",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Sheriff Antoine Chighizola",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec23",
               "name": "Fortunio Bonanova",
               "profile_path": "/3oTAUQDI95m13EmADN6HI9pws8v.jpg",
               "id": 14979,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Louis Chighizola",
               "gender": 2,
               "credit_id": "52fe46439251416c9104ec27",
               "name": "Mario Siletti",
               "profile_path": null,
               "id": 87369,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46439251416c9104ebf5",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46439251416c9104ebfb",
               "name": "Gil Doud",
               "profile_path": null,
               "id": 97651,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.864286,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37380,
      "vote_count": 9,
      "budget": 0,
      "overview": "Shrimpers and oilmen clash when an ambitious wildcatter begins constructing an off-shore oilrig.",
      "similar": [
         41800,
         76140,
         268042,
         48484,
         135988,
         489650,
         29004,
         172165,
         129875,
         208401,
         143304
      ],
      "original_title": "Thunder Bay",
      "runtime": 103,
      "poster_path": "/kRgeDeIbxeVSkITI85NIgY77LYY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1953-05-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Gil Doud",
         "John Michael Hayes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046425/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzAwMjU1ODMxM15BMl5BanBnXkFtZTcwOTk0MzIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Stewart, Joanne Dru, Gilbert Roland | See full cast and crew »"],
      "reviews": [
         "Thunder Bay is an anomaly, a pedantic film on a subject seldom dealt with in the movies, the conflict between businessmen, whose ambitions will cause great change in the local landscape, and the locals, who want things to remain as they are. In this case it's oil drillers versus shrimp fisherman in the Louisiana of the early 1950's. The conflict at times seems almost Marxian, with James Stewart's hardheaded, no-nonsense outsider going up against ragin' Cajun Gilbert Roland, a far more charming and sympathetic figure. Rather than shy away from class conflict, the movie confronts the issue repeatedly, in a variety of ways, and builds up a good deal of tension along the way, as Stewart's compulsive, oil drilling loner, increasingly isolated, takes on the entire community. There's a good deal of fifties sociology here, with the modern, inner-directed Stewart against the tradition-centered fishing people. Neither side understands the other, as one can well see how these local folks would view Stewart as an uncaring and forbidding figure, the embodiment of alien, big city values. On the other hand these people are a rough and tumble lot, uneducated, clannish and utterly without curiosity. It's easy to see how an educated man might look down on them. There's a good deal of action along the way, and some fist-fights. At a time when many Americans still thought of themselves in terms of class, and with the Depression fresh in everyone's minds, it was rather bold of director Anthony Mann to take on this subject from a middle of the road, basically Republican (but not right wing) perspective. In this respect the movie, which came out in the first year of the Eisenhower administration, heralded a new era of compromise, with the promise of better things yet to come. As to which side is right, well, you be the judge. I'm still thinking this over.",
         "\"Thunder Bay,\" strictly a man's picture, may be considered a Western, with boats and oil substituting for horses and guns, on the Gulf Coast off Louisiana... Stewart and Mann considered as regular partners begun for what they thought were fresh pastures... Stewart is properly tough, wild and laconic as the enthusiastic engineer convinced that oil reserves might lie beneath the Louisiana waters, and Duryea have come up with a drilling platform that resists the fury of even the worst storms... Away they go to find offshore oil, with the encouragement of Jay. C. Flippen willing to ramp up, pumping money on exploration... The drilling clashes with the plans of shrimp fishermen who are opposing the test on the fishing grounds... It may have an adverse affect on their marine life... Duryea adds more complications to the action-drama by falling in love with the girlfriend of one of the fishermen, whose sister, Joanne Dru (echoing the sentiments of Janet Leigh in \"The Naked Spur\") is putting her eyes on Stewart... But the machinations of the two girls seem worthless material against the struggles between the guys, which are actually the main force of the movie... After several obstacles, violent storms, romantic distrust, and the retraction of magnate Flippen, who has lost faith in the project, all ends wonderfully when Stewart (hard to believe) discovers not only oil but an abundant source of shrimp... Subsequently the lovers pair off, and the former enemies become allies as they share their beneficial trades... Photographed in Technicolor, \"Thunder Bay\" is a well-produced movie, an entertaining piece of film making...",
         "From the director/actor team that brought us many of the great westerns of the 1950s, Thunder Bay teams Anthony Mann and James Stewart in what could easily be called a modern western. Stewart plays Steve Martin, an oil driller with a dream. His goal is to build an off-shore drill in the Gulf of Mexico. He receives the financial backing of oil tycoon Kermit MacDonald (Jay C. Flippen) and begins work. He sets out from a small fishing community that has been on hard times lately. They are leery of Stewart and his partner Johnny Gambi (Dan Duryea) at first, and become more so when the two start blasting in the middle of their shrimp beds. To make matters worse, Johnny falls in love with a local girl who is already engaged to one of the fisherman. Tension builds as the fishermen continue to have bad luck and the drill progresses. One disgruntled fisherman attempts to blow up the drill platform during the middle of a hurricane. Stewart, who had stayed on the platform to see how it would withstand the storm, catches him just in time to save it. A slippery fight ensues, during which the fisherman and Stewart fight not only each other, but a constant onslaught of water. As in the typical western, the hero (Stewart) wins and the villain dies. The fight scene is one that dates the film. The special effects seem very archaic in wake of such recent films as Titanic and The Perfect Storm. Other than that, the film presents an interesting story on what, at the time, was a very taboo subject. Aware of the controversy the film would stir-up, the film was carefully crafted to prove that two industries could exist side by side. As the fishermen resolve to destroy the well, Stewart discovers that his well has uncovered a new bed a shrimp. When the fishermen learn this they decide that the well is indeed an asset to their community and all live happily ever after. As usual Stewart steals the film. His acting is subtle and believable. The simple story did not push him as an actor, but he is properly harried, tough and laconic. Overall this is an interesting film, enhanced by the beautiful location shots filmed in Technicolor by William Daniels. Truly, an intriguing and different take on the western genre.",
         "In 1946, the drifters Steve Martin (James Stewart) and his partner and friend Johnny Gambi (Dan Duryea) travel to Port Felicity in Lousianna completely broken to meet the investor Kermit MacDonald (Jay C. Flippen). Steve dreams on building an offshore drilling barge to explore oil in the Gulf of Mexico and MacDonald, who is an entrepreneur and also a dreamer, decides to finance them but gives a short schedule to find oil. They initially hire the fishing vessel of skipper Dominique Rigaud (Antonio Moreno) since the fishermen are having difficulties to catch shrimps. Steve and Johnny try to befriend the locals but when they use dynamite to locate oil, the population turns against them. Meanwhile Johnny dates the younger daughter of Dominique, Francesca (Marcia Henderson), while her older sister Stella Rigaud (Joanne Dru) feels attraction for Steve, but she rejects him since she is a wounded woman with a past. Steve, Johnny and their crew need to face the hostility and sabotage from the locals and also a hurricane while searching for the valuable oil. \"Thunder Bay\" is an entertaining romantic adventure that takes place in the period of the beginning of exploration of oil in the Gulf of Mexico and shows the friction between the local fishermen and the oilmen. The plot is corny, with a feel-good conclusion but James Stewart is always an attraction. Further, for those that work in the oil business, it is great to see the early period of offshore exploration of oil. My vote is seven. Title (Brazil): Not Available",
         "Some of James Stewart's post war films are about a man following a vision. In Spirit of St. Lous it's about flight, in Strategic Air Command it's about air defense, in Carbine Williams it's about making a new kind of rifle. Here in Thunder Bay it's about oil under the ocean and how to get it out. Stewart and buddy Dan Duryea invest all their own money in the design of a platform for ocean drilling and think the delta country in Louisiana is where oil is to be found. Stewart and Duryea meet all kinds of opposition from the French cajun shrimp fisherman in the area. And complicating the picture is a pair of sisters Joanne Dru and Marcia Henderson who fall for our heroes. At the time of Thunder Bay's production and release, offshore oil drilling was a big controversy. Not over the environmental impact, but over whether the states or the federal government would get the revenue. The states involved with offshore oil fought for and got a 12 mile limit in terms of taxable revenue. Pocketed a lot of tax dollars because of it. Thunder Bay mentions the environmental impact as it relates to the shrimp fisherman. But it carefully skirts any conclusions either for the oil men or the fishermen. We've seen enough oil accidents at sea since Thunder Bay was made to know what the impact is. We also know how important oil is to our nation and the world. Anthony Mann as director provides us no answers. My guess is he was primarily interested in making a film that entertains more than enlightens. The cast is a gifted group of players who do just that. Gilbert Roland as one of the leaders of the shrimp fishermen is good as he always is. One thing that does surprise me. Dan Duryea has not always played bad guys in film, but he usually does. Usually when he gets involved with a woman she regrets it. I was expecting him to walk out on Marcia Henderson and do her wrong through out the film. Was I ever surprised when he actually marries her. Also in a key scene he gives Stewart a strong does of common sense medicine at a time he sorely needed it and proves to be someone who saves the situation for the oilmen at a critical point. You won't find any thought provoking questions raised about oil or the environment here, but Thunder Bay is decent entertainment if wishy washy on the issues.",
         "Adventure film by Anthony Mann. It is based on an argument of John Michael Hayes, an idea inspired by George W. George and George F. Slavin. Shooting in Morgan City (Louisiana, USA). Produced by Aaron Rosenberg (\"Winchester 73\", 1950), is projected to \"premiere\" the 21-V-1953 (USA). The action takes place in the imaginary town of Puerto Happiness (Louisiana) and surroundings, in July 1946. To place two former marines arrive graduates after completion of WWII. \"Steve Martin\" (James Stewart), engineer, and \"Johnny Gambi\" (Dan Duryea) want to make a fortune with the dream of finding oil in the subsoil. It is one of the eight partnerships of Mann and James Stewart and the first of three works that are \"westerns\". It combines the resources of \"western\" and the thriller for a unique result. Oil prospectors serve as the ancient livestock farmers faced, argumentative basis of many \"westerns.\" Some symbolize progress and other traditions, old customs, attachment to routines of the past and the dimensions of a world organized on a human scale, but with problems of competitiveness. Mann story printed at a sustained level of tension that captivates the viewer's attention and provides a pleasant entertainment. He uses natural elements (storm), sabotage attempts, time constraints, lack of cash, prejudice, opportunism, misunderstandings, jealousy, revenge, ambition, rivalry, idealism, and others to provide the work of a dense richness varied narrative. The special effects are elaborate and provided the charm of traditional bill. The adventurous spirit of the characters, especially \"Steve Martin\" is developed with conviction and skill. The action scenes were shot and mounted with fervor. Music, Frank Skinner (\"Bend of the River 1952), is string orchestra, percussion and metal.\" Tittle Main \"provides the central melody and a summary of the idyllic passages (flutes), romantic (violins) Action (trumpets), dramatic (low brass) and struggle (percussion) that develop on the themes of \"Stella\", \"Francesca,\" \"Stella and Steve\", \"Storm\", etc.. Photography by William H. Daniels (\"Ninotchka,\" 1939), director of photography preferred Greta Garbo, uses a non-saturated Technicolor of intermediate shades of neutral harmonies and contrasts of a powerful chiaroscuro. Associate foregrounds very broad perspective depth.",
         "Thunder Bay is directed by Anthony Mann and written by Gil Doud and George W. George. It stars James Stewart, Joanne Dru, Dan Duryea, Gilbert Roland and Jay C. Flippen. Music is by Frank Skinner and cinematography by William H. Daniels. Offshore oil drillers set up base at Port Felicity, Louisiana and find the town's shrimpers are not at all happy about this threat to their livelihood. Conflict and affairs of the heart do follow. One of the eight films that James Stewart and Anthony Mann made together, Thunder Bay was relevant in topicality upon its release, and remains so today. Whilst lacking the psychological smarts that the duo's Western productions had, it's a handsome production with the expected qualities in front of and behind the cameras. There's a lot of talky passages, which given the subject matter pulsing away at the core is understandable, but Mann ensures that action and suspense is never far away. It all builds to a crescendo, with loose ends and quibbles conveniently tied up in a Hollywood bow, but such is the skills of actors and director it rounds out as good and thorough entertainment. 7/10",
         "First I would like to say I liked this film. It deals in a simplistic way with a complex subject which is the impact of the search for oil in a fishermen's habitat. There are two moments in the film which show changes in attitudes which are too fast to be accepted by the spectator, first when Joanne Dru declares her love for James Stewart and second when the fishermen who came to fight with the men in the platform decide to go away after they strike oil. It is good to see three men who were responsible for the successful Winchester 73 together again. A beautiful and mature Joanne Dru is the woman trying to prevent her sister Marcia Henderson from falling in love with Dan Duryea, because she made a mistake in the past. Stewart and Duryea are desperately trying to find the oil before the money finishes. Even though this is a minor work by Anthony Mann he knows how to tell a story and keep you entertained.",
         "Steve Martin, a man pursuing a dream of finding oil in the Gulf of Mexico, had no idea what he would be getting into when he and his partner, Johnny Gambi arrived at the sleepy fisherman town in Louisiana to meet Kermit McDonald, the head of a firm at the brink of bankruptcy. The new arrivals are clearly not welcome by the small fishing community, suffering from bad years for the lack of shrimp, their principal source of income. Afraid of the way Martin will change the source of their livelihood, create an unforeseen animosity among the oil people and the locals. The situation escalates when Johnny Gambi falls in love with the daughter of a well liked man. \"Thunder Bay\", a 1953 Universal picture, was seen recently on a cable channel. Directed by Anthony Mann, the film keeps the viewer involved, as the action keeps building up. The enactment of a storm in the Gulf area looks real, even though special effects then, were not what they are today. Thanks to Mr. Mann and his crew, things keep moving at a good pace, building on the strength of a dire situation and a deadline for finding the oil. James Stewart does not disappoint with his Steve Martin. After all, Mr. Stewart always delivered, as is the case here. Dan Duryea playing against type, is fun to watch. Joanne Dru has some good moments as Stella. Gibert Roland appears as a shrimp boat owner.",
         "Jimmy Stewart proves in this film he can bring something to even an average script by playing his role powerfully. This battle between shrimp fishermen and oilmen does not work with Stewart. This one is prime Stewart. He has solid directing and Joane Dru plus Harry Morgan head a solid support cast. Still, while the script is a bit weak, Stewart takes this movie and makes it better than it should have been. I can't see another actor in the role of the oilman bringing this one in. The was one of the earlier films where oilmen and the environment are addressed. While it is a little weak on the conflict, the actual facts on this issue are still not addressed properly now. Men and technology have to co-exist. One side or the other is not right as we can not afford to get out of the middle on these types of issues. While the environment is the most important issue, going to either extreme will kill people. It does not matter if the polluter kills people or the environmentalist does, murder is murder. When Stewart draws a line in the sand, as he does here, he brings something special to the table. That something special is what we need more of. It takes the good drama of a film like this to bring that out."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "In 1946, ex-Navy engineer Steve Martin comes to a Louisiana town with a dream: to build a safe platform for offshore oil drilling. Having finessed financing from a big oil company, formerly penniless Steve and his partner Johnny are in business...and getting interested in shrimp-boat captain Rigaud's two lovely daughters. But opposition from the fishing community grows fast, led by Stella Rigaud. Other hazards include sabotage, a hurricane...and a treacherous board of directors.",
         "In 1946, the drifters Steve Martin (James Stewart) and his partner and friend Johnny Gambi (Dan Duryea) travel to Port Felicity completely broken to meet the investor Kermit MacDonald (Jay C. Flippen). Steve dreams on building an offshore drilling barge to explore oil in the Gulf of Mexico and MacDonald, who is an entrepreneur and also a dreamer, decides to finance them but gives a short schedule to find oil. They initially hire the fishing vessel of skipper Dominique Rigaud since the fishermen are having difficulties to catch shrimps. Steve and Johnny try to befriend the locals but when they use dynamite to locate oil, the population turns against them. Meanwhile Johnny dates the younger daughter of Dominique, Francesca, while her older sister Stella Rigaud fells attraction for Steve, but she rejects him since she is a wounded woman with a past. Steve, Johnny and their crew need to face the hostility of the locals, hurricane and sabotage from the locals.",
         "Shrimpers and oilmen clash when an ambitious wildcatter begins constructing an off-shore oilrig."
      ],
      "budget": 0
   },
   "movielensId": 84948,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-05-21",
      "dvdReleaseDate": "2007-06-12",
      "directors": ["Anthony Mann"],
      "runtime": 103,
      "movieId": 84948,
      "title": "Thunder Bay",
      "mpaa": "",
      "actors": [
         "James Stewart",
         "Joanne Dru",
         "Gilbert Roland",
         "Dan Duryea",
         "Jay C. Flippen",
         "Marcia Henderson",
         "Robert Monet",
         "Antonio Moreno",
         "Harry Morgan",
         "Fortunio Bonanova",
         "Mario Siletti"
      ],
      "imdbMovieId": "0046425",
      "originalTitle": "Thunder Bay",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "bK5v4gxi5hM",
         "77TjvFnqphY"
      ],
      "plotSummary": "Shrimpers and oilmen clash when an ambitious wildcatter begins constructing an off-shore oilrig.",
      "tmdbMovieId": 37380,
      "avgRating": 3,
      "releaseYear": "1953",
      "numRatings": 2,
      "posterPath": "/kRgeDeIbxeVSkITI85NIgY77LYY.jpg"
   }
}