{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cooking",
            "id": 1918
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "family dinner",
            "id": 9848
         },
         {
            "name": "old age romance",
            "id": 222963
         },
         {
            "name": "history lesson",
            "id": 237396
         }
      ],
      "imdb_id": "tt0071680",
      "video": false,
      "title": "Italianamerican",
      "recommendations": [
         46595,
         64291,
         20361,
         33470,
         128442,
         51929,
         48717,
         5804
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [{
         "author": "Satch the Cineaste",
         "id": "598e7d3f925141670b0061a7",
         "content": "Italianamerican is a 1974 documentary, not even an hour long, wherein acclaimed director Martin Scorsese interviews his parents, Catherine (she played Tommy DeVito's mother in Goodfellas) and Charles (he played Henry Hill's cellmate in the same film), forming an interesting time capsule of the Italian-American experience. Scorsese's parents relate detailed accounts of being Sicilian immigrants in New York City, their family lives, and \"the old country\" after the war. This is a very talking heads-ish doc with numerous still photos and a bit of footage interspersed in it. However, Catherine has a lot of personality, whereas Charles takes awhile to open up to the camera(s?). Oh, Catherine shows us how to make meatballs, and if the viewer needs more info, a complete recipe is given at the end of the film's credits!\r\n\r\nThis is really necessary viewing for any fan of Scorsese's. It's available to watch at Youtube.",
         "url": "https://www.themoviedb.org/review/598e7d3f925141670b0061a7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe48d59251416c750b4adf",
               "name": "Catherine Scorsese",
               "profile_path": "/rXFjIQVimKotQUtXwVNGg7XVMeW.jpg",
               "id": 11483,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4ae3",
               "name": "Charles Scorsese",
               "profile_path": "/tBOxAaaV7sPGekk6pBdw59tv8eE.jpg",
               "id": 1006721,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself (uncredited)",
               "gender": 2,
               "credit_id": "599222d2925141046a0050cc",
               "name": "Martin Scorsese",
               "profile_path": "/4Xwx5XL1RJj0JQmEo8Fhr6nkpOg.jpg",
               "id": 1032,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4adb",
               "name": "Martin Scorsese",
               "profile_path": "/4Xwx5XL1RJj0JQmEo8Fhr6nkpOg.jpg",
               "id": 1032,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "598e7fb8c3a36874730063f2",
               "name": "Mardik Martin",
               "profile_path": null,
               "id": 2554,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "598e8024925141670b00658d",
               "name": "Lawrence D. Cohen",
               "profile_path": null,
               "id": 27767,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5992232ac3a36823c90050ea",
               "name": "Alec Hirschfeld",
               "profile_path": null,
               "id": 52192,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59922387c3a368235900525b",
               "name": "Elaine Attias",
               "profile_path": null,
               "id": 1869708,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "599223bd92514104480052dd",
               "name": "Saul Rubin",
               "profile_path": null,
               "id": 1869709,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59937646c3a3687eef005824",
               "name": "Lee Osborne",
               "profile_path": null,
               "id": 113450,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 2,
               "credit_id": "5994b85d92514107c8001530",
               "name": "Bert Lovitt",
               "profile_path": null,
               "id": 2046,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5995240a9251410775009bf0",
               "name": "Dale Bell",
               "profile_path": null,
               "id": 1871117,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.817888,
      "production_countries": [],
      "id": 91459,
      "vote_count": 15,
      "budget": 0,
      "overview": "Filmmaker Martin Scorsese interviews his mother and father about their life in New York and family history back in Sicily.",
      "similar": [
         56224,
         19913,
         2062,
         4995,
         11615,
         371638,
         9718,
         24803,
         10065,
         9445,
         705,
         9008,
         22302,
         411019,
         83899,
         5825,
         58233,
         3638,
         18183,
         185460
      ],
      "original_title": "Italianamerican",
      "runtime": 49,
      "poster_path": "/tjgdUbhf4e6SsBQfYl4IaczRNoR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1974-01-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Scorsese"],
      "runtime": 49,
      "synopsis": null,
      "writers": [
         "Lawrence D. Cohen",
         "Mardik Martin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071680/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0NDM3NDA4Nl5BMl5BanBnXkFtZTcwMDIxMTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Catherine Scorsese, Charles Scorsese, Martin Scorsese | See full cast and crew »"],
      "reviews": [
         "I recently read a pretty vicious attack on Scorsese in an excellent evangelical periodical, Books and Culture. It claimed Scorsese is, in a word, bloodthirsty, and still a street punk at heart.Granted, Scorsese has done his share of bloody films, but the violence which obsesses him isn't PHYSICAL, its emotional. In addition, Scorsese isnt simply obsessed with blood..hes obsessed with honor, tradition,and family. A clue to the shallowness of this critique of Scorsese could be found in the fact that the author actually thought Age of Innocence was just a studio assignment,which Scorsese agreed to do reluctantly. In fact, Scorsese obsessed over Wharton's novel for a decade after his pal, Jay Cocks, gave it to him. Everyone of Scorseses critics should watch this heart-felt, tender, and utterly bloodless film. I really hope he finally gets around to doing his long-planned feature film about his parents courtship,and his own boyhood in little Italy. P.S.the film also inspired me to buy The Scorsese Family cookbook!",
         "I got to see a clip of this documentary when Martin Scorsese came to Providence, Rhode Island to accept an award on behalf of Brown University. We got to see a small clip from every directed film that Scorsese had made in his 40 plus year career. Out of all the films, Italianamerican got the biggest laughs and the longest applause. Having been the only Italian and the only person who did not attend Brown University that got into Brown's auditorium (the security was terrible) to see Scorsese, I enjoyed the realism that Scorsese captured by watching his parents be themselves in front of the camera. All the other Irish people who attended the event enjoyed the film as well, but not as much as me.",
         "Like someone opening up a family scrapbook or putting on a video from footage you haven't seen in years, Italian/American is Martin Scorsese's personal look at his family, most particularly his parents Catherine and Charlie. Both have had memorable bits in his films (Goodfellas being their prime, as Catherine was Pesci's mother and Charlie the onion-cooking prisoner in jail), but are also willing to be on-screen for a kind of personal inquisition from Martin about the family's history. We learn about the ancestry of the Scorseses, on both sides, and how this influence came into the family. At times, strangely in such a short amount of time, the 'home video' factor is actually a little boring, as it would be in real life. Yet a fascination remains with these people, and the director's own deep interest in it (he references the family's history as well in My Voyage to Italy). A highlight actually occurs in the end, as Catherine offers up her recipe for tomato sauce! For Scorsese die-hards a must-see; a curiosity for anyone else interested.",
         "Martin Scorsese's \"Italianamerican\" is a documentary, really a home movie in which the legendary director sits down with his parents and listens to them reminisce about their experiences of growing up and coming to America. This is a beautiful, effortless film by the greatest director of all-time. It's charming, and light-hearted, and so familiar you will be able to relate to his parents whatever your ethnic background. As an Italian-American myself I have to admit it was like watching one of my own home movies. My grandparents were just like Charles & Catherine Scorsese... my grandmother taught me how to make sauce just like Marty's mother does in the movie. Everything about them- the look of their apartment, the way they speak and argue- made me nostalgic for my childhood days. At one point Catherine is in the middle of relating one of her stories and you can spot Marty in the foreground picking at the leftovers in the salad bowl... film can be this low-key, this unassuming, and be just as moving as scripted studio fare. Oh, for days gone by...",
         "The beginning of Martin Scorsese's career had much to do with his urge to portray the Italian-American Roman Catholic experience. Who's That Knocking at My Door and Mean Streets, for instance, are not just films about low-level hoods getting into trouble but on a more profound level dealing with the virtually reflexive affectations born out of their culture, heritage and masculinity complexes. One can see these movies over and over again and discover an undertone never before realized, because is not just Scorsese's interest in the subject but his lifelong saturation in it that gave them such endless dimensions and jittery spirit. Italianamerican, shot after returning from Hollywood to rediscover his ethnic roots, whether or not this home movie of sorts has the same vibrancy or histrionics as the director's features, is the last necessary word on the subject. Any vagueness in imagining the look and feel of the Italian-American middle-class Roman Catholic existence will be enriched by this 50-minute homemade doc. The Scorseses talk about their experiences as Italian immigrants in New York among other things, while having dinner at their flat on Elizabeth Street. It is purely incidental that Scorsese's father Charles is quiet much of the time, guarded, slowly growing comfortable with the camera, while mother Catherine is with no trouble at all completely her zestful self. Just as if the director had taken us along while visiting his parents, they discuss, with little apparent preparation, the family's origins, their ancestors, life in post-war Italy and the burdens of poor Sicilian immigrants in America struggling to acquire livelihood and earn enough to support their families. She also instructs how to cook her meatballs. If you misunderstand her instruction at all, don't worry; the recipe's in the credits. Italianamerican is very, well, easy, but it's one of the most endearing things a director has ever done. He shares his parents with us, his old home, the stories that brought him here. The quirks of his parents remind us of those of our own parents. It is pleasant just simply to watch two people who are never afraid to pick a fight with each other, have their many clashing opinions and have learned to let it all slide, to live with each other in peace. Their hostility is not hostility to them; it's just how they talk to each other.",
         "Italianamerican (1974) *** (out of 4) Martin Scorsese short has him and a film crew talking with his parents about their history in America. The premise of this thing doesn't sound too interesting but Scorsese's parents are great storytellers and that keeps this 50-minute film moving quite well. Scorsese's father is very funny in his storytelling and his beliefs and without question he's the highlight. Turner Classic Movies shows this every once in a while but you can also find it on a R2 disc but I'm not sure if that's official or not."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["National Communications Foundation"],
      "summaries": ["Martin Scorsese interviews his mother and father about their life in New York City and the family history back in Sicily. These are two people who have lived together for a long time and know each other very well. They have retained individual identities and differing opinions, yet have found a way to live with each other, and both are fascinating story-tellers."],
      "budget": 0
   },
   "movielensId": 84989,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-01-01",
      "dvdReleaseDate": null,
      "directors": ["Martin Scorsese"],
      "runtime": 49,
      "movieId": 84989,
      "title": "Italianamerican",
      "mpaa": "",
      "actors": [
         "Catherine Scorsese",
         "Charles Scorsese",
         "Martin Scorsese"
      ],
      "imdbMovieId": "0071680",
      "originalTitle": "Italianamerican",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Filmmaker Martin Scorsese interviews his mother and father about their life in New York and family history back in Sicily.",
      "tmdbMovieId": 91459,
      "avgRating": 3.39474,
      "releaseYear": "1974",
      "numRatings": 19,
      "posterPath": "/tjgdUbhf4e6SsBQfYl4IaczRNoR.jpg"
   }
}