{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "grandparent grandchild relationship",
            "id": 1158
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "interracial relationship",
            "id": 10131
         },
         {
            "name": "riverboat",
            "id": 158244
         },
         {
            "name": "reconciliation",
            "id": 163976
         },
         {
            "name": "showboat",
            "id": 165871
         },
         {
            "name": "miscegenation",
            "id": 165872
         },
         {
            "name": "paddlewheel boat",
            "id": 165875
         }
      ],
      "imdb_id": "tt0044030",
      "video": false,
      "title": "Show Boat",
      "recommendations": [
         33738,
         43517,
         43514,
         25209,
         36488,
         38471,
         17352,
         27686,
         43029,
         28658,
         28100,
         38472,
         38716,
         50926,
         38463,
         38470,
         43810,
         33394,
         38890,
         26483
      ],
      "backdrop_path": "/aAxKt6BwZ25CqWJPuDnZhgCjLvf.jpg",
      "revenue": 11000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gaylord Ravenal",
               "gender": 2,
               "credit_id": "52fe474b9251416c7509434b",
               "name": "Howard Keel",
               "profile_path": "/vzLs3LCtv3QkWVg0pYuXLIZp6zs.jpg",
               "id": 39601,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Magnolia Hawks",
               "gender": 1,
               "credit_id": "52fe474b9251416c7509434f",
               "name": "Kathryn Grayson",
               "profile_path": "/nQMdc5MqaePfSE7tmtiIaLGUA6X.jpg",
               "id": 82407,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julie LaVerne",
               "gender": 1,
               "credit_id": "52fe474b9251416c75094353",
               "name": "Ava Gardner",
               "profile_path": "/qrMGSjgI4tpJ3c7ZEjsIMMFDGuR.jpg",
               "id": 25787,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cap'n Andy Hawks",
               "gender": 0,
               "credit_id": "52fe474b9251416c7509435d",
               "name": "Joe E. Brown",
               "profile_path": "/sFU0iVNQrDRA5TYi3WJQHoAbUya.jpg",
               "id": 3156,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ellie May Shipley",
               "gender": 1,
               "credit_id": "52fe474b9251416c75094361",
               "name": "Marge Champion",
               "profile_path": "/cK3eln8DUdZ6olJ8LfH30j94zu6.jpg",
               "id": 148669,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Frank Schultz",
               "gender": 2,
               "credit_id": "52fe474b9251416c75094365",
               "name": "Gower Champion",
               "profile_path": "/lzFAobSmHlm51Q36ENEAiAPk62W.jpg",
               "id": 118222,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Steven Baker",
               "gender": 2,
               "credit_id": "52fe474b9251416c75094369",
               "name": "Robert Sterling",
               "profile_path": "/1hpbGYpuoMuNSw8eHkcemGdLSaZ.jpg",
               "id": 22091,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Parthy Hawks",
               "gender": 1,
               "credit_id": "52fe474b9251416c7509436d",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Racetrack spectator",
               "gender": 1,
               "credit_id": "52fe474b9251416c75094389",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Pete",
               "gender": 2,
               "credit_id": "555070f8c3a368426f000467",
               "name": "Leif Erickson",
               "profile_path": "/e6jUlzMj1S0lf3M6fbDCGcq10M3.jpg",
               "id": 9865,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Joe",
               "gender": 0,
               "credit_id": "5550710c9251416a93002154",
               "name": "William Warfield",
               "profile_path": null,
               "id": 1238069,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Chorus Girl (uncredited)",
               "gender": 1,
               "credit_id": "555071319251416a93002180",
               "name": "Linda Christian",
               "profile_path": "/pADsMTftEn3AZcomjKOkrSu0j1H.jpg",
               "id": 117112,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Cameo McQueen (uncredited)",
               "gender": 0,
               "credit_id": "55507186c3a368426f0004c4",
               "name": "Adele Jergens",
               "profile_path": "/54sawiD0U5Vvw0Y9rjymyeebOZT.jpg",
               "id": 34437,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Seamstress (uncredited)",
               "gender": 1,
               "credit_id": "555071a5c3a36834e1000885",
               "name": "Anna Q. Nilsson",
               "profile_path": "/tRFgifZr8gKPvAHNRE8SKof99GX.jpg",
               "id": 8638,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Drunk (uncredited)",
               "gender": 2,
               "credit_id": "555071d9c3a3687f63004ff7",
               "name": "Bert Roach",
               "profile_path": "/pbqOEk3wSPJH7XZWEUp1UkZ0cDP.jpg",
               "id": 29987,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Sheriff Ike Vallon (uncredited)",
               "gender": 2,
               "credit_id": "55507205c3a3687f63005017",
               "name": "Regis Toomey",
               "profile_path": "/wdcVhuLj0OzaEsgumhRcrMtbfq8.jpg",
               "id": 22093,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c75094359",
               "name": "George Sidney",
               "profile_path": "/t5NzhZ8yYL3hDMm5mGNC7t97qSk.jpg",
               "id": 21506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c75094373",
               "name": "John Lee Mahin",
               "profile_path": null,
               "id": 29618,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c75094379",
               "name": "Jerome Kern",
               "profile_path": null,
               "id": 975566,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c7509437f",
               "name": "Oscar Hammerstein II",
               "profile_path": null,
               "id": 98751,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 1,
               "credit_id": "52fe474b9251416c75094385",
               "name": "Edna Ferber",
               "profile_path": null,
               "id": 18739,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "582930fa9251417b23031d85",
               "name": "Charles Rosher",
               "profile_path": null,
               "id": 9080,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5844a314c3a36844df00f1d1",
               "name": "Arthur Freed",
               "profile_path": "/dzPxN7pBVeSgW46YEOuCzcDbIv2.jpg",
               "id": 9055,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.116513,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17820,
      "vote_count": 21,
      "budget": 2300000,
      "overview": "A dashing Mississippi river gambler wins the affections of the daughter of the owner of the Show Boat.",
      "similar": [
         872,
         252,
         2005,
         31900,
         18126,
         1725,
         45272,
         60405,
         10537,
         16367,
         30197,
         1125,
         28658,
         409447,
         21468,
         3087,
         3062,
         43600,
         40633,
         25167
      ],
      "original_title": "Show Boat",
      "runtime": 107,
      "poster_path": "/9qxeyQk0Wzw0M4ABIF8hc8nS5D7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1951-07-13",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "It's NEW!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Sidney"],
      "runtime": 108,
      "synopsis": "The \"Cotton Blossom\" has just arrived in a small town. It is a show boat, which stops at every city before they wind up the season at New Orleans. As the boat pulls into the dock with a chorus singing and dancing, everybody, blacks and whites alike, stops whatever they are doing and runs to the banks of the river. Captain Andy Hawks (Joe E. Brown) announces that evening's show, and the main performers act out a sneak peek of the play to be performed that night. This time there is trouble, as Pete, the boat engineer, makes a pass at leading actress Julie LaVerne (Ava Gardner). When he is rejected, he threatens Julie and is beaten up by Steve Baker (Robert Sterling), Julie's husband, who is the leading man of the company. Furious, Pete goes to see the local sheriff. Magnolia Hawks (Kathryn Grayson), the daughter of the captain and his wife Parthy (Agnes Moorehead), wants to be the leading actress as well, but her snobbish, ill-tempered mother won't hear of it. Riverboat gambler Gaylord Ravenal (Howard Keel) gambles away all his money, including the ticket he has bought to go to New Orleans. He goes to the show boat, wanting to talk to the captain. He overhears Magnolia practicing at \"acting\" and he tells her that she should be the leading lady of the show. Magnolia is over the moon, although she doesn't think that she is ever going to actually make it. That night, as dancers Ellie and Frank are performing on the stage of the show boat, the sheriff arrives. It is discovered that Julie is half-black and passing as white and is therefore illegally married to Steve, who is white. (Interracial marriage was against the law at that time.) Steve successfully pretends he is also half-black, but if the couple stay on the boat, they would both be classified as black, and in 1880's Mississippi, African-Americans could not perform on the stage; black characters were always performed by whites in blackface makeup. And so, Julie and Steve both have to leave the boat. Gaylord hears of this, and turns up at the dock just after Julie and Steve have left. Desperate, Captain Hawks gives the job of leading man to Gaylord and makes Magnolia the new leading lady, at least until they reach New Orleans and they can look for replacements. As usual, Parthy does not like the idea, but the dire straits they are in force her to agree. Magnolia and Gaylord soon fall in love. Their performance becomes a smash hit along the river because their emotions are not fake. Parthy insists that they do not kiss onstage, but one night after the show she discovers her daughter and the gambler kissing on the deck. Ravenal announces that he has asked Magnolia to marry him and that she has accepted. Parthy storms off angrily. A concerned Cap'n Andy tells Ravenal that he hopes it won't be Saturday night one minute, and a cold Monday morning the next. The happy couple is married (offscreen), leaves the boat and moves to Chicago. They stay at the luxurious hotel Sherman, but they have been unable to pay for their room, as Gaylord does not try to get a job and spends all their money on gambling, always losing but hoping on hitting the jackpot on the next occasion. The hotel manager (Edward Keane) gives him until the next day only to pay his dues, or they will have to leave. Magnolia offers her jewels to her husband, but Gaylord refuses to accept them. However, that night, pressed to pay his gambling debts on the spot, he asks for the family jewels, saying that it's only a temporary lending. Magnolia reminds him that many things can be temporary except for their love. Pretty soon they have to sneak out of the hotel, trying to avoid to be seen by the hotel receptionist (John Crawford), leaving a six-week credit hole to their names. Finally, Gaylord and Magnolia have an argument. She is disillusioned about their life and blames him for being weak, asking him not to touch her. Soon after, out of guilt, he leaves her. At their apartment, where Magnolia has been left stranded, arrives Frank Schulz, (Gower Champion) and his wife Ellie, the dance team who formerly worked on the show boat, who are looking for a room. The Schulzs have an audition at the Trocadero. They talk about their old times at the \"Cotton Blossom\", and it's then that Magnolia reads a written note from Gaylord saying that he's leaving. Julie works at the Trocadero but has become an alcoholic because Steve has left her after all their difficulties passing as white. Her boss tries to keep Julie sober. Frank, having no idea that Julie works there, convinces the manager to give Magnolia an opportunity. The manager is not convinced, even after hearing Magnolia audition. Julie has also heard it from backstage, without letting Magnolia know that she has been working there. Julie realizes that Magnolia needs the job, and quits so that the manager will have no choice but to hire Magnolia. She leaves behind a note to the manager, saying that if he does not hire Magnolia, he's crazy. New Year's Eve: The Schulzs perform and they are a hit. Magnolia performs and she is a miss: depressed over Ravenal's leaving her, she sings as if she had stage fright. However, a drunk member of the audience - Captain Andy Hawks - tells everybody to shut up and inspires Magnolia to have confidence, upon which she begins to sing beautifully. The audience cheers its approval, and Magnolia is a hit eventually. Andy and Magnolia talk. He recommends her to forget Gaylord forever, but she says it's impossible for her, especially when she tells him that she is pregnant. Gaylord doesn't even know; Magnolia did not have the heart to tell him because of his financial difficulties, and then he left her without saying goodbye. In spite of the possibilities of success in New York, Magnolia wants to be back at the boat and she returns with Andy, Frank, and Ellie. Soon afterwards, Kim Ravenal is born. About five years pass; Kim (Sheila Clark) is even learning how to dance. Cut to Gaylord, always alone, always frustrated with his luck, always in the middle of strangers, always gambling away his happiness. On a packet boat, Julie and Gaylord meet for the first time, after he punches out the drunk who has just slapped her. Julie discovers who he is and tells him off, not realizing that he did not know that Magnolia was pregnant when he left her. Julie then asks Gaylord to promise that he won't tell Magnolia that he had found Julie drunk, working as a saloon girl. Feeling enormous pity for her, he agrees. Gaylord approaches Kim, unbeknownst to her that he's her father. They start to play Make Believe together. Magnolia appears and she and Ravenal are reconciled. For once, Parthy and Andy are happy, when they see that Gaylord and Magnolia will be happy forever. From the shore, teary-eyed Julie watches the boat leave, while Magnolia and Gaylord kiss.",
      "writers": [
         "John Lee Mahin",
         "Jerome Kern"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044030/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2NTQ0MzI1MV5BMl5BanBnXkFtZTgwNzY5ODU3MTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kathryn Grayson, Ava Gardner, Howard Keel | See full cast and crew »"],
      "reviews": [
         "I strongly disagree with some of the other viewers. 'Showboat' -- the 1951 version -- is not inferior to the earlier, darker Universal version with Irene Dunne and Allan Jones. The talent used for the lavish technicolor remake is in itself superior to the cast of the original--Howard Keel, Kathryn Grayson, Ava Gardner, Joe E. Brown, Agnes Moorehead, Robert Sterling -- and most importantly, Marge and Gower Champion who can do no wrong with dance numbers. By comparison, the dances in the original version appear uninspired--and even the legendary Helen Morgan (not a conventional beauty by any standards) fails to evoke the same magic Ava Gardner does as Julie. True, Morgan did her own singing but Gardner's voice on the soundtrack could just as well have been used instead of Annette Warren's. Other than that, the MGM film is just fine--everything is staged with much more zest and enthusiasm than is present in the awkward, lumbering James Whale version. And Marge and Gower Champion's version of \"Life Upon the Wicked Stage\" is a priceless example of this team's artful way with a show tune. Their contribution is a major asset of the newer version. Likewise, Grayson and Keel blend their rich voices in song the way they were meant to be heard by Kern & Hammerstein. Irene Dunne had a modest soprano voice but she was not as accomplished a singer as Grayson nor did she deliver numbers with Kathryn's uncommon ease. Performance-wise, Grayson is a bit too subdued against Gardner's more colorful character and did not kick up her heels the way she would in 'Kiss Me Kate', one of her best roles. As for Allan Jones in the earlier version, he was a personable enough singer/actor but he was nowhere close to Keel's adroit handling of both songs and dialogue. Keel went on to become a staple of some of MGM's finest musicals and a fine reputation as a strong singer. The pacing of the older film was slow, leisurely and downright boring at times. The remake is much easier on the eyes and ears. There's a hint of snobbism in the putdowns this film gets from some of the more discriminating viewers who cannot forgive whatever changes were made to make the plot line and time frame smoother. A deliberate change in story structure does not make a film inferior to the original. A high point of the film is, of course, William Warfield's full-bodied version of \"Old Man River\" -- just another of the film's memorable musical moments. An MGM musical in the grand tradition--not to be missed.",
         "I will admit (with a great amount of shame) that the first time I saw the 1951 version of \"Show Boat\" I was not that impressed. I was so used to Kathryn Grayson and Howard Keel as Lilli Vanessi and Fred Grahame, thought Ava Gardner was too beautiful for words, and thought Marge & Gower Champion were the coolest people I had ever seen. That was about it. I was a little bored. But as I have come to watch it recently, I have discovered it is more magnificent the second time around. As a North Carolina native, I must say this movie holds something very special for me -- and that is TWO North Carolina natives from \"Grabtown\" and Winston-Salem, our ladies Ava and Kathryn respectively. First of all, the Technicolor is vibrant and lovely and represents the very fiber that those beautiful, glorious MGM musical treasures of the 1950's were made of. Supporting characters Joe E. Brown and Agnes Moorehead were, as usual, delightfully wonderful. I don't think I've ever seen either of them do anything \"bad.\" William Warfield's delivery of \"Ol' Man River\" (accompanied with Julie/Ava's last wistful look toward The Cotton Blossom, of course) never fails to put a tear in my eye. Howard Keel's voice was in fine form, and he did a great job of portraying the slick gambler, Gaylord Ravenal. Kathryn's voice was, as always, up to par and beautiful, and while perhaps her representation of Magnolia wasn't as vibrant as her portrayal of Lilli in \"Kiss Me Kate\" or Aunt... whoever it was she played in \"Anchors Away\" (ooh, I can't remember the name... that's BAD... REAL BAD), she was still her lovely, charming self. I found that her progression from innocent child-like creature to a portrait of woman- and motherhood was captured and characterized very well. But my favorite parts of the movie were simply Ava Gardner, and Marge and Gower Champion. Ava is, as always, ridiculously and insanely gorgeous. In fact, I would have liked to have seen more of her than I did. It's a stretch for a white woman to play a bi-racial woman, but she did it with what seemed like such ease. She accompanies so much with a look (which is evident as she watches Gay and Nolie sail off together with Kim -- you all know what I'm talking about). And yes, Ava's singing pipes (in my opinion) were far better than Annette Warren's and MGM is stupid for having dubbed her (just like they were stupid for dubbing Debbie Reynolds in \"Singin' in the Rain\"). Her songs, \"Can't Help Lovin' Dat Man of Mine\" and \"Bill,\" were extremely effective, but could've been even more so had they used her real voice. Such expression in those eyes. And my gosh... her speech to Gay! I don't think people in Hollywood ever really looked beyond Ava as anything but a \"sex goddess\" -- but she really had a beautiful talent. Now for Marge & Gower Champion: who couldn't love them? Gower is this sort of... fluid-like creature with a stature and grace like Fred Astaire, but instead of Astaire's \"lanky movements\" that defined his style, he somehow executes the more athletic, brisk movements that defined Gene Kelly's style. And Marge has to be just about the cutest little person I have ever seen (great facial expressions!) and one of the most talented dancers (up there with Gwen Verdon, Carol Haney, Ginger Rogers, Chita Rivera, and all those gifted people) I've ever seen grace a screen. They're sheerly magnetic, and they never miss. \"I Could Fall Back on You\" and \"Life Upon the Wicked Stage\" are two of the most outstanding moments in the movie. You'll love them. All in all, \"Show Boat\" is most definitely worth a look. Or two. Or three. Or... well, as many as you feel like!",
         "Please people! Try not to over-analyze, like so many others have done in the other comments about this fabulous Techno-color classic from the early 1950's Hollywood. It isn't supposed to be a carbon-copy remake of the older 1936 version nor is it supposed to be making any sort of PC statements about race! Times changed and so did the attitudes and views of most americans, especially after WWII. Take it for what it is! A great musical wrapped around a love story. Beautiful lead actress, strong male lead and awesome broadway style tunes sung by great voices, especially William Warfield's \"Old man River\"!",
         "When MGM acquired the rights to Show Boat for the Arthur Freed unit, no expense was spared in making this one of the most expensive films the studio had ever produced. A whole riverboat was constructed as well as the Natchez landing was completely built on a location on a lake which served as turn of the last century Mississippi river locale. No doubt also that Howard Keel and Kathryn Grayson sang beautifully together. Those three Jerome Kern ballads, Make Believe, Why Do I Love You? and You Are Love were just written for their voices. Ava Gardner is a beautiful and fetching Julia. Annette Warren's dubbing of Julie LaVerne's songs Can't Help Loving That Man and Bill perfectly matched Ava's speaking voice. The problem I've always felt with this version is that Howard Keel is too strong a character to be playing Gaylord Ravenal who is essentially a weak personality. Allan Jones in the 1937 version perfectly captured Ravenal's frailty. That 1937 version also had two people from the original Broadway production who made those parts all their own, Helen Morgan as Julie and Charles Winninger as Captain Andy. And it had the incomparable Paul Robeson though William Warfield is a fabulous Joe. The singing of the Jerome Kern-Oscar Hammerstein II score is in the major leagues. The rest of the film however is in a minor key when compared with the earlier sound version with Allan Jones and Irene Dunne.",
         "I had only recently settled down to watching this one which has just been issued on DVD in France. In a frustrating sense, this film shows that perfection is unattainable ! It has perfect lighting, perfect costumes, perfect music, perfect acting but oh, the plot is just so dull and lacking in substance ! But because of the rest I give it a high-ish rating. It's true, though, the plot is really lacking in spice and substance but this is to a large extent compensated for by a mixture of fantastic sets and great musical performances. Indeed, I am very impressed by the particular attention given to lighting by the cameraman ! It seems they avoided filming at midday and always used early morning or early evening sunlight with long, sharp and distinct shadows with yellowish tones. This plus the splendid technicolor is a feast for the eyes. I would be curious to have known exactly where it was filmed. Was it really the Mississippi river ? I also enjoyed those scenes in the cotton plantations. Musically of course, the film is a masterpiece and though my favourite tune is \"Make Believe\", I was extremely impressed by the version of Ol Man River sung by the actor William Warfield who must have had one of the most brilliant voices I have ever heard ! I confess to never having heard of this gentleman prior to seeing the film and had imagined the singer to be Paul Robeson. So I checked out WW on the internet and it appears he was a very respected and educated gentleman. To cut a long story short, I was impressed by his mellow voice and by his towering physique. Ava Gardner was too very beautiful and I also enjoyed seeing dear old Agnes Moorhead whom I have always appreciated in films. So despite a weak plot which sometimes failed to keep my attention, this film is a genuine masterpiece on most other levels and deserves viewing at least once, if only for William Warfield's performance of Ol'Man River.",
         "I've been a Showboat fan for a long time. I've seen it live on stage 5 times as well as the 1936 version and the PBS version. After watching the MGM version again on TCM, I decided that it is almost impossible to make a satisfying version of a Showboat movie. Its strange to say, but I think \"opening up\" the stage version took away some of the intimacy a live version has. Showboat's greatness does not come from the standard boy meets girl - boy loses girl - boy gets girl storyline. It comes from the music and on stage a number can start with one guy on the docks lamenting the suffering endured along the Mississippi and end with a chorus of voices singing about Ol Man River. The numbers themselves \"open up\" to fill the stage. But no movie can do that to the same effect. But my biggest problem with this version is the abbreviation of the story and the musical numbers. The songs Kern and Hammerstein wrote deserve to be fleshed out in all their operatic grandeur. The first act contains what I consider the best back to back to back musical numbers in Broadway history with Make Believe - Ol' Man River - Can't Help Lovin Dat Man and the movie rearranges them out of order and only River is fleshed out. Can't Help should be an 8 minute number with the chorus joining in at the end instead of the barely noticed number in the movie. Because the music is among the best ever written, it is really hard to make a bad version of Showboat. I'll watch this movie whenever it is on TV but if you really love Showboat, get the EMI 3 CD recording with Frederica Von Stade and Jerry Hadley. And go see it live when you have the chance.",
         "The plot may be changed a little, but it is still wonderful stuff, with a cast to die for. A great weepy love story, some fantastic dance sequences from the Champions, a sweet couple of leading ladies in Grayson and Gardner, and a high dose of comedy along the way. All this and Ol' Man River. The perfect Sunday afternoon wallow.",
         "Show Boat is one of my favourite musicals, and I admit to being a solid Howard Keel fan! However, the one thing that gets me, and why they haven't returned it to the original film track, is the dubbing of Ava Gardner's voice. I have a copy of the soundtrack on good old vinyl and have Ava singing her own songs on it and I have to say, in my humble opinion, that she actually did a better job of it, than the person who dubbed her. Maybe in 1951 Ava's rendition was a bit.... too hot for the censors, but today, never. Why can't we have Ava's voice back on the film??? What do the rest of you think?",
         "Don't worry about comparisons with the original, supposedly weak story line, etc, etc - just suspend belief and enjoy it as a musical. The key vocalists are absolutely first rate: Howard Keel, Kathryn Grayson and William Warfield were at the tops of their games here. The superb, effortless vocals from Keel and Grayson are lessons on how to sing - you'll never hear 'Make Believe' sung better than this. William Warfield's version of 'Old Man River' is just magic. People usually talk about Paul Robson in the same breath as 'Old Man River' but none of Robson's renditions can match this performance. Warfield is a true bass (Robson was a bass-baritone) and delivers this song with magnificent power and resonance. Warfield is The Man. Sit back and enjoy the music...",
         "I'm tired of livin' but scared of dyin'... Have you had the opportunity to enjoy \"Showboat\" (1951)? Yesterday was the 1st time I'd been able to see it all the way through...no interruptions. I had my 2+ and 5 year old granddaughters visiting me. They were so enthralled with the music, dancing and costumes they sat and quietly watched it...except when the dancing was on. At that point they joined in with great enthusiasm. A gambler/actor, Gaylord Ravenal(Howard Keel), joins riverboat Cap'n Hawks (Joe E. Brown), his wife Parthy (Agnes Moorehead) and daughter Magnolia (Kathryn Grayson) aka: Nollie. He acts his way onto the boat, up the Mississippi River and into Magnolia's heart. The last is very much against her mother's wishes. Gay and Nollie leave her parents to live on their own. Everything seems to go well until Gay and Lady Luck part company. As things fall apart so does their marriage. Gay runs out and Nollie is left to fend for herself. Hards time and other complications make her realize she needs her parents. Tiny spoiler: Ava Gardner and Robert Sterling are \"Julie LaVerne\" and \"Steve Baker\" an interracial couple who are threatened with arrest because of their relationship. Their story makes up a sad portion of the plot. What will happen to Julie? What about Nollie? They're both in difficult circumstances. Well, that's all you're getting out of me. If you haven't seen it, please do. It is so worth your time."
      ],
      "genres": [
         "Drama",
         "Family",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "The \"Cotton Blossom\", owned by the Hawk family, is the show boat where everyone comes for great musical entertainment down south. Julie Laverne and her husband are the stars of the show. After, a snitch on board calls the local police that Julie (who's half- African-American) is married to a whiteman, they are forced to leave the show boat. The reason being, that down south interracial marriages are forbidden. Magnolia Hawk, Captain Andy Hawks daughter, becomes the new show boat attraction and her leading man is Gaylord Ravenal, a gambler. The two instantly fall in love, and marry, without Parthy Hawks approval. Magnolia and Gaylord leave the, \"Cotton Blossom\", for a whirl wind honeymoon and being to live in a Pl: fantasy world. Magnolia soon faces reality quickly, that gambling means more to Gaylord than anything else. Magnolia confront Gaylord and after he gambles away their fortune he leaves her - not knowing she is pregnant. Magnolia is left penniless and pregnant, and is left to fend for herself, and make a new start.",
         "In the end of the Nineteenth Century, the show boat \"Cotton Blossom\" owned by Captain Andy Hawks flies along the rivers in the South of North America with the lead stars Julie LaVerne and her husband Stephen Baker and musical entertainment. When Julie and Stephen are accused of miscegenation, they have to leave the boat, and Captain Hawk's daughter Magnolia and the gambler Gaylord Ravenal take their places. They fall in love for each other, get married and move to Chicago, living in a fancy and expensive hotel. However, the jinx of Gaylord consumes all their money, and later Gaylord completely broken leaves Magnolia without knowing she is pregnant. She struggles to survive, returns to her father's boat and business and raises her daughter with her parents. Years later, Julie accidentally meets Gaylord and tells him about his daughter.",
         "When Julie la Verne and her husband Steve Baker are forced to leave the showboat Cotton Blossom (their marriage is illegal because of Julie's mixed blood),their places are taken by Magnolia Hawks, the Captain's daughter, and Gaylord Ravenal, a gambler. Magnolia and Ravenal fall in love, marry, leave the boat and move to Chicago, where they live off Ravenal's earnings from gambling. After they go broke Gay feels guilty and leaves Magnolia, not knowing she is pregnant.",
         "The daughter of a riverboat captain falls in love with a charming gambler, but their fairytale romance is threatened when his luck turns sour."
      ],
      "budget": 2295429
   },
   "movielensId": 8502,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-07-13",
      "dvdReleaseDate": "1997-08-22",
      "directors": ["George Sidney"],
      "runtime": 107,
      "movieId": 8502,
      "title": "Show Boat",
      "mpaa": "NR",
      "actors": [
         "Howard Keel",
         "Kathryn Grayson",
         "Ava Gardner",
         "Joe E. Brown",
         "Marge Champion",
         "Gower Champion",
         "Robert Sterling",
         "Agnes Moorehead",
         "Bess Flowers",
         "Leif Erickson",
         "William Warfield",
         "Linda Christian",
         "Adele Jergens",
         "Anna Q. Nilsson",
         "Bert Roach",
         "Regis Toomey"
      ],
      "imdbMovieId": "0044030",
      "originalTitle": "Show Boat",
      "genres": [
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["WqKJM23YB0g"],
      "plotSummary": "A dashing Mississippi river gambler wins the affections of the daughter of the owner of the Show Boat.",
      "tmdbMovieId": 17820,
      "avgRating": 3.26642,
      "releaseYear": "1951",
      "numRatings": 137,
      "posterPath": "/9qxeyQk0Wzw0M4ABIF8hc8nS5D7.jpg"
   }
}