{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "west virginia",
            "id": 8232
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt1396227",
      "video": false,
      "title": "The Wild and Wonderful Whites of West Virginia",
      "recommendations": [
         289575,
         174319,
         86750,
         94066,
         103752,
         86755,
         34044,
         53163,
         13979,
         43487,
         46889,
         49800,
         13063,
         27328,
         32622,
         96702,
         73669,
         50503,
         100017,
         30068
      ],
      "backdrop_path": "/yWKe6jsKui3xyAXisFGxhy8L9KW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 4,
            "character": "Himself",
            "gender": 2,
            "credit_id": "52fe479fc3a36847f813fb85",
            "name": "Jesco White",
            "profile_path": null,
            "id": 89882,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe479fc3a36847f813fb75",
               "name": "Julien Nitzberg",
               "profile_path": null,
               "id": 142598,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a36847f813fb7b",
               "name": "Johnny Knoxville",
               "profile_path": "/vUultoYGh6mZraKoKPbuwkIZqRD.jpg",
               "id": 9656,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479fc3a36847f813fb81",
               "name": "Jeff Tremaine",
               "profile_path": "/dLUeKVdZXfFx3VOgf2zNV9fu1Ll.jpg",
               "id": 56578,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe479fc3a36847f813fb8b",
               "name": "Katie Doering",
               "profile_path": null,
               "id": 142599,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe479fc3a36847f813fb91",
               "name": "Storm Taylor",
               "profile_path": null,
               "id": 142600,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.749003,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49637,
      "vote_count": 34,
      "budget": 0,
      "overview": "Produced by Johnny Knoxville and Jeff Tremaine for MTV and Dickhouse Productions, The Wild and Wonderful Whites of West Virginia is a documentary about the renowned West Virginia outlaw Jesco White and his eccentric backwoods family. In addition to getting in trouble with the law, the Whites, who live deep within Appalachia, uphold a time-honored dancing style, even as they contend with poverty, drugs and other issues. Alternately humorous and sad, the movie is an unflinching look at life on the criminal margins of rural mountain culture.",
      "similar": [
         3134,
         8810,
         281,
         948,
         298312,
         11564,
         133805,
         2142,
         9762,
         4771,
         4638,
         12162,
         769,
         185,
         949,
         10285,
         205,
         170,
         8923,
         241
      ],
      "original_title": "The Wild and Wonderful Whites of West Virginia",
      "runtime": 86,
      "poster_path": "/7EQQsuK1Hk1zcoBlNBKfU41aS39.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dickhouse Productions",
            "id": 6328,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MTV Studios",
            "id": 6329,
            "origin_country": ""
         }
      ],
      "release_date": "2009-04-01",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://wildandwonderfulwhites.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julien Nitzberg"],
      "runtime": 86,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1396227/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3NTU1NjY5M15BMl5BanBnXkFtZTcwOTE2ODg3OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: J. Parker Bazzle II, Big & Rich, Ponty's Camper | See full cast and crew »"],
      "reviews": [
         "This documentary is like a train wreck...it's awful, it's ugly...but you can't stop watching. It really is mesmerizing....and I've never seen anything like it and it's sad that it's apparently true and the people in the film are so happy, proud and open about their completely sick and crazy lives. The movie follows the White family in West Virginia, an extended family that is about as trashy and worthless as any in the world...and a wonderful argument for retroactive euthanasia. I know that's horrible to say that, but watching this inter-generational family on their BEST behavior on camera is like the very, very worst families on \"The Jerry Springer Show\"---on crack. The White family's prison records, drug use, violence and ignorance is overwhelming to watch--it's just hard to imagine a clan like this being proud of themselves--and I could imagine this film being shown in various countries where they hate Americans so they could 'prove' how evil and decadent we really are! While the film is awful to watch, it has several qualities that I would consider important to a truly excellent documentary. First, the narration is minimal and lets the subjects themselves just talk...and talk...and talk. Second, the subjects are allowed to do or say whatever they want....and this seeming lack of direction is what makes it so compelling. Sad, sick and provocative...this is one to see. By the way, my timing for watching this film was amazing. I'd just watched \"Idiocracy\"--a film that warns us that this sort of family IS our future--especially as the ignorance and irresponsible seem to breed at a VERY high rate. Sad...very, very sad.",
         "I work in a therapeutic residential environment. I specialise in taking care of children who come from families like this. Everyday is a battle to try and undo the behaviours that they learned from the people they grew up around. Drugs and gang culture is the norm. They act impulsively as soon as there's a gut feeling. There is very little planning for the future if any at all ever. No consequence training. No boundary setting. The word \"no\" is a signal to begin arguing or to throw a tantrum. They tend to be self serving and inconsiderate. I deal with laziness, they're always expecting to be served by others. They put up a fuss when it's their turn to help out in even the smallest way. Also, families like this typically distrust professional institutions run by educated people. They wonder why their lives are the way they are and they can't figure it out. \"It must be the Devil in us\" one of them says. Change can only happen when people are willing to look at their own selves critically. Life is all about the choices that we make. These guys have a looooong way to go.",
         "I caught this late last night on Showtime or IFC, and was mesmerized by the ignorance of the characters and the utter disregard they displayed for common sense. I mean I could not take my eyes off of the train-wreck-of-a-clan. They possess no ability to think things through. They are ultimately grown children who don't understand the consequences of their actions. I was in awe of their shear stupidity, and even more fascinated with the women of this clan. Shocking, disturbing, and infuriating when you realize that the tax-payers are supporting them. All in all, I think it was good film-making. I definitely learned something, and I would recommend it to anyone who is interested in \"rarely seen cultures\" within America. Or to anyone who just wants to feel better about themselves.",
         "I first scanned by this movie while staying at a hotel. At first while channel flipping I thought it was a bad episode of cops. Only after further viewing did I realize it was much much worse.... and better. Although the documentary format leaves something to be desired, the subjects fill the time with their crazy lifestyles. No real way to describe the documentary. One strange phenomenon is that the young kids are much smarter than the adults. The adults have fried their brains on drugs for so many years that some of them can barely talk. Check it out. \"They took her baby. Prolly cause they found drugs in it.\"",
         "...and marijuana. With the Dancing Outlaw 1 and 2, White Lightnin', and an episode of Roseanne, our beloved Jesco has been the main White focus; but not anymore. Jesco is still on-hand, guffawing, tapping and being just a good ole boy, but we now get a glimpse of the bigger picture. The whole dang White family tree. In The Wild and Wonderful Whites of West Virginia, you're introduced to a whole bunch of Whites. And in the beginning you may be slightly confused with who's who and what's what. But eventually, you get the swing of things as the film turns and basically places it's attention on the female side of the Whites; The trio of the Biggest (Mamie), the Meanest (Sue Bob) and the Baddest (Kirk), and I can't forget Mousie, or the gentle Bertie Mae. Of course going into this film you're expecting the craziness and entertainment that the family is known for delivering, and that's all well and good. But really, it wouldn't have been enough for this doc to succeed. What had me nodding in approval after the film had concluded was the layer of emotion the movie delivered. Jesco has spoken in the past about the misfortunes of the White family, but it's not until now do you really grasp it. Unless you've gone through similar things yourself. The White Family is undoubtedly questionable and intimidating with their life-styles. At the same time they live a very predictable life-style that unfortunately seems to repeat itself. Lots of sadness, violence and drug abuse revolve around this family, and they mask a lot of their sadness by rolling with the flow, and living up to their legendary name. And it kinda makes me think this streak that they're going on, may come to a sad and depressing halt. Then again, they're quite obviously tough, crafty and without a doubt survivors. I just hope they can learn to embrace their rebel ways, while slowing down on the drugs. One White made it out, and it seems Kirk is on the way.",
         "A Dickhouse Production, the same folks who brought us Jackass and Wildboyz. That should be a big clue regarding the content of this production. I caught it somewhere near the beginning or rather it caught me and I couldn't get loose from it. It is that fascinating to be sure. The entire White family is very entertaining and educational. Their lives are an inspiration to educate oneself and rise up from the hellhole of ignorance. Of course it's very easy to judge these people for their way of life, but I believe there is a deeper message here and that is Freedom, we are free to live as we please in this country. If we want to remain ignorant and lazy we can, if we want to succeed that is also attainable. I know people like this, some of us have relatives like these people. However, they are not representative of the entire Appalachian population. Every town and county in the USA has a family just like the Whites. If you do have a chance to see this movie, I would suggest leaving your high horse in the barn and keeping an open mind, you may be enlightened somewhat. I would put it in a collection along side Grey Gardens.",
         "You really can't imagine anyone doing a much better job depicting this scourge on society. I've watched this three times and showed it to friends. No one seems to be able to turn away from the Whites. Being born into that family is an incredible handicap. Life really isn't fair for some people from the git-go, especially those who are addicted to drugs in the womb. Also, we all aren't created equal, because although crafty, the Whites are completely dim and dysfunctional in their outlook towards life. The sad thing is that there are many people like the Whites in America; leeches on the rest of us, sucking the lifeblood out of this country.",
         "I kept thinking while watching The Wild and Wonderful Whites of West Virginia, what would my initial reaction to this film be if I saw it a few years ago? I had a totally different outlook on life, and thought, if it's not like me it's clearly not right. When I watched the 2003 drama Party Monster, I reflected on the same thing I'm reflecting on now. Just because one's way of life is different, doesn't make it wrong. If the White family in this film is happy living the way they are, go ahead. I don't approve of it, but I'm mature enough to respect it. The film focuses on a famous outlaw family living in Boone County, West Virginia where lawlessness, shootouts, drugs, and rowdy-behavior isn't uncommon. It's not like the suburbs or the city, it's worse. Way worse. There are a number of characters in the White family. The most famous is D. Ray White's son Jesco White, a tap dancer who was the subject of the film The Dancing Outlaw. We see Mamie White as well, my favorite character, who is oldest daughter of the deceased outlaw D. Ray White. Mamie introduces some of the deceased members of the White family at the beginning of the film so we're brought up to speed. So many other characters are introduced as well like Sue Bob White, another daughter of D. Ray White who is trying to cope with her son's possible jail sentence. We also get the cousins/grandchildren of D. Ray White like Kirk White, a woman fighting to be clean and see her newly born child. All I can say is that this family is checkered and free as a bird. There is almost no discipline in their household. Everyone acts like a grown child, and no one thinks or even cares about the consequences of their actions. Nobody ever stops and thinks \"why, or what?\" They just do. Country musician Hank Williams III claims in an interview the reason the Whites, and many other people residing in Boone County are so crazy is because they all had something happen in their lives that was enough to scar them and just have a more rowdy look on life. Hank Williams III plays a big role in the White's life. He is almost like a saint or a God in them. They love his music. They dance to it, sing along to it, and pretty much rock out to it. I, myself, am a big Hank Williams III fan because I love his southern sound, and feel he is one of the few true country musicians around now. He is truly one of the best singers in the genre today. This is the kind of film that is odd, wacky, witty, dark, raunchy, and sometimes disgraceful, but you can't look away. You have to watch these people take life head on, not caring about the consequences. Truly, they are careless. Even when one of the Whites goes to rehab, you feel she is obligated to go rather than she wants to. She would much rather party-hardy, but instead must do the right thing. Johnny Knoxville and Jeff Tremaine serve as producers of this project. There is a sense of their Jackass style here. Every cut seems like it's missing \"Hi, I'm \"so-and-so\" White and this is how we inhale fumes!\" I like the style, and it's good to see there is a different direction stemming from the Jackass boys. The Wild and Wonderful Whites of West Virginia is one of those documentaries that is not filled with morals. The message is basic; \"we do what we want, when we want, accept the consequences, whatever they me, and we embrace the fun we are about to have.\" I respect it, but still, am sort of disgusted by their way of life. It's interesting and unique, but they keep saying they want their kids to have a better life when they do nothing to put them on the right track. But them again, I'm a suburban boy. It's not like they care what I think. They're out having fun, and living life. How can we yell at them for that? Starring: The White Family. Directed by: Julien Nitzberg.",
         "I watched this film and didn't really care what happened to anyone. They are all selfish, self-centered, dangerous, manipulative people. There's a reason why they keep reminding you who the people are because you really don't care. The only one I really cared about was the newborn baby. This movie can't compete with American Hollow for character development. This movie even copied the idea of showing what happens when you get out of the county. I'm not sure what the goal of the filmmaker was. At the end of the movie, I just felt like it re-enforced my view of hicks in West Virginia. I know they are the minority and there are good people there that should have been shown somewhere in the film besides the officials pointing out the problems with the Whites. 4/10 for making me constantly shake my head...I must be dizzy for giving it that high of a score.",
         "1. I really enjoyed this movie! I get a kick out of all the White's wild behavior just as much as the next guy. However, sometimes things go a little too far and it is hard to watch. For example, in the scene taking place during Mattie's birthday things get ugly fast. The poor old woman cannot even exist peacefully in her own home without all of her degenerate children traumatizing her. Later in the movie we are shown the after effects of the years of drug abuse. When Kirk's baby is taken from her, when she has to leave her older son, and overall just the negative effects the drugs have had on these people over the years. I think that showing this movie to youth drug recovery groups would be useful as well. This movie doesn't glamorize this lifestyle at all. It shows it for what it is. I highly recommend."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Dickhouse Productions",
         "MTV Studios"
      ],
      "summaries": [
         "Shoot-outs, robberies, gas-huffing , drug dealing, pill popping, murders, and tap dancing - what do these all have in common? These are just a few of the parts of being a member of the Wild and Wonderful White Family. The legendary family is as known for their wild, excessive criminal ways as they are for their famous mountain dancing members, including Jesco White, the star of the cult classic documentary \"Dancing Outlaw.\" Exploring both the comic and tragic sides of life on the other side of the law, this stylish, fast-paced family portrait exposes the powerful forces of corruption, poverty, and West Virginia's environmentally and culturally devastating coal mining culture that helped shape the White family, a dying breed of outlaws preserving a dying form of dance.",
         "A year in the life of the White family, well known for Jesco White, the star of the \"Dancing Outlaw\" documentary."
      ],
      "budget": 0
   },
   "movielensId": 85072,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-04-01",
      "dvdReleaseDate": "2010-10-26",
      "directors": ["Julien Nitzberg"],
      "runtime": 86,
      "movieId": 85072,
      "title": "The Wild and Wonderful Whites of West Virginia",
      "mpaa": "",
      "actors": ["Jesco White"],
      "imdbMovieId": "1396227",
      "originalTitle": "The Wild and Wonderful Whites of West Virginia",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["w3ysuG2O0zw"],
      "plotSummary": "Produced by Johnny Knoxville and Jeff Tremaine for MTV and Dickhouse Productions, The Wild and Wonderful Whites of West Virginia is a documentary about the renowned West Virginia outlaw Jesco White and his eccentric backwoods family. In addition to getting in trouble with the law, the Whites, who live deep within Appalachia, uphold a time-honored dancing style, even as they contend with poverty, drugs and other issues. Alternately humorous and sad, the movie is an unflinching look at life on the criminal margins of rural mountain culture.",
      "tmdbMovieId": 49637,
      "avgRating": 3.30435,
      "releaseYear": "2009",
      "numRatings": 46,
      "posterPath": "/j0FnVFw2ilLcp4z9WZDvfnpEkT0.jpg"
   }
}