{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "sex trafficking",
            "id": 15049
         }
      ],
      "imdb_id": "tt1198153",
      "video": false,
      "title": "The Assassin Next Door",
      "recommendations": [
         48862,
         35065,
         19798,
         46561,
         23817
      ],
      "backdrop_path": "/3Wxz2sHX56EHuVQh7ubZECDK5a0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Galia",
               "gender": 1,
               "credit_id": "52fe46669251416c91053479",
               "name": "Olga Kurylenko",
               "profile_path": "/v9HmONHtTZM4Sl9QSNpxDYvuMCk.jpg",
               "id": 18182,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Elinor",
               "gender": 1,
               "credit_id": "52fe46669251416c91053481",
               "name": "Ninet Tayeb",
               "profile_path": "/1xxdkREWPNOPGQhFrUWvbLjiNTm.jpg",
               "id": 118410,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Elinor's Husband",
               "gender": 2,
               "credit_id": "52fe46669251416c9105347d",
               "name": "Zohar Strauss",
               "profile_path": "/x1fDHFt1lg3NGisHsnsocgCEIJg.jpg",
               "id": 110366,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Roni",
               "gender": 0,
               "credit_id": "52fe46669251416c91053485",
               "name": "Liron Levo",
               "profile_path": "/45nrlrfe8FZb08fNEyzJaOQwsX6.jpg",
               "id": 52688,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Barbie",
               "gender": 1,
               "credit_id": "57b6a841925141635a000b4f",
               "name": "Ester Rada",
               "profile_path": "/3Pji3H7CenmtX7TvE1L7LZU1u7N.jpg",
               "id": 1321912,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Barbie's Friend",
               "gender": 2,
               "credit_id": "52fe46669251416c91053489",
               "name": "Lior Habra",
               "profile_path": "/qAJzNeYF9lpzrRk51e97AAwMTud.jpg",
               "id": 118411,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Peter",
               "gender": 2,
               "credit_id": "57b6a0329251416317000358",
               "name": "Henry David",
               "profile_path": "/gEsnLtYnsnQvTu89YXPZucgXvge.jpg",
               "id": 504193,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Michael",
               "gender": 0,
               "credit_id": "57b6a110c3a368256c0004c1",
               "name": "Shalom Michaelshwilli",
               "profile_path": "/hnOS4XE22dpSg9AFiSQiImxDabz.jpg",
               "id": 1066380,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sassi",
               "gender": 2,
               "credit_id": "57b6a39492514169b8000257",
               "name": "Roy Assaf",
               "profile_path": "/gnaUsQqsD84KUsRUfGIB35A7rW7.jpg",
               "id": 1163018,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mishka",
               "gender": 2,
               "credit_id": "57b6a74592514169b80006b9",
               "name": "Vladimir Friedman",
               "profile_path": "/tP1z0Ib5N1Esz3qi4YKXuR78k5c.jpg",
               "id": 231035,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Nina",
               "gender": 1,
               "credit_id": "57b6a98292514169b80007a4",
               "name": "Yana Goor",
               "profile_path": "/2jv2xXvuiIsaEbvKrdHOWwjhSWh.jpg",
               "id": 1667882,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Miki",
               "gender": 2,
               "credit_id": "57b6b25992514169b50009e8",
               "name": "Raz Lissitzky",
               "profile_path": "/awkXeVTh2yIfOiPhYsk59fsKUPn.jpg",
               "id": 1667889,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Tzahi",
               "gender": 2,
               "credit_id": "57b6b4c9c3a3683e4d00027f",
               "name": "Shalva Ben Moshe",
               "profile_path": "/gzTN572tMnscpcmR7bUDf9eBuQN.jpg",
               "id": 1667895,
               "order": 12
            },
            {
               "cast_id": 8,
               "character": "Bathhouse Attendant",
               "gender": 1,
               "credit_id": "57b69df5c3a3681bec000496",
               "name": "Reymonde Amsallem",
               "profile_path": "/oLv0RFkVnQNpTKvGHdb4xb8LgZI.jpg",
               "id": 1662523,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46669251416c9105348f",
               "name": "Danny Lerner",
               "profile_path": "/i6TmSlzZthzLLCcKskvIuFihYtt.jpg",
               "id": 17208,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46669251416c91053495",
               "name": "Danny Lerner",
               "profile_path": "/i6TmSlzZthzLLCcKskvIuFihYtt.jpg",
               "id": 17208,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57b6b61dc3a3683e900002e4",
               "name": "Nathaniel Méchaly",
               "profile_path": null,
               "id": 55773,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57b6b632925141767f0002fa",
               "name": "Shunit Aharoni",
               "profile_path": null,
               "id": 1667896,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57b6b657c3a3683e4d0002da",
               "name": "Dima Osmolovsky",
               "profile_path": null,
               "id": 1509389,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "57b6b6739251414353001a30",
               "name": "Anat Klausner",
               "profile_path": "/70gwzT5SRcyN0JOGtl3exoxUpYk.jpg",
               "id": 583779,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "57b6b68592514169b5000b32",
               "name": "Ram Shweky",
               "profile_path": null,
               "id": 1667897,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "57b6b6e5c3a3682d8a000cce",
               "name": "Ehud Bleiberg",
               "profile_path": null,
               "id": 36999,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57b6b6f99251414353001a76",
               "name": "Edouard Douek",
               "profile_path": null,
               "id": 6424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57b6b713c3a3683e90000346",
               "name": "Yoav Ze'evi",
               "profile_path": null,
               "id": 1667898,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.163466,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "IL",
            "name": "Israel"
         }
      ],
      "id": 37714,
      "vote_count": 22,
      "budget": 3000000,
      "overview": "In an old apartment building on the wrong side of the tracks, two women, unknown to each other, live across the hall on the second floor. Galia is an assassin involved against her will with the local sex-traffic mafia. All she wants is to reunite with her little daughter that she left back home in Russia. Eleanor is a grocery store cashier and a battered wife. She dreams of winning the lottery and running away from her abusive husband. Galia and Eleanor don't know each other, but as neighbors they share two things: an adjoining wall and a strong need to plan their escape. As Galia disobeys her latest contract, a woman target, and Eleanor discovers that she's pregnant, the two women decide to take action against their oppressors in a fight for survival and freedom.",
      "similar": [
         186,
         27582,
         101,
         50270,
         16995,
         6637,
         1427,
         1904,
         1948,
         2252,
         2832,
         281,
         1538,
         657,
         667,
         682,
         390043,
         156022,
         121856,
         261023
      ],
      "original_title": "Kirot",
      "runtime": 102,
      "poster_path": "/wYFCQMaF4aHppvqsS6ivtJIxJnA.jpg",
      "spoken_languages": [
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/h1MpPSPcg5xDoqIBmaTrMDezxRx.png",
            "name": "Bleiberg Entertainment",
            "id": 1872,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Moving Pictures, DPI",
            "id": 7947,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Douek Productions",
            "id": 259,
            "origin_country": ""
         }
      ],
      "release_date": "2009-04-15",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Beware of thy neighbor.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Danny Lerner"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Danny Lerner"],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt1198153/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5MDcwODkyMF5BMl5BanBnXkFtZTcwMTYxNDU4Mw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Olga Kurylenko, Ninette Tayeb, Henry David | See full cast and crew »"],
      "reviews": [
         "Galia is a Ukrainian prostitute stuck in Israel. Things get even worse when she is forced to carry assassinations for the criminals to which she is property. All day long, Galia does nothing but stay in her apartment, waiting for hit assignments. Eventually, she strikes a friendship with her neighbour, Elinor, who is herself victim of an abusive husband. This movie combines several cliché elements yet delivers them in a captivating way and puts some real heart in what could easily have been another run-of-the-mill thriller. There's a definite Besson influence here, particularly elements of \"Nikita\" and \"The Professional\". Director Danny Lerner focuses on these two women, particularly Galia, and paints an ugly picture of a world where women are still basically \"property\". Alhough Galia carries cold, calculating hits like a pro, she turns into an obedient girl when facing her \"bosses\" and gets slapped around. As a viewer, it's tough not to cringe. Another interesting aspect as a North Anerican was the Israelian setting and the exploration of different cultures, since Galia herself is an outsider. Ninette Tayeb is really solid as Elinor but it is Olga Kurylenko who really shines here. Other movies that she was featured in showed an actress with potential and here, she realizes much of it. In most scenes, she is very believable and the role is rather demanding as Olga shifts from recluse to opening to Elinor and from a fragile woman to a cold hearted killer. The script helps but the whole story depends on Kurylenko's ability to draw us in and make us understand when words are lacking. The finale is thrilling enough and fans of \"Carlito's Way\" will see a nice nudge to this film's own finale as a bunch of crooks pursue Olga and Elinor in a terminal station. Much like Besson, Lerner has crafted a movie that mixes the grittiness of an old school Scorcese with the more naive vibe of a classic Hollywood flick. The result is a solid thriller with an international flavor and a great cast.",
         "For anyone even mildly interested in this genre' of drama, this film is smartly done, intelligent, absolutely well crafted . . . could not have been done better. It's not just the dark and murky world of human trafficking, the mob and all that mixed into the interesting backdrop of this piece, but also the amazingly well articulated relationship that evolves between the two central female characters. The ending is a bit rough, as in it's gut wrenching and then some, but the entire story moves along at a pace that makes every scene count for its maximum potential value. As for Olga, who co-stars in the leading role . . . what can I say? She is seriously smoking hot, and in her own unique way, delivers her character like no other actress possibly could. This film may not be for everyone, but for those who can connect to this genre' of story and filmcraft, it's beautiful, harsh, and tragic all at the same time, hits every button that can be imagined in such context. This is a work of art . . . well done. 10+ in my book.",
         "who ever thinks that the story is unrealistic, is not familiar with the Russian immigrant's life in Israel. Some of them come from Russia as teachers and then, end up as security guards and even prostitutes, just because of the Language difficulties. this movie performs the relationship between two women who gets hit and beaten by men who has power over them. It shows both their struggle and confrontations with the men in the movie, and their special connection. And that's the reason why I like this movie, it showed how much they both hated their jobs and their lives and how much they are the same. So, yeah, it's not a Hollywood made movie, it doesn't have great action like most thrillers ,it's not brilliant or close, but it does have good drama, good acting, good shots (in my opinion) and good story ,that I've already said. I'm Recommending it...",
         "This movie reminds me more of Abel Ferrara's MS 45 than anything else. Also, it achieves the impossible: I no longer have the slightest interest in seeing Olga Kurylenko naked. I rated this flicker higher than I normally would, partly because it's a character study grafted onto a shoot 'em up, a sort of sub-genre I'm a sucker for, and mostly for Kurylenko's visceral performance. The action elements are rote and banal; the real interest here is the interplay between the two female characters. Ultimately, despite the tiresome elements, it worked for me as a brutal indictment of the treatment of women in patriarchal societies, of which modern Israel is as guilty as many other supposedly less enlightened places. The crucial opening scene is, I hate to say, dead on and made me cringe; the only change I would have made was turning the Semitic-appearing men into pasty dimwits from New Jersey in Israel on 'religious study'. Most people don't know Israel, particularly Tel Aviv, is a major trafficking point, with the usual merchandise, i. e. poverty-stricken Ukrainian and Moldovian women. Knowing Kurylenko's background (provincial Ukrainian), her performance makes more sense, and is a stunner; I think personally the inconsistencies in her acting are due more to a scatter-shot script than her own skills; although, I gotta question whether she was actually 'acting' as such. This movie and role had to, had to, hit home for Kurylenko. She pulls a scary performance out of her stylish leather coat. Personally, for me, I've spent time around these people in real life; and the guys are just as bafflingly evil as depicted in this movie, the women just as bafflingly confused. The subject material is depressing in the extreme, I guess. The moment where this movie hit me is a scene on a bus, in which Kurylenko is either scrubbed of makeup or made up to look that way; and I realized with a shock she is a dead ringer for someone I once met in real life, right down to the clothes. That woman is now undoubtedly dead. Watch it for the schizoid movie it is: half popcorn, half deadly serious.",
         "Sometimes you come across a film that gives you more than expected. Nearly one hundred sixty thousand viewers said they have 'liked' this movie.. for a foreign film that's a lot of positive votes. Olga Kurylenko.. bit.ly/17NhB0G ..(tell me she's not a spot-on Rashida Jones twin.. bit.ly/179Bwol ) and Ninette Tayeb.. bit.ly/15WZTXw ..both perform admirably throughout the entire time. Their exceptional good looks wisely toned down for roles in this film. Don't be looking for a Nikita style film from start to finish.. it's near the end the real action kicks in. And the actual ending itself is an unresolved outcome (guess there are no emergency medics or ambulances in this town).",
         "A Ukranian woman, Galia, is working as a prostitute in Tel Aviv, when her friend is beaten and stabbed to death. She survives the abuse by the Russian mobster and he offers her a deal to stop selling her body if she will become an assassin instead. She is given a modest apartment and follows orders. Her passport is being held, preventing her from traveling to see her daughter. Day after day, her neighbor, Elinor, is physically abused by her husband. She finally stabs him and the two run away as the mob turns on Galia after she steals money she is owed by her mafia bosses. The speaking parts alternate from English to Russian to Hebrew with subtitles. There are the usual chase scenes and shootouts and Olga Kurylenko is sexy as Galia, the lead hit woman on the run from the bad guys. A desperate woman doing anything necessary to survive in a cold, cruel world, The Assassin Next Door is depressing and in the end an average action film.",
         "Violent thrillers are yet a rather unexplored territory for the big screen Israeli cinema, and I really wonder why. The Israeli reality even if we put aside the political conflict is quite violent at least if one follows the news. While thrillers and detective stories made their way to the TV series, there are very few productions of the genres on big screens. Kirot (which means Walls, although the English title is The Assassin Next Door) is already four years old, and is one of the rare productions in the genre. It is almost a good one, but ... There was no problem for the script writers to extract the medium and the characters that populate the movie. Local mafia is said to be in control of the sex industry, and many of the characters that populate it are of Russian origin, and the sex workers are also coming in numbers from the less fortunate countries of the former Soviet Union. So a former prostitute forced by the Russian mafia to become a killer does not seem to be an extraordinary story. Even less is exceptional the case of the young woman victim of domestic violence, with simple and naive dreams that are never to be fulfilled. These two characters acted by Olga Kurylenko and local rock star Ninette Tayeb are naturally drawn to each other by a shared record of violence and social injustice, by a lack of hope that makes their fate almost unavoidable. The best scenes of the film are the ones where the two get to know each other wining over the distrust and the differences in language and background, starting to trust, then become friends and eventually share fate. The rather non-professional acting backgrounds of both actresses help, bringing freshness, sincerity and emotion in the building relation between the two. The story around is quite expected, and not badly written with the exception of the final which is unrealistic from many respects. The combination of woman killer, women in distress helping each other against violence, mafia movies, all in an Israeli margin-of-the-society environment works well because if does not take over the film, while keeping the interest of the viewers arise and balancing the story so that it does not become too melodramatic. Director Danny Lerner at his second film (he did not make any other film since then) shows quite a talent in directing actors, setting the camera at the right places, building a credible environment an Israeli can recognize. But here is the problem - there was enough good material in the film to make a more blunt social statement, or use some more striking expressive means. Danny Lerner did not undertake this challenge. Daring more and pushing the limits would have helped the film step ahead of the line. It is a decent film, a decent directorial job, and so it risks to be remembered (if at all) - decent, but not more.",
         "While nobody in their right mind would claim that THE ASSASSIN NEXT DOOR is as entertaining as EITHER the ground-breaking poster girl for the National Rifle Association found in LA FEMME NIKITA or the classic distaff buddy flick THELMA & LOUISE, it still stands as a better than average effort. Whereas NIKITA undergoes extensive training to make her assassin forays somewhat plausible, the bad guys in ASSASSIN simply give a random hooker a gun and tell her to start blowing guys away. Whereas THELMA & LOUISE feminize the ending of BUTCH CASSIDY AND AND SUNDANCE KID--which can be summed up as \"together to the end\"--ASSASSIN lets the girl buddies go their own ways, as short as the way forward may be for one of them. Though the final shootout on the bus stretches credibility, so does the ending of THE GAUNTLET and countless other American hits. The one real downer about ASSASSIN is that it seems the hitwoman's little girl--Lena--gets left in the hands of one mean dad (or guardian). Throughout this film, shot in a hot climate, the cast seems well-hydrated, which means credited \"water girl\" Prague Benbenisty deserves a shout out.",
         "This film is really good. Although there is more than enough adrenaline , I don't think of it as an action flick. The story and the characters are very good. The human aspect of the story is very well conceived. Everything is brutally natural and realistic. Although there are some scenes with some problems, I was so grasped by the film that I didn't care. Although the story is kinda sad, it is never boring. The cast and especially Olga Kurylenko is very good too. Some may say the opposite but yes; I do believe that an ordinary woman without a specific background can be a hired gun as good as Galia. (Dont worry, this is not a spoiler) There are many things in every scene that is so familiar with everyday life but also striking. The \"trivialised\" woman trafficking and prostitution could not be told any better without the audience looking away once in every 10 minutes. The directing hides itself behind the natural flow of the story but silent quality of storytelling is in every scene. If you are looking for an \"entertaining\" action movie with a lot of bloodshed, this one is not for you (except for the bloodshed) Well done to all the crew.",
         "I truly wanted to rate this film higher but there are too many plot holes and the unreal, downright dumb ending made me mark it down. Overall, the plot was good but the writing was bad. The actors did a good job with the what they had. ***Spoiler Alert*** A few plot holes to show what I mean: 1. Once she was in the flat, she could hav easily gone to her embassy (most are in Tel Aviv) and told them that her passport was stolen and got a new one. I know, I hav to get a stolen passport replace'd. 2. Eleanor was in the Army yet she needs to go on the roof and fire a pistol in the air to get wonted to the sound of the gun? BTW, shooting a gun off a rooftop is dangerous and dumb ... What goes up must come down and those bullets came down somewhere in the city. Holding a metal object in your hand during a thunderstorm on a rooftop isn't too bright either. 3. They go thru the metal detector at the bus station but yet everyone still has their guns for the final shootout. There are others. A few small ones I can overlook ... blatant ones I can't. Dumb Ending. The final shootout itself was OK. What was unbelievable was that a shootout that long wouldn't hav drawn the bus-hof's security out in full force. Even more unbelievable is that they would hav walk'd thru the hof with Galia bleeding from the wound and dripping blood and no one ... no one ... not a guard, not a bystander, not a train'd soldier came to help her. And even more unbelievable than that, was that they got on a city bus going ... where? I hope they were going to hospital but why not call an ambulance to the hof in the first place? Or at least get a taxi to a hospital. I am suppose to believ that they stood at a bus stop while she bled ... got a bus with other folks, while she bled ... and the bus driver didn't do anything? This could hav and should hav been a great film but the writing and editing fell far short of the potential."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Bleiberg Entertainment",
         "DPI",
         "Douek Productions"
      ],
      "summaries": [
         "In an old apartment building on the wrong side of the tracks, two women, unknown to each other, live across the hall on the second floor. Galia is an assassin involved against her will with the local sex-traffic mafia. All she wants is to reunite with her little daughter that she left back home in Ukraine. Eleanor is a grocery store cashier and a battered wife. She dreams of winning the lottery and running away from her abusive husband. Galia and Eleanor don't know each other, but as neighbors they share two things: an adjoining wall and a strong need to plan their escape. As Galia disobeys her latest contract, a woman target, and Eleanor discovers that she's pregnant, the two women decide to take action against their oppressors in a fight for survival and freedom.",
         "A woman forced to work for the Russian Mafia as an assassin agrees to help her next-door neighbor kill her abusive husband."
      ],
      "budget": 3000000
   },
   "movielensId": 85106,
   "movielens": {
      "languages": [
         "Pусский",
         "עִבְרִית",
         "English"
      ],
      "releaseDate": "2009-04-15",
      "dvdReleaseDate": "2009-01-01",
      "directors": ["Danny Lerner"],
      "runtime": 102,
      "movieId": 85106,
      "title": "The Assassin Next Door",
      "mpaa": "R",
      "actors": [
         "Olga Kurylenko",
         "Ninet Tayeb",
         "Zohar Strauss",
         "Liron Levo",
         "Ester Rada",
         "Lior Habra",
         "Henry David",
         "Shalom Michaelshwilli",
         "Roy Assaf",
         "Vladimir Friedman",
         "Yana Goor",
         "Raz Lissitzky",
         "Shalva Ben Moshe",
         "Reymonde Amsallem"
      ],
      "imdbMovieId": "1198153",
      "originalTitle": "Kirot",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["lBl_j4rrrJo"],
      "plotSummary": "In an old apartment building on the wrong side of the tracks, two women, unknown to each other, live across the hall on the second floor. Galia is an assassin involved against her will with the local sex-traffic mafia. All she wants is to reunite with her little daughter that she left back home in Russia. Eleanor is a grocery store cashier and a battered wife. She dreams of winning the lottery and running away from her abusive husband. Galia and Eleanor don't know each other, but as neighbors they share two things: an adjoining wall and a strong need to plan their escape. As Galia disobeys her latest contract, a woman target, and Eleanor discovers that she's pregnant, the two women decide to take action against their oppressors in a fight for survival and freedom.",
      "tmdbMovieId": 37714,
      "avgRating": 3.2,
      "releaseYear": "2009",
      "numRatings": 10,
      "posterPath": "/wYFCQMaF4aHppvqsS6ivtJIxJnA.jpg"
   }
}