{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119918",
      "video": false,
      "title": "Pooh's Grand Adventure: The Search for Christopher Robin",
      "recommendations": [
         13691,
         15655,
         261339,
         33838,
         15653,
         13706,
         185515,
         21448,
         46929,
         250480,
         13682,
         253265,
         17644,
         19975,
         19809,
         51763,
         21793,
         68665,
         27047,
         13465
      ],
      "backdrop_path": "/enyIjvOyOnkjNttuzeHAtBAVKAp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Winnie the Pooh (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edb3",
               "name": "Jim Cummings",
               "profile_path": "/i9frXvIJsGtoFikBEFVqE7uN8Bq.jpg",
               "id": 12077,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Piglet (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edb7",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Rabbit (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edbb",
               "name": "Ken Sansom",
               "profile_path": "/el8Oje4diZsMZBk91q0xDOZH0Bq.jpg",
               "id": 77482,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Owl (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edbf",
               "name": "Andre Stojka",
               "profile_path": "/dDTuDBmVS26YmnUq8WxVwCT55Wr.jpg",
               "id": 77546,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Eeyore (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edc3",
               "name": "Peter Cullen",
               "profile_path": "/bEOlxkKjGKRHIwUDfPN3JlFffpx.jpg",
               "id": 19540,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Christopher Robin (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edc7",
               "name": "Brady Bluhm",
               "profile_path": "/qDTZ1v9SeFWRKqlPBW7loKyPO1K.jpg",
               "id": 77547,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edcb",
               "name": "David Warner",
               "profile_path": "/wgp2AlWKveLBOcs8YNuLeZiLsGL.jpg",
               "id": 2076,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Tigger (voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edcf",
               "name": "Paul Winchell",
               "profile_path": "/hAhbU0lCkYA0yCHZb6sVKWluY3Y.jpg",
               "id": 77548,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Christopher Robin (singing voice)",
               "gender": 2,
               "credit_id": "52fe46269251416c7506edd3",
               "name": "Frankie J. Galasso",
               "profile_path": "/2exQ4eB4dmU9JJRoMr5m4TQLJU4.jpg",
               "id": 77549,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46269251416c7506eda3",
               "name": "Karl Geurs",
               "profile_path": null,
               "id": 77544,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46269251416c7506eda9",
               "name": "A. A. Milne",
               "profile_path": null,
               "id": 77545,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe46269251416c7506edaf",
               "name": "Karl Geurs",
               "profile_path": null,
               "id": 77544,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "553fd7d8c3a3683c700000ba",
               "name": "Carter Crocker",
               "profile_path": null,
               "id": 93304,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5540b7d6c3a36829e500135e",
               "name": "Kazuhiro Ohmame",
               "profile_path": null,
               "id": 1460791,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.984132,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14903,
      "vote_count": 67,
      "budget": 0,
      "overview": "A full length animated film for all the family to enjoy. Pooh gets confused when Christopher Robin leaves him a note to say that he has gone back to school after the holidays. So Pooh, Piglet, Tigger, Eeyore and Rabbit go in search of Christopher Robin which leads to a big adventure.",
      "similar": [],
      "original_title": "Pooh's Grand Adventure: The Search for Christopher Robin",
      "runtime": 76,
      "poster_path": "/hFr8o9AYK5u1rGOqM46vgYUXXMX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/jTPNzDEn7eHmp3nEXEEtkHm6jLg.png",
         "name": "Walt Disney Television Animation",
         "id": 3475,
         "origin_country": "US"
      }],
      "release_date": "1997-08-05",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Karl Geurs"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "A.A. Milne",
         "Karl Geurs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119918/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNjMwOTg1NV5BMl5BanBnXkFtZTcwMDk2NTIzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Cummings, John Fiedler, Ken Sansom | See full cast and crew »"],
      "reviews": [
         "This is a great movie that both my children watched extensively as toddlers. It has good messages for kids, as all Winnie the Pooh cartoons do, and the animation and voice acting are top quality. It's also got some great lines that make me laugh no matter how many times I hear them. \"Look at the biceps on that bear! I'm not worthy to dangle from the same precipice.\" - Tigger. \"Never trust that thing between your ears. Haven't had a need for mine in years.\" - Rabbit. \"What's up, buddy bear?\" \"Piglet is up, Tigger.\" - Pooh, pointing a Piglet in the top of a tree. \"Jump down, Piglet! We'll catch you, likely as not!\" - Tigger. \"End of the line. Nothing to do, and no hope of things getting better. Sounds like Saturday night at my house.\" - Eeyore. \"There's no difference between falling ten-thousand feet to the jagged rocks below, and tumbling out of bed. Except for the splat at the end, they're practically similar.\" - Tigger. I find it hard to believe that people would actually criticize this movie negatively. It's a kids' movie for crying out loud. If you've got nothing better to do than watch and criticize kids' movies, you really need to get a life. I gave it a ten. I can't think of anything that could have made it better.",
         "I found this movie to be really charming. The plot is that one day Christopher Robin goes missing, and a note is left. Owl translates his note to say that he is in the Skull, and Pooh, Piglet, Tigger, Rabbit and Eeyore all go on an adventure to find him. Most notable about this movie are its songs. The songs in here are worthy of classic Disney musicals. The characters really do have a lot of development over the course of the movie, especially Piglet overcoming his fears. The only problem with this is the animation, which isn't bad, it just isn't great. I highly recommend this charming adventure, and personally think it's only second best to the original 1977 Pooh film. My rating: ****1/2 out of *****. 71 mins. Rated G.",
         "I don't think it is quite as good as The Many Adaventures of Winnie the Pooh, which was one of the better films of the 60s-70s. Winnie the Pooh's Most Grand Adaventure is a charming and sweet film, that is noticeably quieter in tone to the 1977 film, but for me that is never an excuse for not liking a film. The animation is lovely, with lovely colours, and fairly true in style to the 1977 film. The voice talents are very good, particularly John Fiedler and Paul Winchell as Piglet and Tigger. Jim Cummings is also good as Pooh, but I don't think David Warner was as thoughtful enough a narrator as Sebastian Cabot, though I still liked him. The story is fast moving and the dialogue is delightfully humorous, but there may be some elements that may scare young children. Also, although sweet, adults will find the songs a bit limp, that said Forever and Ever is so touching. All in all, a sweet and charming film. 8/10 Bethany Cox.",
         "I can't! A Pooh film has never been bad. Pooh's cool. Christopher Robin goes to school, and leaves Pooh a note that says where he is, but Owl misreads it and says Christopher Robin has been captured by a skullasauras. Pooh and his friends go on a journey to find him and run into obstacles.Yjey finally find a cave where they each meet a fate that can be humorous.Children will think some of the film is scary, but it turns out all right in the end. Also, Pooh does have a snack with him. Pooh just can't be bad. He's a sweet bear who loves sweets. Forever and ever Pooh! The film runs 70 minutes and is unrated although it should have a G rating.",
         "Much better film for children and everybody than many other children movies. Less violent and more true and loving. Tells more about the true things in life the child is good to know about. Wise movie and moving and touching on the deeper level, I- the adult- truly enjoyed the child within me:) Winnie the Pooh really gets to you!!!!!",
         "The style doesn't belong but it works, somehow. When this film was new and I was young I thought it was cheesy and spoilt Winnie the Pooh. Now I'm older and am interested in things I've seen as a young child. I've dug out those old videos to see what sort of things I liked and hated back then (in case your wondering this was my brother's video that's why it's been left intact). I watched it and actually found myself laughing at those silly jokes and feeling quite emotional at Pooh's little song. Also is it just me or did that tree look like a skull when Pooh looks at it from Owl's window? It's a fun film to watch when you want to look back to the past. It's nice to watch in the gloom of early evenings in winter when the house is empty and quiet. A relaxing film. I did find bits of it still a little cheesy (I won't say what because I don't want to spoil the film). It's not really exciting but it doesn't need to be. The ending is a bit obvious if you can spell but who cares. You'll understand if you see the film. It's worth seeing. It's both funny and sad and possibly a little creepy for kids (it's a good point). And it is quite amusing to see how the characters deal with life with no Christopher Robin.",
         "Pooh's Grand Adventure: The Search For Christopher Robin was a film I very much valued as a younger child, as I did with all the Pooh films. So it was a very nostalgic, and wonderful reunion, when I saw the film again, years later. It hasn't held up as well as other Pooh films, but it's a treat to be sure. Pooh's Grand Adventure is about Pooh, Rabbit, Tigger, Piglet, and Eeyore, and their search for Christopher Robin, whom they believe have gone to \"Skull.\" I must warn you, the first 15 minutes are considerably better than anything else in the movie. That's not to say the rest is bad, but it's a little under-par for a Pooh film, while the first 15 minutes is arguably, Pooh at his very best. These first 15 minutes balance, humor, emotions, whimsy, and simple, yet elegant imagery. Only Pooh and Christopher Robin appear at first, which adds to the simplicity. The rest of the film, never tops, or even comes close to these first 15 minutes, but it's still enjoyable. Pooh's Grand Adventure is much darker than anything Pooh has brought us so far. It's less funny as well. Sure, there's still a lot of gags, most of which will evoke smiles and often laughs, but by comparison, there's much less than in previous (or even future) Pooh outings. There are songs, all very whimsical. Some are beautiful, others are funny. They all work, and not one should evoke a reach towards the skip button. There's a lot of emotion here, nearly as much as in The Tigger Movie. Things like fear and being alone come up, and it's surprisingly touching. The voice cast is wonderful. Voices are captured perfectly. The stand out performances as Christopher Robin, Rabbit, and Tigger are wonderful. Kanga and Roo, one might note, has been completely omitted. Pooh's Grand Adventure doesn't reach the dramatic heights of Pooh's other endeavors, but this is still whimsical, emotional, and amusing for all.",
         "I'm 20 years old and still a Pooh fan. I remembered this movie as a kid so I dug it out and watched it again. Right now, I've taken writing and acting classes so I'm a pretty good judge of movies now. And this movie succeeds on every single level. It's heart warming without being sappy. It's witty and funny without being cheesy or just stupid. It teaches a message without being too obvious. The songs are catchy and well written with fitting visuals to go along with them. This is one of those movies that doesn't feel like a kid's movie as much as it does a family movie. It's appealing to all ages and can bring a smile to anyone, even during a bad day. Very few kid's movies live up to their potential but you can rest assured that Pooh's Most Grand Adventure delivers more you would expect. Bottom line, I would recommend this masterpiece to everyone. Your kids shouldn't go through childhood without seeing it at least once.",
         "I just got the DVD for my 2 and a half yr old daughter. She loves the silly Ole bear as much as I did as a kid. With all of the sequels to really great classic Disney movies, you would think that the newer pooh would be really awful. (see the book of Pooh for example), however there is not a huge difference between this title and the academy award winning short: Winnie The Pooh and the Blustery Day, which is a bonus feature on the DVD. Rabbits singing voice sounds a bit forced and squeaky, But this isn't American Idol. My daughter sits and watches this one instead of checking in on it while playing or getting into mischief. There are great quote lines, already listed in other reviews, and sight gags that make me laugh and keeps my kids grins and giggles going even in the scarier parts. I don't believe that even young kids will have trouble with nightmares. On the other hand I myself am a Stephen King reader and my daughter is used to seeing movies based on his works, She doesn't really watch with me but she comes in and out of the room without being scared. I guess I would be sure I knew my child and watch with them the first viewing or screen it yourself first if being lost in an unknown woods and strange monster growling (Poohs hungry for honey tummy) might scare them. I just wish everyone at Disney would stay closer to Walts original vision. Hopefully The Search for Christopher Robin and Bambi 2 are signs of good things to come.",
         "I like this show... even my two sons said that they loved this cartoon very very very much... Very adventurous and enjoyable for British kids too!!! Book of pooh is also great... Kids over 3 years old would be entertained... when they found that this show talks about friendship and love... And also... Heartwarming cartoon too... My favourite characters are also such as, Piglet, Tigger, rabbit and Owl.... I also love Winnie the pooh series... If you guys haven't seen it... Well then do so now... This show would deserve to be rated 10/10 for the mixed of friendship, Love, Heartwarming, comedy and adventure..."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Disney Television Animation",
         "DisneyToon Studios"
      ],
      "summaries": ["Winnie the Pooh and Christopher Robin are best friends who wish they could be together forever. However Christopher Robin needs to go to school. Christopher Robin has trouble telling Pooh that they will be separated, so he leaves him a note. Pooh, misunderstanding and believing that Christopher Robin has gone to Skull and needs his help launches a rescue mission with the help of Rabbit, Tigger, and Piglet."],
      "budget": 0
   },
   "movielensId": 85181,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-05",
      "dvdReleaseDate": "2006-04-11",
      "directors": ["Karl Geurs"],
      "runtime": 76,
      "movieId": 85181,
      "title": "Pooh's Grand Adventure: The Search for Christopher Robin",
      "mpaa": "G",
      "actors": [
         "Jim Cummings",
         "John Fiedler",
         "Ken Sansom",
         "Andre Stojka",
         "Peter Cullen",
         "Brady Bluhm",
         "David Warner",
         "Paul Winchell",
         "Frankie J. Galasso"
      ],
      "imdbMovieId": "0119918",
      "originalTitle": "Pooh's Grand Adventure: The Search for Christopher Robin",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A full length animated film for all the family to enjoy. Pooh gets confused when Christopher Robin leaves him a note to say that he has gone back to school after the holidays. So Pooh, Piglet, Tigger, Eeyore and Rabbit go in search of Christopher Robin which leads to a big adventure.",
      "tmdbMovieId": 14903,
      "avgRating": 3.41964,
      "releaseYear": "1997",
      "numRatings": 56,
      "posterPath": "/hFr8o9AYK5u1rGOqM46vgYUXXMX.jpg"
   }
}