{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sailor",
         "id": 41599
      }],
      "imdb_id": "tt0020641",
      "video": false,
      "title": "Anna Christie",
      "recommendations": [
         72338,
         120862,
         121003,
         20675,
         66701,
         43689,
         73420
      ],
      "backdrop_path": "/lixz1BEVtHny7rGFP6i3VdJkR0y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anna Christie",
               "gender": 1,
               "credit_id": "52fe461bc3a36847f80ed13d",
               "name": "Greta Garbo",
               "profile_path": "/c0ozpVYhtozDHWtFxH29rUd7JXl.jpg",
               "id": 19549,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Matt Burke",
               "gender": 2,
               "credit_id": "52fe461bc3a36847f80ed141",
               "name": "Charles Bickford",
               "profile_path": "/m06dAXlhneuJ0f53JnpslBQ7bJp.jpg",
               "id": 30527,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chris Christofferson",
               "gender": 0,
               "credit_id": "52fe461bc3a36847f80ed145",
               "name": "George F. Marion",
               "profile_path": "/g8jmJEM81voVuPCuhFOMLRzCOVE.jpg",
               "id": 116260,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marthy Owens",
               "gender": 1,
               "credit_id": "52fe461bc3a36847f80ed149",
               "name": "Marie Dressler",
               "profile_path": "/A5EWhRmu8Pxqr25wH1X6UUVC6vl.jpg",
               "id": 89610,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Johnny, le harpiste",
               "gender": 2,
               "credit_id": "52fe461bc3a36847f80ed14d",
               "name": "James T. Mack",
               "profile_path": null,
               "id": 120474,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe461bc3a36847f80ed151",
               "name": "Lee Phelps",
               "profile_path": "/yBLIKr2IpxLzSiqBt6N9PqGQ7EZ.jpg",
               "id": 121066,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461bc3a36847f80ed139",
               "name": "Clarence Brown",
               "profile_path": "/3fQb3Hw4lUPqJaFIYDIjXVeGw5E.jpg",
               "id": 84034,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "53098e2cc3a36842130036e0",
               "name": "Frances Marion",
               "profile_path": "/eKSqAU7PxO3VCHU9o27CkyKDEkk.jpg",
               "id": 34741,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54039784c3a368119c000b73",
               "name": "Hugh Wynn",
               "profile_path": null,
               "id": 29971,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5403979ac3a368436600571a",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "540397adc3a368068c005576",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "540397c3c3a36816af000aa1",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "5555cb229251412ff9000abf",
               "name": "William H. Daniels",
               "profile_path": null,
               "id": 3637,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a48670cc3a36818ff00bba1",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.415123,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42812,
      "vote_count": 8,
      "budget": 0,
      "overview": "Old sailor Chris Christofferson eagerly awaits the arrival of his grown daughter Anna, whom he sent at five years old to live with relatives in Minnesota. He has not seen her since, but believes her to be a decent and respectably employed young woman. When Anna arrives, however, it is clear that she has lived a hard life in the dregs of society, and that much of spirit has been extinguished. She falls in love with a young sailor rescued at sea by her father, but dreads to reveal to him the truth of her past. Both father and young man are deluded about her background, yet Anna cannot quite bring herself to allow them to remain deluded.",
      "similar": [
         28292,
         50068,
         139030,
         4922,
         881,
         4421,
         387,
         2669,
         18311,
         8619,
         714,
         71805,
         1913,
         2623,
         75674,
         152747,
         643,
         2019,
         9660,
         277834
      ],
      "original_title": "Anna Christie",
      "runtime": 89,
      "poster_path": "/11CCzrtxFNAdHUIk7HEJ4uwzCJ2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1930-02-21",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Clarence Brown"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Frances Marion",
         "Eugene O'Neill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0020641/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNDA5MTY0M15BMl5BanBnXkFtZTgwMzA1NDIwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Greta Garbo, Charles Bickford, George F. Marion | See full cast and crew »"],
      "reviews": [
         "This is an amazingly well-filmed early talkie adaptation of the Eugene O'Neill play. Its major drawback is a static camera, and as a result it comes off much of the time as the filmed play it is, which is a pity, for it's a good piece of primitive moviemaking, made at a time when sound was posing all kinds of technical problems, and as a result most films were experimental whether or not this was their maker's intention. Garbo is as mysterious and charismatic as she was in her silent films, and her entrance is still classic. Her voice is strangely deep, almost boyish, which only enhances her already seductively eccentric persona. As her boyfriend, Charles Bickford is appropriately virile,--he was apparently born craggy--and a perfect counterpart to the divine Garbo. His Irish brogue is not bad at all, and he seems always a natural man of the sea, very O'Neill-like in his independent, brooding nature. As Garbo's (very) confused father, George Marion seems truly from another time. He has the sort of face and voice,--open, unmannered, totally without guile--that has vanished from the earth. Marie Dressler is also in the O'Neill swing of things. Her blank expression and intensity around the eyes speaks volumes, as she plays her boozy character as a woman at times bordering on psychosis. Poetic license, perhaps, as this is not in the script, but we can forgive Miss Dressler's excesses; she is too good at it not to. The story ends with a movement to the next thing, as distinct from resolution, which isn't the author's cup of tea; and those who like their films neatly worked out in the end will be disappointed by the absence of any real surprise. In Anna Christie we are in O'Neill country, a place of sea, storms and fog, a feeling of all-pervading and damnable uncertainty, which we would now call ambivilance, or anxiety neurosis. Rather than analyze this mood the author simply and wisely presents it, as weather, land, ocean and people intertwine and address one another in a unique language we feel priveleged to have heard.",
         "Garbo's first spoken words in this 1930 film electrified audiences and became part of Hollywood legend. Garbo had become a star in her first American film, The Torrent, in 1926. And audiences waited til this film to see if Garbo could make the transition to talkies. She did. And while Pola Negri, Vilma Banky, and Renee Adoree fell by the wayside because of their accents, Garbo sailed on for another decade. Despite the staginess of this film, Garbo is really excellent, especially in the opening scene with the equally great Marie Dressler as Marthy. The two great stars trade dirty looks and sharp words as they size each other up while they have a few drinks and set the tone for the remainder of the film. Garbo was 25; Dressler was 60. Charles Bickford is OK as Matt, and George F. Marion is good as Old Chris. Marion originated this role on Broadway in 1922 and also played it in the 1923 silent version with Blanche Sweet. This Eugene O'Neill play is a true classic yet, oddly, was never filmed again. Anna Christie ranks as one of Garbo's greatest performances. And despite the staginess of the film and the grimness of the story, she is truly a marvel. See this one for Garbo and Dressler!",
         "This is an extremely static film - many of the camera setups remain stationery while the players walk around in them - and scenes go on seemingly interminably in one set, as in the original play - but once this is accepted, one does register an extremely moody and realistic piece with some clever cinematography and two marvelous full-blooded performances - Garbo in her first talkie and Dressler in the performance that made her a star. The Garbo performance, Clarence Brown's direction and William Daniels' cinematography all earned Oscar noms. Dressler would have netted one for support but the category didn't exist as yet. As long as you are warned that it is an early talkie effort, I think you'll be pleased by the naturalness of all the players and the earnestness with which the production is realized. It's solid and stark and quite unlike anything else MGM did at the time. It was available on MGM/UA video but has been cut out of the catalogue. Very worth seeking out.",
         "A woman with a past returns to her alcoholic father living on a shabby boat and falls in love with a sailor. A deliberately grim movie gained fame as Garbo's first talkie (revealing her warm, silky deep voice), and was simultaneously made in Germany - from a well-known O'Neill play. This version now seems pretty stilted and shows the most typical mistakes of early talkies, but full of vivid moments of great power, full-blooded performances (especially the genial interplay between Garbo and Dressler)and the rare Hollywood quality of gritty realism.",
         "For Greta Garbo's first talking picture, MGM wisely chose Eugene O'Neill's Pultizer Prize winning 1921 play ANNA Christie. Also wisely, the producers backed Garbo up with not one but two members of the Original Broadway Cast (George Marion as Anna's father, Chris, and James T. Mack as Johnny the Priest - transmuted to \"Johnny the Harp\" for films so as not to offend). This little change is interesting. Like too many films accused (by those who want MOVIES to be MOVIES and ignore their origins) of being \"little more than filmed stage plays,\" the problem is not the play but the movie makers who wouldn't be more faithful to the property. By diluting a great cinematic stage work so it wouldn't offend anyone, or opening it up because they COULD, too many lose the very qualities which made the piece worth filming in the first place. Fortunately, the respect the studio had for both O'Neill and Garbo allowed ANNA Christie to survive the normally destructive process admirably in Frances Marion's generally sensitive screen adaptation. Wonder of wonders, Marion even allows the POINT of the scene where Garbo's Anna reveals her past on \"the farm\" to the man she badly wants to marry and the father who sent her there in tact! What the League of Decency must have thought of that! The source play's greatest problem has always been that Chris's friend Marthy tends to walk away with the first act and then disappears from the last two so that Anna can take stage - the two sides of the genuinely good woman men don't always recognize. The perfectly cast Marie Dressler (who had cut her teeth on the Broadway stage as well before going to Hollywood) is the perfect balance for Garbo's Anna in this area as well and the fast moving film at only 90 minutes, doesn't allow us too much time to miss her - one of the few benefits from atmosphere being shown rather than eloquently described in the original - AND screenwriter Marion is wise enough to stray from O'Neill to bring Dressler back for a touching scene two thirds of the way through the film that will remind many of Julie Laverne's second act appearance in SHOW BOAT. Anna and Marthy's early scene together on screen (16 minutes into the film) taking each other's measure and setting up all the tension of the rest of the story is among the most affecting scenes in the entire piece. Not to be missed. ANNA Christie is great tragic play and a good film drama. It's hard to imagine that a latter day remake, which would almost certainly lose the grit and atmosphere of this 1930 remake (it was first filmed without sound in 1923 - also with George Marion's original Broadway Chris) could improve on this excellent filming. The internal scenes hew closest to the play, but the exteriors shouldn't be missed by anyone with an eye to atmosphere. While the background screen work is not to modern technical standards, the backgrounds give a better glimpse than most films of the era of the actual world in which the screen play is set (especially in the New York harbor). Nearly all Garbo's naturalistic performances of the sound era have held up superbly (only the too often parodied death scene from CAMILLE, 7 years later, will occasionally draw snickers because of the heavy handed direction and the parodies), but this ANNA Christie, together with the variety of her 1932 films, MATA HARI and GRAND HOTEL, and the sublime Lubitsch touch on her 1939 comedy, NINOTCHKA (\"Garbo laughs!\"), surely stand as her best. O'Neill fans who are taken with this play at the edge of his lauded \"sea plays,\" should track down the fine World War II shaped film released in the year before the U.S. entered the conflict, THE LONG VOYAGE HOME (1940). It is almost as skillfully drawn from those sea plays as this one is from ANNA Christie, and features a youngish John Wayne in one of his rare non-Westerns supporting a fine cast of veteran actors showing him the way.",
         "78 years ago...the premiere of \"Anna Christie\" advertised by the slogan \"Garbo Talks!\" The film runs for 16 minutes and the viewers reach the climax of curiosity: Greta enters the bar and gets through a long awaited transfer from silence into sound: a few seconds closing her silent era and, at last, Greta Garbo says a historic line: \"Gimme a whiskey, ginger ale on the side and don't be stingy, baby!\" \"Anna Christie\" (1930) is the movie by Clarence Brown that introduced a great silent star Greta Garbo to talkies. Nowadays, we can only imagine what serious transfer it was for actors and actresses. The careers of many were bound to end - something we hardly or not at all see at present. And it was no coincidence that it was Clarence Brown who directed the first talkie with the Swedish beauty. Garbo trusted the director after two of his great silent productions, FLESH AND THE DEVIL (1926) and A WOMAN OF AFFAIRS (1928): movies that achieved a smashing success at the box office, both with Garbo in the lead. But we are in 2008 and that fact about the movie, now purely historical, appears to be of minor importance. The question for today's viewer is not what Garbo's voice sounds like but if the movie is still watchable after these 78 years. In other words, we all strive to answer the question if the movie has stood a test of time. Has it? When I recently watched it, I came into conclusion that, except for some minor technical aspects, including static camera, \"Anna Christie\" is still very entertaining. It's, on the one hand, a wonderful story of a life, of a reality that the young woman faces (being based on Eugene O\"Neill's play), and, on the other hand, an artistic manifestation of true magnificence in the field of direction and acting. Let me analyze these two aspects in separate paragraphs. CONTENT: Chris Christopherson (George F Marion), a heavy drinker, lives a life of a sailor, on a barge. Although his days are filled with sorrows, he is consoled by a letter from his daughter Anna (Garbo) whom he hasn't seen for 15 years. She says that she will come back to him. He starts to change everything for better; however forgets that his daughter is no longer a child lacking experience but a 23 year-old woman who has got through various sorts of things on a farm in Minnessota where she lived and worked. Moreover, he forgets that she has a right to accept another kind of male love in her life... This brief presentation of the content not from the perspective of the main character but the one which is introduced to us sooner than Anna (her father Chris) makes you realize how universal it is. Simply no letter from the whole text that life appears to be has been erased after all these years. Cases discussed here in 1930 are still meaningful and valid... PERFORMANCES. There are not many characters in the movie, but there are two that really shine in the roles. It is of course Greta Garbo herself who did something extraordinary in her 15 year-long phenomenon, the presence that strongly marked the history of early cinema (something I have already discussed in many of my earlier comments on her films). But here, Garbo is slightly different. I admit that there are moments in this movie when she does not feel very comfortable with her role. That seems to be caused by her new experience with sound in English; however, her performance is, as always, genuine and unique. But that is what everyone has expected from Garbo. The true surprise of the movie for the 1930 viewers and also for us is Marie Dressler as Marthy. She is excellent in her facial expressions, in her accent, in the entire portrayal of a drinking woman who looks at life from the perspective of \"hitting the bottle.\" Her best moments include the conversation with Anna Christie in the bar preceded by her hilarious talk with Chris. The rest of the supporting cast are fine yet not great whatsoever (here the German version makes up for it). Particularly Dressler, except for Garbo herself, constitutes an absolutely flawless choice. If you asked me what I like about \"Anna Christie\" nowadays, that's what I would tell you: it's a classic movie. However, there is one more thing that I must mention at the end. It is humor, wonderful wit that is noticeable throughout. Although the content is quite serious and \"Anna Christie\" in no way carries a comedian spirit (the only Garbo's comedy was NINOTCHKA), there are such moments when you will split your sides. Don't skip, for instance, Anna and Matt's visit in the fun park, particularly at the restaurant where he orders milk for her thinking how virtuous and innocent she is, beer for himself and where suddenly Marthy joins them by chance... \"Anna Christie\" is a perfect movie for classic buffs and a must see for all at least a bit interested in the true magnificence of performance. If you are fed up with many of those modern starlets, seek such movies out and you shall be satisfied. Very worth your search! Skaal Greta Garbo! Skaal Marie Dressler! Let us drink a toast to the great jobs you did in the movie! Skaal after all these years when wine tastes much better and your spirits are with us in a different sense...",
         "In New York, the alcoholic skipper of a coal barge Chris Christofferson (George F. Marion) receives a letter from his estranged twenty year old daughter Anna \"Christie\" Christofferson (Greta Garbo) telling that she will leave Minnesota to stay with him. Chris left Anna fifteen years ago to the countryside to be raised by relatives in a farm in St. Paul and he has never visited his daughter. Anna Christie arrives and she is a wounded woman with a hidden dishonorable past since she had worked for two years in a brothel to survive. She moves to the barge to live with her father and one night, Chris rescues the sailor Matt (Charles Bickford) and two other fainted sailors from the sea. Soon Anna and Matt fall in love with each other and Anna has the best days of her life. But when Matt proposes to marry her, she is reluctant and also haunted by her past. Matt insists and Anna opens her heart to Matt and to her father disclosing the darks secrets of her past. \"Anna Christie\" is the first talkie of Greta Garbo and a heartbreaking story of a young woman that finds redemption through love. I bought the DVD with both versions of 1930 and 1931, and the version in English is restored and has additional scenes in the beginning and in the ending; however, Jacques Feyder's version in German is better than Clarence Brown's. My vote is seven. Title (Brazil): \"Anna Christie\"",
         "This film is worthwhile despite what you may hear. The performance of Marie Dressler (I hope I am spelling it right) as a drunken old sot is reason enough to see this film. It is an amazing performance. She is in a drunken stupor in three scenes for a good long while and she never does the same thing twice. You can actually smell the alcohol when she is done. Amazing. And Greta of course speaks her first lines on film and shes great. The Eugene O'Neill story is solid and like most O'Neill stories, very deep and intense. This is not light entertainment but if you appreciate those great character actors from the 30's and 40's you will like it. Some of the film is technically fuzzy but all in all worthwhile.",
         "I'd read all the negative reviews for \"Anna Christie\". You know, the gripes about the static camera, out-dated acting and wordiness of the screenplay. But when I viewed it yesterday I found it remarkably affecting and enjoyable. Yep, Clarence Brown's camera remains stationary for the most part, and I'm pretty sure one of the microphones was concealed in the ship's light. Yep, there's a lot of dialogue and no spectacular action sequences. It's an early talkie with primitive technical aspects. But... then there's Garbo, Marie Dressler, George F. Marion and Charles Bickford, all proving that great acting is timeless. I believe \"Anna Christie\" is still one of Garbo's most iconic performances. And it's a wonderful performance from the Divine One, in a role that is really quite atypical for her. Yes, we've seen Garbo weary and almost beaten, yet never with bags under her eyes or her knocking back shots of whiskey. Garbo played so many (delightful) costume roles, that to see her play a contemporary woman is fascinating. She's not weighed down by heavy dresses or make-up. This performance seems quite raw from Garbo. The plot, from the O'Neill play, follows weary Swedish ex-prostitute Anna, and her reunion with her boozy, seaman father. Anna's had enough trouble for any girl of twenty, as she tells drunken, slovenly Marthy (Dressler)in a bar. She finds solace in a life at sea, and romance with a rough-hewn, but good-hearted, fisherman (Charles Bickford). But her past threatens to ruin it all. Charles Bickford is overlooked in Garbo's long line of (largely inferior) leading men. He's one actor who can actually share the screen with her and not get swallowed up by her magical presence. The pair have great chemistry together and seemed to enjoy working with one another. Dressler can never be accused of underplaying, and once again the grand dame is up to her old tricks, but she's terrific and convincing in her role, never annoying as in the dreadful \"Dinner At Eight\". I've never really heard of George F. Marion before, but he was wonderful as Garbo's father. This is Pre-Code, and rather gritty and dark by MGM's standards. I really enjoyed it, and while it may creak in some places, it's still wonderful.",
         "This early sound era adaptation of O'Neill's \"Anna Christie\" would be a decent movie worth seeing on its own, but it is Greta Garbo that makes it particularly worthwhile. The rest of the production is solid, and for the most part, its limitations are common to many other sound movies made in 1930. Garbo herself rises well above the level of the rest of the production, and Marie Dressler is also memorable and effective in her smaller role. It's easy enough to see why a story like this was chosen for Garbo's first \"talking\" role. It provides a female central character who offers a ready-made opportunity for an actress like Garbo to demonstrate a good range of abilities, from strength to tenderness, from coarseness to elegance. She has good scenes with several of the other characters. Dressler's raucous performance works well, and she has some very good moments. George Marion is very believable as Garbo's father. The story itself is an interesting one, with some worthwhile themes, though it does not necessarily lend itself that well to cinema. There are a few times when it might as well just be a filmed stage play, but then there are also a number of times when the camera picks up some good atmospheric details, such as the dockside setting or the New York skyline, that make a good complement to the emotional story."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "In New York, the alcoholic skipper of a coal barge Chris Christofferson receives a letter from his estranged twenty year old daughter Anna \"Christie\" Christofferson telling that she will leave Minnesota to stay with him. Chris left Anna fifteen years ago to the countryside to be raised by relatives in a farm in St. Paul and he has never visited his daughter. Anna Christie arrives and she is a wounded woman with a hidden dishonorable past since she had worked for two years in a brothel to survive. She moves to the barge to live with her father and one night, Chris rescues the sailor Matt and two other fainted sailors from the sea. Soon Anna and Matt fall in love with each other and Anna has the best days of her life. But when Matt proposes to marry her, she is reluctant and also haunted by her past. Matt insists and Anna opens her heart to Matt and to her father disclosing the darks secrets of her past.",
         "It has been 15 years since Chris has sent 5 year old Anna to live with relatives in St. Paul, and now she is coming back. Anna needs rest and a place to stay so Chris moves Marthy off his barge. One night, going down the coast, they rescue 3 survivors of a boat sinking. The big strong Scot, named Matt, takes a liking to Anna and they go to Coney Island when they get back to land. Matt decides that he will marry Anna but Chris says no - as does Anna. Every male member of Chris's family has died at sea and Chris wants Anna to have children and a house on land. This causes friction between Chris and Matt so Anna sits them down and tells both of them the truth about her miserable life in Minnesota and the secret she has been carrying.",
         "Old sailor Chris Christofferson eagerly awaits the arrival of his grown daughter Anna, whom he sent at five years old to live with relatives in Minnesota. He has not seen her since, but believes her to be a decent and respectably employed young woman. When Anna arrives, however, it is clear that she has lived a hard life in the dregs of society, and that much of spirit has been extinguished. She falls in love with a young sailor rescued at sea by her father, but dreads to reveal to him the truth of her past. Both father and young man are deluded about her background, yet Anna cannot quite bring herself to allow them to remain deluded.",
         "A young woman reunites with her estranged father and falls in love with a sailor, but struggles to tell them about her dark past."
      ],
      "budget": 376000
   },
   "movielensId": 8518,
   "movielens": {
      "languages": [
         "English",
         "svenska"
      ],
      "releaseDate": "1930-02-21",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["Clarence Brown"],
      "runtime": 89,
      "movieId": 8518,
      "title": "Anna Christie",
      "mpaa": "",
      "actors": [
         "Greta Garbo",
         "Charles Bickford",
         "George F. Marion",
         "Marie Dressler",
         "James T. Mack",
         "Lee Phelps"
      ],
      "imdbMovieId": "0020641",
      "originalTitle": "Anna Christie",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Old sailor Chris Christofferson eagerly awaits the arrival of his grown daughter Anna, whom he sent at five years old to live with relatives in Minnesota. He has not seen her since, but believes her to be a decent and respectably employed young woman. When Anna arrives, however, it is clear that she has lived a hard life in the dregs of society, and that much of spirit has been extinguished. She falls in love with a young sailor rescued at sea by her father, but dreads to reveal to him the truth of her past. Both father and young man are deluded about her background, yet Anna cannot quite bring herself to allow them to remain deluded.",
      "tmdbMovieId": 42812,
      "avgRating": 3.51,
      "releaseYear": "1930",
      "numRatings": 50,
      "posterPath": "/11CCzrtxFNAdHUIk7HEJ4uwzCJ2.jpg"
   }
}