{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "book",
            "id": 3096
         },
         {
            "name": "assistant",
            "id": 3487
         },
         {
            "name": "innocence",
            "id": 6139
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "author",
            "id": 10818
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "summer",
            "id": 13088
         }
      ],
      "imdb_id": "tt0348593",
      "video": false,
      "title": "The Door in the Floor",
      "recommendations": [
         63437,
         17770,
         17795,
         43267,
         16814,
         51321,
         157036,
         61418,
         15503,
         17207,
         17439,
         7269,
         14441,
         12280,
         6521,
         52856,
         32013,
         40506,
         32077,
         40562
      ],
      "backdrop_path": "/9zI8K73roVhW1zsJNFlQ0g23G0R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ruth Cole",
               "gender": 1,
               "credit_id": "52fe4325c3a36847f803da1f",
               "name": "Elle Fanning",
               "profile_path": "/cbFVl9NWREa0xD2vW9Z3J4ursiu.jpg",
               "id": 18050,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Ted Cole",
               "gender": 2,
               "credit_id": "52fe4325c3a36847f803da17",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Marion Cole",
               "gender": 1,
               "credit_id": "52fe4325c3a36847f803da1b",
               "name": "Kim Basinger",
               "profile_path": "/xpv6NgpY0mDr5QSWjZLXy5KlFn9.jpg",
               "id": 326,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Eddie O'Hare",
               "gender": 2,
               "credit_id": "52fe4325c3a36847f803da23",
               "name": "Jon Foster",
               "profile_path": "/kCYgj6ZMP7oUWGAHBrl0IBszLEH.jpg",
               "id": 20132,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Intervistatore",
               "gender": 2,
               "credit_id": "5a6cbc74c3a368555900d9d5",
               "name": "Larry Pine",
               "profile_path": "/cVw0dH0MKSu6ckFuqkbQK4rNcRI.jpg",
               "id": 19511,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Minty O'Hare",
               "gender": 2,
               "credit_id": "5a6cbc7e0e0a265efe00e3b5",
               "name": "John Rothman",
               "profile_path": "/bRSoDm75c5fKBbCrbrXwaPiAeST.jpg",
               "id": 60205,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dr. Loomis",
               "gender": 0,
               "credit_id": "5a6cbc870e0a265f0100e71c",
               "name": "Harvey Loomis",
               "profile_path": null,
               "id": 1967980,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Alice",
               "gender": 1,
               "credit_id": "5a6cbc940e0a265f0700e6f8",
               "name": "Bijou Phillips",
               "profile_path": "/5QlWCs241byTRTTkhlTHraz2NqY.jpg",
               "id": 11671,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Evelyn Vaughn",
               "gender": 1,
               "credit_id": "5a6cbc9d9251410769008bdf",
               "name": "Mimi Rogers",
               "profile_path": "/cTXSghmtclAmeTSg4lBBjeOwpoQ.jpg",
               "id": 13920,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "donna alla Reception",
               "gender": 1,
               "credit_id": "5a6cbcb6c3a368556200cfe6",
               "name": "Libby Langdon",
               "profile_path": "/tar86bzpswsBwcOIySIhSABu6d4.jpg",
               "id": 177692,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Eduardo Gomez",
               "gender": 0,
               "credit_id": "5a6cbcc0925141075a008924",
               "name": "Louis Arcella",
               "profile_path": "/4xHuoASFBPDCl8EYm6jv2IL7x0m.jpg",
               "id": 1348561,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mendelssohn",
               "gender": 0,
               "credit_id": "5a6cbccb9251410769008c18",
               "name": "Robert LuPone",
               "profile_path": "/hIVQjz4iP4JJ5c8euwVjEsG9SiO.jpg",
               "id": 55496,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5a6cbcd2c3a368554100e43b",
               "name": "Rachel Style",
               "profile_path": null,
               "id": 1357971,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Mrs. Mountsier",
               "gender": 1,
               "credit_id": "5a6cbce3c3a368554d00c59e",
               "name": "Claire Beckman",
               "profile_path": null,
               "id": 1336806,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4325c3a36847f803da29",
               "name": "Tod Williams",
               "profile_path": null,
               "id": 20133,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4325c3a36847f803da2f",
               "name": "John Irving",
               "profile_path": "/bLVhyhdlKRm0dE2NJKuQ9u7kLks.jpg",
               "id": 18776,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4325c3a36847f803da35",
               "name": "Tod Williams",
               "profile_path": null,
               "id": 20133,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.022335,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1944,
      "vote_count": 70,
      "budget": 0,
      "overview": "Alternately tragic and comic, an exploration of the complexities of love in both its brightest and darkest corners. Adapted from John Irving's best-selling novel A Widow for One Year, the film is set in the privileged beach community of East Hampton, New York and chronicles one pivotal summer in the lives of famous children's book author Ted Cole (Jeff Bridges) and his beautiful wife Marion (Kim Basinger). Their once-great marriage has been strained by tragedy. Her resulting despondency and his subsequent infidelities have prevented the couple from confronting a much-needed change in their relationship. Eddie O'Hare, the young man Ted hires to work as his summer assistant, is the couple's unwitting yet willing pawn - and, ultimately, the catalyst in the transformation of their lives.",
      "similar": [
         4347,
         51828,
         267192,
         5951,
         1586,
         298312,
         207932,
         2898,
         77949,
         1826,
         2142,
         147773,
         3134,
         132344,
         23830,
         26602,
         9631,
         76812,
         1730,
         10349
      ],
      "original_title": "The Door in the Floor",
      "runtime": 111,
      "poster_path": "/snmS5sgdoVVXY8YJMbrdPAEPuIM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Revere Pictures",
            "id": 1043,
            "origin_country": ""
         },
         {
            "logo_path": "/xnFIOeq5cKw09kCWqV7foWDe4AA.png",
            "name": "Focus Features",
            "id": 10146,
            "origin_country": "US"
         }
      ],
      "release_date": "2004-07-18",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tod Williams"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "John Irving",
         "Tod Williams"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0348593/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MDY2MzQ0MV5BMl5BanBnXkFtZTcwMDc1ODUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeff Bridges, Kim Basinger, Jon Foster | See full cast and crew »"],
      "reviews": [
         "As a huge follower of Jeff Bridges' work, I am here to tell you that if you're a fan too, you must jettison yourself out of your chair forthwith and propel yourself immediately to a theatre where this magnificent film is showing. The Door In The Floor gives Bridges a chance to create a character truly worthy of his subtle (and generally overlooked) brilliance; his organic, from-the-inside-out approach makes what he does seem so effortless, so thoroughly not-like-acting that he's generally hardly given his due, and if he doesn't garner some serious recognition for what he brings to the table here, there's quite simply no hope for the world. This is a film of deep, devastating power - a film where you, as an audience member, actually share space with the two main characters, Ted and Marion Cole (Bridges, of course, and an equally-brilliant Kim Bassinger, who once again reminds us why she won an Oscar a few years back). We inhabit their crumbled world, from the inside, not just as observers. By the end, we feel as if we have gone through their tragedy with them, and when I left the theatre, I felt as if my life had been changed by sharing with them what I just shared - as if time itself had stopped and left me suspended in there, with them.",
         "My wife and I just got back from \"The Door in the Floor\", and I have to say that I found the film to be complex, deep, and intense. We will be hearing about nominations at Oscar time. There are many, many ways that people react to tragedy, and withdrawing the way that Marion Cole did is certainly common. We have friends that lost their eldest daughter to a congenital heart problem a year and a half ago, and I can tell you that he (the dad) reacted just that way, although he went down the alcoholic route, along with distancing himself from his other two children, because he couldn't face his daughter's death. He finally walked out on the entire family much like Marion did. If you think that it can't happen the way that it did in the film, think again. The performances by Jeff Bridges and Kim Basinger were spot-on perfect. Henry Fonda once said the secret of great actors was that they never let the audience see the wheels turning. I thought that Jeff's performance was one of his best, maybe even better than he was in \"Fearless\", although that is certainly arguable. I still liked Kim Basinger better in \"L.A. Confidential\", but this performance is certainly up there at the top. I certainly intend to see this again, and will end up buying the DVD for my video library. I just love well-written character-driven dramas, and this is certainly one of the better ones.",
         "Having just seen this movie I cannot believe Jeff Bridges was not nominated for this performance (but after Paul Giametti getting overlooked this year, what do you expect) Perhaps people don't know what good acting is: not 'ACTING' but truth, naturalness, and a revelation of how people really behave--but Jeff is so subtle and unshowy that he just becomes the part (Kim Basinger was first rate too)Put this film up against the pretentious and showy twaddle that was American Beauty, and we see what a farce the Oscars really are. The monologue towards the end of this film where Jeff talks about the accident and the death of their two sons was heartbreaking--because it did not go for drama or histrionics, just pure, emotional truth. I urge people who have not seen this movie to please check it out--I don't think you will be sorry--if you are open to the possibility of films that treat you and respect you as an adult, and shows human beings in all their frailties in the most heartbreaking of experiences.",
         "\"The Door in the Floor\" may be one of the best movies so far this year. It offers a moving experience and memorable characters that you will not soon forget. The story is an adaptation of the best-selling novel, \"A Widow for One Year\" by John Irving (who also wrote \"The World According to Garp\" and \"The Cider House Rules\"). I haven't read the book, but the screenplay by writer/director Tod Williams is so good that it's hard to imagine that it doesn't do justice to its source. (Apparently, the book spans many decades in the life of this family; that's certainly a different approach than what is presented in the film.) Applause to Tod again for his brilliant direction in which he obtains sensitive, extraordinary performances from the sterling cast. Jeff Bridges is sublime as Ted Cole, a children's book author. His character dominates the plot and it's an Academy Award level portrayal. Bridges only gets better with time, and he is at the top of his form here. In a more understated, introspective role, Kim Basinger plays Ted's wife, Marion Cole. It's another performance deserving of Academy Award notice. Basinger's beauty is only exceeded by the depth of her acting ability. Elle Fanning, younger sister of the talented ten-year-old Dakota Fanning (\"I Am Sam\", \"The Cat in the Hat\", \"Man on Fire\") is an amazing, natural talent as young Ruth, daughter of Ted and Marion. Jon Foster plays teenaged Eddie O'Hare in yet another superlative job of acting in this movie. Mimi Rogers supports well as Mrs. Vaughn. Her filmography notes she was born in January 1956, which makes her 48 years old. Few actresses would have the ability to play this movie role. She appears in a tense scene, fully nude, and filmed from every angle while she is revolved on a life model's turntable. Wow! More power to her! \"The Door in the Floor\" title comes from one of Ted's children's books. We hear the story as Ted does a reading before a local audience. It is clear from the outset that the Cole family is in a state of severe distress, which relates to earlier losses of two sons. Writer/director Tod Williams is masterful in carrying the audience through the gradual and painful exposition of what happened to the couple's children, Tommy and Timothy. Pleased be aware that all of the principals (except Ruthie) are seen in various stages of nudity in this film -- front, side, back and on top of one another. Everything is shown with great subtlety and sensitivity within the delicate context of the film. There was certainly no prurient interest in any of it. All of the nude scenes are handled in a realistic and matter-of-fact way. For example, little Ruthie sees her father naked, which some viewers may find objectionable, but which certainly works within the context of this film. This is a movie for all seasons. It's still early in the year and we can only hope that \"The Door in the Floor,\" with its wonderful script, direction, editing, and acting, will still be remembered as we approach nominations for the best films at the end of the year. Go out of your way to see this A++ accomplishment.",
         "Spoilers A few days after watching the movie and reading an assortment of reviews from IMDb, local magazines, New York Times to Ebert, I still have not made up my mind how seriously I should take this one. The two names alone, Jeff Bridges and Kim Basinger, should make any serious moviegoers sit up and take note. As well, the subject matter itself is not something to be taken lightly, the tragic loss of children and the devastating aftermath to the parents. (Two films dealing with this subject matter immediately come to mind, Moonlight Mile and In the Bedroom, both quite 'serious' in a sense, particularly the latter). The movie losses no time in coming directly to the point, in a scene where the silent gloom freezes the air, with children books author Ted (Bridges) suggesting to Marion (Basinger) that they should have a trial separation. However, as the events unfold, it seems as if the moviemakers are worried that the audience wouldn't be able to take this heavy stuff, and start to lead us through a maze of eccentricities that almost become noire. The catalyst is 16-year-old writing student Eddie (Jon Foster) hired by Ted as a summer apprentice. It soon becomes quite evident that Ted has little intention to get Eddie involved in literary pursuits, but wants him rather as a chauffeur (Ted has lost his own license through drunk driving charges) and maybe also as a backup baby sitter for little Ruth (Elle Fanning). (A deeper reason for choosing Eddie was revealed much later). A little reminiscent of The Graduate, Marion's seduction of Eddie is however handled with much more gentleness and even some comic relief. Meanwhile, Ted's licentious relationship with a neighbour becomes noir-ish as we see him chased around the swimming pool by her with a butcher knife. The 'hook' in the movie is the delay in revealing to the audience the details of the tragic events that led to the death of the couple's two sons (one of whom looked remarkably like Eddie). The revelation, when it comes, isn't exactly earth shattering, but does serve to give the strained relationship between Ted and Marion another dimension. And we will recall that throughout the movie, we see very little of direct interaction between them. After Eddie's arrival they seem to be communicating through him. Bridges and Basinger are definitely the reasons for watching this movie. From underneath the eccentricity of Ted and the sensuality of Marion, Bridges and Basinger portray beautifully the depth of helplessness of these two characters. Little known Jon Foster is perfectly cast to bring out convincingly the innocence of Eddie. Little Elle Fanning ably demonstrates the family acting tradition. I noticed from her filmography that she played the 2-year-old stage of the character her sister Dakota played in I Am Sam.",
         "This is a must see. As a jaded New Yorker, I sit through every film, minute by minute, saying to myself, can I believe this moment. In this film, 99.9% of the moments of this film are rich in reality, all the way down to the subtle nuances of a child's syntax. You leave the theatre not questioning the motives or intentions of the characters, but loving them and respecting their choices. Irving captures life as it is, and the actors never go to extremes to manipulate you. The story, is well crafted enough to move you. Jeff Bridges has always been a talented actor and demonstrates incredible poise and intention.",
         "This well-acted tragedy pulls us through an exploration of the complexities of love in both the darkest and brightest corridors. Adapted from John Irving's best-selling novel, `A Widow For One Year', the film carefully weaves its way through the painful and tragic aftermath of a deadly accident, alternating between comedy and disaster. The setting is in the privileged beach community of East Hampton on Long Island, New York where our hero, a children's book author, Ted Cole (Jeff Bridges) resides with his beautiful wife Marion (Kim Bassinger). Once upon a time, they had a happy marriage until the bliss was shattered by the accidental death of their two sons. The aftermath resulted in a general despondency and bizarre infidelities that did little to assuage the pain and dysfunction of their deteriorating relationship. The remnants of a once great love are hinted at in almost every scene, although alas are clouded over by their inability to regroup to face the future and put away the past. Eddie O'Hare, (Jon Foster) the college junior Ted hired to work as his summer assistant and protégé, becomes the couple's unwitting, yet willing pawn, who ultimately evolves into the catalyst in the transformation of their bitter lives. Ted's recent children's book, `The Door In The Floor' in due course becomes the surviving metaphor for transforming their lives. The evolving story seems to beg for something really horrific to happen, yet offers a kind of relief when this fear is unrealized. One senses that if this couple had only handled their loss differently, a far better result would have followed. It is also a poignant tale of a young boy's rite of passage becoming a man and another man sinking into an emotional immaturity and then hopefully climbing back out. Directed and written by Tod Williams, this tale is quite apart from the usual Hollywood drivel that may leave you mired in an introspective quandary for quite some time.",
         "I loved \"Widow For One Year\" and was a bit skeptical about \"A Door In The Floor\". I just didn't see it translating well on screen and I have to admit I'm not a Kim Basinger fan either. Well I have to say I was pleasantly surprised with the screenplay and the acting. Yes I felt sad that the other complex part of the story was omitted but after hearing John Irvings comments in the bonus features he put my sadness to rest. I completely see where he was coming from on the difficulties of portraying the other events to be true to the intended meaning. Jeff Bridges and Kim Basinger were very compelling. Kim Basinger did a brilliant job at coming across as a sympathetic character while remaining emotional hardened in a state that allowed her to leave her daughter and sleep with a young teenage boy. One of the things I love best about John Irving is that he creates characters so flawed yet so redeemable and complex. He show the other side of the coin to making bad choices vs. good. He shows that to each screwed up life there are stories of how people get there and how everything around them contributes to who they become. Because of pain some submit to fears, some submit to pleasures, some submit to sorrow. And although some learn to conquer the emotions and pains of life, some don't, and for them it seems Irving wants us to see that they do the best they can to survive it and protect those they love in their own messed up ways. Underneath these characters that seem morally challenged is pain and the desire to survive it. I guess having said that it is sad that Ruth's story was never told. All things considered this was a very good movie based on a brilliant book.",
         "Based on the title, I really didn't know what to expect and enjoyed discovering the story as the focus shifted from picture to picture - is it about the writer, his wife or the young boy who arrives as an assistant... The narrative develops slowly, giving you many possibilities to get into the atmosphere of the Cole family, with feelings, images, impressions, a time to absorb. The other thing I liked about this movie is Kim Basinger; still looks stunning and even better as time goes by and it's refreshing to see her in a serious role, in something different from the 9 1/2 weeks and Batman style. I really loved the ending. As simple, so deep it was. I liked the silence before the cast started to roll and the music to play, I needed that. It's refreshing that a director finally can give us this luxury, just to let us sit still for a little while to digest what was happening on the big screen. Don't miss it - 10/10",
         "Jeff Bridges has always seemed to me to be on the edge of doing some really good things and not quite getting there. He was pretty good in Seabiscuit and back a ways he was good as \"Dude\" in The Big Lebowski, but in The Door in the Floor he is stretched and put to the test in a complicated role and he is WONDERFUL in it! The story is at times intricate and somewhat tedious, but it holds and makes its case because of Bridges. The Academy of Motion Picture Arts and Sciences feels obliged each year to give out a best actor award. Many years I think they should just say....\"none of the works meet minimum standard\"...but this year we won't have to worry about that, at least one role so far is head and shoulders above the rest and that is Jeff Bridges as Ted Cole in The Door in the Floor. Kim Basinger, still a beauty at \"50 something\", plays his troubled wife Marion with great style and feeling. The story is not all that original. Tragedy and dealing with it are Hollywood fare of many decades. However, this one is a bit different and entwines a boy becomes a man twist and a whole lot more. Just go see it! It is not a typical summer movie...I wonder why it came out so early ????...but it is great."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Focus Features",
         "This Is That Productions",
         "Revere Pictures"
      ],
      "summaries": [
         "Alternately tragic and comic, an exploration of the complexities of love in both its brightest and darkest corners. Adapted from John Irving's best-selling novel A Widow for One Year, the film is set in the privileged beach community of East Hampton, New York and chronicles one pivotal summer in the lives of famous children's book author Ted Cole (Jeff Bridges) and his beautiful wife Marion (Kim Basinger). Their once-great marriage has been strained by tragedy. Her resulting despondency and his subsequent infidelities have prevented the couple from confronting a much-needed change in their relationship. Eddie O'Hare, the young man Ted hires to work as his summer assistant, is the couple's unwitting yet willing pawn - and, ultimately, the catalyst in the transformation of their lives.",
         "A writer's young assistant becomes both pawn and catalyst in his boss's disintegrating household."
      ],
      "budget": 0
   },
   "movielensId": 8532,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-07-18",
      "dvdReleaseDate": "2004-12-14",
      "directors": ["Tod Williams"],
      "runtime": 111,
      "movieId": 8532,
      "title": "The Door in the Floor",
      "mpaa": "R",
      "actors": [
         "Elle Fanning",
         "Jeff Bridges",
         "Kim Basinger",
         "Jon Foster",
         "Larry Pine",
         "John Rothman",
         "Harvey Loomis",
         "Bijou Phillips",
         "Mimi Rogers",
         "Libby Langdon",
         "Louis Arcella",
         "Robert LuPone",
         "Rachel Style",
         "Claire Beckman"
      ],
      "imdbMovieId": "0348593",
      "originalTitle": "The Door in the Floor",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["pRoo2qvhQGg"],
      "plotSummary": "Alternately tragic and comic, an exploration of the complexities of love in both its brightest and darkest corners. Adapted from John Irving's best-selling novel A Widow for One Year, the film is set in the privileged beach community of East Hampton, New York and chronicles one pivotal summer in the lives of famous children's book author Ted Cole (Jeff Bridges) and his beautiful wife Marion (Kim Basinger). Their once-great marriage has been strained by tragedy. Her resulting despondency and his subsequent infidelities have prevented the couple from confronting a much-needed change in their relationship. Eddie O'Hare, the young man Ted hires to work as his summer assistant, is the couple's unwitting yet willing pawn - and, ultimately, the catalyst in the transformation of their lives.",
      "tmdbMovieId": 1944,
      "avgRating": 3.39773,
      "releaseYear": "2004",
      "numRatings": 484,
      "posterPath": "/snmS5sgdoVVXY8YJMbrdPAEPuIM.jpg"
   }
}