{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0345185",
      "video": false,
      "title": "In the City",
      "recommendations": [
         124955,
         99387,
         8900
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Irene",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0df",
               "name": "Mónica López",
               "profile_path": "/fTord7U1to52ZFVy7Ylvqyf4n1Q.jpg",
               "id": 67262,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mario",
               "gender": 2,
               "credit_id": "52fe4824c3a368484e0eb0e3",
               "name": "Eduard Fernández",
               "profile_path": "/amJKpgzBvEr9d6WIuT1MjADzDZT.jpg",
               "id": 87015,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sofía",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0e7",
               "name": "María Pujalte",
               "profile_path": "/uUanLn2U1LoaEvQtQd1QaxXZDpd.jpg",
               "id": 132996,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tomás",
               "gender": 2,
               "credit_id": "52fe4824c3a368484e0eb0eb",
               "name": "Àlex Brendemühl",
               "profile_path": "/cJGbHVMlSkYsSfmdk1wduOJqUxL.jpg",
               "id": 28514,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Manu",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0ef",
               "name": "Vicenta N'Dongo",
               "profile_path": "/pzOpz7MZbjbtxgTNXpj8T1RDOvD.jpg",
               "id": 560251,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Ana",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0f3",
               "name": "Miranda Makaroff",
               "profile_path": "/PJYarYmRjPKCGBVSPXx7FRh89h.jpg",
               "id": 560252,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Cristina",
               "gender": 1,
               "credit_id": "52fe4824c3a368484e0eb0f7",
               "name": "Leonor Watling",
               "profile_path": "/lFOK1qKWqXOnJHFrz4MmuiSzpBP.jpg",
               "id": 101,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Silvia",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0fb",
               "name": "Àurea Márquez",
               "profile_path": null,
               "id": 560253,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Andrés",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb0ff",
               "name": "Jordi Sánchez",
               "profile_path": "/1usE9CnFsHE0SUx16XehBJ3cPZq.jpg",
               "id": 560254,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Eva",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb103",
               "name": "Carme Pla",
               "profile_path": null,
               "id": 225129,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Eric",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb107",
               "name": "Eric Bonicatto",
               "profile_path": null,
               "id": 23676,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Dani",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb10b",
               "name": "Pere Arquillué",
               "profile_path": null,
               "id": 15600,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Marina",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb10f",
               "name": "Daniela Romero",
               "profile_path": null,
               "id": 560256,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Teo",
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb113",
               "name": "Bruno Muñoz",
               "profile_path": null,
               "id": 560257,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "55465bdcc3a36856e50041f0",
               "name": "Àgata Roca",
               "profile_path": "/o7GYIpsPqhwPMP7kMI4XRwYGSyT.jpg",
               "id": 1032556,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb119",
               "name": "Cesc Gay",
               "profile_path": null,
               "id": 73693,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb11f",
               "name": "Tomàs Aragay",
               "profile_path": null,
               "id": 560258,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4824c3a368484e0eb125",
               "name": "Cesc Gay",
               "profile_path": null,
               "id": 73693,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.82039,
      "production_countries": [],
      "id": 71110,
      "vote_count": 7,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "En la ciudad",
      "runtime": 110,
      "poster_path": "/g5HSHV4kWb8IAtbGInV6mxwB1U5.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "2003-11-07",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cesc Gay"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Tomàs Aragay",
         "Cesc Gay"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0345185/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNjM5NjA3NV5BMl5BanBnXkFtZTcwMDIzNjgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Mónica López, Eduard Fernández, María Pujalte | See full cast and crew »"],
      "reviews": [
         "\"En la ciudad\" portrays the daily lives, secrets and lies of a bunch of thirty-somethings living in Barcelona. Although they share a lot of time together, one can see the isolation affect the characters, who talk a lot but eventually fail to communicate what's really inside them. The film relies in its magnificent script, but, above all, in the great performances by its actors. Some of them are very good (Eduard Fernández, Mónica López, Alex Brendemühl and some others), but the real standout here is María Pujalte, as a sensitive woman addicted to romance. For its sincere portrait of urban life and for the great job of screenwriters and performers, overall rating: 9.",
         "We first meet Tomas, a recently divorced college professor, in bed with an underage student. The girl seems well adjusted and mature enough to be having an affair with an older man. Then we are taken to see the other characters, who as the story has it, are all inter connected, one way or another. This is a multi story movie in which adult relationships are closely examined. There are Mario and Sara. He is an architect, and she is an actress. Sara has been acting strange and Mario finds out it's because her liaison with one of the actors of the play she has been rehearsing. Monica, who is in media, one days runs into a former schoolmate,Ana,. who is now a successful photographer. Her marriage to Manu is going through some turbulence and the appearance of Ana seems like a diversion. The most pathetic of the friends we meet is Sofia, a lonely woman that has seen her youth go by, and while her friends are married, or having relationships, she is all alone. It's her loneliness that makes her lie about her love life. She tells her friends she has been seeing a French man, when in reality nothing has happened between them. Cesc Gay, a wonderful director, based in Barcelona, shows he really knows all these people. He doesn't hold any punches as he practically x-rays all the characters he examines with accuracy. The director of the fine \"Krampack\", is up to task in this movie where lives inter play in ways that surprise the viewer, as he is not afraid to show all the intensity behind what appear to be bourgeois living in Barcelona. Edoard Fernandez, who was wonderful in \"Fausto 5.0\", shows up as Mario, in a performance where he is hardly recognizable. Wonderful also is Maria Pujalte, the epitome of a lonely woman who resorts to lies in order to hide from her friends how really alone she is. Monica Lopez, Alex Brendenmuhl, Chisco Amado, Vicenta N'Dongo, and Leonor Watling are seen as part of the group of friends being examined in the film. The film clearly shows a mature Cesc Gay, one of the best directors working today in the Spanish cinema.",
         "An ensemble piece set amongst a middle class group of thirty something friends in Barcelona. This tepid drama punches well below its weight. Whilst certainly watchable, it never really gets going. Only María Pujalte's standout performance as Sofía really provides any interest or believable moments. As an unconventionally sexy woman, she perfectly captures the female habit of hankering after the unavailable and unsuitable man who has no real respect for her (in this case a married man), rejecting the attentions of a sensitive and intelligent but uncharismatic suitor. This element excepted, the minor characters and their sub plots are far more interesting than the main action. Cesc Gay appeared to try and pinpoint the inherent loneliness that many city dwellers often feel despite a comfortable lifestyle and a close group of friends, but ultimately the angst middle class misery feels more self indulgent than poignant and insightful.",
         "En la Ciudad (In the City) is a Spanish language film revolving around the troubled lives of a group of friends. Tomas is in a relationship with his student, 16-year-old Ana. Irene is hiding her pregnancy from her husband Manu. Sara is having an affair behind the back of her husband Mario, who also has an affair with Cristina. Sofia is in a relationship with Frenchman Eric, but breaks it off when she discovers he's married, hooks up with philosophy teacher Andres, but eventually returns to Eric. There are just too many characters, they're not very interesting and neither are there problems. I've seen this film twice already and I'm still not sure about what the characters' relationships are with each other. One problem with the film is that because of the sheer number of characters, the filmmakers compress events and leave out vital continuity, forcing the audience to infer as to what exactly is going on. For example, at one point, Irene and a female friend talk as if they've had an affair but we can only infer that they did, we're not exactly sure because the director did not include a scene showing them actually hooking up. It also fails to really resolve anything, so the audience is ultimately left unsatisfied, particularly in the film's last scene, in which the characters all gather together to celebrate Irene's birthday. The film is watchable enough and well-acted, but ultimately does not add up to very much.",
         "\"In the City\" is a subtitled Spanish film about the ups and downs in the lives of a slew of 30+ middle class men and women who are interconnected by a variety of relationships. This uneventful, all dialogue film simply follows these characters around town conjuring snippets of their lives from small talk to infidelity while presenting the viewer with a whole lot of subtitles to read. In spite of a very well acted and directed presentation, \"In the City\" has a scant plot with little to offer save voyeurism which is little pay-off for all the subtitle reading required to follow the motley mix of characters through the nuances of their relationships. Worth a look for Spanish speakers those into \"friends\" flicks. All others beware. (B)"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+ España",
         "Generalitat de Catalunya - Institut Català de les Indústries Culturals (ICIC)",
         "ICF Institut Català de Finances"
      ],
      "summaries": ["Relations are not easy. A multi story movie with intersecting lives in which adult relationships are closely examined. The relations are all having challenges."],
      "budget": 0
   },
   "movielensId": 85323,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2003-11-07",
      "dvdReleaseDate": "2005-04-19",
      "directors": ["Cesc Gay"],
      "runtime": 110,
      "movieId": 85323,
      "title": "In The City",
      "mpaa": null,
      "actors": [
         "Mónica López",
         "Eduard Fernández",
         "María Pujalte",
         "Àlex Brendemühl",
         "Vicenta N'Dongo",
         "Miranda Makaroff",
         "Leonor Watling",
         "Àurea Márquez",
         "Jordi Sánchez",
         "Carme Pla",
         "Eric Bonicatto",
         "Pere Arquillué",
         "Daniela Romero",
         "Bruno Muñoz",
         "Àgata Roca"
      ],
      "imdbMovieId": "0345185",
      "originalTitle": "En La Ciudad",
      "genres": [
         "Drama",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Un grupo de amigos de Barcelona se reúnen casi a diario, pero su amistad es sólo aparente; de hecho, ninguno de ellos conoce a fondo la vida de los demás. La película relata la vida íntima y secreta de cada uno de los personajes, sus sentimientos y deseos más inconfesables.",
      "tmdbMovieId": 71110,
      "avgRating": 1.66667,
      "releaseYear": "2003",
      "numRatings": 3,
      "posterPath": "/g5HSHV4kWb8IAtbGInV6mxwB1U5.jpg"
   }
}