{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nanny",
            "id": 2341
         },
         {
            "name": "honeymoon",
            "id": 2676
         },
         {
            "name": "housekeeper",
            "id": 17997
         }
      ],
      "imdb_id": "tt0022854",
      "video": false,
      "title": "Emma",
      "recommendations": [],
      "backdrop_path": "/sHnfmZmRUwIhEXo3CFCBadifprE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Emma Thatcher Smith",
               "gender": 1,
               "credit_id": "52fe4a2fc3a36847f81bf61d",
               "name": "Marie Dressler",
               "profile_path": "/A5EWhRmu8Pxqr25wH1X6UUVC6vl.jpg",
               "id": 89610,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Ronald 'Ronnie' Smith",
               "gender": 2,
               "credit_id": "52fe4a2fc3a36847f81bf639",
               "name": "Richard Cromwell",
               "profile_path": "/20ntcKkXUn0MXhGdyX7DyWCm7kD.jpg",
               "id": 20367,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Frederick 'Fred' Smith",
               "gender": 2,
               "credit_id": "52fe4a2fc3a36847f81bf63d",
               "name": "Jean Hersholt",
               "profile_path": "/47EWS9uYU5vx10cnyjtqVVDytnI.jpg",
               "id": 32138,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Countess Isabelle 'Izzy' Smith Marlin",
               "gender": 1,
               "credit_id": "52fe4a2fc3a36847f81bf641",
               "name": "Myrna Loy",
               "profile_path": "/2CR0ZjUmMWU5F03EVN32vnxkNvB.jpg",
               "id": 13577,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "District Attorney",
               "gender": 2,
               "credit_id": "52fe4a2fc3a36847f81bf645",
               "name": "John Miljan",
               "profile_path": "/6C1k1y0gVOq3nSoBG29CJPJs1N1.jpg",
               "id": 90000,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Haskins (as Purnell B. Pratt)",
               "gender": 2,
               "credit_id": "52fe4a2fc3a36847f81bf649",
               "name": "Purnell Pratt",
               "profile_path": "/alHik9wlgSTUcugUmit6mMxj7Vm.jpg",
               "id": 13358,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Matilda",
               "gender": 1,
               "credit_id": "52fe4a30c3a36847f81bf64d",
               "name": "Leila Bennett",
               "profile_path": "/1nsV0bjvJD6DIMhofXsXrjaPcjz.jpg",
               "id": 33006,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Gypsy Smith",
               "gender": 1,
               "credit_id": "52fe4a30c3a36847f81bf655",
               "name": "Barbara Kent",
               "profile_path": "/ceJsoNMjt21e3jlHwWvaJXOOumL.jpg",
               "id": 121002,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Sue Smith",
               "gender": 1,
               "credit_id": "52fe4a30c3a36847f81bf651",
               "name": "Kathryn Crawford",
               "profile_path": "/fumIhUe3tmz5ChLeUGi3kh5US2i.jpg",
               "id": 1000195,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Bill Smith",
               "gender": 2,
               "credit_id": "52fe4a30c3a36847f81bf659",
               "name": "George Meeker",
               "profile_path": "/66Z6noR6WSvytzwaxt65X5XW2E1.jpg",
               "id": 99330,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Maid",
               "gender": 1,
               "credit_id": "52fe4a30c3a36847f81bf65d",
               "name": "Dale Fuller",
               "profile_path": null,
               "id": 35504,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Drake the Butler",
               "gender": 0,
               "credit_id": "52fe4a30c3a36847f81bf661",
               "name": "Wilfred Noy",
               "profile_path": null,
               "id": 1054002,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Count Pierre",
               "gender": 0,
               "credit_id": "52fe4a30c3a36847f81bf665",
               "name": "André Cheron",
               "profile_path": null,
               "id": 1175664,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Trial Judge (uncredited)",
               "gender": 0,
               "credit_id": "52fe4a30c3a36847f81bf66d",
               "name": "Clarence Geldart",
               "profile_path": null,
               "id": 132320,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Young Isabelle (uncredited)",
               "gender": 1,
               "credit_id": "52fe4a30c3a36847f81bf669",
               "name": "Anne Shirley",
               "profile_path": "/vqwHzjBgV8wlWUi1cATSXCHV0bA.jpg",
               "id": 19327,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Dr. Horton (uncredited)",
               "gender": 2,
               "credit_id": "5ab3a937c3a368617300872f",
               "name": "Walter Walker",
               "profile_path": "/9RgAFUeUDjxnUsa4Y2dbGqpqH6E.jpg",
               "id": 590550,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a2fc3a36847f81bf623",
               "name": "Clarence Brown",
               "profile_path": "/3fQb3Hw4lUPqJaFIYDIjXVeGw5E.jpg",
               "id": 84034,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2fc3a36847f81bf629",
               "name": "Leonard Praskins",
               "profile_path": null,
               "id": 19399,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a2fc3a36847f81bf62f",
               "name": "Frances Marion",
               "profile_path": "/eKSqAU7PxO3VCHU9o27CkyKDEkk.jpg",
               "id": 34741,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a2fc3a36847f81bf635",
               "name": "Zelda Sears",
               "profile_path": "/ddj3EwdzAWm4zQLuZQ57rpg4v0A.jpg",
               "id": 590253,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "540728cfc3a36868ff000cb4",
               "name": "William LeVanway",
               "profile_path": null,
               "id": 1098542,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "540728f2c3a36868ff000cb8",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5407290bc3a36868f1000c34",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 2,
               "credit_id": "55534304925141499000185b",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "555342dfc3a3686349001834",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.044372,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 104221,
      "vote_count": 1,
      "budget": 0,
      "overview": "When Fred Smith's wife dies in childbirth, Emma Thatcher, who has been nanny to the couple's three children, cares also for the family's new addition. Fred becomes rich and successful, then he and Emma marry. When Fred dies, his will becomes a source of trouble between the children and Emma.",
      "similar": [
         788,
         1164,
         2758,
         1245,
         809,
         806,
         433,
         1933,
         223,
         73937,
         668,
         956,
         250734,
         35019,
         11283,
         5279,
         9687,
         24122,
         2266,
         5966
      ],
      "original_title": "Emma",
      "runtime": 72,
      "poster_path": "/pwCgcROI7uOQk8eDO8QyMXpfWhe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1932-01-02",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Clarence Brown"],
      "runtime": 72,
      "synopsis": null,
      "writers": [
         "Frances Marion",
         "Leonard Praskins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0022854/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjY5OTc5NTAwMV5BMl5BanBnXkFtZTcwNjIyMDcxMw@@._V1._CR49,65,255,424_SX214_AL_.jpg",
      "actors": ["Stars: Marie Dressler, Richard Cromwell, Jean Hersholt | See full cast and crew »"],
      "reviews": [
         "Watching after her rich employer's motherless brood, elderly housekeeper EMMA finds love in a very unexpected place. But an accusation of murder is only one of the burdens she'll have to bear on her weary old shoulders before she finds a way to be useful again. At the time she made this film, Marie Dressler was Hollywood's greatest star. An unlikely celebrity sensation, with her homely face & shapeless body, Dressler was nonetheless adored by the American public who could sense her basic decency & goodness. For a few brief years she became the nation's grandma, someone with whom the public could feel completely comfortable. Dressler seemed to typify the virtues of hard work & plainspoken honesty - attributes which counted for much in the Great Depression's darkest days. This in no way is meant to denigrate Dressler's talents as an actress; she earned her accolades. She had complete command of her craft, mobilizing her pliable face & large body into capturing & holding first the audience's attention & then their admiration, followed quickly by their deep affection. Marie Dressler was a unique cinematic phenomenon; she stands alone, never replicated, duplicated or effaced - except by the vagaries of fickle time. Today in this new millennium, when her special earthy benevolence is needed more than ever, she is virtually unknown to any but the oldest or most nostalgic of movie mavens. As sole star, and with a script penned by her dear friend Frances Marion, Dressler is given free rein to beguile in EMMA. Whether dealing with tragic death, or engaged in comedic high jinks (Dressler in an airplane simulator run amuck or chasing her lingerie-disgorging suitcase across a crowded train station is nothing less than hilarious) she is as completely unforgettable as she was to prove utterly irreplaceable. Firm support is given by gentle Jean Hersholt as Dressler's kindly employer. As his son, Richard Cromwell gives an energetic performance. Lovely Myrna Loy, not-quite-yet a star, is strangely awkward as Hersholt's spiteful daughter. John Miljan is effective in the role of a relentless District Attorney.",
         "This is the one that should have netted Marie Dressler the best actress Oscar, not the year prior's MIN AND BILL. EMMA is a far more complex character and she is able to show a full range of emotion in this teary tale of a devoted housekeeper who marries her employer, only to have three of his spoiled brat children turn against her when he dies. She should have drowned this bunch. She is quite superb throughout. Odd though in that if she raised them, how did they turn out to be such b*****ds???? Dressler earned a most deserved Best Actress nom. The excellent cinematography should also have been recognized by the Academy. This one is a must-see.",
         "So few movies have a woman as the main protagonist, much less an older woman. Marie Dressler is wonderful, as usual, but the script helps a great deal, and the good, unpretentious direction. Old movies really have something special, a sense of compassion and humanity. Richard Cromwell makes a very good impression. It is sad that he lived only 50 years and was forgotten. One wishes Angela would reminisce about him. He had a very pleasant speaking voice. A voice is an instrument, and speech is music.",
         "Saw this early am today 2/10/04 on TCM want to see again..sentimental, weepy yes but so well done, and a beautiful Oscar Nominated performance by Marie Dressler... have not seen this before was impressed good cast, Jean Hersholt (who has an award named after him I believe ?). a very young Myrna Loy, and Richard Cromwell as Ronnie... couldnt place hin, seen before, thanks to Imdb I was reminded that he played Julie (Jezebel) other boyfriend(Ted Dilliard) in the classic Bette Davis film Jezebel... Emma is a little gem, and Dressler more than deserved her Oscar nomination ..She was so funny in the airport scenes & the train station scene where she losses (amongst other things)her corset...and so moving in the final scenes...Watch again,, thanks TCM & Imdb for the info....",
         "This is one of the rare melodramas from 1930's MGM that is really not outdated as others. It is a funny, but genuinely touching story of a devoted housekeeper (Dressler) who marries her wealthy employer, which does not settle well with his grown children. Dressler is just perfect and the ending is so perfect and bittersweet.",
         "This is just one of several films that make me wish Marie Dressler had lived to make more movies after the advent of sound movies. Her career was on the quick upswing when she died and every movie I saw her in was greatly improved by her performance. This is a heart-wrenching movie about a lonely bachelor who marries the nanny who helped raise his kids. He incorrectly assumed that since she was like a member of the family that the kids would readily accept her. However, he soon dies after the wedding and the kids instead treat her horribly--especially when they find out the fortune was left to her. Watch it and be prepared to watch excellent acting and writing--there's just too little of it in most movies.",
         "I don't think that I could ever fully explain how wonderful this movie is, since it is just SOOO good. I caught it on Turner Classic Movies last year, and I've been dying to see it since then, but it isn't on DVD or VHS so I''m out of luck. (If anyone runs into a copy PLEASE post on IMDb!) The last post really covered the basic plot. Marie Dressler as Emma is the sweetest, most darling character to ever appear on the screen. She cares for these kids from when they are born to when they are in their twenties and thirties, loving them as if they were her own. Btw, you can catch Myrna Loy in an early non-exotic film role as one of the kids! Equally amazing is Jean Hersholt's performance as the dad. This is the only performance of his that I have ever seen, and anyone who wonders what the Hollywood humanitarian's acting talents looked like should definitely see this movie. It's very interesting that they give out an Academy award in his honor, but they don't have any of his films widely available. If I could pick just five movies in the universe to recommend, this would undoubtedly be one of them. (Primrose Path w/ Ginger Rogers, The Man with the Golden arm w/Frank Sinatra, Easy Rider, and Stage Fright w/Jane Wyman would be the other four== and they were VERY hard to pick just five!!) So next time it's on TV, make sure you watch it!",
         "Hefty housekeeper Marie Dressler (as Emma) becomes the surrogate mother to a wealthy Long Island family, after their mother dies, giving birth to Richard Cromwell (as Ronnie). While helping her prepare for a well-deserved Niagara Falls vacation, family father Jean Hersholt (as Smith) startles Ms. Dressler by proposing marriage; and, the trip becomes a honeymoon. Back home, only Mr. Cromwell, Dressler's favorite \"son\", celebrates the marriage. The three other Smith children (George Meeker, Myrna Loy, and Barbara Kent) are furious; they feel the ailing Mr. Hersholt married a mere \"servant\", who will steal the family fortune. This is Marie Dressler at her sentimental best; assisted by an apt MGM team, including Clarence Brown (director), Oliver Marsh (photographer), and Frances Marion (writer). Dressler won a \"Best Actress\" Academy Award\" for a previous effort, \"Min and Bill\" (1930); however, her \"Emma\" is a stronger characterization. This more deserved \"Best Actress\" nomination became the Academy Awards' #2 choice for the 1931/32 eligibility period; in the voting, Dressler was just behind winner Helen Hayes (in \"The Sin of Madelon Claudet\"). Dressler should have won for \"Emma\", rather than \"Min and Bill\". Richard Cromwell and Jean Hersholt might have been nominated as \"Best Supporting Actors\"; but, the category was not introduced until 1936 (Dressler would have likely won the 1929/30 award, in this category, for \"Anna Christie\"). Parts of \"Emma\" have not aged well, especially some of the early, yet important, scenes. But, its strengths make up for these weaknesses. Watch for the scene in which Dressler throws her ungrateful step-children out of the house. This is followed by a scene with Dressler being \"haunted\" by the \"ghosts\" of the little Smith children; it's an extraordinarily touching \"special effect\". And, it all works so well due to Dressler. Dressler is unfairly called a \"scene stealer\"; most of the time, she was just very good. If you were good, you kept up with her. With material to work with, Dressler's co-stars are just as memorable. Note, how, in lesser roles, Cromwell and Hersholt compliment Dressler's \"Emma\" perfectly. Both Hersholt and Dressler play his \"death scene\" beautifully. And, Cromwell's one-word description of \"Emma\" is the film's most lingering. You won't forget it. ********* Emma (1/2/32) Clarence Brown ~ Marie Dressler, Richard Cromwell, Jean Hersholt, Myrna Loy",
         "This was an outstanding movie and Marie Dressler was at her best, as usual!!!! This was slightly different from other Dressler roles because this was more of a dramatic role, rather than her usual brand of comedy, although she does have comedic scenes within the movie. She has so much depth to her role as Emma, the housekeeper (and nanny), and one can actually feel the joys and happiness when she's working with the family, as well as the pain, suffering, and sorrow she feels when her husband (played by Jean Hersholt) passes away. The scene that really got me the most, though, was right after inheriting her husband's money, his grown children turned on her. (These are the same children whom she looked after from their childhoods.) After demanding they leave the house, Emma begins to feel saddened by seeing visions of these young children she helped to raise from infancy. That scene really got to me. I felt her pain, wondering \"How could these children grow up and turn on her like that?\" And when her beloved step-son, Ronnie, died, that was really the clincher! I basically predicted THAT would happen but, nonetheless, I could still feel her pain. When watching this movie, grab your popcorn AND a box of Kleenex, because you will need them!!!!",
         "I saw \"Emma\" as a child over 50 years ago. I only remembered three scenes in it and never knew the names of the stars or the name of the film, for that matter. Thanks to IMDb, I was able to go on one of the message boards and find out the name of the film and that the star \"who was a Marie Dressler type\" as I recalled was indeed Marie Dressler (what instincts I had, even in childhood). I was just able to actually see the film on TCM. I'd love to know why it is we remember certain phrases and scenes growing up - the parts I remembered in \"Emma\" were exactly as I recalled them. \"Emma\" is the story of a housekeeper who cares for a motherless family, actually raising the youngest, Ronnie (Richard Cromwell) when his mother dies in childbirth. The entire family is very dependent upon her. Mr. Smith (Jean Hersholt) over the years becomes very wealthy as an inventor, so his kids grow up in wealth and, with the exception of Ronnie, become horrific, ungrateful brats. Emma, of course, thinks they're wonderful and is blind to their faults. When Emma leaves for her first vacation, Mr. Smith accompanies her to the station, buys an extra ticket for Niagara Falls and proposes. The two enjoy their time there, but it's to be their only time as man and wife. Mr. Smith's chronically bad heart gives out, and he dies. All of his money is left to Emma with the proviso that she take care of the children, who would squander every cent unsupervised. The children (Myrna Loy, Kathryn Crawford and George Meeker) assume Emma is going to take all of the money for herself. To break the will, they accuse her of murdering their father. Emma is put on trial for murder. Ronnie is away in the wilds of Canada and doesn't learn about this until the trial is underway. This is such a sweet story, buoyed by the magnificent performance of Marie Dressler. What an actress! Warm, strong and honest, she pulls at your heart. The very handsome Richard Cromwell, Angela Lansbury's first husband, is the adorable and adored Ronnie, and he gives an energetic performance. Cromwell had an interesting life. Not only did he enjoy some years as an actor in A productions, but he was a successful artist his entire life. Eventually, he opened his own studio. After years out of films, he was scheduled to make one, but withdrew when he was diagnosed with cancer. Jean Hersholt is excellent as Mr. Smith. Myrna Loy as one of the brat kids is absolutely stunning, though she doesn't have much to do except to act stuck-up. Highly recommended. Any movie that can stay in your mind and heart for over 50 years has something going for it. Emma had several things, the best being Marie Dressler."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "When their mother dies in childbirth, Emma Thatcher who has been the nanny to his 3 children but now has an infant to care for. The children grow up and Frederick becomes rich and successful. He and Emma marry, as it turns out right before his death, and his will becomes a source of trouble between the children and Emma.",
         "After his wife passes away in childbirth, inventor Frederick Smith looks to Emma Thatcher, his housekeeper and nanny to add the motherless newborn and three older siblings to her charge. She performs this job faithfully for 32 years, over which time one of Smith's patents makes him a millionaire. As the decades go by, his children grow to adulthood under her nurturing care. They enjoy all the advantages that great wealth brings as Isabelle marries a count, and Ronnie, the youngest and Emma's favorite, buys his own plane and realizes his dream to be a pilot. With all the children grown, Emma decides to take her first vacation, but she and Smith realize that he and the family could not do without her nurturing care, so he impulsively asks her to marry him, and her trip to the Niagra Falls turns into their honeymoon. Unfortunately, Smith succumbs to a heart attack upon their return. The family lawyer discloses that Smith, not trusting the maturity of his offspring, has left control of his estate to Emma, who as executrix would allocate the distribution of the money to her stepchildren. Emma modestly rejects the provision and believes the money should go directly to the Smith children. However, when three of them accuse her of greed and avaricious motives, she angrily throws them out of the house. Ronnie remains loyal to his de facto mother, but while he is out of the country, his vindictive siblings go to the district attorney with circumstantial evidence, and Emma finds herself facing charges of murder.",
         "After decades of raising the motherless Smith children, housekeeper Emma Thatcher is faced with resentment when she marries their father."
      ],
      "budget": 350000
   },
   "movielensId": 85374,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-01-02",
      "dvdReleaseDate": null,
      "directors": ["Clarence Brown"],
      "runtime": 72,
      "movieId": 85374,
      "title": "Emma",
      "mpaa": "",
      "actors": [
         "Marie Dressler",
         "Richard Cromwell",
         "Jean Hersholt",
         "Myrna Loy",
         "John Miljan",
         "Purnell Pratt",
         "Leila Bennett",
         "Kathryn Crawford",
         "Barbara Kent",
         "George Meeker",
         "Dale Fuller",
         "Wilfred Noy",
         "André Cheron",
         "Anne Shirley",
         "Clarence Geldart"
      ],
      "imdbMovieId": "0022854",
      "originalTitle": "Emma",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When their mother dies in childbirth, Emma Thatcher who has been the nanny to his 3 children but now has an infant to care for. The children grow up and Frederick becomes rich and successful. He and Emma marry, as it turns out right before his death, and his will becomes a source of trouble between the children and Emma.",
      "tmdbMovieId": 104221,
      "avgRating": 3.91667,
      "releaseYear": "1932",
      "numRatings": 6,
      "posterPath": "/pwCgcROI7uOQk8eDO8QyMXpfWhe.jpg"
   }
}