{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1331095",
      "video": false,
      "title": "Don't You Forget About Me",
      "recommendations": [],
      "backdrop_path": "/1i1twBbsFstBCDqnQDyADLF1dCl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45f8c3a36847f80e5129",
               "name": "David Anderle",
               "profile_path": null,
               "id": 127613,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e512d",
               "name": "Mike Bender",
               "profile_path": null,
               "id": 69209,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e5131",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5135",
               "name": "Scott Coffey",
               "profile_path": "/kRA20iJ4hBeHSUlYduRTXEhQyku.jpg",
               "id": 9306,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5139",
               "name": "Sean Covel",
               "profile_path": null,
               "id": 53941,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e513d",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5141",
               "name": "Roger Ebert",
               "profile_path": "/cN31T08VZbXoAOn3xgwBuiqmkZy.jpg",
               "id": 41694,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5145",
               "name": "Richard Elfman",
               "profile_path": null,
               "id": 127614,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e5149",
               "name": "Jennifer Gibgot",
               "profile_path": null,
               "id": 20742,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e514d",
               "name": "Andrew Gunn",
               "profile_path": null,
               "id": 64830,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5151",
               "name": "Justin Henry",
               "profile_path": "/1d3epQTrVtZa1tVnTx4WWcXNJzU.jpg",
               "id": 71241,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5155",
               "name": "John Kapelos",
               "profile_path": "/5s1r2lu8l1iODlmCf75hBhtxBoU.jpg",
               "id": 55554,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45f8c3a36847f80e5159",
               "name": "James Kerr",
               "profile_path": null,
               "id": 127615,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e515d",
               "name": "Kelly LeBrock",
               "profile_path": "/gk9cVP7V8muOcc8ygC8owV1YhF.jpg",
               "id": 46948,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5161",
               "name": "Andrew McCarthy",
               "profile_path": "/bn6djJHhLF6dTIz5H3UvuCFoeLm.jpg",
               "id": 37041,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5165",
               "name": "Ilan Mitchell-Smith",
               "profile_path": null,
               "id": 70572,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5169",
               "name": "Allan Moyle",
               "profile_path": null,
               "id": 55790,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e516d",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e5171",
               "name": "Annie Potts",
               "profile_path": "/eryXT84RL41jHSJcMy4kS3u9y6w.jpg",
               "id": 8873,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e5175",
               "name": "Jason Reitman",
               "profile_path": "/bW44MnIOve5kqqtcmmbzBre0N7D.jpg",
               "id": 52443,
               "order": 19
            },
            {
               "cast_id": 21,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45f8c3a36847f80e5179",
               "name": "Richard Roeper",
               "profile_path": null,
               "id": 127616,
               "order": 20
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f8c3a36847f80e517d",
               "name": "Alan Ruck",
               "profile_path": "/vIR73PIttX21BfZv1LgfsadDMaT.jpg",
               "id": 2394,
               "order": 21
            },
            {
               "cast_id": 23,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e5181",
               "name": "Mia Sara",
               "profile_path": "/bMEDp048tU5RwHd1m5ZZMa1DgGy.jpg",
               "id": 29091,
               "order": 22
            },
            {
               "cast_id": 24,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe45f8c3a36847f80e5185",
               "name": "Ally Sheedy",
               "profile_path": "/xfNrfzgDwyvmczadJWw4fN70siS.jpg",
               "id": 12851,
               "order": 23
            },
            {
               "cast_id": 25,
               "character": "Himself (archive footage)",
               "gender": 0,
               "credit_id": "52fe45f9c3a36847f80e5189",
               "name": "Gene Siskel",
               "profile_path": null,
               "id": 127617,
               "order": 24
            },
            {
               "cast_id": 27,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f9c3a36847f80e518d",
               "name": "Gedde Watanabe",
               "profile_path": "/nyTEOm2sEMJONOp3oWFKUZuJNTv.jpg",
               "id": 16183,
               "order": 25
            },
            {
               "cast_id": 31,
               "character": "Himself",
               "gender": 2,
               "credit_id": "553e12bf925141125600d83d",
               "name": "Chris Wyatt",
               "profile_path": null,
               "id": 1459908,
               "order": 26
            },
            {
               "cast_id": 29,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45f9c3a36847f80e5195",
               "name": "Kevin Smith",
               "profile_path": "/3XXThSMqHQgQFjM4bMJ25U1EJTj.jpg",
               "id": 19303,
               "order": 27
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45f9c3a36847f80e519b",
            "name": "Matt Austin",
            "profile_path": null,
            "id": 112333,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.063012,
      "production_countries": [],
      "id": 42273,
      "vote_count": 5,
      "budget": 0,
      "overview": "Throughout the ’80s John Hughes defined the teen movie genre and spoke not only to that generation’s teens, but every generation that has followed. Then in 1991 he hung up his director’s hat and disappeared into obscurity ala J.D Salinger. In 2008, a group of young Canadian filmmakers set out to complete a documentary about the man with what they hoped would culminate with an interview, which would be his first since 1999.",
      "similar": [],
      "original_title": "Don't You Forget About Me",
      "runtime": 74,
      "poster_path": "/5JPZ19cRa4QtNedS55mmWlwIYV6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-07-13",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "In 1991, filmmaker John Hughes disappeared from Hollywood. In 2008, four filmmakers went to find him.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Matt Sadowski",
         "Matt Sadowski"
      ],
      "runtime": 74,
      "synopsis": "How did John Hughes capture the growing pains of adolescence so perfectly? Why do his films resonate with those that grew up with them, and those that have just discovered them? Why did he leave? Armed with those and many other questions, a documentary was put into production. It wasn't long before interviews with Hughes alumni (Ally Sheedy, Judd Nelson, Andrew McCarthy) and those influenced by Hughes (Kevin Smith, Jason Reitman) transpired, shedding light on Hughes and his work. However, after 2 years of compiling hundreds of interviews there was still a very important one missing: John Hughes'. Don't You Forget About Me cuts insightful and entertaining interviews with the honest, humorous, and tension filled road trip the neophyte filmmakers make to Chicago, hoping to secure an interview with the reclusive director and closure for themselves.",
      "writers": [
         "Michael Facciolo",
         "Kari Hollend"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1331095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MjE2NDE4NV5BMl5BanBnXkFtZTcwODMyMTE1Mw@@._V1_SY317_CR21,0,214,317_AL_.jpg",
      "actors": ["Stars: David Anderle, Mike Bender, Jackie Burch | See full cast and crew »"],
      "reviews": [
         "\"Don't You Forget About Me\" A documentary every fan of John Hughes wanted to see made by a group of filmmakers no one wanted to see make it. Sadly the filmmakers involved in the creation of this project possess non of the talent the subject of the film himself embodied. Excellent moments with cast members of Mr. Hughes films and moments with the filmmakers of the documentary you cannot fast forward through quickly enough. John, I promise you I will never forget about you or the joy, tears, laughter and unforgettable lines you left behind. You will always be one of a kind. To the creators of this documentary, I will forget about you I've pressed the submit button.",
         "'Don't You Forget About Me' details the story of four Canadian filmmakers on the road to Illinois for one hopeful interview with John Hughes, a man who has shied from the spotlight since 1999. The film is mostly a collection of interviews with the people he worked with (plenty of familiar Brat Pack faces) and the various directors he inspired (from Jason Reitman to Kevin Smith and so on). This is obviously a documentary for Hughes fans, as there's plenty of adulation. The strength of 'Don't You Forget About Me' is the interviews that showcase just how influential John Hughes was (and still is). One interviewee in particular mentions that with the slamming Hughes took from the critics of the '80s, his work is due for a critical reassessment. And, in effect, this documentary is that reassessment. The film's overall weakness is the screen time devoted to the journey of the four filmmakers, themselves. Much time is spent repeating the words of the people they've interviewed, and the rest is spent bickering on how best to approach Hughes at his home. It does lend a sad ending to the film that Hughes died suddenly before its release. But one tends to wish they'd just stuck with interview footage as opposed to the editorialized \"on the road\" material. 6/10",
         "Im not dragging this out any longer than need be, so I will get to the point. The film sounded really interesting and like a fun watch, and delivered partially on my expectations. I am grateful that Netflix had the movie available, and like most of the content on there, it was sub par. I cannot believe how terrible the 'film crew' was in their lack of preparation, even though they continuously state the project was 2.5 years in the making. By the time the prospective 'meeting' with John Hughes came to be, I knew I had to write a review just to get the frustration out of me. I felt a sense of immense embarrassment for the 'crew' and was disgusted at how poorly they portrayed themselves as professionals. One would assume after the lengthy drive to Chicago and the even longer preparation (2.5 years..) they would have had the slightest idea what questions they wanted answers to, and what other topics they would want to discuss. The 'crew' had about as much sense as a group of 12 year old girls trying to track down Bieber. I will say that in the films defence, the editing of the stock interviews was done well, and whomever was responsible for that was the saving grace, for without them I would have given the film a 1/10. I hope the cast of the film has moved on to careers that would suit their capacities.. whether it telemarketing or rocking the sweet headset of a drive-thru.",
         "I can't gloss over this review just because I love watching John Hughes movies, or clips from his movies for that matter. \"Don't You Forget About Me\" is a documentary about 4 John Hughes fans that decide to hop in a van, drive to Chicago, and seek out the aloof Hughes. The clips from the films and the interviews from the stars and filmmakers like Kevin Smith were nice, and they were heartfelt tributes to Hughes, but there are two serious problems with this documentary. The first: Do you realize how easy it is to make a compilation of enjoyable moments from John Hughes films? I'm sure I could jump right over to youtube and find similar compilations. The second: So,.. you wanna make a tribute to Hughes... so you take a camera TO HIS HOUSE mind you(now everyone knows where he lives/lived)... and try to get an interview(unscheduled mind you) with someone who has obviously made a serious effort to avoid the media. I thought the whole idea was poorly thought out. They assembled a letter as well as a list of question to ask Hughes in seconds. That's the respect they had for their little documentary and for the director. The film offered little to no background or insight into Hughes' past. Instead the film makes huge assumptions that are gathered on the fly from 4 people who did NO RESEARCH other than seek out other directors and cast members to talk to. In the end, our 4 seekers offer nothing to this film other than the same emotions that nearly everyone has about John Hughes films. Even the kids they interviewed offered more insight. Was it enjoyable? Well, I didn't turn it off. However, this is something that anyone could have put together, and perhaps done it with a little more respect and panache. The problem is not so much the film as it is the idea of the film. It would have worked so much better if the whole 'searching for Hughes in the Van with a bunch of normal characters' idea would have been scrapped for an in-depth background and tribute that gave us more insight on John Hughes - after all, this was supposed to be a documentary about him.",
         "Director and screenwriter John Hughes (1950-2009) was undoubtedly one of my favorite filmmakers.I see him as a genuine artist whose movies have acquired new relevance through the decades, making me to today appreciate them not only as funny comedies or juvenile melodramas, but also as honest reflections on life, youth and the authentic meaning of maturity. The producers and the director of the documentary Don't You Forget About Me also admired Hughes, and in 2006, they decided to undertake a peregrination from Canada to the city of Chicago in search of the revered filmmaker, who partially retired from the cinema despite the legions of fans who were begging for his come-back.So, during an hour and a half, we see the team looking for his idol in order to interview him, and maybe discover the reasons behind his voluntary exile.We parallel see interviews to actors who worked with him; to famous directors who were influenced by his work; and to modern teenagers who keep finding amusement and valid messages on the movies their fathers saw when they were young. Hughes died in mid-2009, when Don't You Forget About Me was in editing process, something which significantly changed the tone from the documentary and it raised the emotions generated by the testimonies from his fans.It would be cynical (and realistic) to think that that morbid angle raised the financing and distribution from this documentary, but it includes so many interesting data and such emotive moments that I can ignore the commercialism from the project.Besides, I think the movie fulfills with the intention of honouring an important, but unfortunately not very famous, eminence from modern cinema. What is more, it is very entertaining to listen to figures such as directors Jason Reitman, Howard Deutch and Kevin Smith and film critic Roger Ebert (pre-operation) talking about their personal experiences as fans, friends and critics from the filmmaker, not to mention first-hand anecdotes from Ally Sheedy, Judd Nelson, Andrew McCarthy, Kelly LeBrock, Alan Ruck, Mia Sara and many others.All of them agree on Hughes' talent, the influence of his work in modern cinema and his famous artistic integrity. However, Don't You Forget About Me has a few fails: on the one hand, the producers and the director make the mistake of assigning leading characters to themselves, something which feels unnecessary; and on the other hand some of the points the movie makes are repeated again and again (\"Nowadays, nobody represents the teenagers in cinema\"), something which also feels unnecessary.Nevertheless, I liked this documentary pretty much, mainly because of its sincerity and the impact it produces (I cannot deny the ending left me with a lump in my throat).In summary, Don't You Forget About Me represents a honest tribute to Hughes, which is something he really deserved.",
         "The fact that Roger Ebert called John Hughes the \"philosopher of adolescence\" obscures the fact that he was to a larger degree a commercially highly successful writer, producer and also director of mainstream movies in general. Not all of them were great -- I think that Weird Science, for example, is crap (great title though). The documentary works great when we see all those familiar faces from his best movies such as \"Ferris Bueller's Day Off\" thirty years later talking about their joyful memories from when they were young and stars. Then there is a lot of eulogizing from teenagers who say that modern movies don't know what teenagers are about, but teenagers probably always would say that. To give the documentary a framework, the contributors to the documentary then set off to visit John Hughes at his home in Chicago, ostensibly to ask him to direct another teen movie. This charade is kind of annoying because it changes the focus of the documentary from Hughes to the film team, which we don't really care for all that much. Hughes of course doesn't come out to meet the camera crew, and later returns their letter without any further reply or comment. A short while after, he dies of a heart attack in New York City. The movies has its ups (the interviews with the actors) and downs (the eulogizing of the \"good old times of teen cinema when actors didn't divulge their private life on Facebook\"), but overall it was nice to get a bit more insight into John Hughes' work.",
         "Finally a documentary about the life of John Hughes. The unfortunate part is that it's made by amateur Canadian (sadly) filmmakers. The interviews with the stars of Hughes' films are the best part of this documentary. The let down is that while Judd Nelson and other stars are present, there are many stars who aren't. Where was Matthew Broderick? The filmmakers also go on an adventure to go to Hughes' home and subsequently interview him. I'll save you the effort.They don't interview Hughes because they're silly amateurs who wrote up their interview questions half an hour earlier in a coffee shop. They also get Hughes' home address from his pizza delivery man. It's worth watching for the interviews with the cast of Breakfast Club (sans Molly Ringwald, Estevez, Michael Hall), Weird Science (sans Michael Hall), Ferris Bueller (sans Matthew Broderick,Jeffrey Jones (Rooney)). You get the idea. They also interview filmmaker inspired by Hughes like Jason Reitman (Juno, Up in the Air) and Kevin Smith (Clerks). The celebs don't need much prodding so it's the best part of the documentary. I still hope someone makes a halfway decent documentary about the life of John Hughes. Hopefully it won't be deluded fan-boys who treat Hughes like he's Jesus Christ or John Lennon (okay, Hughes really is the Gen X Lennon). Hughes is dead but his legacy lives on. The man simply wanted privacy and we'll probably never know how many weirdos showed up at his door telling him how important he is. It's the J.D. Salinger effect.",
         "A documentary about a bunch of wannabe-documentary filmmakers who got amazing subjects to interview yet got nothing from them because they focused more on their own presence on screen as if anyone is or would be interested in a pack of perfect nobodies in the filmmaking industry. They behaved more like stalkers than doc makers. A pathetic lot they proved to be and a true disservice to John Hughes' work and persona. More than half the film you see these newbies pulling ideas out of their asses which evidently showed how unprepared they were to confront this task. They may have been fans but that didn't make then researchers on the subject. Also, if you read the threads section, you'll notice some of them, as little brats, have jumped in to defend their crock of feces in the most immature and unprofessional way. Skip this one... you'll be glad you did.",
         "This film left me genuinely torn, but only with regards to how vicious and spiteful this review was going to be. I've decided to allow the review to precisely reflect the way that the film in question made me feel. For the record, I do fully understand that the filmmakers - having made the unforgivable idiot's error of beginning a documentary without their centrepiece in place - must have felt that they had to do something with the footage that they'd shot. The problem is that all of their footage, without one single exception, is entirely bereft of pop cultural worth. The interviews - which make up for a depressingly slim amount of the total running time - are about as deep and interesting as a puddle of day-old dog urine. It goes without saying that the likes of Molly Ringwald, Anthony Michael Hall and Matthew Broderick don't appear here, but the actors who do take part aren't actually asked anything of note. You can envisage this crew of filmmakers putting exactly the same questions to Judd Nelson and Andrew McCarthy that they do to a band of young schoolchildren at one point. \"So like, why is John Hughes so great?\" Nobody has the answer. The inarticulate buffoons behind the camera try to answer it themselves during one utterly toe-curling sequence (that takes place in a twilight-tinged field) but if that moment of abject horror isn't to your taste, then believe me - every single other interview is quite indescribably boring. John Hughes was a genius. John Hughes meant the world to everyone. John Hughes spoke to teenagers like nobody ever has, before or since. Yes, we get the picture. So what else you got? What else they got is footage of themselves; and an apparently endless supply of it at that. What makes this fact so thoroughly appalling is that the film stops being about John Hughes after about five minutes. This isn't a film about him - it's a film about them. And these people think they're funny. They think they're cute. They think they're wise. Not only are they none of the above, they also collectively believed that eighty-odd minutes of their inane potterings would somehow make for acceptable entertainment for the paying public. I only have three words for them: how dare you. As a fan of John Hughes, the fact that a documentary pertaining to be \"about\" the great man features such a disarming lack of insight and investigation is absolutely shocking. This is nothing more than a poorly-shot travelogue about a group of deeply uninteresting people making trite and stupid observations for the entirety of the running time. I paid to have the DVD imported, so I'm sure that the ten-watt bulbs who were responsible for this production are probably laughing their heads off right now. But then again, I literally just made my money back via a re-sale on eBay. In a very, very small way, I just bucked a stupid system to make it work for me. John Hughes would have been proud.",
         "John Hughes is a personal hero of mine, so I was desperate to see this film, and I have to say I wasn't disappointed, mainly because the contributions from his movie stars, from Ally Sheedy to Alan Ruck, were respectful, sincere and full of adoration. All of them wondering what happened to a man who they considered a dear friend. I had to think though, if these actors and producers were such good friends of Hughes, wouldn't he have wanted to stay in touch? Wouldn't he have missed their company as much as they claim to miss his? One aspect of this film that I found utterly pointless was the group of wannabe film-makers, documenting their attempts to talk to the man himself. It was kind of like a secondary unneeded documentary mcguffin. It did give a glimpse in to their passion for this project though, but I found their street walking interviews with kids who obviously have no idea what they're talking about to be tacky and last-minute. This movie being made while Hughes was still alive, provided a sense of longing optimism for the return of Hughes, as the actors that have given interviews beg him to come back, which leaves you with a depressing taste in your mouth at the end of the film as you realise he's gone and his genius has gone with him. Notably absent was a contribution from Matthew Broderick, Molly Ringwald and Macaulay Culkin, which disappointed me considering I cried like a baby at their Oscars tribute. I give this film a 6/20 for effort, because despite its shortcomings, it's clearly a labour of love and who can blame them for that? Oh, and I still think Judd Nelson is a self righteous, conceited showpony."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": ["Stay The Course Productions"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 85734,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-07-13",
      "dvdReleaseDate": null,
      "directors": ["Matt Austin"],
      "runtime": 74,
      "movieId": 85734,
      "title": "Don't You Forget About Me",
      "mpaa": "R",
      "actors": [
         "David Anderle",
         "Mike Bender",
         "Jackie Burch",
         "Scott Coffey",
         "Sean Covel",
         "Howard Deutch",
         "Roger Ebert",
         "Richard Elfman",
         "Jennifer Gibgot",
         "Andrew Gunn",
         "Justin Henry",
         "John Kapelos",
         "James Kerr",
         "Kelly LeBrock",
         "Andrew McCarthy",
         "Ilan Mitchell-Smith",
         "Allan Moyle",
         "Judd Nelson",
         "Annie Potts",
         "Jason Reitman",
         "Richard Roeper",
         "Alan Ruck",
         "Mia Sara",
         "Ally Sheedy",
         "Gene Siskel",
         "Gedde Watanabe",
         "Chris Wyatt",
         "Kevin Smith"
      ],
      "imdbMovieId": "1331095",
      "originalTitle": "Don't You Forget About Me",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["Y0fPLN459_I"],
      "plotSummary": "Throughout the ’80s John Hughes defined the teen movie genre and spoke not only to that generation’s teens, but every generation that has followed. Then in 1991 he hung up his director’s hat and disappeared into obscurity ala J.D Salinger. In 2008, a group of young Canadian filmmakers set out to complete a documentary about the man with what they hoped would culminate with an interview, which would be his first since 1999.",
      "tmdbMovieId": 42273,
      "avgRating": 3.04545,
      "releaseYear": "2010",
      "numRatings": 11,
      "posterPath": "/5JPZ19cRa4QtNedS55mmWlwIYV6.jpg"
   }
}