{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "fall in love",
            "id": 155651
         }
      ],
      "imdb_id": "tt0037604",
      "video": false,
      "title": "The Clock",
      "recommendations": [51044],
      "backdrop_path": "/sVUb15bICyWPIxLabAtEOVFZ4FT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alice Maybery",
               "gender": 1,
               "credit_id": "52fe4888c3a36847f816c4f7",
               "name": "Judy Garland",
               "profile_path": "/r2p0SpwpkDc5hhg7hqbar9bKMox.jpg",
               "id": 9066,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Corporal Joe Allen",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c4fb",
               "name": "Robert Walker",
               "profile_path": "/q2qZUq1wRa28FFsgp9bGx8soaEX.jpg",
               "id": 12499,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Al Henry",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c4ff",
               "name": "James Gleason",
               "profile_path": "/ioE4cCouYzFRvqExhorQ5KmfCmq.jpg",
               "id": 30537,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "The Drunk",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c503",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Emily Henry",
               "gender": 0,
               "credit_id": "52fe4888c3a36847f816c507",
               "name": "Lucile Gleason",
               "profile_path": "/rKZnLuV2USC8IDBJ1IYxsF4pvXe.jpg",
               "id": 134254,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c523",
               "name": "Marshall Thompson",
               "profile_path": "/1VmHSu2Xrlqpe25mfQdGNygAlRN.jpg",
               "id": 84233,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Helen",
               "gender": 1,
               "credit_id": "52fe4888c3a36847f816c527",
               "name": "Ruth Brady",
               "profile_path": "/pLgPRPNppIlSolRa4u2sYRk4Phk.jpg",
               "id": 103368,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Michael Henry",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c52b",
               "name": "Chester Clute",
               "profile_path": "/9ZlAACiCnepfZS0dTAqqkdqWGse.jpg",
               "id": 30280,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "New Jersey man at Penn Station",
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c52f",
               "name": "Dick Elliott",
               "profile_path": "/pMzUTZ932haxyn2fVpSmxYgXHih.jpg",
               "id": 30217,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Patron at diner",
               "gender": 1,
               "credit_id": "52fe4888c3a36847f816c533",
               "name": "Moyna MacGill",
               "profile_path": "/6zLZawpv5idiC5cUtxKwzg28PuL.jpg",
               "id": 120173,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Milk customer",
               "gender": 1,
               "credit_id": "52fe4888c3a36847f816c537",
               "name": "Ruby Dandridge",
               "profile_path": "/lD3RVeGtyUtXK8Dc0XkuKEkUGUP.jpg",
               "id": 103369,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Policeman",
               "gender": 0,
               "credit_id": "52fe4888c3a36847f816c53b",
               "name": "Ray Teal",
               "profile_path": "/vddCtm4m8enym2C6QZ69eT3MUJo.jpg",
               "id": 93624,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c4f3",
               "name": "Vincente Minnelli",
               "profile_path": "/qUV0pO7Q1Vs9Jcvq0LWcqOERQ2H.jpg",
               "id": 13980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c50d",
               "name": "Robert Nathan",
               "profile_path": null,
               "id": 87628,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4888c3a36847f816c513",
               "name": "Joseph Schrank",
               "profile_path": null,
               "id": 190735,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4888c3a36847f816c519",
               "name": "Paul Gallico",
               "profile_path": null,
               "id": 6855,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe4888c3a36847f816c51f",
               "name": "Pauline Gallico",
               "profile_path": null,
               "id": 1150512,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5844a5409251416ae800e256",
               "name": "Arthur Freed",
               "profile_path": "/dzPxN7pBVeSgW46YEOuCzcDbIv2.jpg",
               "id": 9055,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5901129692514155d60024bf",
               "name": "George Bassman",
               "profile_path": null,
               "id": 34229,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "590112a392514155d60024cf",
               "name": "George J. Folsey",
               "profile_path": null,
               "id": 12307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "590112b092514155d2002399",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "590112be92514155f40022dd",
               "name": "William Ferrari",
               "profile_path": null,
               "id": 21872,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "590112ccc3a36810d7001fdf",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5ab84d38925141395b0254ca",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.612581,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 54028,
      "vote_count": 8,
      "budget": 0,
      "overview": "A G.I. en route to Europe falls in love during a whirlwind two-day leave in New York City.",
      "similar": [
         11474,
         1429,
         18487,
         968,
         769,
         1771,
         772,
         284,
         594,
         1213,
         9475,
         44214,
         194662,
         76025,
         10096,
         101,
         311,
         154400,
         244772,
         244786
      ],
      "original_title": "The Clock",
      "runtime": 90,
      "poster_path": "/kTjHXyfJtKSARQBgkuDBFYAixra.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1945-04-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Every second a heart-beat",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Vincente Minnelli",
         "Fred Zinnemann"
      ],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Robert Nathan",
         "Joseph Schrank"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037604/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyNzY2NDgyMl5BMl5BanBnXkFtZTcwMDcxODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Judy Garland, Robert Walker, James Gleason | See full cast and crew »"],
      "reviews": [
         "It is, in a word, breathtaking. What I especially love is the duality of Robert Walker and Judy Garland: they are both simple, lonely souls who literally stumble over each other one day then get repeatedly teamed up in a series of seemingly innocent adventures (they ride a double decker bus; she shows him Central Park; he shows her an art museum)- each time attempting to part company but continuing to draw towards each other. When you analyze it, their courtship is almost fantastic, but the time of the film's 1945 release more than allows for the magic of budding romance. It is not really a sugary film; all the while the two leads communicate, you can see the improbability of their situation on their faces. When a milkman rescues them from being stranded at the end of a long date- and they wind up doing his milk route- they burst out laughing at their situation. It makes a later scene of a subway separation particularly heartbreaking, and its later reunion at a train depot breathtaking (I guarantee tears in your eyes)- and that's sort of what the movie's all about. In retrospect, it's a bit ironic to watch the young sweetness of Walker and Garland- two stars who had tragic, frequently unhappy existences. Their chemistry here as strangers who become friends who fall in love is mesmerizing. Ms. Garland does not sing, but her dark, exquisite eyes are music to the camera lens. Several bios have cited this film and MEET ME IN ST LOUIS as the two movies which captured Ms. Garland at her most beautiful, and I suspect that has something to do with the taste and artistry of the director- who was in love with (and would soon marry) his star. Grab immediately.",
         "This film gives Judy Garland a chance (her first, I think?) to appear in a non-singing role, as Alice Mayberry, a hopeless romantic who works in New York. When she meets soldier Joe Allen (Robert Walker) they fall deeply in love with each other and are soon beating a path to the altar. As a war-based romance, this story moves fast because it has to - in a matter of days Alice and Joe know they belong together, and we know it too, thanks to the scenes we see in the museum, in the park away from the bustling traffic, and within the railway station. Garland and Walker are both excellent, the perfect representations of dewy-eyed young lovers. We're not disappointed by the little roles, either - James and Lucille Gleason play a friendly milkman and his wife, Keenan Wynn plays a drunk in a diner, Ruth Brady plays Alice's housemate Ruth, and Marshall Thompson gathers many laughs all to himself as Ruth's silent boyfriend Bill, never allowed to say anything in response to her constant questioning, gossiping, and nagging. Directed by Garland's husband Vincente Minnelli, 'The Clock' is a quiet and lovely film, not often quoted as one of the greats, but a good example of the best entertainment MGM could offer in the 1940s.",
         "A simple little wartime love story about a boy and girl who fall in love during his 24-hour leave is what lies at the heart of \"The Clock\". Amazingly, considering how authentic all the New York scenes look, the entire film was done at MGM's studio lot--even the scenes at Penn Station which was recreated by studio craftsmen with startling accuracy. But the most genuine moments in the film are the performances of the two stars--Judy Garland (in her first non-singing dramatic role) and Robert Walker. The freshness of their appeal is evident in every scene--whether it's their first awkward meeting, the night they spend helping milkman James Gleason deliver his goods, or their last desperate moments together. Vincente Minnelli's sensitive direction shows Garland at her most poignant and vulnerable. Robert Walker makes an excellent co-star. By all means, catch this little gem if you can. It's one of the best wartime films, a simple romance, honest and warmly appealing. Should make servicemen recall the hectic moments some of them may have gone through themselves.",
         "This is a warm and fuzzy movie about life back home during World War II. Unlike Since You Went Away, which involved an entire family and community, The Clock is centered around a young couple and is set entirely on the home front. Robert Walker (Joe) and Judy Garland (Alice) are the romantic couple. But, first, Joe, a country boy arrives at Penn Station in New York, goes out on the sidewalk, and is awe-struck by the skyscrapers of the city. He sees a wonderful panorama of New York City as it was in the spring of 1945. Joe has no idea how he will spend his 48-hour leave. He is caught up in the crowd, pushed here and there, and finally, sits at the foot of the stair rail on the steps in front of Penn Station between the steps and an escalator. Alice stumbles on Joe's gear, nearly falls, and gets her shoe heel caught in the escalator and broken off. She yells for somebody to retrieve her shoe heel and Joe is accommodating. From this point on in the movie, the couple are together almost constantly and visit various landmarks and attractions in New York. Alice finally goes back to her apartment and is quizzed about her long absence during the afternoon and told by her roommate not to fool with military guys. Alice's response is half-hearted at first, but then she begins to think her roommate is right. Alice's thoughts drift back to Joe, who is waiting at the clock of a prominent hotel, their meeting place at 7 p.m. Joe is in despair when Alice doesn't show. Eventually, she arrives. As one would say, the plot thickens, and there are twists and turns, but most of all, accidental separations that are heartbreaking. The longer the couple is together they realize they love each other and should get married, which is a further complication in the plot. The previous reviewer threatened to turn this movie off from boredom? Why does this movie even around today and why is it highly rated? First, it was what the public wanted then. It is 1945 and people are war-weary. They wanted some about the war but from a different point of view. Also, up to this time Judy Garland was in musicals or sang in each movie in which she played. It shows what a dramatic actress she could be. Robert Walker is at his best even though he was recently divorced from Jennifer Jones. So, this is WWII without blood and guts, rationing, etc. It is a love story that filled a need at a previous time in our history. For those of us who saw it on its first run, it is a special joy to see it in our twilight years because of all of the wonderful memories it brings back.",
         "Maybe the most idyllic of those \u009140s movies that confected a storybook New York City on the back lots of Hollywood studios, The Clock tells the story of a whirlwind wartime romance so simply and deftly that it's almost mythic \u0096 like a legend Ovid might have recounted. It also preserves the first adult dramatic role, with nary a note nor a time-step, Judy Garland was to undertake, under the Lubitsch-like touch of her director (and new husband) Vincente Minnelli. Trusting his wife to hold the screen on her own merits, he toned down or tossed away the busy stage business so characteristic of the decade, ending up with something purified \u0096 close to perfect. Indiana small-town boy Robert Walker, on a short leave from the Army before being shipped overseas, loiters in Pennsylvania Station when Garland trips over his gangly legs and breaks a heel. It's classic MGM `meet-cute,' but Minnelli doesn't milk it \u0096 they get the heel fixed and find themselves strolling through Manhattan. Though on the verge of diplomatically ditching him, impatient with his diffident, aw-shucks ways, Garland politely hangs on until finally she has to catch a bus home; she consents to meet him later, under the clock at the Astor Hotel, for a real date. Her chatterbox of a roommate upbraids her for letting herself be `picked up' by a man in uniform, and Garland dithers but finally shows up half a hour late. They spend a stiff evening together, filled with awkward pauses and edgy moments of friction, but end up talking under the stars in Central Park. Having missed the last bus home, they accept a lift from a milkman. In a sequence that comes close to cliché but pulls up short, they spend the night together \u0096 delivering bottles throughout the city for their suddenly incapacitated driver. Next morning, they lose one another, thanks to the subway system, ultimately reunite and, after running an obstacle course festooned with red tape, marry, confident that the future will find them reunited once more. There's not much incident, much action, and what there is Minnelli metes out judiciously. As a drunk who precipitates the incident that throws them together for the night, Keenan Wynn contributes a bravura turn (surely improvised) that teeters on the borderline between funny and obnoxious. As the milkman and his wife, who feeds them a farmhands' breakfast, James and Lucile Gleason offer the young lovers a preview of how young lovers become old friends (as well they might, since the actors were one another's spouses). Only in the difficulties they encounter in trying to get hitched \u0096 licenses, blood tests, civil servants' prerogatives \u0096 does the does the story threaten to careen off into frantic farce. But Minnelli reaches beyond that to find the urgency, the sickening sense that they might fail \u0096 and Garland heart-wrenchingly sums it up afterwards, at an ominously quiet wedding dinner at an automat, when she cries `It was so...ugly!' But after that discordant note Minnelli, ever the Italian, strives for consonance, and finds it in an empty church where Garland and Walker softly recite the marriage ceremony in a pew. Here, Minnelli adds his own benediction: An altar boy obscures the silent couple, sitting quietly in the background, as he enters to extinguish the candles, one by one.",
         "New York during WWII is at the center of this film. It was an era of innocence in the Big Apple. Despite the war being fought overseas, young servicemen came for some serious r&r before going to the front, and perhaps, to an imminent death. It is in this setting where we first meet the protagonists of this charming film that has to be one of the best films about the subject ever brought to the screen. Judy Garland, a rising star at MGM was a singing sensation. That is why her appearance as Alice Newberry showed audiences her acting range. Ms. Garland was a charismatic woman who proved to be the right choice to play this adorable young secretary who meets an unknown G.I. and falls in love with him during a short stay in New York. Joe Allen, an inexperienced young man feels lost as he emerges to face the crowds. Inevitably, Joe and Alice were meant to meet. They fall into an easy relationship that will lead into Joe asking Alice to marry him. Judy Garland is marvelous as Alice. She shows an uncanny sense for doing something that seemed to come naturally. She lights up the screen throughout the film. Robert Walker, with his good looks, is also an asset as the confused Army man who doesn't know the ins and outs of living in the big city. James Gleason, a character actor of many films, also appears as a friendly milkman who befriends the couple as they emerge from the park. In a way, the film shows how naive people were during those days. Now, they wouldn't be caught dead in the park at night. Vincent Minnelli directed with a sure hand. It shows in the finished product. This is one of the epitomes of what a romantic movie was all about.",
         "Two tragic, wonderful performers, Robert Walker and Judy Garland, star as a soldier and the girl he meets in \"The Clock,\" a wartime love story also starring James Gleason, Lucille Gleason, Ruth Brady, Marshall Thompson, and Keenan Wynn. Joe (Walker), on leave before he ships out, is in the big city when he meets Alice (Garland) as the heel falls off of her shoe on an escalator. His charm and enthusiasm soon overcome her, and before she knows it, she's agreed to spend time with him. They embark on an adventure which takes them to the museum and Central Park, where they meet milkman Gleason and end up delivering his products when he is accidentally knocked in the face by a drunk (Keenan Wynn) in a coffee shop. When day dawns, Alice and Joe come to a realization. This is a frenetic, high-energy movie, beautifully orchestrated by Vincente Minnelli, who manages to keep the tender love story in focus as the couple dashes around New York, losing one another, finding one another, doing a milk run, the pace picking up and becoming even more frantic as they race against the clock towards the end of the film. Then it all stops, and there is calmness and silence as \"The Clock\" draws to a close. The clock is a symbol of the limited time they have together, and a symbol of their meeting place - under the clock at the Astor Hotel - and where they find one another after one makes it on the subway and the other doesn't. It's a haunting symbol as Minnelli vividly paints a New York atmosphere with its crowds and bustling with the underpinning of World War II. And imagine - you could go into Central Park at night in the '40s and come out alive. Judy Garland, in the same studio as Lana Turner, Ava Gardner, and many other beauties, probably never appreciated what made her beautiful. In \"The Clock,\" \"The Pirate,\" and \"Meet Me in St. Louis,\" she is at her loveliest, slender and luminous with enormous eyes and a sweet, girlish, vulnerable quality. Walker, who would be bloated and dead six years after this film's release, was doubtless still reeling from problems in his private life when he made this film, but he is handsome, deft with a line, and brimming with youth. He and Garland make a wonderful couple. It's sad to think about what happened to these actors, but one is confident about the characters in \"The Clock.\" Released in 1945, the war would soon be over, and Garland's ending monologue (originally to be said by Walker) rings true. \"Whoever is making the arrangements is doing pretty well by us,\" she says. Too bad it wasn't the same for them in real life.",
         "Among the things I admire in this slight romantic drama is the most impressive set representing New York's Pennsylvania Station. It is certainly a fine achievement, designed by Cedric Gibbons and William Ferrari. Likewise, George Folsey's lovely black and white cinematograpy is perfect for the \"brief encounter\" tale. Director Vincent Minnelli (replacing Fred Zinnemann) took special care to see that Judy Garland looked as fetching as possible, and she does. It is her most beautiful makeup in films, and her performance matches it well. It's hard to believe the entire film was done in Hollywood's Culver City (using real NYC footage and backdrops) which is a tribute to the production staff and crew. They certainly obtained the Manhattan atmosphere, while telling a simple story of youthful wartime romance.",
         "***SPOILERS*** The film \"The Clock\" ends where it began at the vast spacious and impersonal Pennsylvania Train Station in NYC as we see Alice, Judy Garland, disappear as the camera pull away and she's become just a small speck in the mass of humanity milling around there. During the proceeding 48 hours Alice met by chance a young soldier Joe, Robert Walker, on a two-day pass before he's to be shipped over the Atlantic to England and eventually to the bloody battlegrounds in France and Germany to fight in the European Theater of War. During that time Alice and Joe fall in love have a whirlwind romance take a night-time sight-seeing ride of the city on a milk truck with milkman Al Henry (James Gleason), whom they helped in making his early morning deliveries. Later after getting married the two leave each other, Joe for the European battlefield and Alice for her home and job, knowing that it was fate that brought them together and it will be fate, that in the end, will bring them back together again after the war is over. A very cute and adorable 22 year-old Judy Garland in her first adult, as well as non-singing, role playing Alice the type of girl that every GI would want to have waiting for them back home. Robert Walker is very effective as the naive and befuddled small town boy in the big city who finds, among the millions of people living and working there, the one girl that he's always been looking for to bring home and meet the parents as well as marry. Touching little wartime romance involving two persons from totally different backgrounds and localities who would have never met if it wasn't for circumstances beyond their control, WWII, that in a strange and mysterious way brought them together more then anything else ever could. Besides the touching and poignant story and wonderful chemistry between the two top stars, Judy Garland & Robert Walker, \"The Clock\" was beautifully photographed with a stunning and nostalgic look at war-time, 1945, New York City. The film also brought out the people who lived there and how the war affected them and those that went \"Over There\" as well as those who were soon to go \"Over There\" to fight, and possibly die, \"Over There\". There was a very touching scene at a almost empty church with Alice and Joe quietly taking the vows of matrimony that would bring you, like it did them, to tears. This after the chaotic scene at the Justice of the Peace office in City Hall that had Alice wondering if she did, in marrying Joe, the right thing in the first place P.S She Did.",
         "Very simple, yet engaging, \"The Clock\" makes use of some rather interesting casting, some slight but sincere characters, and a story that still works all right despite no longer having its original immediacy. Judy Garland and Robert Walker work surprisingly well as the lead couple, and James Gleason probably makes the picture with his scenes. The title is appropriate, both for its reference to the role of the station clock in the plot and also as something of a simple metaphor of the broader situation faced by the characters. Generally, the best reason for having Garland in the cast is for her singing, yet here she carries the role without using her best-known talent. By keeping the character simple but believable, it works all right. Whenever you see Walker, it's almost impossible not to think of \"Strangers on a Train\" (although, of course, that film came later), yet here he also succeeds with a very different, sensitive character. In contrast, Gleason plays exactly the kind of character role that he does best and most naturally, and it's hard to see the movie working without him. He comes along at just the right time to keep things from petering out, and his character seems to provide exactly what was needed to keep the story from getting off-track. Much of the movie is not especially memorable, and the production is unspectacular, though solid. Yet it's hard not to come away with a positive feeling from watching this simple yet pleasant and thoughtful film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Soldier Joe Allen is on a two-day leave in New York, and there he meets Alice. She agrees to show him the sights and they spend the day together. In this short time they find themselves falling in love with each other, and they decide to get married before Joe has to return to camp."],
      "budget": 1324000
   },
   "movielensId": 8583,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "1945-04-25",
      "dvdReleaseDate": "2007-02-06",
      "directors": ["Vincente Minnelli"],
      "runtime": 90,
      "movieId": 8583,
      "title": "The Clock",
      "mpaa": "",
      "actors": [
         "Judy Garland",
         "Robert Walker",
         "James Gleason",
         "Keenan Wynn",
         "Lucile Gleason",
         "Marshall Thompson",
         "Ruth Brady",
         "Chester Clute",
         "Dick Elliott",
         "Moyna MacGill",
         "Ruby Dandridge",
         "Ray Teal"
      ],
      "imdbMovieId": "0037604",
      "originalTitle": "The Clock",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["y8NePTau2bc"],
      "plotSummary": "A G.I. en route to Europe falls in love during a whirlwind two-day leave in New York City.",
      "tmdbMovieId": 54028,
      "avgRating": 3.48113,
      "releaseYear": "1945",
      "numRatings": 53,
      "posterPath": "/kTjHXyfJtKSARQBgkuDBFYAixra.jpg"
   }
}