{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "germany",
            "id": 74
         },
         {
            "name": "russian",
            "id": 2808
         },
         {
            "name": "intelligence officer",
            "id": 190981
         }
      ],
      "imdb_id": "tt0047279",
      "video": false,
      "title": "Night People",
      "recommendations": [],
      "backdrop_path": "/i7OBcQdrSCJlVagV3HvzwrDyOGb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Col. Steve Van Dyke",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc4b",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Charles Leatherby",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc4f",
               "name": "Broderick Crawford",
               "profile_path": "/fCoHg9CyOza4o9Mg1TLd5yXFGM4.jpg",
               "id": 85895,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "\"Hoffy\" Hoffmeir",
               "gender": 1,
               "credit_id": "52fe4934c3a368484e11fc53",
               "name": "Anita Björk",
               "profile_path": "/4cXowCpX8v9qIcYjAkXEhFXGU4q.jpg",
               "id": 235209,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Ricky Cates",
               "gender": 1,
               "credit_id": "52fe4934c3a368484e11fc57",
               "name": "Rita Gam",
               "profile_path": "/8zC13yEEJWpbyewQiWlYqNdaOQb.jpg",
               "id": 120391,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Maj. R.A. Foster",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc5b",
               "name": "Walter Abel",
               "profile_path": "/zaeePX2vbnFw7gzATG5Q1XeTkJv.jpg",
               "id": 77114,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "M/Sgt. Eddie McColloch",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc5f",
               "name": "Buddy Ebsen",
               "profile_path": "/xBscNtDuEAUld96AlFEUPKM8TG9.jpg",
               "id": 1935,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Frederick S. Hobart",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc63",
               "name": "Max Showalter",
               "profile_path": "/kWgtaI5mcCML9PeZ6Ak9qTHkBw3.jpg",
               "id": 85409,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Frau Schindler / Rachel Cameron",
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc67",
               "name": "Jill Esmond",
               "profile_path": "/6ycUNWGU6Du41sf9XhbO2llKApy.jpg",
               "id": 122910,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Capt. Sergei \"Petey\" Petrochine",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc6b",
               "name": "Peter van Eyck",
               "profile_path": "/xXkWcMKcFSEiupgII0VMCt942Zz.jpg",
               "id": 2567,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Kathy Gerhardt",
               "gender": 1,
               "credit_id": "52fe4934c3a368484e11fc6f",
               "name": "Marianne Koch",
               "profile_path": "/tAubH4kPmCYZ4mQmRyJggQe7IJd.jpg",
               "id": 16309,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Cpl. John Leatherby",
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc73",
               "name": "Ted Avery",
               "profile_path": null,
               "id": 578519,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Maj. Burns",
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc77",
               "name": "Hugh McDermott",
               "profile_path": "/15k664Kfjhg4qS1IXSGHo5iV7SV.jpg",
               "id": 91361,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Lt. Col. Stanways",
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc7b",
               "name": "John Horsley",
               "profile_path": null,
               "id": 47569,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Uncredited",
               "gender": 2,
               "credit_id": "592a40e49251413b4105702b",
               "name": "Rodolfo Acosta",
               "profile_path": "/m7lQ5rATvSUtamHOj6qtfZJGDHr.jpg",
               "id": 24827,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc17",
               "name": "Nunnally Johnson",
               "profile_path": "/uhPu5P41qMxzybWzerWik8H2wVI.jpg",
               "id": 8501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc1d",
               "name": "Nunnally Johnson",
               "profile_path": "/uhPu5P41qMxzybWzerWik8H2wVI.jpg",
               "id": 8501,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc23",
               "name": "Nunnally Johnson",
               "profile_path": "/uhPu5P41qMxzybWzerWik8H2wVI.jpg",
               "id": 8501,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc29",
               "name": "Jed Harris",
               "profile_path": null,
               "id": 346617,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc2f",
               "name": "Tom Reed",
               "profile_path": null,
               "id": 34569,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc35",
               "name": "W.R. Burnett",
               "profile_path": "/wkdR0bD13Jr0LGGsoWgSDyoEWDU.jpg",
               "id": 80728,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4934c3a368484e11fc3b",
               "name": "Cyril J. Mockridge",
               "profile_path": null,
               "id": 14647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4934c3a368484e11fc41",
               "name": "Charles G. Clarke",
               "profile_path": null,
               "id": 70821,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4934c3a368484e11fc47",
               "name": "Dorothy Spencer",
               "profile_path": null,
               "id": 14962,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 0.571376,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 76372,
      "vote_count": 3,
      "budget": 0,
      "overview": "A US intelligence officer, stationed in Germany, is caught in a political dilemma when the Russians kidnap a young Army private, the son of prominent American businessman. In exchange for the soldier's return, the Russians attempt to barter a trade for an elderly German couple who they want for treason.",
      "similar": [
         914,
         351339,
         16869,
         2252,
         2253,
         5925,
         424,
         1245,
         65754,
         14574,
         11046,
         69,
         156022,
         341013,
         228150,
         8055,
         582,
         289,
         637,
         423
      ],
      "original_title": "Night People",
      "runtime": 93,
      "poster_path": "/akuo1zAPHoLswkf8sWnWkwPNRjC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1954-03-11",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nunnally Johnson"],
      "runtime": 93,
      "synopsis": "This cold war film begins with a beautiful and affective montage of recently divided (though not yet wall-bifurcated) Berlin. The story proper gets going as a young GI is kidnapped by the East Germans (released in 1954, it's way too early for mention of anything called the KGB or Stasi). The initial dramatic conflict is between a U.S. military officer (Gregory Peck), who realizes that getting the kid out will be a delicate operation indeed, and said kid's blunderbuss father (Broderick Crawford), who immediately flies to Germany desiring a quick extraction, arguing for either a commando raid or a cash payoff. (Some similarity here to the last few episodes of TV's \"Studio 60 on the Sunset Strip.\") Anyway, Crawford's character is an industrialist of some importance. So, Crawford assumes upon his arrival in Berlin that he can take charge of the situation, and marches straight into Peck's office with nary a word to the secretary or the two American officers standing outside the door. They don't stop him; they know Peck is expecting him. One of the officers says to the other, \"How does he have all this influence?\" \"He plays golf,\" says the other. \"Oh.\" Eventually Peck gets Crawford to cool his jets, largely by letting him witness a demonstration of the spy game's high tensions. When two elderly agents suspect that their cover is blown, they attempt suicide rather than be taken back to the East. Now another problem arises for Peck-- his ear in the East is a female (\"Hoffy,\" played by one Anita Bjork) with whom he naturally has a romantic involvement, but who, it turns out, he cannot trust. Thankfully for the Yanks, Peck finds out about her treachery without revealing that he's on to her, and through a subtle double-cross gets her to effect a prisoner swap, which naturally doesn't take place the way he initially described it to her (and through her to her Comintern bosses). (This all takes place in and around a military hospital that has cool, old-style Berlin, dumb-waiter style perpetually moving elevators, that we won't see again, far as I know, until the film version of Len Deighton's \"The Ipcress File,\" starring Michael Caine.) So, naturally the would-be swap winds up with the GI back on capitalist soil, the commies empty-handed, and the dissimulating female shattered and exposed, deprived of both Peck's love and her personal freedom (that's to say, she is taken off to jail). And Broderick Crawford finds out that a son's love is far more important than golf.",
      "writers": [
         "Nunnally Johnson",
         "Jed Harris"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047279/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NTQ1Nzk1Ml5BMl5BanBnXkFtZTYwNTAxMjg5._V1_SY225_CR45,0,214,225_AL_.jpg",
      "actors": ["Stars: Gregory Peck, Broderick Crawford, Anita Björk | See full cast and crew »"],
      "reviews": [
         "Gregory Peck plays a U.S. Army Provost caught up in exchanging a married couple wanted by Russians for a captured American soldier in \"Night People,\" set in post-war Berlin. By today's standards, this film is on the talky side, with not much action. Although the script was nominated for an Oscar, it's problematic - the denouement was much too simple, for one thing. Broderick Crawford is the father of the captured soldier, and he does an excellent job. Rita Gam is Ricky, Peck's beautiful and feisty secretary. There are several TV faces as well: Buddy Ebsen, Walter Abel, and Max Showalter. Anita Bjork is \"Hoffy,\" a woman who works for Peck yet may be playing both ends. But the film is really Peck's, who does a fantastic job creating an interesting, tough, passionate, decisive, and funny character. He's instantly both likable and admirable.",
         "Nunnally Johnson has been awarded every prize a screenwriter can be given. This film, with its many strengths, demonstrates why as well as does any of his efforts. The storyline here is both complex and adult; it is a Cold War thriller with very-strongly-developed characters, fine performances and great B/W production values throughout. Johnson wrote the script from a story by Jed Harris and directed. The story revolves around a Colonel played strongly by Gregory Peck who is in charge of US forces in Berlin who are dealing daily with the four powers governing their sectors there. Three challenges weigh on him at once. The Russian counterpart he has been trying to help defect is murdered; a young US serviceman is inexplicably kidnapped after meeting the German girl he loves, and demands are made by the Russians to get into their hands two persons in exchange for the soldier. Then the young man's industrialist father arrives to complicate matters further, making demands, while the Colonel discovers a traitor in his own circle of operatives. There are many fine performances in the well-chosen cast, headed by Peck's very strong military character, aided by Walter Abel and Buddy Ebsen; others noteworthy include Peter Van Eyck, Max Showalter, Jill Esmond, Marianne Koch, Anita Bjork and Broderick Crawford. Lovely Rita Gam plays the Colonel's secretary and steals every scene she is in. I found the military-parade pre-opening too-long; but the dialogue, characters and situations were everywhere absorbing and amazing memorable; had Johnson done nothing bu the scripts for this and \"The Dirty Dozen\", his place in Hollywood history would be secure. I suggest that with all its fine technical and creative aspects, when viewers talk about films \"they used to make but can't or don't make any more\", \"Night People\" is exactly the sort of powerful and adult film they have in mind.",
         "This is an extremely well done motion picture. The first directorial job of longtime writer Nunnally Johnson revealed a fine talent which created suspense and captures the audience minds without resorting to chases and explosions. Everything happens indoors, and it is question of brains not of fists. A magnificent job by Broderick Crawford and Gregory Peck, and a well done investigation into cold war minds, all about the kidnapping by the Russians of an U.S.Corporal in Berlin, in order to exchange him for a couple of elderly Germans wanted supposedly by former Nazis in the service of the Soviets. Everything works wonderfully, until one asks why didn't the Russians kidnap the couple in the first place and save all the trouble. Curiously, this was nominated to an Oscar for best original story... It lost, and the award went to Philip Yordan for Broken Lance, which was based not on an original story but in the screenplay Yordan had written in 1949 for House of Strangers, from a story by Jerome Weidman.",
         "Maybe not a barn-burner, but definitely worth seeing because of Peck. The movie actually captures quite well the tradecraft and moral dilemmas of counterespionage, and the scenes between Peck and Crawford are first-rate. Berlin locations add to the authenticity of this forgotten little movie.",
         "It is always difficult to watch a movie that is now 46 years old and assess it as I am continually comparing movies of the 50's to that of the 90's. With special effects, digital sound and plenty of action in movies these days, I have to be careful not to expect the same type of style from 46 yr old movies. Night People was nominated for an academy award for screenplay I believe. The movie is certainly enjoyabe and makes you think but as others have already pointed out there is one serious flaw with the story line that detracts from the overall viewing pleasure (to which I shall explain). The plot centres around a young American GI being kidnapped by the soviets with a view of having him exchanged for to ex Nazi's who double crossed the Germans's during the war and are now hiding in Berlin (the West side). The Russians wish to exchange the American GI (who's father just happens to be a prominent businessman who flies to Berlin to exert his influence). One questions begs answering. Why didn't the Russians just kidnap the two ex Nazi's themselves without any American involvement???? And to add insult to injury the actual exchange insults the intelligence of the viewer as the Russians appear total clutses (the hand over the hostage in American territory before they receive their Nazi's (in fact they don't anyway). Sheer stupidity. That aside, what the movie did highlight to me was that Gregory Peck was / is an outstanding actor. He is so far above the other cast members it isn't funny. His portrayal of Col Steve Van Dyke is excellent, being harsh, caring and funny at the appropriate moments. The movie also allowed me to acknowldege Broderick Crawford's acting ability. I gave the movie a 7/10, it is certainly enjoyable enough, but I can't help wonder how the script got an Oscar nomination?",
         "Back in 1954, this spy film appeared on the Silver Screen. When it did, it was not promoted as a spy thriller to audiences. However, this is was one of those particular movies called \" Night People \" which does produces a bigger bang than one expects. The story as written by Jed Harris and directed by Nunnally Johnson begins slowly and tells of a single United States soldier, Cpl. John Leatherby (Ted Avery) stationed in West Germany shortly after W.W. II. After his kidnapping, the Americans are notified. A noise which is heard in the state department and there after reaches the the parents of the young soldier, who happens to have some very powerful friends, one which takes his millionaire status and starts banging on Washington doors to get his son back. Back in Germany, the problem lands on the stoop of one, Col. Steve Van Dyke (Gregory Peck) who is ordered to resolve the issue. He is an experienced soldier, but is hindered by the boy's Father (Broderick Crawford) who tries to throw his weight around and ably assisted by Sgt. Eddie McColloch (Buddy Ebsen). Dealing with the other major powers controlling the Eastern section of the Berlin Wall, proves a difficult task, what with the rise of the Russians, Ex-Nazis, double agents and political victims all vining for his attention. What we expect as an audience members is a sleeper, instead this film lays the foundation of later Tom Clancy type spy thrillers and Gregory Peck does a notable job in his role. Without hesitation I would recommend this movie due to the participation of Broderick Crawford, Buddy Ebsen, Anita Björk and Marianne Koch, and all the rest of the cast who made this remarkable film a classic. ****",
         "This film is so well crafted that it still can't be faulted - 60 years later. There's not a weak player in the cast - and this must be the film to remember both Peck and Crawford by. Peck by his mastery of the very complex character he has to play, Crawford by the masterful way in which he plays his usual, boorish, stereotype - but then brilliantly wises up to reality. The scenes where Peck and Crawford interact are electric. The plot is very, very complex. Even if you pay full attention to every word and every character nuance, you'll probably still be unprepared for the twists and turns of Nunnally Johnson's subtle and complex story. On this topic, you'll note some reviews criticising the plot for weaknesses. Not So. It is a foolhardy reviewer who goes up against a Nunnally Johnson script! To elaborate I'd have to spoil. Suffice it to say that this story is a wild horse - and you'll have one heck of a job staying on its back as it bucks, twists and cavorts. Worth seeing - has to be seen, some might say - more than once!",
         "It's a fast-paced thriller about a mob of Himmler's goons in post-war Berlin who kidnap an American GI, the son of a big wheel in the ferris business, and who want to trade the kid back for a pair of burnt-out old anti-Nazi Germans so they can torture and kill them as revenge. Get that? If not, it's not too important. The movie will make things almost clear enough. It's a lot of fun to watch. The acting required is negligible -- the plot is everything. Broderick Crawford does his \"junkman\" number from an earlier movie, a blustering materialist who comes to Germany to cut through the red tape and see that his kidnapped son is returned regardless of the cost. The price is the return of those two anti-Nazis, one of them already deliberately blinded by the Gestapo because of his involvement in the plot to assassinate Hitler. By the end of the movie, Crawford has seen the human face of Cold War intrigue and decides that the elderly couple should be saved. His feelings, of course, are as irrelevant after his change of heart as they were before. The job is in the hands of stern but human Major Gregory Peck. Peck snaps out orders and calls everyone by diminutives -- Stansman is \"Stanzy,\" Frau Hoffmeier is \"Hoffy,\" Colonel Ludovich is \"Ludy\", Petrochine is \"Petey\", and so on, so obsessively that one wonders if Nunally Johnson actually visualized the script. There's a little hole in the plot too, or maybe it's somewhere in my frontal lobes. Peck discovers that his former girl friend Hoffy is actually a spy for the Russkies (or for Himmler's thugs, it's not clear). And she realizes at a critical point that Peck knows. How does she realize it? I don't know. In the scene, Peck seems to do nothing that would arouse her suspicions. Maybe she is a Jungian intuitive type. But who cares? You can't really take any of this seriously, not even the deaths that crop up in the story, because we have never seen the people who die. And the film is leavened with occasional shots of humor. Barnaby Jones -- I mean Buddy Ebson as the wisecracking sergeant keeps poking his head into a room full of guys listening to the radio and asks who's ahead -- the Yankees again? And Ebson also has to go through one of those scenes in which he samples a bottle of absinthe, grimaces, shudders, and starts to speak in a hoarse whisper before clearing his throat and speaking normally. There is a running gag about a doctor who is trying to quit smoking by never carrying any cigarettes around, except that he keeps bumming them off other people. In my opinion the most amusing scene is one in which a British intelligence agent visits Peck and the two of them have soft drinks. On his way out, the Brit pauses at the door then walks back and leans over the secretary and asks what that stuff was in the brown bottle. \"Root beer, sir,\" she replies. He thinks for a moment, then comments, \"Curious sort of stuff, don't you think?\" and leaves the room. Enjoyable minor film kind of drags you along with its quick unfolding of events.",
         "A film that starts out innocently enough and is shot in Technicolor doesn't hold out much hope of being much of a tough Berlin Cold War drama like Carol Reed and James Mason might have made. Nonetheless, Night People gets pretty engrossing as the story unfolds. What it lacks in shadowy black and white photography and bleak ambiance, it makes up for in a couple of cool plot twists and attention to keeping the story moving. Gregory Peck bites off his lines as if he really means them as the colonel who's trying to get the young corporal who was kidnapped from the US sector after he kisses his German girlfriend good night, to the Russian sector and held for the ransom of an elderly couple, the wife of whom is part of a cool scene in a big beerhall restaurant where Peck is chewing the scenery and German sausages with Broderick Crawford. Crawford's character as a rich Toledo industrialist and well connected father of the kidnapped corporal gets pretty interesting as well as he's bent on throwing as much of his considerable weight around as he can in order to expedite his son's return. But this is international intrigue which requires a lot of preparation while the go-between German ex-mistress of Peck who likes absinthe, gets slowly revealed. Actually, the story is mostly top-notch, though with sergeant Buddy Ebsen's numerous humorous observations and overall casualness, the film is a lot lighter though not necessarily less smarter than some the of black and white classics.",
         "The Cold War was settling in for a deep freeze when Night People was made in 1953. The story is about the kidnapping of an American corporal on occupation duty in Berlin and the efforts by our military to get him back. Mind you this isn't any ordinary corporal. Turns out he's the son of Broderick Crawford who is doing a light version of his junk tycoon from Born Yesterday. As it is explained in a line which audiences today might not get, 'he plays golf'. That he was a businessman who played golf was meant that he played regularly with the most famous golfer in America. You could not go a week in the USA of the Fifties without reading in the newspapers or hearing on radio or television about President Eisenhower tearing it up at some golf course. No one born after 1956 or so would possibly grasp the meaning of that description. So Crawford goes to Berlin to get some action and he runs into Gregory Peck of the Provost Marshal's office who does things in his own time and won't be bullied or influenced. Peck's role calls for him to be soldier, diplomat, and psychologist all in one. But he's a professional and he carries it off despite a few unexpected wrinkles. One of them turns out to be Anita Bjork who has been working both sides of the Cold War in an effort to obtain her much needed absinthe. Aiding and abetting Peck in his attempt to free the corporal are Rita Gam as his girl Friday, Sgt. Buddy Ebsen, Peck's non-com aide, and army doctor Walter Abel who has to be on standby at the climax of the film. Why is that, you have to watch Night People to find out, but Abel's needed for a potential emergency. Berlin ever since the airlift was at the center of the Cold War with the Russians. The wall had not been built yet and after that things kind of settled to an uneasy acceptance until the fall of the Soviet Union. Night People is an average Cold War drama made better by the presence of some A list cast members and a tightly edited script by Nunnally Johnson who also directed."
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Bavaria Film"
      ],
      "summaries": ["Post WWII yarn about a young GI abducted by the Soviets in West Berlin and hauled off to the East. His recovery gets complicated as Colonel Steve Van Dyke (Peck) tries to sort out the usefulness of informants, spies, bureaucrats, and the abductee's influential father (Crawford)!"],
      "budget": 0
   },
   "movielensId": 85863,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1954-03-11",
      "dvdReleaseDate": null,
      "directors": ["Nunnally Johnson"],
      "runtime": 93,
      "movieId": 85863,
      "title": "Night People",
      "mpaa": "",
      "actors": [
         "Gregory Peck",
         "Broderick Crawford",
         "Anita Björk",
         "Rita Gam",
         "Walter Abel",
         "Buddy Ebsen",
         "Max Showalter",
         "Jill Esmond",
         "Peter van Eyck",
         "Marianne Koch",
         "Ted Avery",
         "Hugh McDermott",
         "John Horsley",
         "Rodolfo Acosta"
      ],
      "imdbMovieId": "0047279",
      "originalTitle": "Night People",
      "genres": [
         "War",
         "Drama"
      ],
      "youtubeTrailerIds": ["9_gU-EdW-lc"],
      "plotSummary": "A US intelligence officer, stationed in Germany, is caught in a political dilemma when the Russians kidnap a young Army private, the son of prominent American businessman. In exchange for the soldier's return, the Russians attempt to barter a trade for an elderly German couple who they want for treason.",
      "tmdbMovieId": 76372,
      "avgRating": 2.5,
      "releaseYear": "1954",
      "numRatings": 4,
      "posterPath": "/akuo1zAPHoLswkf8sWnWkwPNRjC.jpg"
   }
}