{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "race",
            "id": 40870
         }
      ],
      "imdb_id": "tt0079366",
      "video": false,
      "title": "The Jericho Mile",
      "recommendations": [
         106284,
         86236,
         247426,
         48153,
         238006,
         57566,
         40593,
         87417
      ],
      "backdrop_path": "/vS1XrCb34iUgmX1uuVdE2B0CHu5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Larry 'Rain' Murphy",
               "gender": 2,
               "credit_id": "52fe4939c3a36847f818f845",
               "name": "Peter Strauss",
               "profile_path": "/ufx1trct43k7UcT4DpoIMPZXi5A.jpg",
               "id": 21368,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. D",
               "gender": 2,
               "credit_id": "52fe4939c3a36847f818f849",
               "name": "Brian Dennehy",
               "profile_path": "/5OgSljTrXQ3pZvy66WveAGpygnS.jpg",
               "id": 6197,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "R.C. Stiles",
               "gender": 2,
               "credit_id": "52fe4939c3a36847f818f863",
               "name": "Richard Lawson",
               "profile_path": "/jwdLCnTAIHwub1IBdOUbFVxDa0L.jpg",
               "id": 10090,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dr. Bill Jankowski",
               "gender": 2,
               "credit_id": "58c20e0ac3a36842de001bc7",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Warden Earl Gulliver",
               "gender": 2,
               "credit_id": "58c20ec09251410512001c72",
               "name": "Billy Green Bush",
               "profile_path": "/2SRq2WbO2YNGYHGp6hb0Bu8ef.jpg",
               "id": 35090,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Wylene",
               "gender": 1,
               "credit_id": "58c20f1292514104ef001eaa",
               "name": "Beverly Todd",
               "profile_path": "/pu3WvCEFahtHXElYVwqgzo9x1p5.jpg",
               "id": 18292,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "O.A.U. Chairman",
               "gender": 2,
               "credit_id": "58c20f3c92514104e9001e55",
               "name": "William Prince",
               "profile_path": "/w5aLRVfH98WHH5wezzMT9oAB8t0.jpg",
               "id": 46099,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Jerry Beliot",
               "gender": 2,
               "credit_id": "58c20f9992514104e4001df5",
               "name": "Ed Lauter",
               "profile_path": "/3mlQucZnEpYA1R8LxxKepsd7JpO.jpg",
               "id": 21523,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4939c3a36847f818f853",
               "name": "Michael Mann",
               "profile_path": "/nKmUpRpuQIsYubR7vIxVKhkbaTW.jpg",
               "id": 638,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4939c3a36847f818f859",
               "name": "Patrick J. Nolan",
               "profile_path": null,
               "id": 1171028,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4939c3a36847f818f85f",
               "name": "Michael Mann",
               "profile_path": "/nKmUpRpuQIsYubR7vIxVKhkbaTW.jpg",
               "id": 638,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.06321,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 57537,
      "vote_count": 8,
      "budget": 0,
      "overview": "Rain Murphy is a man sentenced to life in prison, choosing to do his time in near-isolation, and engages in distance running when given the opportunity for free-time. While his form and speed capture the attention of prison officials who believe he could be competitive for the Olympics, Murphy expresses disinterest. But when the one man he has befriended is taken advantage of by political groups within the prison, Murphy decides to pursue the opportunity presented to him in his memory.",
      "similar": [
         9291,
         2300,
         10637,
         9655,
         8923,
         22881,
         73,
         323677,
         10474,
         348893,
         9563,
         2323,
         86130,
         13416,
         1578,
         1429,
         5925,
         12163,
         1367,
         1374
      ],
      "original_title": "The Jericho Mile",
      "runtime": 97,
      "poster_path": "/mV6qZQv1fqpaM9q0SFyDp9Fo2ck.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "ABC Circle Films",
         "id": 2166,
         "origin_country": ""
      }],
      "release_date": "1979-03-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Behind the wall of this prison is a man traning to challenge the Olympic record..",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Mann"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Patrick J. Nolan",
         "Patrick J. Nolan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079366/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMDQzNzM2OV5BMl5BanBnXkFtZTcwOTc0NDQzMQ@@._V1_.jpg",
      "actors": ["Stars: Peter Strauss, Richard Lawson, Roger E. Mosley | See full cast and crew »"],
      "reviews": [
         "I watch a lot of movies - DVD, features, and classics, you name it. The night I watched JERICHO MILE, my wife (who had ordered it on the internet) said she remembered it from when she was in high school, that it had stayed with her all of these years. Somewhat reluctantly I sat down (with our daughter & son), and was riveted from the opening sequence to the end titles. We all were. She, who remembered the original, and our kids (18 and 16) who had no idea what the movie was about couldn't believe it. Our favorite scene? Bar none, when peter Strauss so passionately bangs his fist down and says, \"i'd do it AGAIN!\". It didn't advocate violence because it was a defense crime, but evoked such intensity we couldn't believe it...when his fellow cell mates gave him their food in support of his efforts, there wasn't a dry eye in our house. Someone please make more movies like this one. UNBELIEVABLE!!",
         "I watched the this the other night on a local station because I didn't feel like watching tripe like 'American Idol'. Peter Strauss gives a great performance as a convict named 'Rain' Murphy who keeps to himself. He admits to his crime and makes no bones that he feels no shame for it. His cell is bare of any comforts that other inmates have like books and pictures. The only time he feels in another zone is in running. He does it often and can run a mile in under four minutes. When a college coach hears about this, he wants to prime him for a shot at the Olympics. At first, 'Rain' wants no part of this, but when his best friend is killed, he shows interest. This is a good movie, period. Strauss is very good (What did you expect, anything less?) and Michael Mann shows hints of greatness that would come full bloom years later. This movie had that bit of realism (probably because it was filmed among convicts). It almost feels like this was a true story. The additional casting is good. There is a lot of notable names like Brian Dennehy, Roger E. Mosley, and Richard Moll as well. My heart sank when some pompous board of directors wouldn't let him run because he didn't feel bad for his crime. His final act made me stand up and cheer. When they took his dreams away, he took them back hard. This was back when TV movies were actually good. 'The Jericho Mile' is a gem of a film. ESPN Classic, PLEASE SHOW THIS FILM!!!",
         "I've never given a movie a ten out of ten before but this is the closest I have ever come (I gave it a 9). There are very few movies that I truly love, this however is one of them. With it's gritty realism, fantastic on-site locationing, and it's great soundtrack it literally blew my young mind when I first saw it in 1979. At that point I didn't know about prisons, violence, racial tensions, or the struggle to survive & live free. I doubt that anyone who is an adult, or for that matter anyone who is growing up in todays world could be impacted by this film in the same way I was all those years ago, but I will say this: \"if you haven't seen this movie I envy you\"; this is because you have the chance to see this great film for the frist time. For each of us they're different, but here's to the rarest movies of them all: the ones we actually love...",
         "The power of this film stuns me even today. It has all the trademarks of a Michael Mann film, including the line that appears in all his works about the 'man' inventing a hard time that some character cannot handle. This may be the first time that line was used, and argueably, the most effective. Simple story of a simple man who made a decision, and had the guts to face the consequences. He never denies what he did, regrets that it happened, but would do nothing different, given the chance, nor does he try to escape the consequences. Rain Murphy is a man who denies himself all of the creature comforts of civilization. He has no TV or no photos in his cell, no books, only the essentials. He does not work as an inmate, because he denies himself the things he would use his meager pay to buy. He is punishing himself for his crime. He rejects the idea of running in the Olmypics, or even trying, because it would disrupt his new life. A life where he runs until he cannot walk, then zones out until he cannot talk stretching his muscles. A shock to Murphy's system changes all of this, he buys into the dream of competing, only to be cheated. Murphy's final act of defiance is memorable. Mann might have gotten more polished over the years, this film shows talent always delivers",
         "I've seen The Jericho Mile several times. In fact it's on my TV right now as I type this. I've always thought it was one of the best TV movies ever. Peter Strauss is outstanding in this role. To sum things up...if you haven't seen The Jericho Mile, it's definitely worth a watch.",
         "This movie was exceptional. It tells the story of a man who, after he was sentenced to life imprisonment for killing his father-in-law when he found him raping his sister, sets out to become a world-class runner. It not only gave a realistic portrayal of prison life, but also deftly portrays the mentality of someone who is serving such a sentence. Peter Strauss played the role perfectly. Along with \"Rich Man, Poor Man\", this movie was probably the best performance of his career. Probably the best scene in this movie was when Murphy was before the civilian board trying to get permission to run in the race and he sees right through the man's preconceptions and bigotry concerning convicts. This man did not see Murphy as a person but rather as something other than what he was. Very rarely has such passion and intelligence come from a made-for-TV movie.",
         "A film that deserved theatrical release. This made-for-television movie is a cinematic gem that exemplifies the technique of Michael Mann with stirring contemporary music tightly integrated to the visual images. Always with Mr. Mann, the amplification of impact by the music is almost as if there is an invisible academy-award-winning actor added to the ensemble of cast, writer, director and cinematographer. This film is definitely one of my all time favorites. While nothing is perfect, this film comes very, very close. Along with an excellent script, great direction and masterful acting by Richard Strauss, there is an all-star ensemble of character actors at their finest: Roger Mosely; Brian Dennehy; Ed Lauter; Geoffrey Lewis; Richard Moll; Miguel Pinero; William Prince; Burton Guilliam; Ji-Tu Cumbuka; Richard Lawson and Billy Green Bush. You may not recognize the names, but you will recognize every face. If this comes on TV, sit down with popcorn, turn up the sound for an amazing soundtrack and score, and prepare to be riveted for the 97 minutes of the film. I highly recommend recording it, since it is only available on VHS and DVD from Holland and the DVD is region 2 encoded.",
         "i love watching the Jericho mile. i mean watching peter Strauss run the mile is like watching usain bolt sprint the 100 meter. i think peter Strauss is a excellent actor and should do another running movie. he is lightning fast has great energy and can run a mile in under 4 minutes and that my friend is amazing. no man alive can out race rain Murphy i mean the man runs 80 mile a week no one does that but him. i've watched the Jericho mile 100's of times and will watch it 100's more. great movies get watched more than movies that are not. i thank the makers of this film for giving years of there lives to make it.they are great people and i bless them all.thank you for letting me get my word out again thank you all.",
         "An interesting and involved film about a \"lifer\" just trying to live out his days peacefully. Elements of the main character appear in Michael Mann's later films, like Thief (1981), Heat (1995), and so on. You can see this one at the UCLA Instructional Media Laboratory-- one of the only places in the country that has copies readily available to the public. It's a great one!",
         "This was Michael Mann's first dramatic film, and despite being made on TV movie budget, the talent of this director is clear to see. Peter Strauss is first rate as the introverted prisoner who finds some of sort solace in running and keeping fit, and deservedly won an Emmy Award for best lead actor in a TV movie/miniseries. He plays this quiet character with his rage held in check, this becoming something of a theme with main characters in later Michael Mann films. Many scenes were filmed in a real prison, with some prisoners starring in the film. Michael imbues the film with a visual style that pushes this film to be more of a cinematic experience. Certainly the design, with art director Steven Burger working very effectively with director Michael Mann and his choices of music, creates a terrifically realistic atmosphere, which draws the viewer in and sustains interest throughout the film. The dynamics of prison life and culture are very well observed. However an interesting twist is put on the fact that Strauss's character is someone atypical. He sits alone from the other prisoners, accepting his incarceration as the only life he will know, and plays this brilliantly. This contrasts with the other prisoners are motivated differently, for example to belong to a gang, or by their desire to be released and by reunited with family. This is the case with his neighbour Stiles (Richard Lawson), a more open and compassionate character, who desire to see his family is taken advantage of by a white gang leader, well played by Brian Dennehy. While the story evolves predictably, it is very enjoyable. Strauss certainly got fit for the role, and the running scenes are very well done. Jimmie Haskell's music works well, and the film builds to a enjoyable, emotionally satisfying but bittersweet climax that works very well. Arthur Schmidt's editing is closer to feature film in terms of style and polish, and it is no surprise he won an Emmy Award for his efforts. He would progress to a hugely successful career and would become editor on a number of Robert Zemekics's films, winning Oscars for his work on Who Framed Roger Rabbit and the epic Forrest Gump. Patrick Nolan and Mann himself also won Emmy's for the excellent script. In all, a TV movie that is taut, clever, and very impressive."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["ABC Circle Films"],
      "summaries": ["Rain Murphy is a man sentenced to life in prison, choosing to do his time in near-isolation, and engages in distance running when given the opportunity for free-time. While his form and speed capture the attention of prison officials who believe he could be competitive for the Olympics, Murphy expresses disinterest. But when the one man he has befriended is taken advantage of by political groups within the prison, Murphy decides to pursue the opportunity presented to him in his memory. This action not only has profound changes on him, but also on the atmosphere of the inmates in the prison and their outlook on the accomplishments he can make."],
      "budget": 1100000
   },
   "movielensId": 85883,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-03-01",
      "dvdReleaseDate": "2005-04-10",
      "directors": ["Michael Mann"],
      "runtime": 97,
      "movieId": 85883,
      "title": "The Jericho Mile",
      "mpaa": "",
      "actors": [
         "Peter Strauss",
         "Brian Dennehy",
         "Richard Lawson",
         "Geoffrey Lewis",
         "Billy Green Bush",
         "Beverly Todd",
         "William Prince",
         "Ed Lauter"
      ],
      "imdbMovieId": "0079366",
      "originalTitle": "The Jericho Mile",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Rain Murphy is a man sentenced to life in prison, choosing to do his time in near-isolation, and engages in distance running when given the opportunity for free-time. While his form and speed capture the attention of prison officials who believe he could be competitive for the Olympics, Murphy expresses disinterest. But when the one man he has befriended is taken advantage of by political groups within the prison, Murphy decides to pursue the opportunity presented to him in his memory.",
      "tmdbMovieId": 57537,
      "avgRating": 3.27778,
      "releaseYear": "1979",
      "numRatings": 9,
      "posterPath": "/mV6qZQv1fqpaM9q0SFyDp9Fo2ck.jpg"
   }
}