{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt0252487",
      "video": false,
      "title": "The Chaos Class",
      "recommendations": [
         31534,
         31408,
         38794,
         31402,
         31547,
         31412,
         110040,
         110033,
         27211,
         31607,
         80982,
         31241,
         53298,
         74302,
         69319,
         31405,
         101217,
         184979,
         30691,
         27721
      ],
      "backdrop_path": "/gqWsDKfD4fY64JSZZLqhkhU9lo2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Inek Saban",
               "gender": 2,
               "credit_id": "52fe48b09251416c91095147",
               "name": "Kemal Sunal",
               "profile_path": "/pLCZwCuSiU1Hm7sXjhOD64juIgY.jpg",
               "id": 97272,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hafize Ana",
               "gender": 1,
               "credit_id": "52fe48b09251416c9109514b",
               "name": "Adile Naşit",
               "profile_path": "/eqcXd6bu7L4OMohDCYKVCddXZ2H.jpg",
               "id": 97274,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Güdük Necmi",
               "gender": 2,
               "credit_id": "52fe48b09251416c9109514f",
               "name": "Halit Akçatepe",
               "profile_path": "/fuVYz64vD4TncetkyexiH91UYIl.jpg",
               "id": 556047,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Damat Ferit",
               "gender": 2,
               "credit_id": "52fe48b09251416c91095153",
               "name": "Tarık Akan",
               "profile_path": "/jC010hrp1k2WozY288XcSvOBjNB.jpg",
               "id": 142766,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kel Mahmut",
               "gender": 2,
               "credit_id": "52fe48b09251416c91095157",
               "name": "Münir Özkul",
               "profile_path": "/1Uvb8jqnRNN41F41BrvPjnBFdfp.jpg",
               "id": 556048,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Badi Ekrem",
               "gender": 0,
               "credit_id": "52fe48b09251416c9109515b",
               "name": "Şener Şen",
               "profile_path": "/m8idLZ2icbHsSoic0L3PPQuGv6T.jpg",
               "id": 77349,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a03c3a36878ec02a202",
               "name": "Bilge Zobu",
               "profile_path": "/tMD3LC9PHKSbtkVLvfIzqBIw1I4.jpg",
               "id": 102912,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a17925141145202a69a",
               "name": "Ahmet Arıman",
               "profile_path": "/p4LuX95oe3CzdNNiF0tH8iT9VsR.jpg",
               "id": 1762880,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a2592514113ef02a38b",
               "name": "Ertuğrul Bilda",
               "profile_path": null,
               "id": 1362741,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a41c3a36878c9028a13",
               "name": "Sıtkı Akçatepe",
               "profile_path": null,
               "id": 1052887,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a55925141141e02b05f",
               "name": "Kemal Ergüvenç",
               "profile_path": null,
               "id": 1324823,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a62c3a36878c9028a3b",
               "name": "Cem Gürdap",
               "profile_path": null,
               "id": 930601,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a6c925141142f02a22c",
               "name": "Muharrem Gürses",
               "profile_path": null,
               "id": 1052880,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "59d15a99c3a368790402a9a0",
               "name": "Hayri Karabey",
               "profile_path": null,
               "id": 1202124,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "59d15ab2c3a368786c0281f8",
               "name": "Hüseyin Kaşif",
               "profile_path": null,
               "id": 1202122,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe48b09251416c91095143",
            "name": "Ertem Eğilmez",
            "profile_path": "/nD8dVkgrYI1c2QfYZnagByLVUVv.jpg",
            "id": 109083,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.810349,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 83651,
      "vote_count": 18,
      "budget": 0,
      "overview": "Lazy, uneducated students mostly coming from money, share a very close band. They live together in the dormitory of this private highschool, where they daily plan their latest pranks on teachers or the other classes. When a new and obviously strict headmaster arrives, the students naturally try to overthrow him. A comic war of nitwits follows.",
      "similar": [],
      "original_title": "Hababam Sınıfı",
      "runtime": 90,
      "poster_path": "/gZQurOLS4oznIQSBGkYKViz5Ym9.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [],
      "release_date": "1975-04-01",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/vdI2iVoQcJUwJQioE8JCmRvAX4w.jpg",
         "name": "Hababam Sınıfı Serisi",
         "id": 473983,
         "poster_path": "/rebHcRyxEv5e8lN7eihGBH5rxzw.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ertem Egilmez"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Umur Bugay",
         "Rifat Ilgaz"
      ],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0252487/",
      "coverLink": null,
      "actors": ["Stars: Kemal Sunal, Münir Özkul, Halit Akçatepe | See full cast and crew »"],
      "reviews": [
         "Hababam Sýnýfý (Hababam Class)is a great comedy which reflects as the best example of 'the marvelous era of 70's comedies' of the Turkish cinema. It is about a class of highschool students in a private school. Their school tuition are paid by their ignorant parents who think that's all for them to get prepared for life. The students bond each other as a family. They are lazy, ignorant, funny and the worst nightmare of their teachers. Adile Ana (ana=mother) who is the attendant in the school is like their own mother and she accepts them as real sons. Their kingdom over the school is challenged when a new principal (Munir Ozkul) comes. He doesn't have a family (says he didn't have time to found one while dealing with others education), and plays a role of though, disciplined, but deep inside a warm hearted teacher and principle. The movie is full of hilariously funny scenes of the students' adventures between themselves, their teachers, other students and of course the principle who declared a war on them to get them disciplined. It is funny but also a touchy film when they found the 'father' figure they lost in the principle. There is one thing we should mention about the plot; the movie reflects the Turkish culture. Therefore there are not brutal gang members in the class terrorizing teachers and the school. They are just playing innocent jokes on everybody not harming anybody but their own future. They are still respectful to the elderly and teachers. It is a great movie.",
         "When you watch Hababam Sinifi you can not get yourself out from feeling the good old high school ages that you have had. It has lots of school moments that we have all shared which we sometimes still remember and wish that we could still turn back the time and live those years again and again. The movie keeps us remembering the whole funny situations that we were in, during those years; various ways of cheating exams, running out of class with kinds of funny excuses just to go and watch the final matches, smoking in the toilets during the break-time and so on... Of course the movie gives great lessons against these behaivors with the help of one character which lead the whole \"Hababam Sinifi\" series. Mahmut Hodja. His moral values and commitment to his students had us all get wet eyes during this comedy. But of course not only him, the whole cast had his own different character profiles. Body Ekrem (which was played by \"The Extraoridnary\" Sener Sen), Inek Saban, Guduk Necmi, Hafize Ana etc. But of course non of these characters could come to life without the great observations of the fabulous director, Ertem Egilmez (may he rest in peace). During his entire directing career he always made his movies like a mirror holding through the audience and had them to watch themselves in the movies and I can say that Hababam Sinifi is one of his greatest works. Speaking for myself, I must admit that this is my favorite movie of all time and even the movie is played on TV a million times, I never get bored seeing it again and again. I guess none of you would either...",
         "Hababam Sinifi is adopted from a novel by rifat ilgaz. Turkey's one of the most popular artists like Kemal Sunal, Sener Sen, Munir Ozkul, Halit Akcatepe, Adile Nasit, Tarik Akan, Sevket Altug, Perran Kutman played in all series. It's been on Turkish TV channels over and over again and still get high ratings. The whole series is a classic, the best parts go around \"Güdük\" Necmi and \"Inek\" Saban. Sener Sen is also great as the gym teacher \"Badi\" Ekrem. One of the greatest figures of Turkish cinema Münir Özkul and Adile Nasit take their parts as \"Kel\" Mahmut and Hafize Ana. Adile Nasit with her famous giggling draws a mother figure for the students... Anyways, I wonder if it was released in other countries but if you're Turkish you've already seen it a million times and would watch it again if there is nothing else on TV :)",
         "\"Hababam\" is a never-aging movie. I just watched it again last night (I don't remember how many times I watched it!) and I was on my knees, laughing with tears in my eyes. Sener Sen, Munir Ozkul, Adile Nasit, Kemal Sunal (Only Ozkul and Sen alive today) are among the greatest comedians in Turkish cinema and watching them in the same movie is undescribable joy! Movie's passing into a sadder region makes the onlooker feel that this is life itself. Before recovering a laugh coma the onlooker enters a sad valley. The original score is a great helper in these transitions. Composer Melih Kibar created one of his best works for Hababam Sinifi. To sum up, Hababam Sinifi is like a drug when you feel gloomy, blue, sad. You can cheer up within minutes if you sit and watch it.",
         "Like most of the Turks, I have watched this film lots of times, and each time I still could find it entertaining, funny and touching... It very much deserves the high ratings, however, as many others have already noted down, comedy is not universal. Thus the movie may not mean so much to other nationalities and the rating may lead to wrong impressions/expectations. There seems no solution to this rating problem, but maybe the source of the rating could somehow be noted down somewhere... In this way the visitor will be able to see that (1) it is a masterpiece of Turkish cinema (due to high rating) (2) It has only been watched and rated by mostly Turkish people so far (due to source of rating). In time more people from all over the world might have opportunity to watch and rate this film and we can finally have a \"universal\" rating for it.",
         "Hababam Sinifi is adopted from a novel by . Turkey's one of the most popular artists like Kemal Sunal, Sener Sen, Munir Ozkul, Halit Akcatepe, Adile Nasit, Tarik Akan, Sevket Altug, Perran Kutman played in all series. It's been on Turkish TV channels over and over again and still get high ratings. The whole series is a classic, the best parts go around \"Güdük\" Necmi and \"Inek\" Saban. Sener Sen is also great as the gym teacher \"Badi\" Ekrem. One of the greatest figures of Turkish cinema Münir Özkul and Adile Nasit take their parts as \"Kel\" Mahmut and Hafize Ana. Adile Nasit with her famous giggling draws a mother figure for the students... Anyways, I wonder if it was released in other countries but if you're Turkish you've already seen it a million times and would watch it again if there is nothing else on TV :)",
         "I think this movie must be translated in all languages on the world. Fabulous comedy from the great director of Turkish cinema. Many of excellent actors are also together in this movie. It is the film which is seen by all Turkish people at least once. This great comedy must be seen by all people in the world. It is even better than all other films in the world which is launched as comedy. There are jokes on all scenes of the movie. Especially, one of the main character's of the movie Kemal Sunal has a great performance. You cannot make anything other then laugh, laugh and laugh. Watch and be full of fun. It is directed in 1975.",
         "This classic Turkish film (although some might wonder at this mainstream movie being called a film) is etched permanently into the psyche of Turkish culture. It's such a shame that there's no kind of film preservation society in Turkey. No One realizes that this film is going to disappear within the next decade or two. If I'm ever successful I've made a promise to my childhood that I'll find a good print of this film and put efforts forward to restore it and preserve it in various formats so that my kids and their kids can one day see it.",
         "This is the one and only film on the world that is shown once a week on different channels and still gets more rating than those idiot reality shows. I know at least ten people who refuse to go out with our group of friends in the evenings this film is shown. \"Hababam Sinifi\", the movie was so successful that a five-film series was produced right after the first. Hababam Sinifi Tatilde - Ertem Egilmez (hababam class on vacation) Hababam Sinifi Uyaniyor - Ertem Egilmez (hababam class getting up) Hababam git Hababam gel - Aram Gulyuz (hababam come'n'go) Hababam Sinifi Dokuz Doguruyor - Kartal Tibet (hababam class hard times) Hababam Sinifi Gule Gule - Ertem Egilmez (hababam class bye farewell) In year 2003, new producers gathered a new group of actors and a giant budget to make a refreshing start for this amateur tasting old series; \"Merhaba Hababam Sinifi (Hababam Class Hello)\" was directed by Kartal Tibet. In the following year (2004) \"Hababam Sinifi Askerde (Hababam Class in the Army Now)\" came after, directed by Ferdi Egilmez. The last two modern Hababam Sinifi was plainly produced for fiscal expectations. The original movie and the following ones (all were produced at poor times of this country with tiny budgets and unknown young actors and actresses) were shown at least once a week on TV and though anybody has seen them at least 40 times already, these were still gathering people from different generations before the screen. The expectations were as the modern ones with giant budgets with well-known faces would gain more attention and make a good profit. Nonetheless, these were unsuccessful to catch the amateur soul of the original ones.",
         "Hababam Sinifi is a great, funny movie... All Turkish people love this movie.Movie's favorite character is Kemal Sunal(Inek Saban)(Cow Saban) He was an important actor(comedian) in Turkish Cinema. Also in this movie we can see famous comedians together.Watching them is really a great fun. This movie was created in 1975 but still watched and laughed by everybody. Hababam Sinifi is the first movie of this series.Later the directors created \"Hababam Sinifi Sinifta Kaldi\" \"Hababam Sinifi Uyaniyor\" and etc. At last I wanna say that everybody should watch this movie. Have fun!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Arzu Film"],
      "summaries": ["Lazy, uneducated students share a very close bond. They live together in the dormitory, where they plan their latest pranks. When a new headmaster arrives, the students naturally try to overthrow him. A comic war of nitwits follows."],
      "budget": 0
   },
   "movielensId": 86057,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "1975-04-01",
      "dvdReleaseDate": null,
      "directors": ["Ertem Eğilmez"],
      "runtime": 90,
      "movieId": 86057,
      "title": "The Chaos Class",
      "mpaa": null,
      "actors": [
         "Kemal Sunal",
         "Adile Naşit",
         "Halit Akçatepe",
         "Tarık Akan",
         "Münir Özkul",
         "Şener Şen",
         "Bilge Zobu",
         "Ahmet Arıman",
         "Ertuğrul Bilda",
         "Sıtkı Akçatepe",
         "Kemal Ergüvenç",
         "Cem Gürdap",
         "Muharrem Gürses",
         "Hayri Karabey",
         "Hüseyin Kaşif"
      ],
      "imdbMovieId": "0252487",
      "originalTitle": "Hababam Sınıfı",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["k6gi9WhpBJ0"],
      "plotSummary": "Lazy, uneducated students mostly coming from money, share a very close band. They live together in the dormitory of this private highschool, where they daily plan their latest pranks on teachers or the other classes. When a new and obviously strict headmaster arrives, the students naturally try to overthrow him. A comic war of nitwits follows.",
      "tmdbMovieId": 83651,
      "avgRating": 4,
      "releaseYear": "1975",
      "numRatings": 18,
      "posterPath": "/gZQurOLS4oznIQSBGkYKViz5Ym9.jpg"
   }
}