{
   "tmdb": {
      "original_language": "nl",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0086369",
      "video": false,
      "title": "A Question of Silence",
      "recommendations": [
         134752,
         7514,
         911,
         15484,
         28963,
         29140,
         43828,
         5998,
         10831,
         132,
         3111
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Christine M.",
               "gender": 0,
               "credit_id": "52fe49b79251416c750d10a3",
               "name": "Edda Barends",
               "profile_path": null,
               "id": 211254,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Annie",
               "gender": 0,
               "credit_id": "52fe49b79251416c750d10a7",
               "name": "Nelly Frijda",
               "profile_path": "/aSob361v124Apxx7GlLCjZtVEhm.jpg",
               "id": 34871,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe49b79251416c750d10ab",
               "name": "Henriëtte Tol",
               "profile_path": "/ymtNojOEhy8QxwfbvQWF0GgvKN0.jpg",
               "id": 211016,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Janine van den Bos",
               "gender": 0,
               "credit_id": "52fe49b79251416c750d10af",
               "name": "Cox Habbema",
               "profile_path": "/v4EEAwrZiYrP8IgmwVrQvr9u7vx.jpg",
               "id": 27533,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ruud van den Bos",
               "gender": 0,
               "credit_id": "52fe49b79251416c750d10b3",
               "name": "Eddie Brugman",
               "profile_path": null,
               "id": 1009979,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Rechter",
               "gender": 2,
               "credit_id": "52fe49b79251416c750d10b7",
               "name": "Hans Croiset",
               "profile_path": null,
               "id": 145580,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49b79251416c750d109f",
               "name": "Marleen Gorris",
               "profile_path": "/sSVUF5IE4nF4CCLzkwCfRmQz1Ws.jpg",
               "id": 13496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a962fe09251417b1e0034ea",
               "name": "Marleen Gorris",
               "profile_path": "/sSVUF5IE4nF4CCLzkwCfRmQz1Ws.jpg",
               "id": 13496,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a9630230e0a265438003874",
               "name": "Matthijs van Heijningen",
               "profile_path": null,
               "id": 69339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a9630680e0a26544d0037c0",
               "name": "Frans Bromet",
               "profile_path": null,
               "id": 26573,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5a96307fc3a3685a0800391f",
               "name": "Hans van Dongen",
               "profile_path": null,
               "id": 21443,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5a9630980e0a2654380038d8",
               "name": "Jany Temime",
               "profile_path": null,
               "id": 11227,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a9630bd0e0a26544d00380a",
               "name": "Conny Brak",
               "profile_path": null,
               "id": 1905973,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5a9630cdc3a3685a24003858",
               "name": "Hans Voors",
               "profile_path": null,
               "id": 1693103,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5a9630e90e0a2654410036fe",
               "name": "Victor Dekker",
               "profile_path": null,
               "id": 105969,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5a96311ec3a3685a08003993",
               "name": "Ulli Ullrich",
               "profile_path": null,
               "id": 1665770,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "5a9631460e0a26543800395e",
               "name": "Harry Ammerlaan",
               "profile_path": null,
               "id": 35507,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a96316d0e0a26544100374c",
               "name": "Lodewijk De Boer",
               "profile_path": null,
               "id": 1247374,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5a963187c3a3685a24003901",
               "name": "Martijn Hasebos",
               "profile_path": null,
               "id": 1987074,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.810312,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 96529,
      "vote_count": 7,
      "budget": 0,
      "overview": "Three women, all strangers to each other, meet in a dress boutique. One of the three is approached by the male proprietor as she is shoplifting a garment. When he approaches her the other two join her in beating the man to death. Other female shoppers ignore the whole situation and leave when the crime is complete. The court appoints a female psychriatrist to examine the women; contrary to public opinion the psychiatrist finds they are not insane but implies the rage expressed by the crime is a result of the male dominated society. An interesting study of extreme behavior. The prisoner's cells were a revelation. Written by Rosemarie Friedman",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "De stilte rond Christine M.",
      "runtime": 92,
      "poster_path": "/mdc8mV9td64iNMCTJJNHDXFmPP5.jpg",
      "spoken_languages": [{
         "name": "Nederlands",
         "iso_639_1": "nl"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sigma Film Productions",
         "id": 15187,
         "origin_country": ""
      }],
      "release_date": "1982-02-18",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marleen Gorris"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Marleen Gorris"],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0086369/",
      "coverLink": null,
      "actors": ["Stars: Edda Barends, Nelly Frijda, Henriëtte Tol | See full cast and crew »"],
      "reviews": [
         "This film is NOT anti-male. It is not suggesting that women go out and randomly kill men just for being of that gender. What is does do is use a wonderful technique called reversal. If three men had brutalized a woman, well, \"society\" might not find that so shocking (maybe more now than earlier years, but certainly not as shocking as the reverse). It doesn't want to start propaganda, it wants to make you THINK. By making the therapist think on it, it forces the viewer to think on it as well. What's the history of women being brutalized and then remaining quiet about it? Have women really achieved the social, political, and economic equality that is the feminist goal? Why not? This movie doesn't hate men; it simply loves women enough to give everyone something to think about.",
         "I'm not even sure if a DVD is available in North America, and if it isn't it would be a tremendous shame. \"A Question of Silence\" is a tough, rigorous, unsentimental and unblinking examination of justice and is, as another comment observed, a far less mainstream and safe film than Goriss's \"Antonia's Line.\" For anyone who has even a passing interest in dark, uncompromising work, go out of your way to find this film. It's a little wonky technically and there are perhaps 5 minutes or so of didactic twaddle one wishes the director has discarded in the cutting room- but none of this diminishes from the towering overall achievement. For anyone whose taste runs to the safe and predictable and who doesn't like being provoked by the films they watch, avoid this one. It's not for you.",
         "I just watched this film for a law class and wanted to briefly defend it, in light of the previously posted comment by another user. I think the comparison of feminist reaction to male dominance in this movie, with anti-Semitism of the Nazi era, is inappropriate and not logically founded. Anti-Semitism and Jewish persecution in Nazi Germany was an example of social/religious bigotry, intolerance, and violence perpetrated by the political majority against a political and religious minority. It was based on a history of escalating persecution spanning centuries. By contrast, this movie concerns the emergent hostile sentiments of a social/political minority group, to their perceived oppression by the social/political majority. The movie dates from the 1980's and perhaps both suffers and benefits from this fact -- it looks somewhat dated, but the social climate of that era is important to understanding the movie. Europe of the 1970s and 1980s, much like the US, was still very resistant to even the idea that sexism really existed or was a problem. The courts were actively fleshing out the parameters of sexual rights and protections -- legally carving out the nuances of sexual harassment, sex discrimination, and reproductive choice law. The film is basically an extended commentary, arguably controversial, on the repression of women in a male dominated society. In this regard, the message is possibly too strongly stated -- three women, having finally had enough of silently accepting sexism and male domination, suddenly snap and brutally murder a male sales clerk in cold blood. They feel no remorse, and no men in the movie can even begin to comprehend the very idea of sexism or its effect on women. However, to compare the feminist sentiments of the film to Nazi-ism, is not only unfair, but is an offensive and reactionary over-statement of disagreement with these same feminist sentiments.",
         "Very powerful and thoughtful. Much superior to Gorris' more-acclaimed Antonia's Line, in my opinion. This film has none of the cutesiness of Antonia but all of the thoughtfulness and thematic weight. The theme is a subtle examination of the roles of men and women in Dutch society, and I guess it could apply to many societies. The film has a viewpoint, but it problematizes and complicates matters so that it's impossible for the viewer to blindly accept that viewpoint. It examines SUBTLE discrimination and dehumanization. The only frustration I had was the fact that the copy I viewed did not give subtitles to a lot of the dialogue--e.g., a woman listens to the radio for about a minute, but non-Dutch speakers (like myself) don't understand any of it, and I'm guessing that with a filmmaker as careful as Gorris, this dialogue is important.",
         "This film captivated me when I first viewed it 10 years ago and continues to do so. It captured the sense of living in a hostile world, evident to any feminist or woman who has suffered at the hands of patriarchy, the system, 'the man' or possibly even the US 'just us' system. It makes obvious the masculinist basis of language and the inability of some women to describe their experience of oppression within social systems that utilize languages designed and created to express the dominant position. This film is powerful, and in my experience, confuses only those that have no empathy with the experiences of any of the main characters; namely men. Comments like those of Brian-343 quoted below miss the moral statement of the film, that patriarchal systems of dominance are SO destructive to some that it literally drives them to insanity (backed up by medical evidence of rates of mental illness in women only being equalled by those of men in times of extreme stress and distress: wartime). 'Did it seem like they answered the question why they did it? I didn't think so. I was left with a weak canned answer. It was just \"they were oppressed by the patriarchal society, so they have a reason to kill.\" What? Do you kill a person based on your whim just because that person is a part of a group of people who \"generally\" oppresses you? I think the filmmaker failed to make her big moral statement - you don't excuse a criminal instantly because they were supposedly oppressed.' The film doesn't excuse the murder. It demonstrates the reasons for it. The female protagonists do not escape punishment although Gorris does posit incarceration as preferable to their previous existences; marriage or servitude. It is a crying shame that this film has not been transcribed onto DVD.",
         "unlike one of the comments I saw on this site I believe that this is one of the most powerful films of the feminist movement. The person who wrote the comment about it being a Nazi film has either NOT WATCHED THE FILM or DID NOT UNDERSTAND A SINGLE THING. First of all, the film is Dutch. It is set in the Netherlands. Not Germany. It has nothing whatsoever to do with racism, but deals with feminism, as the title suggests the silence of the 3 women in trial, especially Catherine. The woman did not call other women to help her murder the shop keeper. These were women who have never met before but got together by a certain bond (women rights) and killed, YET only symbolically killed the man who suppressed them. This murder is fictitious, it is symbolism to women rising up against man and finally escaping the role as prey. The film also encompasses great cinematic techniques and motifs that never end. To those who have read the review that I did...hope this helps. It is a great film, do not let anyone spoil it.",
         "The misunderstanding of this controversial film often comes from the misconception that feminism hates men. The plot of three women killing a man in a boutique is indeed based on an actual event (although the victim in the news was a young woman). In this film, Marleen Gorris studies the extreme behaviour, relating it to the male-dominant legal system that does not give much room for studying people's feelings. If one can see that Gorris' position is more with the pyschiatrist who is sympathetic with the case rather than promoting hatred, it is not hard to see why Los Angeles Times considered the film as a subversive movie in the best sense of the word.",
         "To call this movie hate literature is one thing, but the analogy used referencing Jews and Nazis is completely not applicable here. This is a film about power, domination, and oppression, all three of which men exercise over women in our society. One would have to live in a bubble to say that Jews hold the same position over non-Jews or Nazis (or did pre-WWII)! As a Jew, I find your comment mildly offensive, and as a man (while it is always difficult to recognize one's privilege), I find this film to be an amazing critique of patriarchy. While murder may not be the solution, this film shows the extraordinary way in which 3 women who have been beaten down their whole lives (and have nothing to lose) attempt to fight back against an enemy that is unbeatable. The laughter at the end of this film proves just who gets it and who doesn't. PS- I've heard that in some places during the initial screenings of this film, women in the theaters actually broke out in laughter with the women on screen during the court scene....",
         "This film takes a radical approach to the domination of the male gaze in cinema and in society. I doubt that the film-makers condone violence or murder for any reason, but a significant murder in the plot of this movie is an eye-opener to the prevalent gender roles in most of the world. Any one who can interpret a movie from an objective standpoint to the characters should understand that the message of this film transcends the plot, and that it is vastly important to any culture. I think it is entirely irrational and quite offensive to compare the roles of women and men in this film to Nazis and Jews, respectively, as another commenter has done. A ridiculous analogy could be quickly formed by the inverse as anyone you call a \"Nazi\" will instantly seem evil. A film like this or any other deeply metaphorical film asks not to be judged realistically, but to make you think. No rational person would judge A Clockwork Orange, or Fight Club by the standards that they are irrelevant because they contain chaos and violence. However, because the killers in this movie are women and not men, it seems to get an unusual reaction out of many viewers who feel they have to defend their stance against murder. It gets an especially strong reaction out of men, it seems, because men are allowed to be anything in films, but women are still very limited. If you are an intelligent person who can understand the themes of a film without suddenly being swayed into a murderous rampage, watch this movie. It will be like nothing else you've seen in years.",
         "A Question of Silence is a moving film about three women who commit a horrible, violent crime and about the establishment's attempts to understand their motive. Without forethought and without knowing one another, they attack and kill a boutique owner in cold blood. The film follows the psychiatrist (played by Cox Habbema) as she interviews the incarcerated women. The major conflict comes from the women's refusal to state their motive, whence the title. Everyone assumes they must be insane, because to admit otherwise (and this is the conclusion to which the psychiatrist finally comes) is to admit that the world is a very bad place for women, indeed. The film is hard to watch, especially, I would imagine, for men. But it by no means glorifies the murder or the murderers. Nor do the murderers find \"overwhelming public support\" at their trial. What they find is willful incomprehension on the part of the men who arrest them, try them and testify against them. Because what they have done cannot be understood in the context of any existing cultural system, including language, the women can only laugh as their sentence is pronounced. Their laughter is frightening, irrational and yet somehow gives shape to a different kind of logic."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Sigma Film Productions"],
      "summaries": ["Three women, all strangers to each other, meet in a dress boutique. One of the three is approached by the male proprietor as she is shoplifting a garment. When he approaches her the other two join her in beating the man to death. Other female shoppers ignore the whole situation and leave when the crime is complete. The court appoints a female psychriatrist to examine the women; contrary to public opinion the psychiatrist finds they are not insane but implies the rage expressed by the crime is a result of the male dominated society. An interesting study of extreme behavior. The prisoner's cells were a revelation."],
      "budget": 0
   },
   "movielensId": 86061,
   "movielens": {
      "languages": ["Nederlands"],
      "releaseDate": "1982-02-18",
      "dvdReleaseDate": null,
      "directors": ["Marleen Gorris"],
      "runtime": 92,
      "movieId": 86061,
      "title": "A Question of Silence",
      "mpaa": null,
      "actors": [
         "Edda Barends",
         "Nelly Frijda",
         "Henriëtte Tol",
         "Cox Habbema",
         "Eddie Brugman",
         "Hans Croiset"
      ],
      "imdbMovieId": "0086369",
      "originalTitle": "De stilte rond Christine M.",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Three women, all strangers to each other, meet in a dress boutique. One of the three is approached by the male proprietor as she is shoplifting a garment. When he approaches her the other two join her in beating the man to death. Other female shoppers ignore the whole situation and leave when the crime is complete. The court appoints a female psychriatrist to examine the women; contrary to public opinion the psychiatrist finds they are not insane but implies the rage expressed by the crime is a result of the male dominated society. An interesting study of extreme behavior. The prisoner's cells were a revelation. Written by Rosemarie Friedman",
      "tmdbMovieId": 96529,
      "avgRating": 2.5,
      "releaseYear": "1982",
      "numRatings": 5,
      "posterPath": "/r39WBsFMlgRZZqT1vL9carfeRgS.jpg"
   }
}