{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "desert scientist",
            "id": 2050
         },
         {
            "name": "rave",
            "id": 3221
         },
         {
            "name": "carnival",
            "id": 3473
         },
         {
            "name": "party",
            "id": 8508
         }
      ],
      "imdb_id": "tt0357567",
      "video": false,
      "title": "Confessions of a Burning Man",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cb9251416c9105ff39",
               "name": "Paul Barnett",
               "profile_path": null,
               "id": 120937,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cb9251416c9105ff3f",
               "name": "Unsu Lee",
               "profile_path": null,
               "id": 120938,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.16854,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38631,
      "vote_count": 2,
      "budget": 0,
      "overview": "The experience shared by four first-timers demonstrates how Burning Man dissolves the barriers between races, nationalities and economic classes. A beautiful piece of film-making which inspires and entertains as it provides some understanding about why people return year after year.",
      "similar": [
         8363,
         195589,
         376659,
         325133,
         14484,
         8456,
         109414,
         627,
         122081,
         9777,
         2770,
         6075,
         4964,
         4771,
         10895,
         11778,
         319,
         813,
         979,
         1586
      ],
      "original_title": "Confessions of a Burning Man",
      "runtime": 83,
      "poster_path": "/ex7MKhXgmtsqPiYl5SpcEbgintZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2003-10-23",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Paul Barnett",
         "Unsu Lee"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0357567/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNDQ5ODY1NF5BMl5BanBnXkFtZTcwNDAyMzUyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Epps, Anna Getty, Samantha Weaver | See full cast and crew »"],
      "reviews": [
         "God no! But the filmmakers did their very best to make it seem so. Perhaps it's an attempt to keep spectators away from the event itself, but I don't think so. I attended the film with seven other Burners merely two weeks after returning from BM '03, and we all agreed: What a disappointment! Following the experiences of the sad, whiny and uninteresting subjects of the film was like nails scraping across a chalkboard, you just want to leave the room screaming. These folks were not accurate cross sections of the type of people who attend Burning Man. I mean, come on! A GETTY? Please! Apparently BM '01 was the year everyone \"just said no,\" and the year everyone went to bed early and got a good night's sleep, and the year that everyone abstained from anything even remotely resembling sex. Anyone who has attended BM will want to save their frustration for something that's actually frustrating, like the state of our government. All others should attend BM and form their own opinions of the event. Oh, and to make matters worse, there is a typo in the open moments of the film, which leads one to conclude all kinds of unfortunate things.",
         "Oh my god, there should be a law against making a movie on a camcorder. This movie is almost completely devoid of any redeeming qualities. The soundtrack is great, but the images suffer from video artifacts on the big screen. Obviously no effort was spent to color time the film, and the audio is so poorly mixed behind the music, that a lot of the time you can't hear squat. But worse than this, the alleged filmmakers only captured about .01 percent of the experience. They shied away from controversy in any form. What makes the celebration so different is the alternative lifestyle living in this community. None of that here. So, if you want a headache from giant out of focus and shaky images, crummy audio, and vanilla treatment, go for it. Do find the soundtrack tho'.",
         "This documentary comes off better than some of the previous ones on Burning Man. One of the strongest aspects of the film is in capturing the amazing visual experience of the festival - with some great cinematography, also the soundtrack was excellent too. The film also does a good job of touching on the spiritual side of the festival. A lot of Burners come seeking something - either a better knowledge of themselves or the world in general. I liked how it focused on the personal growth aspect instead of the usual nakedness, drugs & sex. A major weakness though is the focus on the specific group of first-time Burners. These people didn't add a lot to the film I found and weren't really representative - they never seemed to really catch the Burner spirit. At best their stories were just boring - and at worst they remind me of self-absorbed winers they get on Survivor or the Real world (especially since they seemed to be a purposely diverse group thrown together in a rather contrived way). For me it would have been more interesting if the filmmakers included more dialog with Larry Harvey or others who could intelligently articulate something about the philosophies behind BM. Overall though, an enjoyable and skillfully made documentary.",
         "I saw this at the Deep Ellum film fest--it was incredibly moving and had the whole room in tears. The personal stories made the Burning Man event available to the audience, and through their interwoven journeys, the film triumphed to tell the tale of what the hell Burning Man is all about. I've been to Burning Man 5 times and my family has no idea what it is about--they think it's all drugs and partying--but there is a spiritual aspect of the event that was captured in this film, and my parents actually are thinking of going now, since seeing this movie!! The cinematography was beautiful (how could it not be...well, actually it's quite hard to get anything without dust on your lens), the music is fantastic, there is some hilarious moments, and ultimately some great nuggets of the surealism that sets this event apart. FINALLY a movie that captures Burning Man in a most natural BEAUTIFUL way!! Hats off to the filmmakers for sharing..can't wait to get this DVD and show to friends.",
         "I wasn't so sure about it...went to the screening in san diego and the theatre was packed (with a lot of skeptics like me, i'm sure)...but that said this movie went way above my expectations...the music rocks (literally) and the mood of burning man came across in a big way...my girlfriend even cried. it was so great to see a good movie about an event that means so much to so many people. the filmmakers were sensitive about saying this is \"their journey\" so it's not like this is the definitive zillion hour doc that's trying to say what burning man is...it's an excellent take on the event that reached out to everyone around me...we went out afterwards and regaled eachother of our own burning man stories. thumbs up.",
         "Thank you for a beautiful film! One that finally speaks about the art...me and my girlfriend were crying by the end. Great visuals...great music. It really moved me...saw the film at Sundance and the audience gave a STANDING O. The filmmakers were there to answer questions/ and asked how many people had been to Burning Man...about 1/3 the room. The rest just walked into the screening and were still moved to tears!~ GREAT JOB. THANK YOU FOR PUTTING THIS FILM OUT...IT REPRESENTS THE COMMUNITY IN A BEAUTIFUL WAY!!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Hotbed Media"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 8627,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-10-23",
      "dvdReleaseDate": null,
      "directors": [
         "Paul Barnett",
         "Unsu Lee"
      ],
      "runtime": 83,
      "movieId": 8627,
      "title": "Confessions of a Burning Man",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0357567",
      "originalTitle": "Confessions of a Burning Man",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The experience shared by four first-timers demonstrates how Burning Man dissolves the barriers between races, nationalities and economic classes. A beautiful piece of film-making which inspires and entertains as it provides some understanding about why people return year after year.",
      "tmdbMovieId": 38631,
      "avgRating": 1.7,
      "releaseYear": "2003",
      "numRatings": 5,
      "posterPath": "/ex7MKhXgmtsqPiYl5SpcEbgintZ.jpg"
   }
}