{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "unexpected happiness",
            "id": 2203
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "loneliness",
            "id": 9957
         }
      ],
      "imdb_id": "tt0057999",
      "video": false,
      "title": "Dear Heart",
      "recommendations": [],
      "backdrop_path": "/fj57Lonhsv02h0HuhPzRLUKQ9Hh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Evie Jackson",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4a5",
               "name": "Geraldine Page",
               "profile_path": "/zyGpaCsHZUJRUyFUJNlTQ6dBs6F.jpg",
               "id": 41283,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Harry Mork",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4a9",
               "name": "Glenn Ford",
               "profile_path": "/t6lpxAmhOrRJ22d2xnQ1uB0CJf6.jpg",
               "id": 3381,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Phyllis",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4ad",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "June Loveland",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4b1",
               "name": "Barbara Nichols",
               "profile_path": "/5327cqoUJIWAg3iatFdVWQmpoW3.jpg",
               "id": 14575,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Patrick, Phyllis' Son",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4b5",
               "name": "Michael Anderson Jr.",
               "profile_path": "/jjvwMOXSSXr7qtj976by14KQAmQ.jpg",
               "id": 24808,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Miss Fox",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4b9",
               "name": "Mary Wickes",
               "profile_path": "/eVNN8YtXFYGGO7uzaA7SqlVFe63.jpg",
               "id": 20624,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Miss Moore",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4bd",
               "name": "Alice Pearce",
               "profile_path": "/xZdynSG1PSq84QBK3GKx0rdfBnm.jpg",
               "id": 113952,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Cruikshank",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4c1",
               "name": "Richard Deacon",
               "profile_path": "/ikKk1FGXFDl9GJoyI3I2EBfexEY.jpg",
               "id": 80206,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Frank Taylor",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4c5",
               "name": "Charles Drake",
               "profile_path": "/AiuCiwhqEyt5yGAu52tXuhK8uNL.jpg",
               "id": 15978,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mitchell",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4c9",
               "name": "Patricia Barry",
               "profile_path": "/na5BXKplegqYCWvRWvRvSWxXL78.jpg",
               "id": 40208,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Miss Tait",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4cd",
               "name": "Ruth McDevitt",
               "profile_path": "/4mPxaegx2KjdUbMS17Z7uRxuara.jpg",
               "id": 85833,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Connie",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4d1",
               "name": "Neva Patterson",
               "profile_path": "/iqFt5B09XmCdI8tXuR3Ayg3O0je.jpg",
               "id": 54682,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Hotel masher",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4d5",
               "name": "Ken Lynch",
               "profile_path": "/6zrOWruN0LoolGOSNdzKdJMiVkd.jpg",
               "id": 2652,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Marvin",
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4d9",
               "name": "James O'Rear",
               "profile_path": null,
               "id": 95265,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Mrs. Sloan",
               "gender": 1,
               "credit_id": "52fe49eac3a36847f81ad4dd",
               "name": "Sandra Gould",
               "profile_path": "/xMNwhtMRiGtey1WHqVVmC8w3p5U.jpg",
               "id": 113655,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49eac3a36847f81ad4a1",
               "name": "Delbert Mann",
               "profile_path": "/og3XZHwLtTjoxD2hNdORK2vXT67.jpg",
               "id": 67451,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49eac3a36847f81ad4e3",
               "name": "Tad Mosel",
               "profile_path": null,
               "id": 176871,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "530fef40c3a3682a02000671",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "530fef5ec3a3682a02000673",
               "name": "Folmar Blangsted",
               "profile_path": null,
               "id": 4309,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "530fef6ac3a36829d3000718",
               "name": "Joseph C. Wright",
               "profile_path": null,
               "id": 7337,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "530fef77c3a36829ef0006c4",
               "name": "Howard Bristol",
               "profile_path": null,
               "id": 10918,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "530fef84c3a36829d300071f",
               "name": "Donfeld",
               "profile_path": null,
               "id": 10189,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56d4c736c3a3681e3c017425",
               "name": "Russell Harlan",
               "profile_path": "/yDYlBTYPEMARI8sKwPjnleqQvFL.jpg",
               "id": 4308,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.983701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 101226,
      "vote_count": 4,
      "budget": 0,
      "overview": "A lonely Ohio spinster hopes to find romance when she travels to New York City for a postmasters' convention.",
      "similar": [
         812,
         277547,
         435126,
         37710,
         152601,
         694,
         11224,
         37247,
         9029,
         10719,
         16290,
         50546,
         62206,
         49013,
         49524,
         76492,
         9472,
         10530,
         5,
         13
      ],
      "original_title": "Dear Heart",
      "runtime": 114,
      "poster_path": "/58wRJrCr6oK27UBol4j8OXmkSI1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Out of Towners Productions",
         "id": 18682,
         "origin_country": ""
      }],
      "release_date": "1964-12-02",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "Two hours from now, two total strangers will meet at a hotel convention in the most unconventional love affair in years!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Delbert Mann"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Tad Mosel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057999/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNTM2OTU1Nl5BMl5BanBnXkFtZTYwODg3NDg5._V1_SX188_AL_.jpg",
      "actors": ["Stars: Glenn Ford, Geraldine Page, Angela Lansbury | See full cast and crew »"],
      "reviews": [
         "This is a film about two middle aged people in search of their soul mates. It is a very adult film. Children under 35 usually don't find it very rewarding unless they possess an unusual emotional maturity. I loved it the first time I saw it when I was about 22, but I didn't understand its depths until I was about 38. It shows the despair of lonely singles. It shows the \"innocence\" of the never attached. A spinster (what an ageist and sexist term) and a not too old jaded and bored bachelor try to make relationships which don't really fit work for them. The efforts they go through and the situations they find themselves in make for a lovely and sweet ride. The resolution is extremely gratifying and not so unrealistic. Its tone, mood and pacing as the two meet and learn about each other build beautifully. I don't want a remake, but I miss movies of this maturity, thought and charm. No glamour, no glitz, no silly gags, no pretty young things, this film shows ordinary people with ordinary problems trying to find someone to love in a world that isn't always kind to people past their \"prime\". Geraldine Page is revelatory as the slightly ridiculous woman who grows more lovely as the story progresses. Glenn Ford's charms are used to their maximum effect and Angela Landsbury adds the right shrewish tone. This is a must see for people who love a good complicated normal romance.",
         "This film is one of the best! Glen Ford and Geraldine Page are excellent. The story is believable, sentimental without being too predictable. Page, as Evie gives a marvelous performance as a single woman postmaster in her forties, living it up at a convention in the Big Apple; perhaps her best performance. At one point, she gives a monologue about what women \"give up\" as they grow older waiting to find a husband. The writing is touching without being saccharine. And the direction throughout this scene and others is subtle and play-like; simply superb. Films are just not shot in long takes as this one anymore. This film is an example of a little-known black and white film that gets overlooked, but is stellar in its own right!",
         "Glenn Ford and Geraldine Page were never better than they are in the film \"Dear Heart.\" It's the story of how two people (who in all likelihood should never be together...or even meet) find each other and fall in love, despite the fact that their lives are heading in completely opposite directions. Geraldine Page is Evie, a small town Postmistress at a Postmaster's convention. She's outgoing, gregarious, and talks (and interacts) with everyone...wanting anyone she meets to feel her same joy of life and excitement in simple things. But despite her bubbly personality, she's lonely, and can only affect superficial relationships with strangers. Glen Ford is a charming salesman who's been a lady's man always heading in a direction opposite of the altar. He finally decides to tie the knot with Angela Lansbury (at her controlling, oppressive best) when he meets Evie. She's honest in the extreme, delightful in her no holds barred approach to life...and like nothing Glen's ever met before. They shouldn't have anything in common...but they do...it's her approach to life, and through her he sees how he really wants to be...and she sees the real him. They know they can't ask too much of each other...or can they? Surprizing and sparkling, this story set the standard for romances some 30 years later...like \"Sleepless in Seattle.\" It shows no matter which way you're heading...you only think you have life planned and real love...the right one...will always find a way to re-write your story. Simply said...the world needs truly wonderful movies like \"Dear Heart\" now, more than ever.",
         "I note that a DVD version of this charming film is available in Great Britain, but not here . (Our VHS version is not in stock from one major source and one wonders if the British DVD is also out-of-stock.) This title boasts two truly fine actresses, Geraldine Page and Angela Lansbury (although the latter has little more than a cameo, of which she makes the most, as always), plus a wonderful supporting cast as well. Ordinarily I've found Glenn Ford to be rather dull in several of his big screen performances but in this one I recall finding him well-suited to his role and giving an entirely sympathetic and amusing account of himself opposite Ms. Page in a role she obviously relished. With a well-remembered theme song and a nice music score by the prolific Henry Mancini, there's probably no danger of this one being remade, I suspect, and, since it's close to perfect in this original telling, let's just hope that a DVD release will eventually allow us to revisit the qualities that made it genuinely appealing for mature audiences forty years ago and, I feel sure, still would today.",
         "Geraldene Page was always one of my favorite actresses. She was exceptionally good as she posessed a broad spectrum of insight into the characters that she portrayed. She was one of the few actresses who could play almost any given part in any genre. Here she is teamed with the very talented Glenn Ford in a light-hearted romantic comedy where they play off of each other brilliantly. The directing is fabulous and so is the story, even though some may find it a bit slow. I think it is worth watching more than once. One of the most hilarious scenes in the film is when Miss Page and Mr. Ford are in one of the hotel hallways deciding exactly what the other guests are like and 'supposedly how they live' as well. I like this movie because it makes me feel good! Angela Lansbury is excellent also, in her 'barely more than a cameo appearance' as she ignites the fire that makes the story work! A definite 10 in my book. Watch this gem!",
         "Perhaps it was the fact she'd already received three nominations. She would eventual be nominated for 8, putting her in 8th place behind only Streep, Hepburn, Nicholson, Davis, Olivier, Newman and Tracy which is pretty impressive territory! She would win one. Or perhaps it was just the strong year for actresses with Sophia Loren in \"Marriage Italian Style\", Anne Bancroft in \"The Pumpkin Eater\", Kim Stanley in \"Séance on a Wet Afternoon\", Debbie Reynolds in \"The Unsinkable Molly Brown\", or eventual winner Julie Andrews in \"Mary Poppins\", but I believe Geraldine Page's performance here is the equal of any 1964 female film performance. Her character Evie is one of the most sympathetic ever recorded and Page's expert portrayal captures the hearts of the audience. Along for the ride is the vastly underrated Glenn Ford and the always watchable Barbara Nichols. Too bad we didn't see more of her along with contemporaries Hope Holiday and Sue Ann Langdon. I wish there was more on this site about all three. \"Dear Heart\" was not intended as a blockbuster and as 1960s films go, it was more or less a \"B\" picture. But the film features excellent writing, a believable storyline, excellent performances, and a captivating score by Henry Mancini.",
         "I first saw this movie alone in our darkening family room on a summer evening at the age of 14.It was the first Geraldine Page performance I'd ever seen and it hooked me.I fell in love with her,with Glenn Ford,with New York City,with apartments over cafés,with....well,I fell in love.This movie rings with romantic notions and truths,sympathetic characters,and (for viewers of a certain age or awareness) an abundance of familiar faces.Also the theme song \"Dear Heart\" is one of Henry Mancini's loveliest and most evocative both melodically and lyrically.Actually,in my early teens I spent a lot of summer evenings watching television alone in our darkening family room,a little lonely yet hoping not to be disturbed.Now,at age 51,I consider myself lucky that during those somewhat lonely and impressionable times I had the opportunity to be exposed to this movie and so many others of it's quality.I like it!",
         "Gentle, delightful film of greeting card salesman Glenn Ford who happens to meet ditzy postmaster Geraldine Page during a New York convention. Great character development, superb direction (by Delbert Mann), memorable score (Henry Mancini), luminous B&W cinematography all contribute to a great movie experience. Ford and especially Page are at the top of their games here. Great support from Angela Lansbury, Ken Lynch, Richard Deacon, and other notable character actors. Final reunion scene at Grand Central Station is truly poignant. Too bad these movies are extremely scarce nowadays. Catch it if you remember 1964 and want to watch a film without explosions, violence, or foul language.",
         "This is one of my favorite movies. It's a very sentimental story about lonely people who find each other. The characters of Harry(Glen Ford) and Evie(Geraldine Paige) are very well written, complete and endearing. I can watch this movie over and over again. I love it.",
         "A lonely and single woman look for love and companionship in New York City at a postmasters' convention. This sweet film brought tears to my eyes watching it. Dear Heart was wonderfully acted by Geraldine Page, Glenn Ford, and Angela Lansbury. It was a delight to watch."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Out of Towners Productions"],
      "summaries": ["Single and alone, Evie arrives in New York for the annual Postmasters' convention. Staying at her hotel is a womanising salesman newly promoted to his marketing department and trying to adjust to having become engaged. When his path crosses Evie's, she wonders if this is finally the man for her, while her ways just seem to annoy him. At least to start with."],
      "budget": 0
   },
   "movielensId": 86308,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-12-02",
      "dvdReleaseDate": null,
      "directors": ["Delbert Mann"],
      "runtime": 114,
      "movieId": 86308,
      "title": "Dear Heart",
      "mpaa": "",
      "actors": [
         "Geraldine Page",
         "Glenn Ford",
         "Angela Lansbury",
         "Barbara Nichols",
         "Michael Anderson Jr.",
         "Mary Wickes",
         "Alice Pearce",
         "Richard Deacon",
         "Charles Drake",
         "Patricia Barry",
         "Ruth McDevitt",
         "Neva Patterson",
         "Ken Lynch",
         "James O'Rear",
         "Sandra Gould"
      ],
      "imdbMovieId": "0057999",
      "originalTitle": "Dear Heart",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["jaBbKmxRnCo"],
      "plotSummary": "A lonely Ohio spinster hopes to find romance when she travels to New York City for a postmasters' convention.",
      "tmdbMovieId": 101226,
      "avgRating": 2.91667,
      "releaseYear": "1964",
      "numRatings": 6,
      "posterPath": "/58wRJrCr6oK27UBol4j8OXmkSI1.jpg"
   }
}