{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "space research",
         "id": 191092
      }],
      "imdb_id": "tt0057328",
      "video": false,
      "title": "The Mouse on the Moon",
      "recommendations": [
         11643,
         4932,
         42407,
         58293,
         49844,
         36642,
         31644,
         24214,
         42728,
         22682,
         42995,
         31918,
         5638,
         52122,
         36283,
         66043,
         43040,
         42245,
         65012,
         22176
      ],
      "backdrop_path": "/xTpJhQSrrNFRPupJj7qtamGxC1w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Grand Duchess Gloriana XIII",
               "gender": 1,
               "credit_id": "52fe47acc3a36847f8142311",
               "name": "Margaret Rutherford",
               "profile_path": "/mB0mupPkd27Kb1EgIwAXnY7LpBo.jpg",
               "id": 11127,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Prime Minister Rupert Mountjoy",
               "gender": 2,
               "credit_id": "52fe47acc3a36847f8142315",
               "name": "Ron Moody",
               "profile_path": "/21sEsEm1yRmDO9UxrG1WNDVfwPl.jpg",
               "id": 41236,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Vincent Mountjoy",
               "gender": 2,
               "credit_id": "52fe47acc3a36847f8142319",
               "name": "Bernard Cribbins",
               "profile_path": "/uxpXeSHWOJvDnozRaYr7tixWmHk.jpg",
               "id": 40943,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Professor Kokintz",
               "gender": 2,
               "credit_id": "52fe47acc3a36847f814231d",
               "name": "David Kossoff",
               "profile_path": "/d5xMGFITkes230NjLQ8F5u7RU3f.jpg",
               "id": 29675,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "52fe47acc3a36847f8142321",
               "name": "June Ritchie",
               "profile_path": "/hSBnVTN4xphShiDPT1F9WI7QkK9.jpg",
               "id": 111323,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Maurice Spender",
               "gender": 2,
               "credit_id": "52fe47acc3a36847f8142325",
               "name": "Terry-Thomas",
               "profile_path": "/tdsN3NUsBNEPtHkWX5BskfG7yCi.jpg",
               "id": 29427,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47acc3a36847f814230d",
               "name": "Richard Lester",
               "profile_path": "/2H4PFCd4G8BLHK34lTsUs3cn2tM.jpg",
               "id": 10586,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47acc3a36847f814232b",
               "name": "Leonard Wibberley",
               "profile_path": null,
               "id": 73247,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47acc3a36847f8142331",
               "name": "Michael Pertwee",
               "profile_path": null,
               "id": 43793,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.567845,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 49876,
      "vote_count": 9,
      "budget": 0,
      "overview": "Sequel to The Mouse that Roared; The Tiny Country of Grand Fenwick has a hot water problem in the castle. To get the money necessary to put in a new set of plumbing, they request foreign aid from the U.S. for Space Research. The Russians then send aid as well to show that they too are for the internationalization of space. While the grand Duke is dreaming of hot baths, their one scientist is slapping together a rocket. The U.S. and Soviets get wind of the impending launch and try and beat them to the moon.",
      "similar": [],
      "original_title": "The Mouse on the Moon",
      "runtime": 82,
      "poster_path": "/dNbwRyqIKmrY9T3avSmt82ckrMW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Walter Shenson Films",
            "id": 3462,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists Corporation",
            "id": 8213,
            "origin_country": ""
         }
      ],
      "release_date": "1963-05-07",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Stop shooting at our moon!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Lester"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Leonard Wibberley",
         "Michael Pertwee"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0057328/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTc4NTk4NDgyN15BMl5BanBnXkFtZTcwODY2NjE2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Margaret Rutherford, Ron Moody, Bernard Cribbins | See full cast and crew »"],
      "reviews": [
         "It's hard for it not to pale in comparison to its predecessor, \"The Mouse That Roared,\" but \"The Mouse on the Moon\" is still an amiable enough comedy that it overcomes its own slightness and miniscule budget. The plot -- which concerns the Duchy of Grand Fenwick petitioning the United States for a loan so that it can develop a space program (which is really a cover for the prime minister's insatiable desire for indoor plumbing) -- is amusing and gives director Richard Lester and screenwriter Michael Pertwee plenty of opportunities to draw parallels between the Americans and the Russians as they scramble to beat the tiny country to the moon. Instead of Peter Sellers in three roles, we have Margaret Rutherford taking over one (as the dotty grand duchess) and Ron Moody taking over another (as the ruthless prime minister). Both are funny enough, but they're no substitute for the real thing. Joining them are a young Bernard Cribbens as Moody's son Vincent, who wants nothing more than to be an astronaut, David Kossoff (one of four actors returning from \"The Mouse That Roared\") as the ever resourceful Professor Kokintz, and Terry-Thomas as a thoroughly inept British spy. Also watch for John Bluthal in his first of many films for Lester as Von Noldol, the enthusiastic German scientist working for the U.S. For Richard Lester fans, this is a must-see. After all, this is the film that got him the job directing a certain film starring four lads from Liverpool...",
         "The two \"Mouse\" films benefitted greatly from the wonderfully funny source novels by terribly under-appreciated Irish author Leonard Wibberley. Although the second film suffers in comparison because of the loss of star Peter Sellers, the performances by Ron Moody as Count Mountjoy and Dame Margaret Rutherford are still quite effective. It must be pointed out that some of the higher bits of satire of Wibberley's novel have gone missing from the film. In the novel, the Duchess (a 23-year-old married to Chief Forester Tully Bascomb) asks Count Mountjoy (she has called him \"Bobo\" since infancy) for an Imperial Russian sable fur coat. Mountjoy, desiring to update the Grand Fenwick castle's 14th century plumbing, gets a decree passed asking for a loan from the United States for $50,000 for the coat. Being the sly fox that he is, he also asks for $5 million to enter the SPACE PROGRAM! Of course, Mountjoy has every intension of buying the Duchess her coat and using the rest on the plumbing (and also for road improvements, as there are no paved roads in the country). The USA realizes that it's a ruse of some sort, but sees it as an excellent PR opportunity and decides to give them $50 million instead! The rest of the plot is pretty much directly translated into the film. Too bad Wibberley's remaining books in the series (\"The Mouse on Wall Street,\" \"The Mouse That Saved the West,\" and \"Beware the Mouse!\") were never filmed.",
         "This is one of the best political satires I have ever seen. Ironically, I saw this film before I saw the predecessor, The Mouse That Roared, and I still have yet to see all of that film. I really enjoyed the fact that this film poked fun at how obsessed the United States and the Soviet Union were on the space race that they didn't know how the Duchy of Grand Fenwick beat them in the construction of a rocket to the moon. Bernard Cribbins, Ron Moody and David Kossoff were all exceptional in this film and they made it an enjoyable experience. Too bad this or the original \"Mouse\" film are rarely, if ever shown on television anymore.",
         "I disagree with the other critics who say this doesn't live up to the original. I think that even without Peter Sellers, that this sequel stands on its own two feet. The script was incredibly funny, from start to finish. There are so many nice touches by the screenwriter; it's hard to list them all. However, the touch of having the astronauts and cosmonauts being forced to return in the Fenwick rocketship - is just brilliant! The major drawback with this script is the lead's love interest, the blonde girl. She really feels like a fifth wheel throughout much of the film, and her subplot isn't dynamic enough. However, overall there are plenty of jokes strewn throughout the story, and the direction and editing is also spot-on.",
         "There could do with some watching of films such as this in high offices in the US or indeed, in many other \"world powers\". Pragmatism and a certain amount of humility might be learnt by those watching and a realisation that acts of domination aren't necessarily a good thing nor will they end in their intended way; are the basic premise of this film. What it lacks in subtle finesse, it makes up for in it's universal humour and it's now poignant reminder that we can all be fools when we think first of ourselves and only later of the consequences for others. A film made in 1963, more than 40 years old, still has a message for us today, a message that it seems many need reminding of. Splendid farce and superb comedy moments and a jolly gripping tale to boot. I'll drink champagne to that!",
         "The DVD box claims that this mild comedy is 'hilarious' are somewhat inflated. Okay, the box copy on any comedy tends to exaggerate its hilarity, so we won't hold such hyperbole too strongly against it. That said, this modest sequel to The Mouse That Roared manages to entertain as what it is: a low key family comedy of moderate charms. The idiot locals of the tiny and pastoral Grand Duchy of Fenwick return, this time with a scam to get Uncle Sugar to pay to restore the place's ancient plumbing by way of a 'technology loan'. Wink, wink. When U.S. inspectors arrive to view the results of Fenwick's space program, the locals scramble to keep them off-balance while enlisting the aid of an eccentric old professor to build them a REAL moon rocket. And it just so happens he has been working on that very thing. There are the usual farcical runnings around and the presence of the quirky Terry-Thomas is always welcome in this sort of exercise, but the whole thing is less clever and less fun than the original or the many Ealing Studios caper movies from which it clearly draws inspiration. The look is good, the characters all have their modest individual charms and everything turns out nifty in the end, aww, but don't expect anything overly inspired. There isn't a lot of real cinematic cleverness here, just good, competent old-fashioned movie entertainment. As that it works just fine. Enjoy.",
         "The tiny country of Grand Fenwick is again the center of attraction as its resourceful Prime Minister Mountjoy and a scientist, Professor Kokintz, want to make a statement to the world. The P.M. thinks that by interesting the Americans in a phony space plan, his country will receive a fair compensation in aid to replace the nation's poor plumbing system, while the professor has found what he was looking for with the help of the Grand Fenwick's wine in order to achieve his ambitious project. The tiny country is the envy of the American, Russian and British government because it will achieve something that its most powerful counterparts cannot do: be the first to land on the moon! The sequel of \"The Mouse That Roared\" gets a fun production by Richard Lester, a man that understood comedy well. One would have thought the loss of the previous hit star, Peter Sellers, would not work, but thanks to Mr. Lester's vision it is a much better film that we expected. Not having seen at all, we were able to catch up with it, as it appeared on a cable channel recently. The film has a great look in spite of the time elapsed since it was first release. On hand for this installment, are some excellent English performers. Margaret Rutherford makes a valuable contribution with her Gloriana XIII, a dizzy lady who gets her speeches confused whenever she happens to speak at a public function. Ron Moody is perhaps the best thing in the movie as the ambitious Mountjoy. Bernard Cribbins and June Ritchie play a young couple in love. David Kossoff is Professor Kokintz, the brainy inventor that is instrumental in the launching of the space ship. The excellent Terry-Thomas adds a funny performance to the movie.",
         "Whoa! Isn't something missing here? Another episode in the Grand Fenwick chronicles and no Peter Sellers? I mean, you got all the standard Brits, Ron Moody, Dame Maggie Rutherford, John Le Messieur and, of course, the gap-toothed Terry Thomas, but where's Peter? This movie is definitely his kind of vehicle and Bernie Cribbins does his level best-- but, it's not Peter. Rumor has it, and I've never been able to trace down the source, that Sellers was slated for this part and contracts, shooting commitments and the like served to interfere... But, we can only imagine how it would have turned out if the PS had been there.",
         "That noted country The Grand Duchy Of Fenwick manages to overtake both the Americans and the Russians in the space race in a delightful British comedy, The Mouse On The Moon. That only seems right because Grand Fenwick nearly controlled the world in The Mouse That Roared. How did this country do it? Well for starters it got an American loan for research and the Russian loan of one of their rockets. Americans and Russians each looking to outsmart the other in international diplomacy and Fenwickian Prime Minister Ron Moody outsmarting them with of all things, honesty. You have to see the film to see how it plays out. Secondly the Fenwickians have scientist David Kossoff with a trusty assistant Bernard Cribbins who is also Moody's son and Kossoff is shall we say pursuing an entirely different line of research in his efforts to find fuel. As it turns out Grand Fenwick already has the perfect rocket fuel, but it needed a mind like Kossoff's to refine it. Again you have to see the film for what it is and how it works. Margaret Rutherford is back as the Grand Duchess Of Fenwick presiding with regal medieval splendor in this insignificant piece of European real estate. And Terry-Thomas is a splendid British spy whom the Fenwickians help somewhat in his mission. Sad that Peter Sellers couldn't be in the film, the part that Bernard Cribbins plays was clearly written with him in mind. Still this comedy is another fine one from the United Kingdom.",
         "\"The Mouse That Roared\" put a comedic spin on the United States' policy of rebuilding those countries it has beaten in war. Here in the sequel, the subject is the space race and the international contest concerning putting a man on the moon. As in the original film, the small duchy of Grand Fenwick is faltering financially and needs the aid of other countries to make ends meet. (It never occurs to anyone to sell off some of the jewels dripping off their ruler, The Grand Duchess!) The Prime Minister (Moody) concocts a scheme to trick the U.S. into providing funds for rocket research which he actually intends to use for installing indoor plumbing at the castle (due to his fondness for long baths which, initially, don't include hot water!) Once the U.S. coughs up some money, the U.S.S.R., not to be outdone, provides Grand Fenwick with a rocket, though neither country believes that any true result will come of their deeds. When Moody's son Cribbins comes back home from school, he decides to actually give space travel a go, with the help of a grandfatherly professor (Kossoff.) Meanwhile, the dotty Duchess (Rutherford) engages in various pageantry and the duchy's youth live as protesting Beatniks (!) led by Richie. Much of this satire will be lost to a newer generation since so much has changed since the time it was made. This was filmed before the Kennedy assassination and the breaking of many social and sexual taboos across the world. If anything, it presents a sort of periodic time capsule of the socio political climate of the day. Director Lester shows signs of the rather subtle slapstick and physical comedy that he would insert into many of his later films. Top-billed Rutherford (right at the height of her popularity in the Miss Marple films) is given almost nothing to do. Always engaging to watch, she nonetheless has very little of interest to work with and is off screen for much of the picture. Moody gives a solid and energetic performance, though his biggest hit would follow in a few years with \"Oliver!\" Cribbins is only moderately entertaining and lacks the charisma to really grab attention. The ever-exasperated Thomas shows up briefly as a U.K. spy and adds some sparkle to the proceedings. Richie has a thankless, idiotic role and an even more thankless wardrobe. It's worth a look for fans of Moody, Lester and films concerning The Cold War and earlier U.S. mores, but doesn't really succeed as a full-on comedy. Most of the humor is very dry and spotty. Fans of physical comedy may find more to laugh at during the various mishaps of the cast. For many folks, the absence of Peter Sellers (star of the original film in three separate roles) relegates this to a misfire. It's not a bad little film, it's just not a great one."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": ["Walter Shenson Films"],
      "summaries": [
         "Sequel to The Mouse that Roared; The Tiny Country of Grand Fenwick has a hot water problem in the castle. To get the money necessary to put in a new set of plumbing, they request foreign aid from the U.S. for Space Research. The Russians then send aid as well to show that they too are for the internationalization of space. While the grand Duke is dreaming of hot baths, their one scientist is slapping together a rocket. The U.S. and Soviets get wind of the impending launch and try and beat them to the moon.",
         "A tiny country persuades the Americans and Soviets that they're starting a space program, when they really just want some money for new plumbing."
      ],
      "budget": 0
   },
   "movielensId": 86312,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-05-07",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Richard Lester"],
      "runtime": 82,
      "movieId": 86312,
      "title": "The Mouse on the Moon",
      "mpaa": "",
      "actors": [
         "Margaret Rutherford",
         "Ron Moody",
         "Bernard Cribbins",
         "David Kossoff",
         "June Ritchie",
         "Terry-Thomas"
      ],
      "imdbMovieId": "0057328",
      "originalTitle": "The Mouse on the Moon",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "9yqZzPV5V7k",
         "fQv0d50-7Go"
      ],
      "plotSummary": "Sequel to The Mouse that Roared; The Tiny Country of Grand Fenwick has a hot water problem in the castle. To get the money necessary to put in a new set of plumbing, they request foreign aid from the U.S. for Space Research. The Russians then send aid as well to show that they too are for the internationalization of space. While the grand Duke is dreaming of hot baths, their one scientist is slapping together a rocket. The U.S. and Soviets get wind of the impending launch and try and beat them to the moon.",
      "tmdbMovieId": 49876,
      "avgRating": 3.1,
      "releaseYear": "1963",
      "numRatings": 5,
      "posterPath": "/dNbwRyqIKmrY9T3avSmt82ckrMW.jpg"
   }
}