{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt1343755",
      "video": false,
      "title": "Rabbit Without Ears 2",
      "recommendations": [
         6076,
         53174,
         170759,
         28938,
         94562,
         253370,
         75969,
         80125,
         160085,
         73770,
         6733,
         6183,
         9805,
         9510,
         47979,
         308187,
         269258,
         8366,
         35217,
         83729
      ],
      "backdrop_path": "/3sBXFdOGrQcAZt4WYBUQPjyQ7ss.jpg",
      "revenue": 48720000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ludo Dekker",
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6fd7",
               "name": "Til Schweiger",
               "profile_path": "/mRQ9URazBbImeV0NxHZsGS3Px7D.jpg",
               "id": 1844,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Anna Gotzlowski",
               "gender": 1,
               "credit_id": "54104ceb0e0a26125f0018b9",
               "name": "Nora Tschirner",
               "profile_path": "/aPQMifOpxjutL5xdKHFedmXQJ7h.jpg",
               "id": 19910,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Moritz",
               "gender": 2,
               "credit_id": "54104d130e0a2612590018a5",
               "name": "Matthias Schweighöfer",
               "profile_path": "/qp2AD7quBf4busgntuk0kd1Bsiq.jpg",
               "id": 16808,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Thomas Kretschmann",
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6fdb",
               "name": "Thomas Kretschmann",
               "profile_path": "/sAGn557s6oJ74SycAV2DPb26Vqn.jpg",
               "id": 3491,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ralf",
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6fdf",
               "name": "Ken Duken",
               "profile_path": "/tuyAiTfdMeUwR4qLUJButZmRZDd.jpg",
               "id": 44651,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Cheyenne-Blue",
               "gender": 0,
               "credit_id": "54104d320e0a26125c00183a",
               "name": "Emma Schweiger",
               "profile_path": "/4oL34Vm71kRkY8CstYeIWLwB9m6.jpg",
               "id": 147444,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Asi",
               "gender": 2,
               "credit_id": "54104d410e0a26125f0018c0",
               "name": "Sönke Möhring",
               "profile_path": "/bFu7ecYD1ts7m0qO5pxeRndGhAK.jpg",
               "id": 147446,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Barmädchen",
               "gender": 1,
               "credit_id": "54104d510e0a2612590018ad",
               "name": "Annika Blendl",
               "profile_path": "/b4v6klpF1tXcpxnCX5MQZ1XpdG4.jpg",
               "id": 17053,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Caro",
               "gender": 0,
               "credit_id": "54104d5f0e0a261267001878",
               "name": "Jasmin Gerat",
               "profile_path": "/5qScqtASUktfGPoPmeavczKsVQU.jpg",
               "id": 21832,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Schönheitsarzt",
               "gender": 0,
               "credit_id": "54104d740e0a261264001862",
               "name": "Thomas Heinze",
               "profile_path": "/tu3DQr6TRXtvedGWFqN1Q9P9lMv.jpg",
               "id": 35264,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Herb",
               "gender": 2,
               "credit_id": "54104d820e0a261264001864",
               "name": "Heiner Lauterbach",
               "profile_path": "/ijrlHcCTjA5VrmY3vJsuOC3qUL3.jpg",
               "id": 7830,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Samy",
               "gender": 2,
               "credit_id": "54104d970e0a26125f0018c7",
               "name": "Elyas M’Barek",
               "profile_path": "/Arh8aKvYeJfigN0sAtNWt0GIZRo.jpg",
               "id": 25409,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Taxifahrer",
               "gender": 2,
               "credit_id": "54104dae0e0a2612590018b1",
               "name": "Denis Moschitto",
               "profile_path": "/mHFhG5ooyLxkk8Oc21TFvgoKE78.jpg",
               "id": 16250,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Dr. Ephraim Eisenberger",
               "gender": 2,
               "credit_id": "54104dbe0e0a26125f0018cd",
               "name": "Uwe Ochsenknecht",
               "profile_path": "/nPaQx2K0UodicKPlrAXQjjkilF7.jpg",
               "id": 682,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Arzt",
               "gender": 2,
               "credit_id": "54be69f992514148f000ac72",
               "name": "Marc Hosemann",
               "profile_path": "/wlSoTU9tbv2Gyl8rzz3WPDwJt3T.jpg",
               "id": 5600,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6fcd",
               "name": "Til Schweiger",
               "profile_path": "/mRQ9URazBbImeV0NxHZsGS3Px7D.jpg",
               "id": 1844,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4501c3a36847f80b6fd3",
               "name": "Anika Decker",
               "profile_path": null,
               "id": 57759,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.735312,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 9511,
      "vote_count": 117,
      "budget": 0,
      "overview": "Two years have passed. There is a normal life, but handsome Ludo meets his old love, and Anna is very jealous...",
      "similar": [],
      "original_title": "Zweiohrküken",
      "runtime": 124,
      "poster_path": "/ngeNPb1BB3z4R372ksxHorFHHNv.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "barefoot films",
         "id": 1989,
         "origin_country": ""
      }],
      "release_date": "2009-11-24",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/d6huUTFcLRVOHeS70zj8WF4J71U.jpg",
         "name": "Keinohrhasen Filmreihe",
         "id": 215456,
         "poster_path": "/jRDSPbqRWAHux09eVm1riddAdys.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Til Schweiger"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Anika Decker",
         "Til Schweiger"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt1343755/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0MTE5MDM2N15BMl5BanBnXkFtZTcwMDE2OTIxMw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Beck, Annika Blendl, Yvonne Catterfeld | See full cast and crew »"],
      "reviews": [
         "I was curious where this story was going to. In part 1 (I'm guessing you have seen that, so no spoilers for the sequel, but for part 1) Til was a reporter, for a tabloid newspaper, but by the end of it, he committed to be work at a Kindergarden. Plus it seemed Tils character and Noras were about to start one very good relationship. But the way the movie starts is a marathon of clichés (about relationships and men/women respectively). And it's not done in a funny way either ... you just get scene after scene, wondering when the movie actually is going to start or not. Of course you might think this is nit-picking and if you watched the movie and liked it, good for you. I wished I could have, but I couldn't really like it (even though there are a few nice scenes, that do not involve excrement or other premature jokes) ...",
         "I started with an open mind since I enjoyed Keinohrhasen. That movie was kind of funny. This one however is a total sellout, designed to make an extra buck on the back of the previous movie. The jokes were not even funny and fairly predictable. I just wonder why nobody noticed during the production process how bad this was going to be. How is it to present such a bad movie at a movie premiere to an audience - did THEY think this was good. If you are renting the DVD - get plenty of alcohol, a backup movie and watch it with some friends that are funny. Don't watch it with your children. It's not funny or even enjoyable in any other way. They only way I can imagine someone enjoying this is if you are curious about what watching a really bad movie feels like.",
         "Till Schweiger is unfortunately one of those German directors who seem to \"engineer\" their movies in order to cater to a maximum degree to a certain target audience. By that I mean that he takes some simple ingredients that he knows will please the audience and loosely connects them to form a film. He was clearly trying to sell this flick to women, so he took cute children, romance and jealousy, a main character discovering his responsibility in life (an invariant in films by Schweiger), inhibited erotic scenes and some stupid, below-the-belt kind of jokes and glued them together to an incoherent, predictable and largely non-entertaining collage. Sometimes, the results of Schweiger's industrial film-making approach can be decent, as can be seen with Barfuss. Here however, the plot is just mundane to the point of being non-existing, the jokes are embarrassing and contrary to the first film, even the children are portrayed in such an unrealistic way that they don't convey any of the desired cuteness anymore. As other reviewers have pointed out before me, the production company probably only wanted to make a quick buck with this, following up on the success of Keinohrhasen. If you think that you like a film formed from the above-mentioned ingredients than you should probably watch Keinohrhasen instead - it's exactly the same, only with a slightly better plot.",
         "Til Schweiger's \"Keinohrhasen\" was a massive commercial success in Germany, so of course id did not take too long till they came up with a second movie. The central characters are just like in the first Til Schweiger, Matthias Schweighöfer and Nora Tschirner. I thought the film started very weak with humor on great breast size and farting in people's faces, but as it went on, it got better. It never reached the level of the first movie, but all in all it's a decent outcome. There is some male-female discussion about shoes which reminded me of Loriot the way it was written. In the first film, Jürgen Vogel played himself in a cameo and here in this movie, Heiner Lauterbach and Uwe Ochsenknecht, two of Germany's most known actors over 55 play small, but funny roles. While the first film was about Schweiger's and Tschirner's characters getting together, this film is about struggles they are facing during everyday life, especially as former partners of them enter the picture. Then there is a sub-plot with Schweighöfer's character which walked the fine line between funny and cringeworthy and occasionally even crossed it for worse. The ending of this 2-hour-film was one of its weaknesses in my opinion. First of all, the fact that they sleep with their exes at exactly the same time felt weird to me and the harmonic ending seemed just rushed in and included for the sake of it. It was extremely cheesy. There is lots of music in this one, but the only kinda memorable song for me was \"This Is The Life\" by Amy McDonald. It was not as successful as the first, but still became the 6th most lucrative film at the box office in 2009 and number 2 if you only count German films. As a whole, I recommend \"Zweiohrküken\" (chicken with two ears) to people who enjoyed \"Keinohrhasen\" (\"rabbits with no ears\"). Just like its prequel, it was written and directed by Anika Decker (who has the same name like the central character) and Schweiger himself, who also directed it again. We'll see if they ever make a third one. If they do, i just hope the decrease in quality won't continue. The only thing better than the first is that Alwara Höfels (one of the biggest weaknesses of \"Keinohrhasen\") is pretty much nonexistent in this sequel.",
         "This film has massive problems, starting with an embarrassingly thin plot: girl suspicious of boyfriend, boyfriend gets defensive, girlfriend gets defensive in turn, both partners cheat on each other, they kiss and make up. The end. While telling this 'story', we are treated to low-brow jokes, little character development, and sexist notions about relationships. Ludo is so annoying and childish, you end up wanting Anna to cheat. And then break up, so we don't have to watch any more sequels. The children in the film seem to serve no other purpose than to make Ludo a bit more bearable (after all, the kids like him better than Ralf), and to allow for closure of this far too long film. Even the musical score is ill-matched. One star for the camera-work, with a very nice shot across the water at the end. A pitiful effort.",
         "This movie is the proof that Til Schweiger is not a Director nor a Writer. I never really cared for him to begin with, though he has done some great films. I went to ZweiOhrHasen, since \"EinOhrHase\" had caught me by surprise, and was a cute little romantic comedy. This film however starts funny, but this one is a cliché flick, that goes under the belt-line real quick. Terrible script, with no punchline... plus Til tries to be more American then German - I never heard a American Ambulance Siren in the middle of Berlin. This movie is a total sellout and a super weak script, and nothing for someone who looks for a bit of quality. If you like under the belt-line slapstick dull movies you may like this... however half way through you may notice that even these jokes (bodily excrement's in a paper bag scene - copied one-2-one) are stolen and become very old very quick. Whatever... and Til: \"You are not creative!\"",
         "I had already been a fan of Til Schweiger before seeing this film. I read about it that it did not receive the recognition it deserved. I had seen Til Schweiger in quite a few other films and I was interested to see his ability to perform in a drama setting. We had seen a bit of this in the film Driven in 2001, and his performance was outstanding. He stole the show, with his ability to become his character. But I noticed that when he doesn't say anything, he is still able to convey what is going on in the scene with just his emotions. Not many actors/actresses have mastered this ability and this is part of the appeal of watching him on screen. This movie had both funny, awkward, and dramatic moments, that it all dealt with extremely well. I would recommend this film even to people who do not like reading subtitles. But part of the beauty of watching a film in another language is leaving it in it's intended language, as many scenes can be lost in translation. If you pay close attention to body language and the emotions involve, it's easy to perceive what is lost in translation. My rating of this film, I would gladly pay to see it more than once and I intend to buy it on DVD. To my surprise, it was not available on stream, and the previous film from 2007 is not available either. This is very discouraging, but if you buy it or rent it somewhere, you will not be disappointed. This wasn't my first film to watch in German and read subtitles. It won't be the last. The German film industry needs more recognition and that's surprising to come from an American, born and raised. But it's true and German films are worth every penny. It kind of makes me want to learn the language and experience the beauty of their culture after watching this movie. I hope someone else enjoys this film as much as I did. Thanks to Til Schweiger for writing, directing, and acting this great piece of modern day masterpiece. Please continue to make great things and do good. We love your work and you as a very talented individual."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Seven Pictures",
         "Warner Bros.",
         "barefoot films"
      ],
      "summaries": ["Ludo Decker and Anna Gotzlowski have been living together for two years. Everyday routine has set in, with Ludo neglecting his household responsibilities much to Anna's dislike, while he is in turn annoyed by her constant complaining. When Ludo runs into his former lover Marie in the disco, and Anna's old boyfriend Ralf comes to stay in their flat for a few days, the young couple faces serious jealousy and doubt in their relationship. Anna secretly reads Ludo's phone messages, while he in turn stumbles upon \"The List\", an account of Anna's former lovers-including Ralf, who scores better than Ludo does. After a number of provocations, Ludo beats Ralf in a restaurant, and angrily leaves Anna. Even though the two still strongly care for each other, they end up sleeping with their respective ex-lovers. Ralf confesses that he never stopped loving Anna, but she rejects him and tells Ludo what happened. Even though Ludo has cheated on her as well, he angrily argues that she herself told him that, unlike men, women do not actually sleep with someone without feelings being involved. Anna begs him to come home, but he only says that he has no home any more, and leaves. Meanwhile, Ludo's best friend Moritz desperately tries to get more successful with women, and ends up in a number of absurd situations. In the end, he meets a young and beautiful sex-addict named Lana. After a few weeks, Anna receives a letter from Ludo, who has traveled back to the place where they spent their first and only vacation together. He writes that he misses her terribly, and that he wants nothing more than to come back, have children, and spend the rest of his life with her. Anna follows him and finds him on a lonely beach, where she tells him that she wants a \"little Ludo\" before they can talk about a \"little Anna\". In the end, they return home together."],
      "budget": 0
   },
   "movielensId": 86478,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2009-11-24",
      "dvdReleaseDate": null,
      "directors": ["Til Schweiger"],
      "runtime": 124,
      "movieId": 86478,
      "title": "Rabbit Without Ears 2",
      "mpaa": "",
      "actors": [
         "Til Schweiger",
         "Nora Tschirner",
         "Matthias Schweighöfer",
         "Thomas Kretschmann",
         "Ken Duken",
         "Emma Schweiger",
         "Sönke Möhring",
         "Annika Blendl",
         "Jasmin Gerat",
         "Thomas Heinze",
         "Heiner Lauterbach",
         "Elyas M’Barek",
         "Denis Moschitto",
         "Uwe Ochsenknecht",
         "Marc Hosemann"
      ],
      "imdbMovieId": "1343755",
      "originalTitle": "Zweiohrküken",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two years have passed. There is a normal life, but handsome Ludo meets his old love, and Anna is very jealous...",
      "tmdbMovieId": 9511,
      "avgRating": 2.67857,
      "releaseYear": "2009",
      "numRatings": 42,
      "posterPath": "/ngeNPb1BB3z4R372ksxHorFHHNv.jpg"
   }
}