{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0055992",
      "video": false,
      "title": "Follow That Dream",
      "recommendations": [
         26299,
         18691,
         18682,
         45598,
         20238,
         18693,
         18642,
         42783,
         18894,
         8745,
         18684,
         18690,
         45335,
         2094,
         18645,
         47263,
         18228,
         31151,
         67012,
         18688
      ],
      "backdrop_path": "/7aSfnUBHWnwDAgvGZFNZoK8nTjt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Toby Kwimper",
               "gender": 2,
               "credit_id": "52fe478d9251416c7509d835",
               "name": "Elvis Presley",
               "profile_path": "/4h4iQNdwzbMeqpPo92zSiYdYMwA.jpg",
               "id": 21457,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pop Kwimper",
               "gender": 2,
               "credit_id": "52fe478d9251416c7509d839",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Holly Jones",
               "gender": 1,
               "credit_id": "52fe478d9251416c7509d83d",
               "name": "Anne Helm",
               "profile_path": "/roBrzHNsFlTs3u9UAQmuKvCdcuz.jpg",
               "id": 83390,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Alisha Claypoole",
               "gender": 1,
               "credit_id": "53e0fa240e0a265a99006ecd",
               "name": "Joanna Moore",
               "profile_path": "/fzSAhMvjKSTy0PNkbehN3OHO5fe.jpg",
               "id": 94889,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Carmine",
               "gender": 2,
               "credit_id": "5927728f9251413b5402ce38",
               "name": "Jack Kruschen",
               "profile_path": "/3QOPlFyLfFR8cLe0pseRjrm3lra.jpg",
               "id": 4094,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Nick",
               "gender": 2,
               "credit_id": "592772959251413b4a02e6f9",
               "name": "Simon Oakland",
               "profile_path": "/alhR5PBU7GVlhp8COJXURKrjaZd.jpg",
               "id": 14063,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Judge",
               "gender": 2,
               "credit_id": "5927729dc3a368782d02c31d",
               "name": "Roland Winters",
               "profile_path": "/qYU5Z3pS6Ac9EK5fB68bamsJTmL.jpg",
               "id": 83822,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "H. Arthur King",
               "gender": 2,
               "credit_id": "592772a6c3a368782d02c327",
               "name": "Alan Hewitt",
               "profile_path": "/yvbIwqOPKZFsJG9A1AEKHY2tny7.jpg",
               "id": 73943,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "George",
               "gender": 2,
               "credit_id": "592772ae9251413b4102e8e8",
               "name": "Howard McNear",
               "profile_path": "/pqe7uwiUrPXruIuYefjO5MOtEFI.jpg",
               "id": 19786,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Jack (as Frank de Kova)",
               "gender": 2,
               "credit_id": "592772b79251413ba002be55",
               "name": "Frank De Kova",
               "profile_path": "/4aXrw9N1VBv3XHSxFRcnhH1lW9T.jpg",
               "id": 50574,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Mr. Endicott",
               "gender": 2,
               "credit_id": "592772c0c3a36877ee02ef32",
               "name": "Herbert Rudley",
               "profile_path": "/myl5ccynELeb0ebAS4tgoCVTA7W.jpg",
               "id": 50573,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Eddy Bascombe",
               "gender": 0,
               "credit_id": "592772cd9251413b4a02e743",
               "name": "Gavin Koon",
               "profile_path": null,
               "id": 1823707,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Teddy Bascombe",
               "gender": 0,
               "credit_id": "592772d5c3a36877ee02ef5e",
               "name": "Robin Koon",
               "profile_path": null,
               "id": 1823708,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Blackie",
               "gender": 2,
               "credit_id": "592772df9251413b4102e92f",
               "name": "Robert Carricart",
               "profile_path": "/gPlhmRMEYDlFiMigtTZ7vLKJxY7.jpg",
               "id": 151499,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Al (as John Duke)",
               "gender": 2,
               "credit_id": "592772e89251413b5b02fb5f",
               "name": "Barry Russo",
               "profile_path": "/l242CgssJEh1wuQyWErJoLzM6Xy.jpg",
               "id": 151491,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe478d9251416c7509d847",
               "name": "Gordon Douglas",
               "profile_path": "/r6UZt0lLqgXHAG8GoN3NiWrnH5d.jpg",
               "id": 51677,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe478d9251416c7509d84d",
               "name": "Charles Lederer",
               "profile_path": null,
               "id": 4358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "592767b2c3a368782d02b751",
               "name": "David Weisbart",
               "profile_path": null,
               "id": 2766,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5927674f9251413b5002cd8b",
               "name": "Richard Powell",
               "profile_path": null,
               "id": 142255,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5927676b9251413ba002b1f8",
               "name": "Walter Mirisch",
               "profile_path": "/vo1wXRoFhrD9qtarvvchZkcOKyX.jpg",
               "id": 14523,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "592767b9c3a368780a02a867",
               "name": "Hans J. Salter",
               "profile_path": null,
               "id": 30130,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "592767c9c3a36877ee02e241",
               "name": "Leo Tover",
               "profile_path": "/z8ocR2ZSLCqLwnla56TycFAFCR3.jpg",
               "id": 12279,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59277267c3a368782d02c2d0",
               "name": "William B. Murphy",
               "profile_path": null,
               "id": 22096,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5927726dc3a368780a02b3c2",
               "name": "Malcolm C. Bert",
               "profile_path": null,
               "id": 2764,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59277273c3a36877df03097d",
               "name": "Fred M. MacLean",
               "profile_path": null,
               "id": 13974,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 4.223183,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18643,
      "vote_count": 16,
      "budget": 0,
      "overview": "When the Kwimper family car runs out of gas on a new Florida highway and an officous state supervisor tries to run them off, Pop Kwimper digs in his heels and decides to do a little homesteading. He and his son Toby and their \"adopted\" children - Holly, Ariadne and the twins - start their own little community along a strip of the roadside.",
      "similar": [],
      "original_title": "Follow That Dream",
      "runtime": 109,
      "poster_path": "/3A2nItzpYh5G8g7Sl6QcFMwRstT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Mirisch Corporation",
         "id": 219,
         "origin_country": ""
      }],
      "release_date": "1962-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gordon Douglas"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Charles Lederer",
         "Richard Powell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055992/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MDcxMjM1Ml5BMl5BanBnXkFtZTcwODAyMDgzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Elvis Presley, Arthur O'Connell, Anne Helm | See full cast and crew »"],
      "reviews": [
         "Elvis made quite a number of movies. Most of them of the cookie-cutter, formula variety designed to showcase his wonderful voice, a fact that should surprise absolutely NO ONE. Lets face it guys, Elvis achieved his fame by way of his singing, not his acting. His selection of movie vehicles (especially later in his career) is ample proof of this. Having said this however, The King was not without some native ability as an actor, both dramatic and comedic. As proof of this I give you his two best movies: King Creole, in which he gave a very credible dramatic performance (and right along side the likes of Carolyn Jones, Walter Mathau and Dean Jagger no less); and this movie - Follow That Dream. Follow that Dream is a wonderful piece that has several things going for it: To begin with, it was a straight comedy, his first and best. Very different from his earlier films where he played characters (like Danny Fischer in Creole) that were somber and even dark).In contrast, his portrayal of Toby Kwimper was innocent and fun. The chemistry between Toby and his father (Arthur O'Connell) was terrific. Second, the theme of the movie is a crowd pleaser. Its story line is pure \"David and Goliath\" with the State playing the role of the pushy and overbearing villain. And finally, there are the songs. What can I say folks the musical score is the King at his best. The score includes a perfectly lovely ballad - \"Angel\" together with two positively jubilant toe-tappers \"What a Wonderful Life\" and the title song \"Follow that Dream\". One last comment: This movie lifts my spirit, and makes me happy. Now I know those are two perfectly ridiculous reasons to like a movie but, fact is, there are far too few movies that do that for me now-a-days and this movie is one of them. It may not be academy award material (I gave it 7 out of 10) but if you need something to put a smile on your kisser, this one is worth your while.",
         "This is one of Elvis's best films in my opinion. And one where he extended his range a bit. Usually he plays he troubled youths, or confident smart people who are trying to prove themselves. Here's he's an innocent in the world and it's a tribute to his acting skills that he was acquiring that he didn't descend into being Gomer Pyle. Of course the film is greatly helped by the title tune which in my opinion is one of his best movie songs. Follow That Dream rightly belonged among Elvis's golden hits. With an innocence here that rivals even Stan Laurel or Harry Langdon, Elvis manages to defeat some pretty sharp characters. The film itself has a charming innocence about it that makes it thorough going fun.",
         "Most of his movies I've seen seem to be an excuse to have him sing songs. However, this one has a plot and good acting. It's a lighthearted story that is a joy to watch each time I see it. The comedy is great. Elvis' portrayal of Toby is SUBERB!! Even knowing the jokes that are coming I can't help but laugh because they are done so well. I prefer this movie over any other he made.",
         "For sheer entertainment and enjoyment, \"Follow That Dream\" was a great movie. It was one of Elvis' best. To watch it was to restore your vision of all that is good and right in the world. It was truly a great story of the victory of good over evil. I saw it when I was a young man and at age 64 I still enjoy watching it. This is one young people and older should view. We all would be better people by doing so.",
         "And very heartwarming at the same time. This is by far Elvis' best comedic effort, and he delivers a near perfect performance as the allegedly dimwitted Toby. But methinks Toby has more on the ball than he's willing to let on. I have to believe Jethro Bodine of the Beverly Hillbillies was modeled after Elvis' character. Everytime he runs into an attractive woman he starts to \"cipher\" his \"timeses\". Absolutely hysterical. And his destruction of the neighboring squating mobsters from Chicago is outrageous. Elvis just wanders through scene after scene as if he's totally oblivious...think again. Arthur O'Connell is wonderful as the patriarch of this near gypsy like family. What a treat. Check it out.",
         "One of Elvis's better comedies. The movie has some good Elvis tunes and overall a nice light feel to it. The final courtroom scene is great and makes you wish every day in court ended up this way. While it is a \"formula\" movie in many respects, it does make for a nice evening or rainy afternoon \"get away from it all\" and have a laugh sitting. A must for any Elvis fan!",
         "\"Moonspinner\" (previous reviewer) must have had his/her head in a spin. First of all, I'm an Elvis fan, so I'm biased; and I acknowledge that about 10 of his 31 films were pretty poor. But for people to imply that Follow That Dream was one of them is ridiculous. Elvis' performance in this film is not simply good - it's outstanding. He plays an \"idiot savant\" type of role, and plays it to perfection. His speaking voice, his body language, his timing : they're all spot on for this characterisation. The fact that the film lasts for 1 Hr 45 min proves that some integrity went into its making, in order to get the whole story across; and make no mistake, it's a good story with a number of good episodes. OK, we're all so sophisticated and know-it-all these days, and can say the story is unbelievable, but it is set the best part of 50 years ago. Again, contrary to some other comments, the location filming is beautifully done and in the few instances where they have done back-projections, it is not at all obvious. It's easy to pick fault with any film, if you set your mind on it, but my only criticisms of Follow That Dream are (i) that Joanna Moore's diction is very poor and difficult to follow and (ii) that the recording studio echo on the song Follow That Dream does not fit the simplicity of the scene where it's sung - yet it still has a charm to it. Elvis's performance in this film deserved/deserves some wider recognition. There's no question that he was a competent actor. Contrast his role here, as Toby Kwimper, against the dramatic role as Pacer Burton in the superb Flaming Star, only a year earlier, and you can only express admiration. One final word of praise for Anne Helm, who plays her part as Holly to perfection.",
         "Follow That Dream is one of my favorite Elvis movies.He proves he could have been good at light comedy.This is a fun,good natured role for Elvis.There is comedy,romance and Elvis music.If you like this combination,you will like this movie.",
         "Being a fan of The Andy Griffith Show (TAGS) and The Beverly Hillbillies, I find an uncanny resemblance between Toby Kwimper and Andy Taylor as well as Jethro Bodine. While not quite the simpleton that Jethro was, Toby was ignorant to a lot of the ways of the world. Both were known espouse their superior intellect and high education and to recite their times tables. Jethro called it cyphering. And like the other 'sheriff without a gun', Andy Taylor, he outwitted his adversaries using cunning and intellect. One wonders if he really wasn't as simple as he appeared to be. It could have been his way of putting people at ease and his adversaries off their game. It made me wonder if TAGS and BH were patterned after this movie or vice versa. Turns out they were released at about the same time. Probably happenstance.... or not. There are a several \"Follow that Dream\" alumna on TAGS. I'll let you figure out who they are. The most memorable part of the show was the candy bar scenes. I remember watching a movie back in my teens and thought it was extremely hilarious. I remembered the scenes, just not the name of the movie. I wondered for years what the name of the movie was. I stumbled upon a VHS copy a year or two ago in a bargain bin. I figured, \"Elvis? for a buck? can't go wrong.\" At first viewing, the first time the big brother bites off the long piece of candy bar to even things up, I said, \"THAT'S IT!\"",
         "This was Elvis beginning to come into his own as good actor. This was one of his funniest movies. His character, Toby is a mentally limited young man with a heart of gold. I like the way that even the Kwimper's own mistakes cannot defeat them. This movie had a strong plot and once again a strong supporting cast, with the late Arthur O'Connell (Kissin Cousins), Anne Helm and the late Howard McNear. If Elvis had made more movies like this, his movie career would have been much better acclaimed."
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["Mirisch Corporation, The"],
      "summaries": ["When the Kwimper family car runs out of gas on a new Florida highway and an officous state supervisor tries to run them off, Pop Kwimper digs in his heels and decides to do a little homesteading. He and his son Toby and their \"adopted\" children - Holly, Ariadne and the twins - start their own little community along a strip of the roadside. The fishing is good and the living is easy until the mob sets up a gambling operation and the state supervisor sics a sexy social worker on the Kwimpers in an effort to take away Ariadne and the twins."],
      "budget": 0
   },
   "movielensId": 8647,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-01-01",
      "dvdReleaseDate": "2004-05-11",
      "directors": ["Gordon Douglas"],
      "runtime": 109,
      "movieId": 8647,
      "title": "Follow That Dream",
      "mpaa": "G",
      "actors": [
         "Elvis Presley",
         "Arthur O'Connell",
         "Anne Helm",
         "Joanna Moore",
         "Jack Kruschen",
         "Simon Oakland",
         "Roland Winters",
         "Alan Hewitt",
         "Howard McNear",
         "Frank De Kova",
         "Herbert Rudley",
         "Gavin Koon",
         "Robin Koon",
         "Robert Carricart",
         "Barry Russo"
      ],
      "imdbMovieId": "0055992",
      "originalTitle": "Follow That Dream",
      "genres": [
         "Drama",
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["NwDQetm6NUI"],
      "plotSummary": "When the Kwimper family car runs out of gas on a new Florida highway and an officous state supervisor tries to run them off, Pop Kwimper digs in his heels and decides to do a little homesteading. He and his son Toby and their \"adopted\" children - Holly, Ariadne and the twins - start their own little community along a strip of the roadside.",
      "tmdbMovieId": 18643,
      "avgRating": 2.80435,
      "releaseYear": "1962",
      "numRatings": 23,
      "posterPath": "/3A2nItzpYh5G8g7Sl6QcFMwRstT.jpg"
   }
}