{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "poet",
            "id": 5933
         },
         {
            "name": "playwright",
            "id": 10965
         },
         {
            "name": "sancho panza",
            "id": 211254
         }
      ],
      "imdb_id": "tt0068909",
      "video": false,
      "title": "Man of La Mancha",
      "recommendations": [
         43812,
         23148,
         27858,
         35262,
         39282,
         22994,
         36759,
         61880,
         72473,
         42243,
         31361,
         22614,
         38222,
         17382,
         64942,
         21896,
         36851,
         21932,
         42622,
         97519
      ],
      "backdrop_path": "/2lF8Beifs7kkSgIZzKGmsOQMhpv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Don Quixote De La Mancha / Miguel de Cervantes / Alonso Quijana",
               "gender": 2,
               "credit_id": "52fe46d4c3a36847f811476b",
               "name": "Peter O'Toole",
               "profile_path": "/7esSG4iZHueb5Nh8RBBhtRZLpom.jpg",
               "id": 11390,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dulcinea / Aldonza",
               "gender": 1,
               "credit_id": "52fe46d4c3a36847f811476f",
               "name": "Sophia Loren",
               "profile_path": "/emKLhbji1c7BjcA2DdbWf0EP9zH.jpg",
               "id": 16757,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sancho Panza / Cervantes' Manservant",
               "gender": 2,
               "credit_id": "52fe46d4c3a36847f8114773",
               "name": "James Coco",
               "profile_path": "/nuJa1euBEOo7UOJMQDCfSB0aeSo.jpg",
               "id": 41220,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "The Padre",
               "gender": 2,
               "credit_id": "5490bf89c3a368228c000012",
               "name": "Ian Richardson",
               "profile_path": "/wUENAdxr5JFGFNbDe6HTFwrlvA9.jpg",
               "id": 385,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "The Innkeeper / The Governor",
               "gender": 2,
               "credit_id": "5490c06c9251412848000007",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sanson Carrasco / The Duke",
               "gender": 2,
               "credit_id": "5490c08d925141284f00000d",
               "name": "John Castle",
               "profile_path": "/yXMWGwbbMB67Gt0EAFMfN4kxA8W.jpg",
               "id": 15198,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pedro",
               "gender": 2,
               "credit_id": "5490c098925141284f00000f",
               "name": "Brian Blessed",
               "profile_path": "/azFYGqcDS1Oo8skhbHzGPZSICTU.jpg",
               "id": 8318,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Antonia Quijana",
               "gender": 1,
               "credit_id": "55ee4aebc3a3682c6401543d",
               "name": "Julie Gregg",
               "profile_path": "/wguGwZZTN3u3CGD8Gq7v0Tm8bx.jpg",
               "id": 160728,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "The Housekeeper",
               "gender": 1,
               "credit_id": "5490c0d4c3a3682290000038",
               "name": "Rosalie Crutchley",
               "profile_path": "/3GeycPOd4LHV1tSaRErb8tHT67q.jpg",
               "id": 39001,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "The Barber",
               "gender": 2,
               "credit_id": "5490c0e6c3a3682285000024",
               "name": "Gino Conforti",
               "profile_path": "/7EPicshDcPKxAHnHwjYmcgtg7E.jpg",
               "id": 74492,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Captain of the Guard",
               "gender": 2,
               "credit_id": "55ee4b1b9251413e45016f3d",
               "name": "Marne Maitland",
               "profile_path": "/y8q7N1D28UmmwuRgt39X2fv6xTa.jpg",
               "id": 67882,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "The Innkeeper's Wife",
               "gender": 0,
               "credit_id": "55ee4b1bc3a3686f170063dc",
               "name": "Dorothy Sinclair",
               "profile_path": null,
               "id": 1431636,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Fermina",
               "gender": 0,
               "credit_id": "55ee4b1b9251412e07000eef",
               "name": "Miriam Acevedo",
               "profile_path": "/tUhCr2xqDQ06iwFbXZZvGEXTBJz.jpg",
               "id": 1506792,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Muleteer",
               "gender": 2,
               "credit_id": "55ee4b1cc3a3682c6401544a",
               "name": "Dominic Barto",
               "profile_path": "/20vkhxfA3NriMVIYOAuzwNKXyfz.jpg",
               "id": 16647,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Muleteer",
               "gender": 0,
               "credit_id": "55ee4b1c92514106d600fe19",
               "name": "Poldo Bendandi",
               "profile_path": "/hVrefgRN3VEMODPcgPiCVtzFbrI.jpg",
               "id": 222249,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Muleteer",
               "gender": 0,
               "credit_id": "55ee4b1c9251412c320010b1",
               "name": "Peppi Borza",
               "profile_path": null,
               "id": 1506793,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Muleteer",
               "gender": 0,
               "credit_id": "55ee4b1dc3a3682c6b016383",
               "name": "Mario Donen",
               "profile_path": "/wHz8OGBEW6Q5BCi2g9nIANUWW7M.jpg",
               "id": 1336159,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Muleteer",
               "gender": 2,
               "credit_id": "59bd4d4bc3a3681bd4013c95",
               "name": "Paolo Gozlino",
               "profile_path": "/2exTvyWzjOHswk3lbYLws7QvkOY.jpg",
               "id": 1019917,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Muleteer",
               "gender": 0,
               "credit_id": "59bd50b59251413525013a69",
               "name": "Teddy Green",
               "profile_path": "/eL62ZjOwrfC4PgISOnXpqnfKilK.jpg",
               "id": 1244813,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d4c3a36847f8114779",
               "name": "Dale Wasserman",
               "profile_path": null,
               "id": 133878,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d4c3a36847f811477f",
               "name": "Arthur Hiller",
               "profile_path": "/irrSj7cAn2ByM7hhu2emkMdFOai.jpg",
               "id": 133259,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.734452,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 45793,
      "vote_count": 19,
      "budget": 0,
      "overview": "In the sixteenth century, Miguel de Cervantes, poet, playwright, and part-time actor, has been arrested, together with his manservant, by the Spanish Inquisition. They are accused of presenting an entertainment offensive to the Inquisition. Inside the huge dungeon into which they have been cast, the other prisoners gang up on Cervantes and his manservant, and begin a mock trial, with the intention of stealing or burning his possessions. Cervantes wishes to desperately save a manuscript he carries with him and stages, with costumes, makeup, and the participation of the other prisoners, an unusual defense--the story of Don Quixote.",
      "similar": [
         872,
         11224,
         224141,
         15121,
         134,
         252,
         3933,
         254470,
         10020,
         353616,
         316029,
         2005,
         8587,
         9479,
         11631,
         114,
         812,
         10882,
         10530,
         9444
      ],
      "original_title": "Man of La Mancha",
      "runtime": 132,
      "poster_path": "/iFsmLAjlBn3bZyjKFg1hmtyzShR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Produzioni Europee Associati (PEA)",
         "id": 7508,
         "origin_country": ""
      }],
      "release_date": "1972-12-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Peter O'Toole, Sophia Loren and James Coco dream 'The Impossible Dream' in...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arthur Hiller"],
      "runtime": 132,
      "synopsis": "It is the late sixteenth century. Miguel de Cervantes, an author and part-time actor, has been thrown into a dungeon with his manservant for openly lampooning the Spanish Inquisition. In the dungeon, he is subjected to a mock trial, and the other prisoners confiscate many of Cervantes's belongings, but he seeks to save a mysterious manuscript. Having a trunkful of costumes, props, and makeup at his disposal, he suggests that he be allowed to present an entertainment, with the other prisoners also playing roles. And now the story of Don Quixote begins: Alonso Quijana - not Quijano as in the novel - (Peter OToole), is a country squire somewhere in La Mancha. He is no longer young. He enjoys reading almost incessantly. He eventually goes mad from reading too many books of chivalry (which were in vogue then) and decides to become a knight-errant himself - Don Quixote de la Mancha. Don Quixote, on horseback and in armor, with Sancho Panza (James Coco) riding a donkey at his side, sets out early one morning to find adventures. They proceed along a road on the plains of La Mancha, discoursing about the rules and customs of knight errantry, until, in the distance, a windmill is seen. Don Quixote, believing it is a ferocious four-armed giant, attacks it. Don Quixote first pierces one vane with the lance, then attacks with his sword. He is scooped up by the sails of the windmill, and \"rides\" it until he loses his balance and clatters to the ground. Don Quixote explains that, at the last minute, an evil enchanter who has it in for him has changed the giant into a windmill. As Sancho tends to his bruises, Don Quixote says in all seriousness: \"A knight must not complain of his wounds, though his bowels be dropping out\". Upon higher ground in the distance, a sprawling establishment is seen, and Don Quixote decides to proceed to yonder castle. Sancho tells him it's really an inn, but no matter . . . In the courtyard of the inn, a group of mule team drivers have stopped and want food and drink. The serving wench is curvaceous Aldonza (Sophia Loren), a hard working servant with a habit of selling herself for money during the night. As she serves, she is accosted by many men, and she pushes them off. Pedro (Brian Blessed) is the leader, and feels entitled to have first dibs on Aldonza, but she rejects him. Pedro: My mules are not so stubborn. Aldonza: Fine! Make love to your mules! While this is going on, a horn blast is heard. It is Don Quixote, arriving, asking for the Lord of the Castle, puzzled that dwarfs have not been sent out to meet him, . The innkeeper (Harry Andrews) welcomes him and soon decides to humor him in his delusions. He explains that the dwarfs are busy with other duties. Don Quixote instructs the innkeeper thus: \"See that your grooms care for my fleet-footed Rocinante, a horse of courage, sobriety, and chastity, the flower and glory of horseflesh\". When the innkeeper's wife expresses concern that he might have no money, the innkeeper replies: \"When has a poor man ever found time to run mad? Of course he has money, he's a gentleman,\" and Don Quixote is shown to an upstairs room. As Don Quixote enters the busy main patio, he addresses the muleteers and others present as Lords and Ladies, causing merriment, but he takes no notice. He does notice Aldonza, and his brain is immediately in a new track, addressing her as his lady Dulcinea, and approaches her, explaining to her who she really is in a song, \"Dulcinea\". Aldonza is puzzled, busy and not in humor for such craziness, although she appreciates being treated with respect. She assumes he wants what all the others want from her. The muleteers all keep guffawing and laughing at him. In the meantime, at the home of Alonso Quijana, his niece Antonia (Julie Gregg) and his housekeeper (Rosalie Crutchley) ask advice from the parish priest (Ian Richardson) and physician Sansón Carrasco (John Castle), who is Antonia's suitor. The women voice their worries in song: I'm Only Thinking of Him, quite concerned with the embarrassment triggered by his antics. Carrasco's views dominate: \"A man who chooses to be mad can also choose to be sane.\" He concocts a plot to convince Don Quixote to return home, and then they will see what to do next. Back at the inn, Sancho brings a letter from Don Quixote to Aldonza, asking for a token that he can wear in battle, something like a silk scarf. She is intrigued but scoffs, giving Sancho a dirty floor rag. Eventually, Don Quixote gets the rag, kisses it and holds it as if it were a beautiful pristine silken scarf. An itinerant barber (Gino Conforti) shows up at the gate and enters, wearing a bright brass barber's shaving basin as a hat. Don Quixote sees the bright brass and, very agitated, demands it be given to him, claiming it is the fabled Golden Helmet of Mambrino, a magical item that protects the knight who wears it. The barber recognizes the situation. As the basin is worth only half a crown, the terrified barber acquiesces at swordpoint, and all the mule drivers enjoy the joke. As soon as the barber departs, Don Quixote kneels in front of the innkeeper and asks for a boon, that he should the very next morning dub him knight, as he has agreed to fight a real knight, but has no right to do so until he is dubbed. He will stay up all night, as required by the rules, watching over his armor. He must fast, so he declines dinner. Some time after dusk, a group in black mourning costumes, bringing a bier, the principals masked, show up at the gate and ask for Don Quixote de la Mancha. After he identifies himself, a tearful lady veiled in black asks Don Quixote to grant her a boon. He agrees, of course, and she says that their relative on the bier has been turned into stone by the spell of an evil enchanter. The spell can be broken if Don Quixote will agree to meet the enchanter in battle. The enchanter will presumably wait for Don Quixote the next day, on the road, near Don Quixote's village. The stone man on the bier was a man hired to participate in a hoax, the tearful veiled lady was none other than Antonia Quijana, and the other two were Sansón Carrasco and the housekeeper. Also there was the local village priest, who reluctantly joined the group, although he sympathizes more with Quixote. After the night watch starts, Aldonza comes to talk to Don Quixote. Exasperated, she asks him why he does the things he does. He says that all that matters is that he follow the Quest, and sings the musical's signature song \"The Impossible Dream\": \"To dream, the impossible dream / To right, the unrightable wrong / To love, pure and chaste from afar / To try, when your arms are too weary / To reach the unreachable star. / This is my quest, to follow that star.../ To fight for the right / Without question or pause / To be willing to march / Into Hell for a Heavenly cause!\". etc. Aldonza is deeply moved by the song and begins to sympathize with the knight. Pedro the chief muleteer comes to Aldonza, angry that she is late for their lovemaking. He slaps her, and a brawl ensues, Don Quixote and Sancho and Aldonza on one side, Pedro and the muleteers on the other, but only Pedro fights for real, the others are in it for making fun of Don Quixote, so they clown around somewhat and at the end of it, the muleteers are all unconscious on the ground. The innkeeper thinks things are getting out of control, so he insists on knighting Don Quixote right away, and politely orders him to bed and to leave the first thing the next morning. The muleteers decide to take revenge on Aldonza, and when, by the laws of chivalry, she \"ministers to their wounds\", they savagely beat her and carry her off with them in order to rape her. Don Quixote and Sancho leave the inn, hopeful and joyful, renewing their discussions of knight errantry, and Don Quixote corrects Sancho in his speech, saying he uses way too many proverbs. They come upon the furious Aldonza on the roadside. She is bitter, and mocks Don Quixote's attempts to comfort her. Just then, a few paces away, we see a knight in full armor, flanked by a dozen squires bearing shields decorated with mirrors. They approach and surround Don Quixote, taunt him with his failures, dazzle them shining the sun into his eyes, and Don Quixote, still reeling and shocked by Aldonza's rejections, collapses. We next see Don Quixote in bed, surrounded by the Priest, Carrasco, Antonia, and the housekeeper. His experience with the Knight of the Mirrors has sent him into a coma. First Sancho, then Aldonza, come to see him, and push their way in to talk to him, although Carrasco wants to keep them out, but the Priest says there's no point. Upon hearing Sancho's voice, Don Quixote opens his eyes and starts talking very softly. He says he is no longer Don Quixote, but Alonso Quijana: \"Soft and fair, my friends; in last year's nests there are no birds this year.\" He tells the priest to write down his last will. He has only a vague memory of being Don Quixote, but Aldonza, who has found she cannot live without being Dulcinea, begs him to remember. He eventually does, and rises from his bed ready to search for adventures once again. However, his strength fails him, and he dies in Sancho and Aldonza's arms. But to Aldonza, Don Quixote can never die, and when Sancho calls her by her real name, she gently asks him to call her Dulcinea. The prisoners have been deeply moved by Cervantes's \"entertainment\" and return his manuscript to him. It is the still-unfinished novel, \"Don Quixote de la Mancha\". As Cervantes and his manservant are escorted by the Inquisition to their trial, the prsoners sing a final reprise of \"The Impossible Dream\".",
      "writers": [
         "Dale Wasserman",
         "Dale Wasserman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068909/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMjk0MzY2Nl5BMl5BanBnXkFtZTcwMzA2ODE1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter O'Toole, Sophia Loren, James Coco | See full cast and crew »"],
      "reviews": [
         "Bringing big Broadway musicals to the screen has always posed tremendous problems for film makers. The results have by and large been unsatisfactory, with few exceptions. The late 60's brought us \"Camelot\", (67),\"Hello Dolly\" (69) and \"Fiddler on the Roof\" (71), all films adhering to the unquestioned rule that bigger is better, be it casts, sets and orchestrations. All three were overblown bores. Arthur Hiller's concept for \"Man of La Mancha\" is clearly the antithesis of what had become expected of the musical on film. He decided to use the film media not as a device for augmentation in a broad sense, but rather to focus in on the characters and bring them as close to the audience as possible using naturally many close-ups. They are the crux of the film; not massive sets, huge choruses or dazzling choreography. \"Man of la Mancha\" boasts two fine songs; the rest are pretty mediocre, which justifies Hiller's keeping the music as a device to serve the characters and not the other way around. From the very start with the credits appearing, the audience is geared up for one of those massively orchestrated rousing overtures. Yet, what we are offered is an underscored, almost chamber music style overture setting the tone for the entire film. The message as with chamber music is clear; the focus is on the content, not the trappings. The critics by and large hated the film. Maltin in particular is uncharacteristically savage in his criticism. They simply were not prepared to accept an unorthodox approach to a huge Broadway success. While \"Dolly\", \"Camelot\" and \"Fiddler\" tend to be almost impossible viewing today, \"Man of La Mancha\" remains astonishingly fresh, very much vindicating Hiller's concept of this much maligned and misunderstood movie. Being so focused on character, the films success would lie with its principal players. O'Toole gives a bravura performance, one of his finest, while Loren too, is perfect in her role. Sure the soundtrack is not one to listen to in the way one would a Broadway musical. But both O'Toole's and Loren's shaky vocals are in perfect sync with the fragility of their characters and hence very human and very moving. If more Broadway musicals had been brought to the screen with such a clear concept as was \"La Mancha\", the movie musical may have enjoyed far greater success.",
         "This is one of my favorite movies of all time. It saddens me that there are those out there who think this movie was horrible. How can you watch O'Toole give his speech: \"Maddest of all: to see life as it is and not as it should be!\" and not be brought to emotion? This movie is not exactly like the theater version. However, if you note who made the screenplay changes, the song changes, etc., it's the same men who worked on the play. There are some good songs cut out. And Peter O'Toole and Sophia Loren are not the world's best singers. But this movie is brilliant. Coco is a wonderful Sancho, I love his voice and his expression. O'Toole is a fabulous actor and I felt like the prisoners in the end singing \"The Impossible Dream.\" I own this movie. I encourage anyone who hasn't seen it to go get it and watch it. It has inspired me to try to do better in everything I do, and I often watch it and sing the songs to remind me to \"see life as it should be.\" And if this movie needs a defender, I sign up for the job.",
         "As one who is familiar with the works of Cervantes I must say that this particular representation is among if not the best of all. Peter O'Toole leads an ensemble of many of the best actors, and actresses of the time. Among them that classical beauty Sophia Loren, who played Aldonza/Dulcenea to perfection. O'Toole gives what I consider to be one of his best, if not the best performance of his life. His natural style captivates audiences, totally. I have seen few actors who can act so natural, and with such eloquence. His gift of oratory is quite remarkable. The beautiful Loren with her natural acting style, and wit gives the character of Aldonza/Dulcenea the most justice any actress can give a role. The rest of the cast, the priest, Quijana's niece, housekeeper, play the part of self centered people fooling themselves into \"they're only thinking of his (Quijana/Quixote's) well being , to the infinite degree. Equally talented were the muleteers , Pedro the head muleteer was a real card. The audience must take into consideration the fact that almost all the actors, and actresses were playing dual roles. This in an of itself is an credit to their acting abilities. No commentary would be complete without mentioning the music. It ranks as one of my top ten soundtracks. I listen to some of the songs on an almost daily basis. This film is superb.",
         "I consider myself somewhat of a movie aficionado, having seen several thousand movies over the past forty years; and I can unequivocably say that \"Man of La Mancha\" is my all-time favorite movie. While some of the familiar criticisms lodged against it are valid, there is still no other movie that can approach its depth or poignancy. I judge a movie by its ability to move me: to make me laugh, to make me cry, to make me think. This movie tackles one of the greatest themes of life: whether to live in a helpful illusion or live in the harshness of reality. Don Quixote's story is the ultimate in human heroism, a tragic man of courage struggling to see and live life, not as it is, but as it should be. His unwavering idealism in the face of all-too-familiar cynicism and skepticism is both foolhardy and inspiring. This movie always leaves me, not with tears trickling, but with great sobbing. I strongly recommend it for both your heart and your head.",
         "I must have a major blind spot because I loved this movie in 1972 when I saw it the first time and the second and the third time. Now I have become an semi-regularly woeful countenanced man myself and I love it even more. My heart started to stir watching O'Toole's speech at the Oscars so I re-rented La Mancha even as it was being removed from the active shelf at my local Hollywood video. I took it home and played it for the youngest of my five daughters, eleven year old Mary. She loves musicals as much as I do. She got into it. I cried again. Sorry. I love this film. Like I said, I must have a tin ear or a blind spot or goddamn it, maybe I'm right. Man of La Mancha is a 10 plus and a must for all O'Toole fans which at this point should be about everybody who loves movies. Let the revisionism begin here. O'Toole and Loren> C'mon",
         "I've been reading a lot of negative reviews for this movie, and I can't understand why. I've seen \"Man of La Mancha\" twice now and find it incredibly entertaining and inspiring. Though he doesn't sing, Peter O'Toole is enchanting as Quixote and Sophia Loren (perhaps the sexiest woman in film history) is a marvelous Aldonza/Dulcinea. The songs, less numerous than those in the play, are well sung, arranged and recorded (except for one bit where Sancho's mouth moves but no sound comes out) the action is choreographed beautifully and the story moves along very well. Moreover, it fits neatly into the \"Yeah, he's crazy. So?\" category alongside films like \"Harvey\" and \"Don Juan DeMarco.\" So why would others choose to give this a bad review? I may have the answer. Not only have I listened to songs from the two Broadway cast recordings that exist, I have had much experience with Broadway fans (being one myself) and know that the truly die-hard fans tend to ONLY like the original cast ONLY like the original production and NEVER like the movie version. This is the conclusion I have reached: It isn't the movie \"Man of La Mancha\" that sucks...it's the play. Indeed, watching it on screen you are given to wonder how it can be successfully presented on stage, and perhaps it cannot. But, old-school Broadway fans won't have it! \"The original is better\" say the die-hards. \"Who needs Frank Sinatra and Marlon Brando? The original cast of 'Guys and Dolls' is better! Richard Gere? Jerry Orbach is better in 'Chicago'! And the movie version on 'Bye Bye Birdie' sucks.\" These are all monstrous lies, as Sinatra, Brando and Gere were great in their respective movies and the movie version of 'Bye Bye Birdie' is infinitely superior to the play. So don't listen to the die-hards, choose quality over tradition. Rent or buy \"Man of La Mancha\" on DVD because it's one you'll want to watch again and again.",
         "The users on this board seemed to concur that this was somehow a bad musical but I disagree. I'm really particular when it comes to people just bursting out into song for no apparent reason and this was one of those few times where I actually liked it. I've always enjoyed the Don Quixote story and this was a fantastic turnaround. I can see why some viewers say that the singing wasn't nearly as extraordinary as it was on Broadway but few film adaptations are. Besides the acting was stellar and it drew out extreme emotions of happiness, sorrow, or laughter out of me at times. Though dirty and ragged I found Sophia Lauren to still be beautiful and her body is absolutely perfect in every way I can fathom. Peter O'Toole was great as a crazy old man set forth on an unattainable quest for glory and at the end someone who had to once again face the harsh life of reality. For those of us who haven't seen it on the stage I feel it is a wonderful performance that was thoroughly enjoyable for persons of all ages that are looking to be whisked away by a tiny bit of magic! I'm positive that I'll have some of the songs stuck in my head for at least several days now. Final Blaze: Movies: I don't usually see musicals on the big screen. DVD Purchase: If my budget ever increases to a more desirable level. Rental: An awesome choice!",
         "I'll keep it short. The message of this story is infinitely more important than any perceived flaws in casting, makeup, music, singing, etc. The emotions are there in this movie, and quite moving. The message is also there, and as fresh as it was when Cervantes wrote his famous book centuries ago. Don Quixote was a madman, yes, but his \"quest\" is one we should all embrace. Knight errantry, chivalry, compassion, and treating women with kindness and respect may be considered terribly out of sync with todays values, but when I read stories about a 16 year-old boy lured, by the promise of sex, to a savage beating death at the hands of his peers, I seriously question the soundness of those values. In many ways, today's world is every bit as \"base and debauched\" as it was during the Spanish Inquisition. Frankly, I would much rather live in Quixote's \"mad\" version of the world than I would in the reality of this one. Squash the movie critic in you for a couple of hours and just enjoy the movie for it's wonderful message! PS: I've been waiting years for Man of La Mancha to come out on DVD. Anybody know when?",
         "There are those who would have you believe that this is a bad movie because it deviates from the stage musical. In the play, for example, Sancho has a grating high-pitched voice whereas in the movie, his voice is warmer and stronger. Another example is the deletion of certain songs such as the completely unnecessary and boring \"What Do You Want of Me?\" and \"To Each His Dulcinea.\" In addition, Cervantes is jailed on stage for foreclosing a church. In the movie, he is sent before the Inquisition on grounds of heresy. This makes the whole thing that much more significant and important. It also relates to a central theme in the movie, that Cervantes' and indeed Don Quixote's way of fighting back at the world is to imagine a new world. To dream, as it were, the impossible dream. The stage version was one of the most substantially flawed in Broadway's history. Richard Kiley (the original stage actor) had a strong, powerful voice, that is true, but it didn't sound like Don Quixote. The man who dubs Peter O'Toole's voice in the movie, however, sounds not only like Peter O'Toole, but like Don Quixote. Indeed, the only thing about the movie that is different from the play is that the actors in the movie are GOOD! And they don't just put on big, fake, funny voices in the traditional idiotic Broadway style. They portray their characters honestly and in keeping with the spirit of the story. And it is a story that everyone should hear. If you are like me, a lifelong chaser of impossible dreams, then the story of one man's quest to slay giants which are actually windmills cannot be ignored. And don't be such a stuck-up tight ass about film adaptations. Of COURSE they're going to be different, that doesn't make them worse.",
         "That was the response of one of the Inquisition prisoners to the inquiry, \"Why are you here?\" \"I was selling lies about one country to fools in the other country who believed me when.........\" The fact that O'toole can't sing for diddly is OK by me. He played the mad wise old man so wonderfully. The subtle idea that they were all imprisoned by the Inquisition manned by beasts who performed torture in the name of Jesus, who was tortured in a similar Inquisition, \"Are you the Messiah?\", etc. leaves you reverberating. Just as you also sit and think about the recursive show within a show within a show that you are seeing. We were shown one other aspect of the corrupt Christian church by the priest who plots with the niece and her fiance to bring the old man back to his 'senses' so he can legally will her his property. There are so many lines in this movie that are momentous. Just the very idea in this jaded time that there are beliefs worth dying for, worth fighting the valiant but unwinnable battle against the implacable foe for, really knocks me out!!! Was anyone EVER so innocent, so pure? I live in a country where the president, the Supreme Court and the Congress are filled with low life liars, and yet there are Americans here who are as noble as Senor Cervantes. There is another noble character in here that I would love to see analyzed by some of you scholars: that's the innkeeper/head of the prisoners. He has the respect of the mob, is a stable figure full of common sense, but yet is wise enough to respect the noble mad knight. And then there's the squire, Cervante's neighbor. He reminded me of my feelings toward Bill Clinton, when he answered the question, \"Why do you follow this madman?\" \"I like him. I just LIKE him.\" He's crazy, he's mad, he is engaged in an unwinnable fight, but \"I like him\". And Sophia Loren as the Mary Magdelene figure: those mauling scenes were excellently done, because they scared me and made me fear for her safety, as the men all but rape her. Maybe the reason they didn't was similar to the excuse I heard for my great-great-grandfather's 'kindness' toward his slaves in Opp, Al.: \"You don't mistreat your horses, cause you want them to be around tomorrow healthy enough to work for you.\" I checked this one out from the rental store, but I will now seek to buy it, as it's one that I will re-visit from time to time as I and my country changes. Will we ever have another time in the USA when 'good' people are able to make changes, when our planet is not allowed to be despoiled by our own government? Or is that to be left to another country whose Constitution is based on freedom, yet uncorrupted? \"When in the course of human events, it becomes necessary to shake loose the bonds of government...........\" I'm afraid it's about time."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Fantasy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Produzioni Europee Associati (PEA)"],
      "summaries": [
         "This musical version of Don Quixote is framed by an incident allegedly from the life of its author, Miguel de Cervantes. Don Quixote is the mad, aging nobleman who embarrasses his respectable family by his adventures. Backed by his faithful sidekick Sancho Panza, he duels windmills and defends his perfect lady Dulcinea (who is actually a downtrodden whore named Aldonza).",
         "In the sixteenth century, Miguel de Cervantes, poet, playwright, and part-time actor, has been arrested, together with his manservant, by the Spanish Inquisition. They are accused of presenting an entertainment offensive to the Inquisition. Inside the huge dungeon into which they have been cast, the other prisoners gang up on Cervantes and his manservant, and begin a mock trial, with the intention of stealing or burning his possessions. Cervantes wishes to desperately save a manuscript he carries with him and stages, with costumes, makeup, and the participation of the other prisoners, an unusual defense--the story of Don Quixote."
      ],
      "budget": 12000000
   },
   "movielensId": 8651,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-12-20",
      "dvdReleaseDate": "2004-05-11",
      "directors": ["Arthur Hiller"],
      "runtime": 132,
      "movieId": 8651,
      "title": "Man of La Mancha",
      "mpaa": "PG",
      "actors": [
         "Peter O'Toole",
         "Sophia Loren",
         "James Coco",
         "Ian Richardson",
         "Harry Andrews",
         "John Castle",
         "Brian Blessed",
         "Julie Gregg",
         "Rosalie Crutchley",
         "Gino Conforti",
         "Marne Maitland",
         "Dorothy Sinclair",
         "Miriam Acevedo",
         "Dominic Barto",
         "Poldo Bendandi",
         "Peppi Borza",
         "Mario Donen",
         "Paolo Gozlino",
         "Teddy Green"
      ],
      "imdbMovieId": "0068909",
      "originalTitle": "Man of La Mancha",
      "genres": [
         "Action",
         "Music"
      ],
      "youtubeTrailerIds": ["q-FRZcQ4qVE"],
      "plotSummary": "In the sixteenth century, Miguel de Cervantes, poet, playwright, and part-time actor, has been arrested, together with his manservant, by the Spanish Inquisition. They are accused of presenting an entertainment offensive to the Inquisition. Inside the huge dungeon into which they have been cast, the other prisoners gang up on Cervantes and his manservant, and begin a mock trial, with the intention of stealing or burning his possessions. Cervantes wishes to desperately save a manuscript he carries with him and stages, with costumes, makeup, and the participation of the other prisoners, an unusual defense--the story of Don Quixote.",
      "tmdbMovieId": 45793,
      "avgRating": 3.58187,
      "releaseYear": "1972",
      "numRatings": 171,
      "posterPath": "/iFsmLAjlBn3bZyjKFg1hmtyzShR.jpg"
   }
}