{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "human animal relationship",
            "id": 2526
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "german shepherd",
            "id": 33671
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0843358",
      "video": false,
      "title": "My Dog Tulip",
      "recommendations": [
         74641,
         44850,
         36188,
         311056,
         332980,
         56578,
         44245,
         239367,
         53873,
         65318,
         35067
      ],
      "backdrop_path": "/kguor55L1EB4lQMx92MhnlqS8P6.jpg",
      "revenue": 246574,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "J.R. Ackerley (voice)",
               "gender": 2,
               "credit_id": "52fe4814c3a36847f8157295",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nancy / Greengrocer's Wife (voice)",
               "gender": 1,
               "credit_id": "52fe4814c3a36847f8157299",
               "name": "Lynn Redgrave",
               "profile_path": "/jnXKuScyfE4zZ5AqBpmrVBMKeVz.jpg",
               "id": 29791,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ms. Canvenini (voice)",
               "gender": 1,
               "credit_id": "52fe4814c3a36847f815729d",
               "name": "Isabella Rossellini",
               "profile_path": "/yKnom6aUaP17Z49mypVZmq1jdjH.jpg",
               "id": 6588,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Plum / Pugilist (voice)",
               "gender": 2,
               "credit_id": "52fe4814c3a36847f81572a1",
               "name": "Peter Gerety",
               "profile_path": "/4P7v9Tx7pNkfLGhwDwsP8oBytbt.jpg",
               "id": 1986,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Captain Pugh / Mr. Blandish (voice)",
               "gender": 1,
               "credit_id": "536e8c8cc3a3687e6c000909",
               "name": "Brian Murray",
               "profile_path": "/bNRA2o9EGVfT3cEWCFm8f0rUjFK.jpg",
               "id": 56618,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Army Veterinarian (voice)",
               "gender": 2,
               "credit_id": "536e8e310e0a2647ce01040b",
               "name": "Paul Hecht",
               "profile_path": null,
               "id": 170953,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Bicyclist / Rude Veterinarian (voice)",
               "gender": 0,
               "credit_id": "536e8f1b0e0a2647c8011003",
               "name": "Euan Morton",
               "profile_path": null,
               "id": 227772,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4814c3a36847f81572a7",
               "name": "Paul Fierlinger",
               "profile_path": null,
               "id": 146883,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4814c3a36847f81572ad",
               "name": "Sandra Fierlinger",
               "profile_path": null,
               "id": 146884,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "536e7f460e0a2647d8010974",
               "name": "J.R. Ackerley",
               "profile_path": null,
               "id": 1318285,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "536e80340e0a2647d10103e5",
               "name": "Sandra Fierlinger",
               "profile_path": null,
               "id": 146884,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "536e8b580e0a2647d8010a82",
               "name": "John Avarese",
               "profile_path": null,
               "id": 1150805,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "536e8bb5c3a368122000d419",
               "name": "Paul Fierlinger",
               "profile_path": null,
               "id": 146883,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "536e8bfcc3a36839c100378e",
               "name": "Paul Fierlinger",
               "profile_path": null,
               "id": 146883,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "536e8c20c3a368122000d425",
               "name": "Paul Fierlinger",
               "profile_path": null,
               "id": 146883,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "536e8c2ec3a368124a00d67d",
               "name": "Sandra Fierlinger",
               "profile_path": null,
               "id": 146884,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "58e49076925141283502a1e5",
               "name": "Frank Pellegrino",
               "profile_path": null,
               "id": 1790119,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.402074,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52032,
      "vote_count": 10,
      "budget": 0,
      "overview": "The story of a man who rescues a German shepherd and how the two become fast friends.",
      "similar": [
         424488,
         8272,
         858,
         141,
         634,
         693,
         28178,
         93456,
         49519,
         112160,
         437557,
         97630,
         242224,
         24684,
         258480,
         43923,
         427900,
         455,
         9598,
         450438
      ],
      "original_title": "My Dog Tulip",
      "runtime": 83,
      "poster_path": "/fSQyyPle6YRl5SMZjI1ho4QeCR5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Norman Twain Productions",
         "id": 8828,
         "origin_country": ""
      }],
      "release_date": "2009-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Sometimes, love really is a bitch.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Paul Fierlinger",
         "Sandra Fierlinger"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "J.R. Ackerley",
         "Paul Fierlinger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0843358/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODM0MjMyMTUyOF5BMl5BanBnXkFtZTcwMjIwMTY3Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Christopher Plummer, Lynn Redgrave, Isabella Rossellini | See full cast and crew »"],
      "reviews": [
         "I have been dying to see this film since I first heard about it over a year ago and finally saw it, and, not only did it live up to my very high expectations - it surpassed them! Based on the classic book, \"My Dog Tulip\" by J.R. Ackerley, this film is an absolute treat from start to finish. It's an animated film and every frame is a work of art. It was hand-drawn but not on paper - it's the first film to be drawn on a tablet and over 100,000 drawings were made. You can almost feel the love and devotion that went into this touching story. It's about a lonely man, who, quite by chance, acquires a German Shepherd dog, who turns out to be the love of his life! I'm sure anyone who has ever loved a dog will enjoy this story. However, just because it's animated doesn't mean it's aimed at children. Quite the contrary - it's definitely for adults as much of the movie involves Ackerley's frustrated attempts to find a mate for Tulip. If you're a dog-lover, an artist, or just someone who appreciates a good film, do yourself a favour and go see this wonderfully unique film! I can't wait to see it again!",
         "An utterly charming and delightful film which provides a mostly joyful and honest perspective on the trials and tribulations of being owned bya dog. The mores and geography of a time and place from England's recent past are portrayed from a middle- class perspective, with very effective attention to detail. You'll leave wanting to get home right away to your canine, and give him/her a reminder of how much you care. The graphic styles are a great fit for the setting and the sentiments of the story. We left curious about the book's author, and wondering how he fared after the end of the period covered in the film. The last few years of Tulip's life get little-to-no coverage in the film, which short-changes the audience a little. The dog's youth is engagingly well covered, it would have been even more of a delight to get some rich visual story-telling about Tulip's middle- and old-age.",
         "A dog is a man's best friend. And sometimes a dog can substitute a woman in a man's life. My Dog Tulip was a book written in 1956 by the English writer J.R. Ackerley about how he rescued a female dog named Tulip from an abusive home. Tulip went on to give J.R. the best fifteen years of his life, and quite possibly the best thing in Tulip's life was J.R. Both had instant chemistry and expressed a strong love for each other. Coming from a cat lover, My Dog Tulip was beautiful in every category. The animation was not CGI, it was hand drawn on a tablet which wound up to be over 100,000 still drawings. I've never seen a film done like this and I've never seen a film quite like this. The animation is scratchy, but it manages to capture the beauty even without it being polished and glorified. It doesn't need to be. It is a complete throwback, and if it would've been made with CGI it would ruin the film. J.R. Ackerley was an openly gay man and often expressed that he was in his writings. He admitted he was after his parents died because of the time period he grew up in where being gay was the absolute worst thing that could've happened to you. Thankfully it isn't like that now. J.R. never found the right partner, but told us in the movie and in the novel My Dog Tulip that it was Tulip who served as his mate. Tulip's behavior would become increasingly protective when another woman came to see J.R., mainly his sister Nancy, Tulip would bark uncontrollably and demand undivided attention from him. She didn't like J.R. with other women. Tulip wanted J.R. to be his only. My Dog Tulip could easily be mistaken as a movie for a young child. One between the ages of four and nine. It is not. The film is totally geared towards adults, or understanding adolescents. It is equipped with dry British humor and a very soft spoken voice. The narrator is always calm, even at the most tense of times. The film deals with topics like love and the menstrual cycle of dogs. It is something many children will not get or even be interested in. They will just want to see the doggy. Compared to a film like Marley & Me, My Dog Tulip holds up a lot better most likely because it is true and not a work of realistic fiction. Marley & Me was nice at showing how bad a dog can be, but My Dog Tulip shows how good and sweet a dog can be to a human. Two totally different films, that are both nicely done in their own way. We all know what happens at the end, it isn't suspenseful. Tulip grows old and dies at fifteen after giving birth to several puppies. Tulip's story is very sweet and soft, even at it's saddest. J.R. died at the age of seventy in 1967. His spirit will continue to live on in his books and this heartwarming and caring film. Easily overlooked for the animation category in the 2010 Academy Awards. NOTE: My Dog Tulip was actress Lynn Redgrave's final performance before passing away on May 2, 2010. R.I.P. Starring: Christopher Plummer and Lynn Redgrave. Directed by: Paul Fierlinger.",
         "When English writer and BBC editor J. R. Ackerley brought home with him a German Shepherd bitch whose owner was in prison, little did he anticipate how difficult would be to care for her. However, despite the fact that Queenie (the original dog's name) was untrained and high strung demanding his full-time attention, he felt unconditionally loved for the first time in his life. This is a delightful animated movie for adults and older children based on Ackerley's memoir of the same name. Each individual frame was digitally painted with broad brush strokes creating a minimalistic and naturalistic scenes. Tulip is shown acting like a dog when she is taken to the veterinarian, runs out of control in the park, or goes into heat. And life-long bachelor Ackerley used to his peace and quiet is challenged by each one of Tulip's behaviors or problems. This is a movie about unconditional love that dog and animal lovers, or for that matter anybody who has had real feelings for any creature, should treasure. To understand the origin of Queenie, see the very good comedy drama \"We Think the World of You\" with Gary Oldman and Alan Bates, based on Ackerley's novel of the same name. It tells how an incarcerated burglar's dog becomes the object of class warfare between his working class wife and parents, who mistreat the dog, and a middle class former boyfriend.",
         "Whenever you come home, feeling a bit lonely or overlooked, and you do not have a dog, this is one of those movies that make you feel warm in your chest and pressed in your throat. My Dog Tulip is about the loving relationship between a man and his dog, going through the most common circumstances with so much care and affection, that it leads to endless devotion between both and the kind of spotted emotions that we usually call \"human\", that make you, the viewer, blight and smile. The animation and the story are both drawn and written so personally, that it detaches itself from other films in the way it reaches you. It also contains so much social reflection and wisdom that is makes a remembrance that is everlasting. 10 out of 10",
         "This film is perfect. The story is lovely, the music fits brilliantly, the animation, especially in the way. with a few lines and a little colour, it catches the \"character\" of the dogs is incredible in it's simple perfection. I came to England (from Scotland) and fell in love with the place thanks to H.E. Bates' books...this little film reminded me so much of them....it's very restrained in it's beauty, summed up by the first line: \"In being quite unable to love each other, the Englishmen turn to their dogs\" Why did this film not sweep the Oscars? No other animation comes close...apart from perhaps \"Mary & Max\". Everything about it is perfect.",
         "As a lover of dogs and animation, I found this film appealing. It is a perfect example that combines the two alongside '101 Dalmatians,' 'Oliver and Company,' 'The Plague Dogs' and pretty much any incarnation of 'Scooby Doo,' although the animation style of this film differs from that of all four of the titles since it has a sketchy if wobbly look. Most of the animation was smooth but jerky on the chickens and the backgrounds were as sketchy as the characters and both had rather subtle colours if the fantasy sequences on paper were plain and simple. The narrative of this film was engaging and reminiscent of 'Marley and Me.' I liked how Joe's typing or handwriting fitted in with it as well as the fantasy sequences depicting Tulip and other dogs in anthropomorphic ways on lined or plain sketch paper while the music had an old-fashioned feel that suited the film's style very well. Although some parts of it were crude and disgusting (especially Joe cleaning up Tulip's runny mess in the middle of the night - it nearly made me vomit) and risqué (no wonder it's a UK 12 rating), I was touched by the unlikely relationship of Joe and Tulip. Although she was a live-wire and seemed to be more interested in his sister Nancy, he still loved her. Parts of the film reminded me of when my parents owned a dog themselves such as Tulip dragging her bottom on the floor with her hind legs in the air (probably what dogs do when they need to relieve themselves) and going on heat since I observed Jasmine (my parents' Cavalier King Charles spaniel that they acquired in 2008 but was sadly returned to her breeder in 2011) dragging her bottom on the floor and my dad suggesting she needed a wee as well as her moments of going on heat. While the pace of the film was pretty slow until Tulip had her puppies, it was at this point that it became rushed because it seemed like little or no time between the birth of Tulip's puppies and her death (mentioned but not seen: only depicted as her fading away and returning as an anthropomorphic spirit). I like the fact that this film was dedicated to Lynn Redgrave since it was her final film before her unfortunate passing. All in all this is an obscure yet distinctively-animated film that has its blend of crude, risqué and touching moments and is easier to follow than 'The Plague Dogs'. 8/10.",
         "I usually would not watch any film that was animated but because the book MyDog Tulip was so enjoyable I decided to give it a try. I'm so very glad I did. The art work is brilliant. My Dog Tulip is not in any way cartoon-like and is not for children, It is very faithful to the book. If you have never lived in England especially during the period covered in the book I would think you might not connect with the film because it is so very British. A lot of Americans might be put off due to this but I found it was one of the pleasant things about it, having lived in England for a few years. Also the author's companionship with his Alsatian (German Shepherd) dog was really heart warming. I also had an Alsatian and could relate to a lot of the things in the film concerning the problems he encountered trying to find a suitable mate for his dog and also the encounter Tulip had with the chickens could have come directly out of my notebook. I enjoyed this film for its artwork, story and British humor. I will definitely watch it again. Tulip could have been a twin for my dog.",
         "At first this film looks like a short for children. It is not. It is a rather lecherous look at dogs. It is not for prudes. The ideas it discusses seem more shocking because of the innocent animations used to present them. I am one of the least prudish people I know, but found this film repeatedly embarrassing. It seemed unseemly for Christopher Plummer to be relishing such gross things as vomit, diarrhoea, bowel movements, urination, masturbating dogs, getting turned on by dog genitalia, zoophilia, leching over dog breeding, dog erections, tight dog foreskins, and dog behaviour in heat. It is naughtily amusing by periodically putting a dress on the animated dog Tulip, and has her behave with dog-like motivations but as a human. This makes clear just how different dog behaviour is from human. The \"kindly\" old man behaves in ways that belie his gentle voice. He allows his dog to bite children, to bark at all hours, to attack people and poop on other people's property then not clean it up. He does not spay his dog then beats all the dogs attracted. He lets his dog have puppies just so he can derive some perverted pleasure from the birth before drowning them. This clashes drastically with the charming animation which is like entering a painting. The musical score is rendered with extraordinary crispness. Its cheery oompah band is used rarely to punctuate the story. It is very well done. The big problem with the film is its deceptiveness. It so very different from what you would expect, you feel tricked into participating in some filthy joke. It is not X-rated porn, but it is quite off-colour and the box should let you know to expect that.",
         "I am an artsy, worldly person, but I was creeped out by the ever present toilet humor and the smut, even though it was animated. This movie started out appealing because it was animated, had pleasant music and was set in England. It seemed charming, creative, and well-spoken at first, especially for dog lovers and anglophiles, but it became unpleasant and offensive with graphic animated canine and human sexual functioning and toilet and menstruation humor. It was smutty. You should know this before you watch it in mixed company. It is a definite NO for children and not a date night movie either. I watched the special feature about the making of the film and I am not surprised that it was animated by a middle-aged recluse couple who appear to enjoy what they see as sticking it to middle class values, but it was creepy. And I was horrified by the scene when the main character was preparing to drown puppies. Be forewarned, that just because it is animated does not make it benign or wholesome. It is neither."
      ],
      "genres": [
         "Animation",
         "Drama"
      ],
      "productionCompanies": ["Norman Twain Productions"],
      "summaries": ["The story of a man who rescues a German shepherd and how the two become fast friends."],
      "budget": 0
   },
   "movielensId": 86604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": "2011-08-02",
      "directors": [
         "Paul Fierlinger",
         "Sandra Fierlinger"
      ],
      "runtime": 83,
      "movieId": 86604,
      "title": "My Dog Tulip",
      "mpaa": "",
      "actors": [
         "Christopher Plummer",
         "Lynn Redgrave",
         "Isabella Rossellini",
         "Peter Gerety",
         "Brian Murray",
         "Paul Hecht",
         "Euan Morton"
      ],
      "imdbMovieId": "0843358",
      "originalTitle": "My Dog Tulip",
      "genres": [
         "Animation",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a man who rescues a German shepherd and how the two become fast friends.",
      "tmdbMovieId": 52032,
      "avgRating": 3.1,
      "releaseYear": "2009",
      "numRatings": 25,
      "posterPath": "/fSQyyPle6YRl5SMZjI1ho4QeCR5.jpg"
   }
}