{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rothschild",
            "id": 207193
         },
         {
            "name": "financial empire",
            "id": 207194
         }
      ],
      "imdb_id": "tt0025272",
      "video": false,
      "title": "The House of Rothschild",
      "recommendations": [
         108213,
         31678
      ],
      "backdrop_path": "/1ea4FCMairHWd4pY2eGnSQc1vzg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mayer Rothschild",
               "gender": 2,
               "credit_id": "52fe4922c3a36847f818a91f",
               "name": "George Arliss",
               "profile_path": "/3lqGNqIufnDGIAwnYKp57QEiNvZ.jpg",
               "id": 124309,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Count Ledrantz",
               "gender": 2,
               "credit_id": "52fe4922c3a36847f818a923",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julie Rothschild",
               "gender": 1,
               "credit_id": "52fe4922c3a36847f818a927",
               "name": "Loretta Young",
               "profile_path": "/g5IlFLATSLpINVlaoV8Ncce2RCA.jpg",
               "id": 85848,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Duke of Wellington",
               "gender": 2,
               "credit_id": "52fe4922c3a36847f818a92b",
               "name": "C. Aubrey Smith",
               "profile_path": "/u00cKiTSCbCeFLaTPL6ykgqB5AB.jpg",
               "id": 2438,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Capt. Fitzroy",
               "gender": 2,
               "credit_id": "5309804dc3a36863b100300f",
               "name": "Robert Young",
               "profile_path": "/yD74ANflpVXQPci4cihAg63BfK7.jpg",
               "id": 14868,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Baring",
               "gender": 2,
               "credit_id": "53098055c3a368420b00374e",
               "name": "Arthur Byron",
               "profile_path": "/73brZu9pY1nF1sIxK4LIkMXEcGC.jpg",
               "id": 78829,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gudula Rothschild",
               "gender": 1,
               "credit_id": "53098063c3a3687b570017d7",
               "name": "Helen Westley",
               "profile_path": "/3KCibC13Xj8Qb94oe8reysc19cI.jpg",
               "id": 108986,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Herries",
               "gender": 2,
               "credit_id": "5309806cc3a36842130035c8",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hannah Rothschild",
               "gender": 1,
               "credit_id": "5309807ac3a36841f0003667",
               "name": "Florence Arliss",
               "profile_path": "/ixPSlE8jRtYTWI3lam1qnte6NIu.jpg",
               "id": 921146,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Prince Metternich",
               "gender": 2,
               "credit_id": "53098088c3a368420100370b",
               "name": "Alan Mowbray",
               "profile_path": "/s49NhpPmbn9ZaADRTJJAgDADDZt.jpg",
               "id": 8240,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Official (uncredited)",
               "gender": 2,
               "credit_id": "594524a79251413ff400fddd",
               "name": "Nigel De Brulier",
               "profile_path": "/dSat7OeGS4bTrpwLZFnchCsc8vO.jpg",
               "id": 34047,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4922c3a36847f818a931",
               "name": "Alfred L. Werker",
               "profile_path": "/4B0LohF5Fj01lBPgqLKc7P1oJSr.jpg",
               "id": 81930,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54218805c3a36818cf0018e8",
               "name": "Nunnally Johnson",
               "profile_path": "/uhPu5P41qMxzybWzerWik8H2wVI.jpg",
               "id": 8501,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54218811c3a368135a00084e",
               "name": "George Hembert Westley",
               "profile_path": null,
               "id": 1366944,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "5ac3bf53c3a3682d33038cee",
               "name": "Darryl F. Zanuck",
               "profile_path": "/pfl8oR2otTYihADFtjLkrtKoFrM.jpg",
               "id": 8502,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac3bf64c3a3682d1a0380b5",
               "name": "J. Peverell Marley",
               "profile_path": null,
               "id": 98501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ac3bf6d0e0a260c01037929",
               "name": "Allen McNeil",
               "profile_path": null,
               "id": 14649,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5ac3bf750e0a260c3903d261",
               "name": "Barbara McLean",
               "profile_path": "/18NdkfiYOB1aSCaWLZZFc2zofub.jpg",
               "id": 10603,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac3bf820e0a264a4e0811e1",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.81737,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 57035,
      "vote_count": 7,
      "budget": 0,
      "overview": "The story of the rise of the Rothschild financial empire founded by Mayer Rothschild and continued by his five sons. From humble beginnings the business grows and helps to finance the war against Napoleon, but it's not always easy, especially because of the prejudices against Jews.",
      "similar": [],
      "original_title": "The House of Rothschild",
      "runtime": 88,
      "poster_path": "/jFuek7IzrpsxGtcsUuzIDytHPkK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "20th Century Pictures",
         "id": 4985,
         "origin_country": ""
      }],
      "release_date": "1934-04-07",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Alfred L. Werker",
         "Sidney Lanfield"
      ],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Nunnally Johnson",
         "George Hembert Westley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025272/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MTg5OTg1NF5BMl5BanBnXkFtZTYwODM3MTU2._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: George Arliss, Boris Karloff, Loretta Young | See full cast and crew »"],
      "reviews": [
         "This is quite a rousing film for a biopic, and sports one of Arliss's best performances. Made two years after Hitler's rise to power, the whole subtext of the film is anti-Semitism and the then-current events in Europe. Napoleon is the stand-in for Hitler--the man all peace-loving men must join together to wage war against to secure peace. There are scenes of violence in the Jewish ghetto--stirred up by anti-Semite Karloff. Everything Rothschild does he does to end anti-Semitism; many speeches on this theme. Rothschild's father is shown as a Shylock-type, making money with money, fooling the tax collector, but with reluctance and great bitterness, doing so only because other professions are denied him, and because the tax collector overcharges Jews. C. Aubrey Smith gives a really delightful performance as Wellington. The final scene is one of the first live-action sequences to be made in three-color Technicolor, before BECKY SHARP. The topicality gives the film an immediacy that is often lacking in period films.",
         "Five brothers, born & raised in a Jewish ghetto at the end of the 18th Century. Taught by their parents in the ways of international finance & commerce, but above all in living a life of dignity as Jews. Five brothers who grew to establish banks wielding enormous power from the five great European capitals - Frankfurt, London, Paris, Vienna, Naples - yet who always worked together for the common goal of peace in Europe & the destruction of tyranny. Five brothers united as THE HOUSE OF ROTHSCHILD. In this lavish film, Mr. George Arliss gives yet another splendid history lesson and this time the old fellow gets to play two roles: Mayer Amschel Rothschild, the founder of the dynasty; and eldest son Nathan Rothschild, who established the London branch of the family. As always, Arliss is fascinating to watch, his every twitch conveying significance & meaning. It is a shame he is almost forgotten today, as he was a marvelous actor. But he does not act alone here. Indeed, his co-stars are quite accomplished. As in so many of his films, his real-life wife Florence Arliss plays his (Nathan's) spouse and is charming, as usual. The somewhat obtrusive romantic subplot is handled by the two Youngs, Loretta & Robert, who look lovely & handsome respectively. Helen Westley is exceptional as Mayer's wife Gudula, the matriarch of the family. Also on hand are Reginald Owen, Alan Mowbray, Ivan Simpson, Ethel Griffies & wonderful old Sir C. Aubrey Smith as the Duke of Wellington - it is a particular treat to watch his scenes with Arliss. A rather subdued & urbane Boris Karloff is the villain of the film, playing a Prussian nobleman who delights in being anti-Semitic. Pains are taken to show the evils inflected upon Continental Jewry during the age of repression & pogroms and it is important to remember that this film was produced in 1934, as Evil was once again raising its head in Central Europe. The ideas of men in the 19th Century, such as Karloff portrays here, would lead inexorably to the gas chambers & furnaces of Nazi Germany in the 20th. Forget Frankenstein's Monster. This was Karloff's most horrific role. In the last 4 minutes, the movie turns from black & white to beautiful early Technicolor, a delight to the eyes. There are a couple of glaring historical inaccuracies in the movie that must be pointed out. Nathan was not the elder of Mayer's sons - in fact he was the 3rd born. And it was not he, but his grandson, another Nathan, who was raised to the peerage to become Baron Rothschild in 1885, 49 years after the death of his grandfather. Trifling, yet significant.",
         "HOUSE OF ROTHSCHILD concentrates on anti-Semitism, and the struggle of the Jews to get equality and recognition from their Gentile neighbors. It's presentation of the problem is simplistic, but given the time that this film was produced it was amazing that any attempt was made to attack anti-Semitism at all. In 1934 Adolph Hitler was Chancellor of Germany one year already. Strong anti-Semitic strains were felt all over Europe and the U.S. - in fact in most of the world. It took some courage to make any jab at it, and producer Darryl Zanuck (a non-Jewish Hollywood film studio head - a rarity) had plenty of that. He would repeat this in fourteen years producing GENTLEMAN'S AGREEMENT. George Arliss first plays the head of the famous banking family, Mayer Amschel Rothschild. A stereotypical Jewish money lender, he dies of a stroke after confronting the bullying, greedy tax men. Before he dies he tells his five sons two things: 1) The gentiles have prevented the Jews from competing in the regular professions leaving them in the role of money lenders. But the gentiles have thus put money into the hands of the Jews as an only weapon. So it should be used to force the gentiles to emancipate the Jews from their awful ghettos. 2) The boys should establish an international bank in London, Paris, Vienna, Frankfort, and Naples. They would be in a good position to build a mighty economic weapon to use against the Jews' foes, so that (as Mayer says) the Jews can live with dignity. For most of the picture Arliss plays Nathan Rothschild, who is lucky enough to be set up in London. The five branch bank soon is one of the great financial institutions of the world. Nathan has managed to support the British Government and it's allies in the wars against Napoleon. But after Napoleon is sent to Elba the British and their allies (led by the German, Count Ledranz) are freezing the Rothschilds out of a major bond issue. Nathan realizes that this is due to the anti-Semitic Ledranz, and uses his position at the stock exchange to bear down on the bond issue, threatening to ruin the men who are pushing the issue. Hastily calling a meeting, Lord Baring (Arthur Byron) prevails on the aristocrats to let Rothschild in for a share of the bond issue. Ledranz does it with ill-feeling, warning Nathan that this is not the end of the matter. Shortly afterward there are pogroms all over central Europe. As Ledranz (Boris Karloff, in a splendidly evil performance without) puts it,\"The House of Rothschild - The House with the Red Shield: I'll make it RED!\" There is little Nathan can do about this. But shortly afterward Napoleon escapes from Elba, throwing the alliance (especially Ledranz) off balance. They need Nathan to stabilize the stock exchange, or the Little Corsican will win an easy victory against them. And (although they don't know this) Napoleon has already reached out to Nathan with a counter-proposition: help him and Jewish Emancipation is assured. That Nathan throws his support to the alliance is no real surprise. He feels that if he supports Napoleon the image of the Jews suffers with the bulk of the Gentiles - they traffic in human lives and blood. But he does save the stock exchange, and he ends having proved that the Jews can be as good citizens as their Gentile counterparts. How true is the story? Well I recommend Frederic Morton's classic book THE ROTHSCHILDS to get the accurate story. Mayer Rothschild was the financial agent of the Prince of Hesse-Cassel. The money made from the renting of Hessian troops was shepherded by Mayer into a vast fortune, and he got a commission. It staked out (and trained) his five sons, who did make their private bank the biggest in the world. The French Revolution had announced that the Jews were equals of the Gentiles (the bill ending French legal discrimination against the Jews was presented by Maximillian Robespierre!). Napoleon reestablished it, and (in 1807) called the first meeting of the Jewish Sanhedrin since 70 A.D. Whether he did this for publicity or he meant it is still debated. The spread of the reform by the Revolutionary and Napoleonic armies achieved was hurt by the reaction in Europe after Napoleon's final defeat in 1815. Ledranz is a splendid villain (and a German one, for all that). But he appears to be based on Prince Claus Von Metternich, the Chancellor of the Austrian Empire. In fact, although he probably had some social anti-Semitism, Von Metternich was quite friendly to the Rothschilds, and he figured out a way of allowing them to be ennobled in Austria and in the German states. The film does seem a little simplistic. There is no reference to the blood libel as such, or to the blame Christianity placed on the Jews for the death of Jesus. And to make a case that economic muscle alone would change people's minds was silly and short sighted. It could equally awaken jealousy and hatred for a successful people. But that it was advanced at all in 1934, and that the film was an attempt to confront a hideous, growing problem, was deserving of praise. Ironically it was too little, too late. Goebbels would produce an anti-Semitic film called THE ROTHSCHILDS during World War II, and his pet director Veidt Hartmann would direct THE ETERNAL JEW (where Jews were compared to rats, and scenes from HOUSE OF ROTHSCHILD appear to have been cut in). Hartmann would also direct JUD SUSS, regarding another Jewish financier of an earlier period, who was hung for \"crimes\" - of course, Hartmann insisted he Jud Suss Oppenheimer was guilty of those crimes. So, for all the good intentions of Zanuck and Arliss and the others, history had a dreadful commentary awaiting in the wings.",
         "Darryl F. Zanuck covered Napoleon's sweep across Europe in two early films: \"Lloyds of London,\" in which Tyrone Power plays a fictional character who continues insuring the British fleet so that his childhood friend, Horatio Nelson, can win the war; and \"The House of Rothschild\" in which Nathan Rothschild and his banker brothers provide the financing to beat Napoleon. Both are excellent films. There are a few historical liberties in \"The House of Rothschild,\" but the film is based on fact. George Arliss has a dual role as Mayer Rothschild and his son, Nathan. When the film begins, the family is living in a Prussian Jewish ghetto where Mayer is doing well but doesn't want the tax collectors to know. On his deathbed, he instructs his sons to establish banking houses throughout Europe as so much money is stolen when it is being carried by messengers. The plot then focuses on Nathan and goes into the rampant anti-Semitism which forces Nathan out of an important loan. It also shows his brilliance for business as he fights Count Ledrantz (Boris Karloff) who spreads propaganda and incites pogroms. The climax of the film takes place when it appears Napoleon is winning and Nathan starts buying up everything on the stock market, which is bottoming out, in order to keep the deal he made for the war effort. Though not much is made of it, the Rothschilds had informants everywhere, which enabled them to get information before anyone else. He is able to announce before it is made public that Napoleon has been defeated at Waterloo. \"House of Rothschild\" stars one of the great actors, George Arliss. Other actors from the stage entering films often used tremulous voices and melodramatic gestures but Arliss had a tremendous speaking voice and a grand acting style that made a powerful impression on the screen and infused the characters he played with a believability as well. A blond, beautiful Loretta Young is on hand as his daughter, who is in love with a Gentile named Fitzroy (Robert Young) - and though one would expect the love story to be fiction, it isn't. This film has an interesting history of its own: Excerpts from it, taken out of context, were used in the anti-semitic Nazi films Der ewige Jude and Die Rothschilds. Despite persecution, the Rothschilds remain an extremely powerful family in the present - the original name of the family was Bauer; Rothschild is actually German for \"red shield,\" which is in the center of the family coat of arms. Today, they're in a variety of occupations besides banking - actress Helena Bonham Carter is a Rothschild due to a marriage on her mother's side.",
         "A dramatic, inter-generational history of the House of Rothchild. Most people have a vague notion of the Rothchild banking dynasty, but like me, probably didn't know the history and pain that went with it. This story covers the origin and evolution of that dynasty and an explanation of it's motivation. The story centers around the elder brother, Nathan, played by George Arliss and his four brothers. I have to admit that I never saw the George Arliss magic until I saw this picture. He really was a major talent, although he was quite old when he did this. We see the family breaking out of \"Jew Street\" in Frankfurt, and establishing banks throughout Europe while struggling to overcome anti-semitic attitudes and actual pogroms. There are some personal vignettes involving Loretta Young as Nathan's daughter and her goy suitor played by Robert Young that tend to humanize the family but really don't amount to much. The real story is the family drive to help stabilize a war ravaged Europe and through it, command the respect of a deeply anti-semitic aristocratic European society. The picture paints a rather pastel version of what was probably a grueling battle for acceptance, but it managed to convey a feeling of warmth and respect for the underdog. There are some very nice touches. The family members all touch the mezuzah each time the enter or leave the house. Everybody kisses Mama, and George Arliss shows what appears to be a real tenderness whenever he interacts with Loretta Young. The brothers never appear to be avaricious, but rather an integrated force of will, determined to succeed, yet determined to play by the rules. All in all, an enjoyable and informative docu-drama. Well worth the 90 minutes.",
         "By accident I stumbled onto this early movie on a TV channel. It is most interesting for me because I never gave a thought to money matters regarding the Napoleonic wars, it being remembered only in a military light, the clashing of arms and ships, etc., so I've learn a lot from seeing this historical film, give and take a few inaccuracies. It's seldom found in the history books unfortunately. Loretta Young is a vision of loveliness and her tender scenes with Robert Young bring a pleasant interlude of gentle romance in a tale that is mostly dominated by the wheelings and dealings of high finance and the wars of the time. There is much emphasis on the plight of the Jewish people and their burden over the centuries of not being accepted in society. It brought to mind the family history of the composer Felix Mendelssohn whose ancestry converted to Christianity in order to join the mainstream and blend in socially. I would think that from today's viewpoint it would seem an odd gesture to do so, and hopefully human beings are becoming more understanding of each other without resorting to such sacrifices. I particularly liked the lengthy scene where Nathan speaks courageously about financing and war, then concludes with, \"We stand for peace.\" A very enlightening film with excellent dialogue and fine dramatic acting throughout. I only regret knowing so few in the cast.",
         "In the person of Nathan Rothschild, overlord of the international banking house that shaped the destiny of Europe, George Arliss has found his most congenial role since Disraeli. The story provides a fasinating study of internatinal intrigue in the nineteenth century. It is presented straight-forwardly, without apology or sentimentality. Because of its lack of dramatic sequence, the picture lapses into passages that become monotonous. The injection of a romantic episode between Nathan's daughter and a Gentile British office, with its mixed-marriage problem during those years, is tritely handled. This film is rarely shown over the years in America and is controversal at times. On the whole, the picture has been skillfully cast, and there are good performances by George Arliss, Reginald Owen and Boris Karloff who gives an excellent performance as Baron Ledrantz.",
         "... which is appropriate since he had the talent of at least two actors of any era. In this case Arliss plays both Mayer Rothschild and son Nathan after the house of Rothschild has begun to flourish into a huge banking enterprise. What makes these precode biopics of Arliss fun to watch is his mischief, the precocious energy of a five year old and the wisdom of a sage observer of human nature all packed into one lean unimposing frame. The precode era also allowed Arliss to make a comment here and there that likely would be censored in the production code era. The time is that of the Napoleanic Wars and the Rothschilds, after funding the British in the first defeat of Napolean, find the British aristocracy develops a not so startling case of amnesia and begins treating Nathan Rothschild as an outsider - a Jew - and excludes him from their most lucrative deals. When Nathan Rothschild initially outsmarts them in business, the vindictive Count Ledrantz (Boris Karloff) incites riots against the Jews throughout Europe, even putting Nathan's own mother at risk back at the ancestral home in Germany. However, what nobody knows at the time is that Napolean will escape and a second campaign against him will be necessary. Will the Rothschilds go after their own best interests and back Napolean or will they again side with those that have discarded them - the British. Watch and find out. Also watch George Arliss' other biopics of the early sound era - Disraeli, Voltaire, and Alexander Hamilton are the ones I've actually been able to see so far. All of these are very much worth your time.",
         "(Slight Spoilers) Lavish historical epic of the Rothschild family's rise from the Jewish ghetto of Frankfurt in Prussia to become the most powerful banking institution in Europe. Thoward the end of the movie \"House of Rothschild\" things weren't at all looking good for the family of banking brothers with all of them, and their banks securities, buying up British bonds on the London Stock Exchange for cut-rate prices with rumors going around that the Battle of Waterloo in Belgium was lost to Napoleon's forces. It was the old stock market saying that \"information is the most valuable commodity\" that rescued the Rothschild's vast money holdings. That commodity in the end not only saved the Rothschild fortune, and more then doubled it, but also saved those investors who were wise enough to follow Nathans lead in not abandoning the allies financially at their most critical time of need when everything looked as if it were lost. The film mostly concentrates on how the Rothschilds, namely Nathan and his brothers, despite the anti-Jewish prejudices that they faced in early 19th Century Europe prevailed in the end to overcome the slings and arrows as well as the anti-Semitic riots incited by the likes of Prussian Count Ledrantz, Boris Karloff, to become the richest and most powerful bankers in the world. Besides the historical facts in the movie there's also a fictitious sub-plot involving Nathan's daughter Julie, Loretta Young, having a love affair with the handsome and dashing British calvary officer Captain Frizroy, Robert Young,that her father had a hard time accepting Since Fitzroy wasn't Jewish or a Rothschild. But in the end everything was ironed out, by the script writers, to make the affair between the two lovebirds a joyous and successful one. Nathan who was earlier sandbagged by Count Ledrantz and his fellow bankers when a loan that he expected his bank to float involving the restoration of France, after Napoleon's exile on the Island of Elba, was rejected. This came about because of what Ledrantz smugly called a \"technicallity\"! The unforgivable \"technicallity\" being that Nathan was Jewish! This sleazy and despicable act on the part of Ledrantz & Co. had an outrage and indignant Nathan get back at Ledrantz and his gang of banker cut-throats. Nathan thus, using financial guerrilla-like tactics, undercut the bonds that they were to float and sell to the British public representing the French loan. In the end this forced Ledrantz & Co. to come to the Rothschild Bank hat in hand begging for Nathan to become a partner. Even if Nathans partnership cost these rascals and unscrupulous financial manipulators as much as 50 million British pounds for them to do it. Smarting from the beating his and his cohorts took at the hands of the witty and clever Nathan sore loser Ledrantz started to foment anti-Jewish riots all over his native Prussia, which included the Rothschild family home \"The Red Shield\" in the Jewish ghetto of Frankfurt. This was Ledrantz way to get back at Nathan but that quickly came to an end with the startling news of Napoleon escaping from his exile in Elba and regaining power in France. This meant that they, Ledrantz & Co, would need the Rothschild money again to finally stop Napoleons determined attempt to conquer all of Europe. Like the bankers did before in needing the Rothschild's banks money to defeat Napoleon after his massive June 21,1812 eastern invasion that lead to his disastrous withdrawal from Czarist Russia back in the winter 1812-1813. With news hard to come by back then it was Nathan's ingenious and secret way of using carrier pigeons from the battlefield that gave him the edge in knowing that the Duke of Wellingtons, C. Aubrey Smith, forces checked and repulsed Napoleon's big offensive at the battle of Waterloo! That happened as rumors were abound on the floor of the London Stock Exchang that just the opposite happened. This timely information had Nathan and his brothers buy up all the British Government Securities that were being sold off and bid down by panicked stock brokers and investors. In the end Nathan not only saved the London Exchange from total collapse but made himself and the Rothschild Bank, or banks, the financial powerhouse that it became and is, after some 200 years later, even now. George Ariss plays both the elder Mayer and his son Nathan Rothschild in the movie with both Robert and Loretta, no relations, Young as the star-struck lovers Fitzroy and Julie in small but very important supporting roles in the film.",
         "I also watched it the other day on the Fox Movie Channel and the final sequence was indeed not in color. That surprised me because I thought that surely their vault would have contained a print with the Technicolor finale. About 15 years ago, the Castro Cinema here in San Francisco showed a series of 20th Century Fox classic films, all with 35 mm prints. The House Of Rothschild was shown with the beautiful Technicolor final sequence. The fact that it was not shown that way on the FMC was disappointing, but it was still great to see the film again, as it's so rarely shown."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": ["20th Century Pictures"],
      "summaries": [
         "The story of the rise of the Rothschild financial empire founded by Mayer Rothschild and continued by his five sons. From humble beginnings the business grows and helps to finance the war against Napoleon, but it's not always easy, especially because of the prejudices against Jews.",
         "The wealthy Rothschild family undergoes prejudice from the anti-Semitic society they live within."
      ],
      "budget": 0
   },
   "movielensId": 86675,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-04-07",
      "dvdReleaseDate": null,
      "directors": ["Alfred L. Werker"],
      "runtime": 88,
      "movieId": 86675,
      "title": "The House of Rothschild",
      "mpaa": "",
      "actors": [
         "George Arliss",
         "Boris Karloff",
         "Loretta Young",
         "C. Aubrey Smith",
         "Robert Young",
         "Arthur Byron",
         "Helen Westley",
         "Reginald Owen",
         "Florence Arliss",
         "Alan Mowbray",
         "Nigel De Brulier"
      ],
      "imdbMovieId": "0025272",
      "originalTitle": "The House of Rothschild",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of the rise of the Rothschild financial empire founded by Mayer Rothschild and continued by his five sons. From humble beginnings the business grows and helps to finance the war against Napoleon, but it's not always easy, especially because of the prejudices against Jews.",
      "tmdbMovieId": 57035,
      "avgRating": 3.1875,
      "releaseYear": "1934",
      "numRatings": 8,
      "posterPath": "/jFuek7IzrpsxGtcsUuzIDytHPkK.jpg"
   }
}