{
   "tmdb": {
      "original_language": "nl",
      "keywords": [],
      "imdb_id": "tt0113840",
      "video": false,
      "title": "Mother Dao, the Turtlelike",
      "recommendations": [64728],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b55c3a368484e183d8d",
               "name": "Vincent Monnikendam",
               "profile_path": null,
               "id": 1090944,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b55c3a368484e183d93",
               "name": "Vincent Monnikendam",
               "profile_path": null,
               "id": 1090944,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "57c0554ac3a36820f8004b62",
               "name": "Rade Milicevic",
               "profile_path": null,
               "id": 1670531,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57c05553c3a3684d39003a29",
               "name": "Jan-Dries Groenendijk",
               "profile_path": null,
               "id": 1190874,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "57c0555cc3a3687326000f97",
               "name": "Vincent Monnikendam",
               "profile_path": null,
               "id": 1090944,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57c055649251414b5f00378f",
               "name": "Hans van der Marck",
               "profile_path": null,
               "id": 1670532,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57c05570c3a3687326000fa5",
               "name": "Albert Markus",
               "profile_path": null,
               "id": 1434856,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57c0557d925141498f000e3f",
               "name": "Licky Zydower",
               "profile_path": null,
               "id": 1670533,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.720073,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 130272,
      "vote_count": 5,
      "budget": 0,
      "overview": "In a span of ninety minutes the film aims to show how the Netherlands administered its colony as a colonial enterprise and what the relations were like at the time. The usual commentary has been omitted and in its place poems and songs in Bahasa Indonesia have been included in a digital sound composition.  In Mother Dao the Turtlelike, the viewer sees how the colonial machinery in the 1920s was implanted in a world so different from Western Europe.",
      "similar": [],
      "original_title": "Moeder Dao, de schildpadgelijkende",
      "runtime": 90,
      "poster_path": "/5CltSp1Howc28Z0N7GzzqOF0IGd.jpg",
      "spoken_languages": [
         {
            "name": "Bahasa indonesia",
            "iso_639_1": "id"
         },
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Nederlandse Programma Stichting (NPS)",
         "id": 12023,
         "origin_country": ""
      }],
      "release_date": "1995-04-06",
      "vote_average": 8.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vincent Monnikendam"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Vincent Monnikendam"],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0113840/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "This film is neither a traditional documentary nor a traditional narrative work. Consisting entirely of found footage shot in Indonesia between 1912 and 1932, the Dutch director combines birdcalls, Indonesian poems, Gamelan hymns, and non-diegetic sound as a dynamic filter for the stream of images. What you see is a society on the verge. Industrialism is at play. But so is nativism. The Dutch colonial presence is shown with all its inherent displacements, violence and cultural disconnects, but the director never wields a heavy or pedantic hand. Instead, history, with the epic force of 60 - 80 years of hindsight, is displayed as both inevitable and fungible. The persistent specter of technology haunts the film. But as specific as it is to the Dutch-Indonesian colonial relationship, it feels much more universal. We witness the introductions of medicines as well as machines. Lepers and malaria victims are shown alongside factory workers. But, once again, the director isn't making simple juxtapositions. He also shows the bucolic countryside and rivers, as well as local dances, opium smokers, sunsets by the ocean, and ridiculous state ceremonies. This film is the opposite of didactic. The larger story has something to do with Mother Dao. Really, that's as much as should or could be said. I am reminded of Wiseman's non-narrated documentaries, but what sets Mother Dao apart is its very constructed sound. With the images carrying their received impact of history, the subtle and superb use of sound is what ultimately carries the film. Still, at least four or five sequence will burn into your memory forever. No need to list them, you'll know when they appear. This is a very slow-moving film. Do not watch when sleepy. I fell asleep the first four times I saw this film, but I never tire of seeing it. Please, Zeitgeist, release this on DVD. It is one of cinema's great achievements.",
         "This film is quite astonishing. Indeed I found it to be overwhelming. There is such density of incident and meaning and history that you can't really take it all in one sitting. There is footage from literally hundreds of documentaries shot in the Dutch East Indies between 1912 and 1933, over this there is a soundtrack which combines sound effects to match the previously silent images, and also some poetry which I think is Persian in style. The poetry concerns a creation myth. Before the world existed there was apparently only Mother Dao, who was turtlelike. She became dirty, and gleaned the dirt from her body into one mass which she pressed into a ball on her kneecap using her thumb. This is our world. She also gave birth to a man and a woman, who first inhabited the earth. As the poem in the earth goes, when she died, she turned into dust, and all the dust rained down on the earth and filled all the chasms, and gave rise to all different forms of peoples and creatures, who did not know that they were brothers and sisters. I've a penchant for this type of stuff from reading about it as a kid. This particular myth comes from the islanders of Nias, actually for them the world was just their island and Mother Dao is the sea, but the way it's described in the poetry of the film is far better. If you ever saw Forugh Farrokhzad's The House Is Black and listened to her poetry, you will get the idea of what happens during Mother Dao. There are other poems too, with which the film will delight you if you manage to track it down. I could not quite believe some of the sequences, you have for example a crocodile hunt where somehow a group of quite unprotected native individuals working under white men have corralled around fifty crocs into shallow water, and are killing them with long poles. The crocs are thrashing furiously through the water and move very very quickly when trying to escape, it is a wonder no-one was hurt! Then you have an interior scene with a Dutchman dressed in a white pith hat, and a white suit, shining out of the screen like some sort of god amongst furrowed-skin muscular half-naked brown locals. You get awesomely unsafe factories with huge machinery, a worker dips his hand through a gap where a piston engine is revolving, totally casually, seemingly unaware that is he gets it wrong he will finish his shift down one arm. In other miscellaneous scenes you get workers high up on huge warehouse skeletons totally without protection, volcanic explosions, dynamite blasts, beautiful and intricate stone artifacts from pre-colonial times. Really unmissable, and should be seen more than once.",
         "Taking archive silent b/w footage from the colonisation of the dutch east-indies, the filmakers re-edit it to their new agenda to show the despoilation of a land, people and society in the name of enlightenment and $. Laugh, shake your head, and be moved to the point of tears. See it.",
         "I agree with all the positive comments made by the other writers. This movie was on TV here in The Netherlands this week, on a Dutch version of the History Channel. They ran it four or five times, and I watched it each time. The images just mesmerized me, I could not stop watching. The appeal may have partly been the fact that the images were from my own countries colonial past, but I'm glad to read they grabbed non-Dutch viewers as well. Some of the images speak for themselves, like the images from inside factories, or from native women taking a bath. Other images are very confusing, like the ones of dozens of (Indonesian) men coming off a boat, getting some medical exam and then being marched into a camp, surrounded by barbed wire. Were this prisoners, captured freedom fighters perhaps? Or just soldiers? At moments like that I missed some sort of captioning, explaining what was going on. But I guess it's a deliberate choice of the director, to enhance the exotic feel of the movie. I was really fascinated to see all these 'familiar' Dutch faces there, people who could have been my (great)grandparents. And all these signs in Dutch, and young native children being taught Dutch in schools. It's not that long ago that the Dutch were kicked out (60 years), but somehow all the images felt very alien to me, as if this all happened much longer ago, or that it wasn't my own past I was watching. Very strange. Watch it, if you can, and be amazed.",
         "A more than interesting project. Using documentary footage from the time of silent cinema (I guess most of it comes from the 1920s), the movie shows life in the Dutch East Indies, the country that today is known as Indonesia. There is a lot of exotic footage here, as they show the dutch colonists living the good life in a country club, a dutch missionary teaching the natives how to do the sign of the cross, the hunting of crocodiles, a native baby suckling her mother's teat one second and the next second smoking a cigar. I suppose the general idea of the director is to show the perversity of colonialism through the colonists own footage...though others may see this movie as an overwrought case of post colonial guilt.",
         "\"Mother Dao, the Turtlelike\" is a film in which its director, Dutch-born Vincent Monnikendam, uses found footage taken out of its original context (shot in early 20th century Indonesia while under Dutch colonial rule) and uses it to tell the story of imperialism. The film achieves what it sets out to do, showing us all the ill effects of colonial conquest (disease, forced conversion, etc.) Monnikendam effectively uses his found footage, used as pro-imperialist propaganda during Dutch's rule, juxtaposing its original intent with the cruel and bitterly sad advantage of hindsight. Overall, \"Mother Dao\" is an overlong film that is effective and will last in viewers minds far after they have viewed it.",
         "This cleverly produced selection from over 200 films made of colonial Indonesia has some fascinatingly memorable bits. The crocodile hunt, the shot of the baby smoking a cigarette and sucking his mothers' nipple alternatively and the making and shipping of tobacco. It is clearly a pinko attempt to get you all shocked about colonialism, but ends up being interesting, informative and a contrast to Indonesia today. The poetry read over the scenes is suitably lefty, and not very good, it is black & white. If you have a better film in mind, see it."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Nederlandse Programma Stichting (NPS)"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 86719,
   "movielens": {
      "languages": [
         "Bahasa indonesia",
         "Nederlands"
      ],
      "releaseDate": "1995-04-06",
      "dvdReleaseDate": null,
      "directors": ["Vincent Monnikendam"],
      "runtime": 90,
      "movieId": 86719,
      "title": "Mother Dao, the Turtlelike",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0113840",
      "originalTitle": "Moeder Dao, de schildpadgelijkende",
      "genres": [
         "History",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a span of ninety minutes the film aims to show how the Netherlands administered its colony as a colonial enterprise and what the relations were like at the time. The usual commentary has been omitted and in its place poems and songs in Bahasa Indonesia have been included in a digital sound composition.  In Mother Dao the Turtlelike, the viewer sees how the colonial machinery in the 1920s was implanted in a world so different from Western Europe.",
      "tmdbMovieId": 130272,
      "avgRating": 3.25,
      "releaseYear": "1995",
      "numRatings": 4,
      "posterPath": "/5CltSp1Howc28Z0N7GzzqOF0IGd.jpg"
   }
}