{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0869921",
      "video": false,
      "title": "Nora Roberts' Angels Fall",
      "recommendations": [],
      "backdrop_path": "/dXrs7P8Eoteu2mYTgu3CfNXgr9f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Reese Gilmore",
               "gender": 1,
               "credit_id": "52fe440e9251416c910036eb",
               "name": "Heather Locklear",
               "profile_path": "/ryFO3TlhGi0mddbHECswjzsiF51.jpg",
               "id": 58691,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brody",
               "gender": 2,
               "credit_id": "52fe440e9251416c910036ef",
               "name": "Johnathon Schaech",
               "profile_path": "/kHB3nmTs5e4QK6f2QoIMxlGPeJ0.jpg",
               "id": 51670,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rick Marsden",
               "gender": 2,
               "credit_id": "52fe440e9251416c910036f3",
               "name": "Gary Hudson",
               "profile_path": "/fHnzZ2e0djGf2NZut16YAmOAAbs.jpg",
               "id": 60292,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lo",
               "gender": 2,
               "credit_id": "52fe440e9251416c910036f7",
               "name": "Derek Hamilton",
               "profile_path": "/1btCZXaBFTNx0flxS7Wus8fr1x1.jpg",
               "id": 100372,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Joanie",
               "gender": 1,
               "credit_id": "52fe440e9251416c910036fb",
               "name": "Linda Darlow",
               "profile_path": "/smSg03uwQsyrBMHchfATu2UGGXo.jpg",
               "id": 64678,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Linda Gail",
               "gender": 1,
               "credit_id": "55f987199251416c7a00040c",
               "name": "Lisa Marie Caruk",
               "profile_path": "/9m4eiHcqNMXQnctPne9ZxLOftqa.jpg",
               "id": 81802,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Doc",
               "gender": 0,
               "credit_id": "55f98731c3a368678e002a0b",
               "name": "Len Crowther",
               "profile_path": null,
               "id": 1499020,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Mac Drubber",
               "gender": 0,
               "credit_id": "55f987509251416c7a000418",
               "name": "Pete Seadon",
               "profile_path": "/uj6x8stsQJeFduRB2TqPTmTxw6H.jpg",
               "id": 54636,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440e9251416c91003701",
               "name": "Ralph Hemecker",
               "profile_path": "/sbj6UN5yd9JnjwoS654E2NyBprx.jpg",
               "id": 109537,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe440e9251416c91003707",
               "name": "Nora Roberts",
               "profile_path": null,
               "id": 82620,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe440e9251416c9100370d",
               "name": "Janet Brownell",
               "profile_path": null,
               "id": 85155,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe440e9251416c91003713",
               "name": "Chris Bacon",
               "profile_path": null,
               "id": 71268,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe440e9251416c91003719",
               "name": "Stuart Michael Thomas",
               "profile_path": null,
               "id": 1205375,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5370dda50e0a2647ce01462a",
               "name": "Joel Ransom",
               "profile_path": null,
               "id": 23487,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5370ddb90e0a2647c40150b0",
               "name": "Louis F. Cioffi",
               "profile_path": null,
               "id": 38698,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5370ddc70e0a2647cb014b3a",
               "name": "Andrew Moreau",
               "profile_path": null,
               "id": 1318880,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5370ddfd0e0a2647c40150b8",
               "name": "Carol Case",
               "profile_path": null,
               "id": 1318881,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "55f98602c3a368678b002da0",
               "name": "Tom Cox",
               "profile_path": null,
               "id": 71582,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55f9865cc3a3686782002b32",
               "name": "Salli Newman",
               "profile_path": null,
               "id": 998858,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55f9867292514108120029c0",
               "name": "Murray Ord",
               "profile_path": null,
               "id": 998877,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55f9868992514108120029c8",
               "name": "Jordy Randall",
               "profile_path": null,
               "id": 1316145,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55f9869c925141081b002a2c",
               "name": "Candice Elzinga",
               "profile_path": "/r03Ef6Pc7uwos4Vsg4faajV3Dlq.jpg",
               "id": 63784,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55f986afc3a3686786002785",
               "name": "Rhonda Fisekci",
               "profile_path": null,
               "id": 1314170,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55f986c7c3a368678b002db7",
               "name": "Joanne Jacobsen",
               "profile_path": null,
               "id": 1406582,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "55f986e4c3a368677b00299f",
               "name": "Dug Rotstein",
               "profile_path": null,
               "id": 1340919,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.286721,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 30335,
      "vote_count": 7,
      "budget": 0,
      "overview": "A woman starts a new life in a small Wyoming mountain town after suffering a traumatic event on the other side of the country - but one day, she witnesses a murder in the woods......",
      "similar": [],
      "original_title": "Nora Roberts' Angels Fall",
      "runtime": 90,
      "poster_path": "/fKQdPOzciHX2C0QaC0XBq8zKZ4N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alberta Film Entertainment",
            "id": 3997,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Degeto Film",
            "id": 986,
            "origin_country": ""
         },
         {
            "logo_path": "/6LVLYfZAEQfhJey0MGvhFXdDEK1.png",
            "name": "Lifetime",
            "id": 3431,
            "origin_country": "US"
         }
      ],
      "release_date": "2007-01-26",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ralph Hemecker"],
      "runtime": 90,
      "synopsis": "As the sole survivor of a massacre at the Boston restaurant where she was a chef, it's no wonder the super-skittish Reece Gilmore (Heather Locklear) wants to escape her life. She hits the open road with no destination in mind, desperate for a fresh start. When her car gives out in a picturesque Wyoming town, Reece takes a job at the local diner, hoping to earn enough cash to keep moving. But as she gets to know the townspeople (especially a dashing mystery writer named Brody, played by Johnathon Schaech), she considers putting the past behind her and settling down there until she witnesses a murder while hiking. Now she's traumatized again, and not just by the killing: When the cops check out the crime scene, there is absolutely no evidence of the murder, and everyone doubts her story which leads Reece to question her own sanity. This thriller is sure to keep you guessing, and Heather Locklear is at her dramatic best.",
      "writers": [
         "Janet Brownell",
         "Nora Roberts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0869921/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2Mjc4MzI4NV5BMl5BanBnXkFtZTcwMTkzODM1MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Heather Locklear, Johnathon Schaech, Gary Hudson | See full cast and crew »"],
      "reviews": [
         "Heather Locklear gives a benevolent performance in Angels Fall, which premiered on Lifetime tonight. The story goes like this: After her car breaks down in a Wyoming town, Reese (Locklear) takes a job in a diner to make ends meet. Meanwhile, many of the locals pry into her past and learn she previously witnessed a shooting in Boston. When Reese sees what she believes is a murder, her credibility is called into question on account of her past. Locklear shines here, and she is absolutely beautiful (has she ever had a bad hair day?!). Hunky Johnathon Schaech does a nice job. Competent actors, beautiful locations, professional cinematography, effective score and a solid story, make for an above-average thriller in Norah Robert's Angels Fall. Recommended. 9/10",
         "OK book adaptation - acting was fine but the movie storyline was very choppy and didn't allow for real character development. Although I like Heather Locklear, I would not have cast her in this role. In the novel, Reese is a brunette in her late 20's - a Rachel McAdams-type would have better suited the part. Jonathan Schaech was decent as Brody but again the lack of character development leaves you not really caring about anybody in this movie. Overall the movie leaves out some of the best climax moments in the book and the moments that are captured in the movie seem forced and over the top. Where Nora Roberts' novel draws the reader in with realized characters and steady plot flow, this movie speeds through this sleepy Wyoming town barely giving you a real glimpse into the story itself.",
         "This movie had many of the elements I love in a television film: suspense, intrigue, romance and, believe it or not, location. There were plenty of all in this film. I have never been much of a Heather Locklear fan, but she shined in this film. It opened in a beautiful Wyoming town (whose location was actually the picturesque Alberta, Canada). She appears a bit distraught and nervous as her car breaks down in the town of Angels Fall. As she has a professional culinary background, as well as a need to pay her bills, she immediately procures a job as a cook at the local diner. Her delicious cooking, as well as her mysterious past, quickly make her a town favorite and a subject of gossip. Jonathon Schaech plays a brooding writer who has recently relocated to the town. His initial demeanor, which could be interpreted as menacing, quickly turns to friendship, then romance with Locklear. After she witnesses a murder in the forest and the authorities find no evidence, there are rumors her mental state is deteriorating, compounded by a tragic event in her past. Schaech's character is her only champion, sleuthing the murder with her as well as helping her keep a grip on her sanity.",
         "I have long been a fan of Nora Roberts, but never had the chance to see any of her work retold in a movie. It was definitely worth the wait. I don't think the plot was altered all that much from how the story was originally told, although there were some things added or changed a bit to throw suspicion around. The parts that were cut from the story(understandably) did not detract from the movie version - both were excellent. I could identify with both of the lead actors as playing their characters straight from the book. Johnathon Schaech was especially good as Brody and was well matched with Heather Locklear as Reese. The other characters fit in almost as well, with some minor differences that I had pictured in my mind. But, of course, everyone sees things a bit differently. I hope the next three movies are done as well as this one was.",
         "I am an avid Nora Robert's fan, so I was pretty happy the movie stayed close to the book. Many times when a book is changed to movie the soul of the book is lost, I didn't find this to be the case here. I didn't really like the flashback scenes, I found them to be too chaotic and hard to follow most of the time. Maybe this time could have been better spent giving some more time with Reese and Joni. Their dynamics and eventual friendship, in the book, enables healing for Reese. Without Brody's love and Joni's friendship would she have been able to come so far in such a short time? I don't think so! Regarding the cast: Johnathon Schaech, WOW! Can you say HOTTIE!!! He is a perfect Brody, just cute enough to be wanted by women, just rugged enough to be like by men. However; Reese is suppose to be a young woman beginning her career when her life changing event occurred, therefore: I hate to say it, but I do believe that Heather Locklear, while still beautiful, is too old for the part of Reese.",
         "where the faces are different, but the underlying message is still the same. This is a brand-new movie, and yet I've seen it a thousand times before. The last fifteen minutes of it are as predictable as a sunrise, right from the opening credits. Can the Hollywood producers not come up with a different idea, a new ending for their so called \"thriller\"s? Do they still believe that this type of ending has any thrill at all, when it's been done so many times? I'm not familiar with Nora Roberts as a writer, but this looks like it could well have been written by Mary Higgins Clark, or by me, for that matter. I wouldn't rate this higher than 4 on the Richter scale.",
         "I just watched Angels Falls this weekend. I thought it was a terrible movie - watchable but just not good. I'm sure the book was way better as NR is a fantastic writer, but I did not really get drawn into sympathy with Heather Locklear's character. I think some of that was her performance. I can't criticize it technically. She obviously followed the script and her direction, but there was a depth of feeling missing. I knew she was traumatized because she turned her head a lot and I was told - over and over again - that she was, she even had some facial expressions that carefully didn't line her beautiful face, but there was no depth of emotion in her being or her eyes. Her grooming was also an issue. She always looked perfectly groomed, not like someone who had been on the run for a year in her car. I laughed out loud when the other character told her she needed a day of beauty because she looked haggard - she didn't - not even when she was sleeping in the tub!! JS, the lead actor, was also pretty good, but he too seemed stiff and mechanical in going through his part. I know he was supposed to be into the lead character, but he was not directed well enough or didn't act well enough to pull off his dual duty as a suspect and catalyst for the mystery. He was just a pretty face. In fact, all of the characters, except for the doctor, the sheriff and the Lothario son seemed like people reciting lines rather than real to the story. Especially the young blond waitress who actually looked like an actress waiting tables trying to be noticed by a casting agent, except she's supposed to be a country girl wanting to marry a local boy and not in LA. She also didn't deliver any of her lines appropriately. I also had issue with the lighting sometimes. It seemed too dark. The sets, also, seemed to, well, clean and pristine to be realistic. Picking tacky colors does not by itself make for authenticity. Neither does telling me that the place needs a paint job when it doesn't particularly look like it. I don't know why they kept mentioning that, it didn't enhance the later need to actually paint the walls - without telling the cops necessary evidence. The script was another problem here. Nora Roberts is a poet. Her writing is amazing and her characters vivid and compelling. The stories are also carefully crafted. I'm sure the book itself works well as a mystery. Here, the story was obviously edited to fit the format and the running time. As a result, I felt the story was choppy and lacking in depth. Some of the things that could have been startling were too abrupt and some of the facts were shoved down our throats in an unconvincing way and didn't add anything to the story. For instance, that the blond waitress wanted the Lothario added nothing to the mystery and it's constant repetition didn't work to make me really believe or care. I only knew they wanted each other because the mother kept whinging on about it while talking about her son's sex life (ewwww, meanwhile, the actors barely bothered to keep up the pretense, and, like I said, it didn't add anything to the mystery because it was the mother who fought back, badly, against her son being a suspect and not the waitress - who could have done a good job at that since she was befriending Heather's character. Given how wonderful Nora's writing is, this was a big disappointment.",
         "I've seen some of the other Nora Roberts' novels that were made into movies. But, this is the first time that I've read the book and watched the movie. While the book did draw me in and kept me reading, the movie just didn't pull at me. I felt that the movie contained a lot of teasers, but didn't expand upon them. One example was Reese telling Joanie that there needs to be fresh herbs. The movie ends with us not knowing whether Joanie got those fresh herbs. Personally, I thought Heather Locklear was too old to play the part of Reese Gilmore. I like Ms. Locklear and think she is a good actress when she is cast in the right role: Sammy Jo Dean Carrington in Dynasty, one of her best characters. Understanding that this movie was a made for TV movie and had to work within time constraints, it could have been presented differently and still told the story in a way that would have kept my interest. I would suggest that if you haven't read the book yet, don't read the book until after you've watched the movie.",
         "I thought Lifetime did a decent job adapting this fantastic novel into a movie. But come on, Heather Locklear? Isn't she a little old for the leading role (and the leading man)? I really enjoyed the Joanie character, but I would have liked to see more of Mac Drubber and Linda-gail. The setting of this film was superb, I loved all the scenic views. But again, I found myself wishing for more. I felt like this film was lacking the relationship between the characters. We probably could have seen more of the \"crazy\" side of Reece. I was able to watch the whole movie, but the casting was pretty poor. Hopefully the next Nora Roberts film will be better.",
         "If you read the book you can tell within the first 10-15 minutes of the movie that it is going to suck. So to help keep my ranting down I will list the issues I have with the movie rather than go into deep detail. 1. Reece is suppose to be in her early twenties and not her forties. It wouldn't be so bad if Ms. Locklear could have at least pass off as in her mid thirties and her botox didn't make her face look swollen. Swollen face does not equal looking like you are 20-some years younger. 2. Reece has PTSD, tendencies and is OCD. When being questioned about the cook job she is smiling some time, flippant about having her car break down and can't leave and too perky. When questioned about how long she'd been on the road she is annoyed. Never once did she come across nervous during the \"interview\" nor when she got behind the grill. She's suppose to be uneasy and anxious. 3. Movie shows Reece sleeping in the bathtub with the door closed. Reece has issues with small space. She was traumatized by being shot inside a closet so doesn't like small spaces. There is a point in the book where she is taking a bubble bath and said other times she had tried with the door locked but always ended up scrambling out of the tub to open the door. When she has the door open can't be in there for that long. Even when she showers she has to recite multiplications to get through being in there. With all that said, there is no way in hell she would sleep in the bathroom with the door shut. 4. Joanie is way too nice/soft spoken. Joanie IS a nice person but she doesn't use kid gloves, is rough spoken, straight to the point and pretty much is the kind of \"tough love\" person. The kind that will be like \"that sucks, i am really sorry that happened but it can help make you stronger so get on with it\". She won't pity you but push/help you move on. 5. The \"panic attack\" that she had in the store never happened. That was royally stupid, dumb and definitely a WTF moment. In the book she was happy and excited about buying stuff for a place she was going to live in. So if you read the book and see that BS in the movie it will definitely be a \"Thats effing retarded!\" And then Brody WALKING the box of stuff to her place. I understand they did that to cut time out and jumble their meeting, the backfire Reece thought was gun and her moving into the pace together but still it was stupid. In the book Brody got roped into helping her bring her stuff to the apartment is because he had a car and she had more than just one box of stuff. I won't even start in on how bad Locklear's acting was on trying to look terrified of thinking the sound of a car backfire was a shot gun. The movie plays down Reece's fears and what she was going through. That right there ruined and voided important parts of the story. The story itself isn't just a love murder story but also to see how Reece over comes her battle with the tragedy in her past. 6. When Reece was on the cliff seeing the murder taking place she never tried to run to them to stop the murder in the book. In the movie she saw it happening, without thinking starts to go towards them, almost falling off the cliff, falls down to her backwards, has a flash back, gets back up to see them suddenly gone, stumbles/runs down the trail, out of now where Brody scares her. In the book Reece ran into Brody, before seeing the murder, on the trail while she was hiking up. Brody's reason for being there, he was doing research since he was \"killing someone up there later\" in his book. Reece goes to the cliff sees a guy strangle a girl till she stops moving, turns around, runs back down the path and literally runs into Brody on the trail rather than him coming out of nowhere. It's only when she is stumbling back down the trail, before she ran into Brody the second time, that she starts to get what she just saw and her memory mixing together. She is indifferent in the movie saying \"She's dead. There is nothing we can do for her now\" and Brody is the one who says to call the sheriff. In the book she is hysterical and wants to get help. BIG difference in attitude. The little snip in the movie after the sheriff left seemed ridiculously stupid considering the way she was before. In the book it makes sense since she was scared, upset and wanted to get help. In the movie, nope, it was retarded. Honestly, the list goes on and on but we are limited on how many words we can put in here. So these were just the major complaints that affect the whole movie and those were in just 30 minutes into it. If I added the smaller ones and the other issues from the rest of the movie, it would never fit here. My recommendation, don't watch the movie and read the book. If you can't read the book then listen to the unabridged audio book. It is almost 15 hours long but worth the time where the movie isn't worth the botox Heather Locklear use to try to look younger."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Alberta Film Entertainment",
         "Degeto Film",
         "Lifetime Television"
      ],
      "summaries": [
         "Running out of transportation - and financial means, when her car breaks down in a Rockies town, former Boston chef Reese Gilmore accepts a diner cook's job at least until she can afford the spare parts which may takes weeks to arrive anyway. She resist the owner's womanizing son, handsome romantic ranch-hand Lohario 'Lo', but gets on kissing terms with grumpy recluse author and former city reporter Brody. She needs help to and after reporting to sheriff Rick Marsden she vaguely saw an apparent murder. No woman's corps is found, and her own psychiatric past is revealed.",
         "A chef moves to a small town in Wyoming after her Boston restaurant is shut down because of a fatal shooting."
      ],
      "budget": 0
   },
   "movielensId": 86811,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-26",
      "dvdReleaseDate": null,
      "directors": ["Ralph Hemecker"],
      "runtime": 90,
      "movieId": 86811,
      "title": "Nora Roberts' Angels Fall",
      "mpaa": "",
      "actors": [
         "Heather Locklear",
         "Johnathon Schaech",
         "Gary Hudson",
         "Derek Hamilton",
         "Linda Darlow",
         "Lisa Marie Caruk",
         "Len Crowther",
         "Pete Seadon"
      ],
      "imdbMovieId": "0869921",
      "originalTitle": "Nora Roberts' Angels Fall",
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman starts a new life in a small Wyoming mountain town after suffering a traumatic event on the other side of the country - but one day, she witnesses a murder in the woods......",
      "tmdbMovieId": 30335,
      "avgRating": 3,
      "releaseYear": "2007",
      "numRatings": 7,
      "posterPath": "/fKQdPOzciHX2C0QaC0XBq8zKZ4N.jpg"
   }
}