{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bootlegger",
            "id": 5419
         },
         {
            "name": "reporter",
            "id": 12193
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0019304",
      "video": false,
      "title": "The Racket",
      "recommendations": [
         157343,
         86087,
         86232,
         131455,
         167235,
         119564,
         13847,
         108224,
         43600,
         33001,
         84099,
         222786,
         37215,
         109435,
         20675,
         66701,
         31678,
         179818,
         43689,
         43597
      ],
      "backdrop_path": "/ebmN9dAB5dWQTgZMu5MmlmAwfaT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Police Captain James McQuigg",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e058177",
               "name": "Thomas Meighan",
               "profile_path": "/f00ZeOS43NQMqW9IIHE9azL1Wj4.jpg",
               "id": 98970,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Nick Scarsi",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e05817b",
               "name": "Louis Wolheim",
               "profile_path": "/j74Kja2i4V2mhuPFFWOQQZteI4a.jpg",
               "id": 2010,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Helen Hayes",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e05817f",
               "name": "Marie Prevost",
               "profile_path": "/5wtvGJfdcctPHOk3Qfgd3CFc54b.jpg",
               "id": 98971,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Patrolman Johnson (as Pat Collins)",
               "gender": 0,
               "credit_id": "52fe4565c3a368484e058183",
               "name": "G. Pat Collins",
               "profile_path": "/imT0COfQBYrJOWp53rHbREJNLrz.jpg",
               "id": 98972,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Spike Corcoran",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e058187",
               "name": "Henry Sedley",
               "profile_path": null,
               "id": 98976,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Joe Scarsi (as George Stone)",
               "gender": 2,
               "credit_id": "52fe4565c3a368484e05818b",
               "name": "George E. Stone",
               "profile_path": "/aDX2se7zXTrwq3YbYnrZZFMwIFS.jpg",
               "id": 3163,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e058155",
               "name": "Lewis Milestone",
               "profile_path": "/qBEYKHYyjbMoaJBZtQgVe6fVa5v.jpg",
               "id": 2000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e05815b",
               "name": "Bartlett Cormack",
               "profile_path": null,
               "id": 94298,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e058161",
               "name": "Bartlett Cormack",
               "profile_path": null,
               "id": 94298,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4565c3a368484e058167",
               "name": "Howard Hughes",
               "profile_path": "/v3c00dpgMKMN5Pigg0XWzVt2vWE.jpg",
               "id": 13348,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4565c3a368484e05816d",
               "name": "Robert Israel",
               "profile_path": null,
               "id": 11524,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4565c3a368484e058173",
               "name": "Tony Gaudio",
               "profile_path": null,
               "id": 8713,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5646b6b7c3a368260c001996",
               "name": "Eddie Adamson",
               "profile_path": null,
               "id": 1368301,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5646b6c09251413acf0019f9",
               "name": "Julian Boone Fleming",
               "profile_path": null,
               "id": 1535876,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5646b6c89251413ad700199f",
               "name": "Nate Watt",
               "profile_path": null,
               "id": 144397,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.593629,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27777,
      "vote_count": 5,
      "budget": 0,
      "overview": "In this silent film, a renegade police captain sets out to catch a sadistic mob boss.",
      "similar": [
         19,
         11615,
         634,
         1949,
         74643,
         496,
         38055,
         81003,
         460793,
         17578,
         82023,
         1372,
         10774,
         4234,
         3078,
         458663,
         2637,
         455661,
         9008,
         9662
      ],
      "original_title": "The Racket",
      "runtime": 84,
      "poster_path": "/aM52f8uErYzUyZ9rTcAyCbC3nbL.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Caddo Company",
            "id": 13866,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1928-11-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lewis Milestone"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Bartlett Cormack",
         "Bartlett Cormack"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019304/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5Mzc0MDY2N15BMl5BanBnXkFtZTgwMTg4MjQ3NDE@._V1._CR21,21,288,461_SX214_AL_.jpg",
      "actors": ["Stars: Thomas Meighan, Louis Wolheim, Marie Prevost | See full cast and crew »"],
      "reviews": [
         "Sadly this film was made available long years (like 50) after the giants of the early gangster films were available---Little Cesear and The Public Enemy,so it missed the true acclaim it probably deserves. Being made during Prohibition, and during the less \"glamourous\" studio period (but with an excellent director, fast paced script and great supporting cast) it has the immediate feel of the time---when the policeman hero is exiled to the country it IS the country, and the character actors shine here--especially the incandescent and tragic Marie Prevost as the platinum blonde chanteuse, Helen Hayes. She is absolutely wonderful as a complete jazz baby flinging herself into the arms of the nearest well heeled heel available, her desperation clearly visible under the surface. This performance is subtle in it's (Mae West) undertones, but she anticipates the bright gaudy generous hearted vulgarity of Jean Harlow by several years. She has a huge range with her hideous fox fur collared cape, her cigarette, and her bits of business with her props--she has the stage presence of her character's name Helen Hayes, but she is much more naughty and fun to watch. She cynically analyzes the lead villain's fear of women, and stands up to him, leveraging his fear in the face of his men, and lays her neck on the line. At the same time, she desperately digs for gold, playing hard to get with the gangster's weak spot, his younger, ratty brother. (George Stone in an early role). The scene where she rips off her \"act\" costume, and jumps on an upright piano and has the musician's wheel her over to the gangster's brother's \"birthday party\" is pure gold. How sad that she died so horribly in real life, but how wonderful that her performance is preserved here in all it's splendor! While Thomas Meighan is the same noble stiff as a board hero of DeMille's society matrons movies of the l920s he also shows range in a \"good cop\" role with a noir twist at the end, making this one of the first contemporary gangster movies. George E Stone, who would go on to play everyone's favorite rat for the next 40 years is here in a juvenile lead, scummy and detestible as ever, and the perpetually bombed and wisecracking reporter Skeets Gallegar gets all the fast paced and best lines. God Bless Ted Turner for not letting this one get lost! Cannot wait for it to come out on DVD for all true noir and gangster film archaeologist's to enjoy! We can only wonder what a kick it would be in film histories of today if this had been available at the same time as The Public Enemy , Little Ceasar and other seminal works. If you are a \"Merry Gangster Historian\" go for it!",
         "Lewis Milestone performed one of his best directing jobs with \"The Racket.\" He had a superior cast in what, in a later talkie, might be just a mediocre script, but taken in context, \"The Racket\" is a great movie. Watch the byplay during the funeral, for example. Milestone and his editors and special effects people create some excellent visual effects to complement a cast that charms even in the role of slimy bad guy. Minor characters still got their chances to shine in the spotlight and even the non-speaking -- well, of course all the characters were non-speaking in one sense -- the un-named characters whose job was to look menacing or even just interested in the goings-on, all stood out. Frankly this film was a surprise to me -- not that it was so good, but that I had had no knowledge of it beforehand. To come so early in the career of so many of the people connected with it, notably Howard Hughes, who had the (to me) strange title of \"presenter,\" this film is a stand-out. Robert Israel, who wrote the music for this revival, is fast becoming one of the great composers of the modern era. All the people who are responsible for this film's recent revival deserve the thanks of film lovers as well as film historians. \"The Racket\" is one to see again.",
         "This has been resurrected courtesy of Turner Classic Movies, the University of Nevada, et al. (in pretty good shape, too) in a nicely done digital restoration, complete with a good score. If you get a chance to see it, you might want to take a chance: in spite of it being a silent (I consider that a handicap), it's an entertaining film, with a lot to like. There's fine acting, especially by Louis Wolheim as the main gangster, whose face is so expressive you don't miss the sound as long as he's on screen. Marie Prevost and 'Skeets' Gallagher turn in solid supporting performances. There's clever dialogue: very good given the constraints silent films inherently have. Personally, I thought the best feature is the wonderful cinematography. Rarely does the camera technique look dated or technically primitive, and many scenes are as well done as any since. The use of dissolves and interesting angles was delightful, and there are even a couple (surprising, to me) attempts at zooms that come off alright. Obviously a good director/cinematographer team. The overall look of the film is fresh and clear. The story is pretty entertaining and the characters are brought to life, making me glad this film was brought back to life as well.",
         "I found this a very enjoyable early crime drama. Students of the genre will want to compare this to \"Little Caesar\" and/or \"The Front Page\". Transitions within scenes and from one scene to another flow better in \"The Racket\" than in many other silent films. I agree with earlier comments about the new scoring. There is too much brass and too much forte. The film itself is about 83 minutes long, much longer than we thought during the 76 years that it was out of circulation. The restoration job on the film is one of the best that I have seen, especially for a film as old as this one is. I hope it is released soon on DVD.",
         "I am watching it right now on TCM. It has been digitally restored and a new soundtrack added. The music is excellent. I was sure it was 'period' until I saw the credits, which are rolling as I type. Marie Prevost is amazing, she dominates every scene in which she appears. Her expressions and body language are astounding. It helps you understand what silent movie acting is all about. This was a Howard Hughes production. I believe the picture is longer than 60 minutes, though. The University of Nevada at Las Vegas is credited with this restoration project. They did a great job. I love this movie.",
         "Like TWO ARABIAN KNIGHTS and THE MATING CALL, this film has now been restored by UNLV (which found the prints of these films once thought lost in an archive of producer Howard Hughes' possessions) in cooperation with Flicker Alley. Lewis Milestone, who had just directed TWO ARABIAN KNIGHTS for Hughes, brought much of the same sense of friendly rivalry between the two leads to this picture, as well as the same co-star, Louis Wolheim. All the elements of many a subsequent gangster picture are here: The close personal relationship between the antagonists (gang boss Wolheim and cop Thomas Meighan); the kid brother whom the gangster wants to shelter from the rackets (George E. Stone, soon to appear in LITTLE CAESAR and many another gangster flick), but who runs afoul of a tough little chanteuse (Marie Prevost). Mob bosses cavorting in lavish nightclubs, overwrought gangland funerals, crooked politicians, a wet-behind-the-ears reporter with two old pros as a chorus: it's all here. Enough of the action takes place in a run-down precinct house to belie the story's stage origins, but there's plenty of action, including a shootout between two rival gangs, to keep things hopping.",
         "Tough cop Thomas Meighan (as James McQuigg) versus underworld kingpin Louis Wolheim (as Nick Scarsi). In a subplot, blonde gold-digger Marie Prevost (as Helen Hayes) pursues Mr. Wolheim's \"bad boy\" brother George Stone (as Joe Scarsi). This Howard Hughes piloted film was considered for \"Best Production\" at the first Academy Awards, as \"the most outstanding motion picture considering all elements that contribute to a picture's greatness.\" Although it understandably lost to \"Wings\", it does posses elements of \"greatness\". Mr. Meighan, one of the biggest and most beloved stars of the era, brings considerable presence to his role; with a script that offers him surprisingly few opportunities for characterization. Wolheim and director Lewis Milestone are always a fun to watch match. Ms. Prevost and the supporting cast do their best with the \"love story\" and gangland activities. And, the production values are high. If only more focus and characterization were on the personal stories and conflicts concerning McQuigg and Scarsi! Curiously hesitant to show much depth; still, \"The Racket\" exposes, while inadvertently glamorizing, the gangster lifestyle. ******* The Racket (6/30/28) Lewis Milestone ~ Thomas Meighan, Louis Wolheim, Marie Prevost",
         "As it has just been recovered and digitized by University of Nevada at Las Vegas and Turner Classic Movies along with the rest of Howard Hughes' classic silent movies, the people of today will finally get to see this great movie. A movie about prohibition and the mafia, made at the same time it was all going on. Idealizing the mafia before the Godfather was even thought of. Although it may be silent, it shows detail on the corruption of the mob with the police force and government officials, and not to mention the costumes of the film were obviously fitting for the time period, and used common \"gangster\" themes, such as the pinstriped suit with fedora and the cigar. The production quality is very good for the time, with what equipment they had to work with. The stereotypical choppiness of the frames from 20's movies rarely occurs, except when there is much fast action. Turner also did a good job digitizing this, as the film quality is still high. I recommend that people see this, albeit short, it gives a good idea about the movies of the times. Along with \"Two Arabian Nights\", also produced by Howard Hughes.",
         "The Racket proved me wrong about a certain assumption I had always maintained that gangster films came really alive once sound came in because the snappy dialog of a Cagney, Bogart, or Robinson film was integral to the success. This film could hold its own with any of the sound films of the genre. It originated on Broadway as a three act play all taking place in a police station that is captained by Thomas Meighan who is a doggedly honest cop in a city that is systemically corrupt. It's gotten real personal between Meighan and gangland boss Louis Wolheim. Wolheim is a swaggering arrogant sort who's even got his superiors out of joint with him for his quick resort to violence. Wolheim is a misanthropic sort who does not like women, no gangster molls for him. He has a weakness though, his spoiled rotten younger brother George E. Stone who has fallen big time for torch singing Marie Prevost. All that brings Wolheim down eventually. Seeing Prevost on top of an upright piano she is obviously basing her character on Helen Morgan. The Racket came to the screen a tad too early, some musical numbers would have been good and might have happened if the film had been done even a few months later. Maybe even Morgan herself might have done the part. As for Meighan his character is clearly based on Lewis J. Valentine who was a model captain who during the Roaring Twenties maintained his honesty in a corrupt era. Eventually Fiorello LaGuardia made him New York City's police commissioner and he was probably the best that ever filled that job. But that was in the future. Howard Hughes produced this for Paramount and when he took over RKO he remade it with Robert Mitchum, Robert Ryan, and Lizabeth Scott. It's a film that I like very much so it was a double treat for me to see this version of the same story. I'd recommend seeing both back to back. And The Racket was up for an Oscar for Best Picture in the year of the first ceremonies. It lost to another Paramount film Wings. The Racket proves that silent films could make good gangster films.",
         "If you've read some of my other comments, you'll know that I'm in the middle of watching all movies that received Academy Award nominations in the Academy's very first year, 1927-28. \"The Racket\" was one of three nominees for Best Picture, along with \"Seventh Heaven\" and \"Wings,\" and though it's by far the least ambitious and \"important\" of the three, it's the one that I found to be most satisfying. It's a quick, speedy little gangster thriller from Lewis Milestone about one committed cop's determination to see a crime lord brought to justice. It was based on a play, but Milestone does a terrific job of keeping things cinematic -- this movie moves, and that plus the fact that it's not long to begin with makes its running time go racing by. Thomas Meighan, who apparently was a big name at the time but who is unfamiliar to me, plays the cop, while Louis Wolheim plays the gangster. Both are terrific, but both are upstaged, as is everyone else, by Marie Prevost (playing a character named, of all things, Helen Hayes) as surely one of the first memorable gangster molls. She gets a really good pre-Code line (if silent films can be said to have lines) about babies and storks that gives you one of those \"could they really say things like that back then\" moments that pre-Code movies always have. As far as I know, this movie isn't available anywhere for legitimate viewing. I had to see it the same way I saw \"Wings,\" by watching it in pieces on a site whose name I won't mention. Better catch it soon before someone takes it down. Grade: A"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["The Caddo Company"],
      "summaries": [
         "An honest police captain named McQuigg becomes a tough rival to a powerful bootlegger named Scarsi, even though McQuigg's pinches never stick because Scarsi and his organization control the corrupt politicians and judges. When Scarsi can't scare McQuigg off, he gets him transferred to a quiet police precinct in the suburbs, but McQuigg continues their war of words via a pair of wisecracking newspaper reporters. Then McQuigg catches a huge break when Scarsi's younger brother gets picked up for a hit and run accident in his precinct, putting in motion a complex plan to bring down the mobster using the reporters, a nightclub singing gold digger, the upcoming elections and Scari's own organization.",
         "An honest police captain vows to bring down a powerful bootlegger who is protected by corrupt politicians and judges."
      ],
      "budget": 0
   },
   "movielensId": 86858,
   "movielens": {
      "languages": [""],
      "releaseDate": "1928-11-01",
      "dvdReleaseDate": null,
      "directors": ["Lewis Milestone"],
      "runtime": 84,
      "movieId": 86858,
      "title": "The Racket",
      "mpaa": "",
      "actors": [
         "Thomas Meighan",
         "Louis Wolheim",
         "Marie Prevost",
         "G. Pat Collins",
         "Henry Sedley",
         "George E. Stone"
      ],
      "imdbMovieId": "0019304",
      "originalTitle": "The Racket",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In this silent film, a renegade police captain sets out to catch a sadistic mob boss.",
      "tmdbMovieId": 27777,
      "avgRating": 3.375,
      "releaseYear": "1928",
      "numRatings": 4,
      "posterPath": "/aM52f8uErYzUyZ9rTcAyCbC3nbL.jpg"
   }
}