{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "god",
         "id": 9649
      }],
      "imdb_id": "tt1326954",
      "video": false,
      "title": "Oh My God",
      "recommendations": [],
      "backdrop_path": "/191uFGPwTGQAcONNEWl553Q6NPE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46eb9251416c9106419f",
               "name": "Hugh Jackman",
               "profile_path": "/dFbNlPpiEPupTAlNVNh5vrxBU1h.jpg",
               "id": 6968,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46eb9251416c910641a3",
               "name": "Seal",
               "profile_path": "/giV21X01UFa6YjEbgwnbXcGmMuK.jpg",
               "id": 131666,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46eb9251416c9106419b",
            "name": "Peter Rodger",
            "profile_path": null,
            "id": 131652,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.611373,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38931,
      "vote_count": 4,
      "budget": 0,
      "overview": "\"Oh My God\" asks people from all walks of life, from celebrities, to the religious, to atheists and the common Man - the question - \"What is God?\"",
      "similar": [
         310,
         9059,
         33076,
         1023,
         335778,
         583,
         2698,
         145,
         5876,
         5255,
         866,
         85,
         2454,
         605,
         279,
         604,
         9693,
         2675,
         32657,
         147441
      ],
      "original_title": "Oh My God",
      "runtime": 93,
      "poster_path": "/yiCGrnjCqunxk1SS63nAPFdtGsM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Syzygy Productions",
            "id": 6264,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rodger Pictures",
            "id": 73340,
            "origin_country": ""
         }
      ],
      "release_date": "2009-11-13",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "Did God create Man or did Man create God?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Rodger"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Peter Rodger"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1326954/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNjI4NjkxMF5BMl5BanBnXkFtZTcwMDMxNDUxMg@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Rodger, Hugh Jackman, Ringo Starr | See full cast and crew »"],
      "reviews": [
         "I don't know why the rating for \"Oh My God\" is so low on IMDb, it shouldn't be. What Peter Rodger has created is a beautiful documentary about humanity and our beliefs. He travels from India to England to Israel/Palestine asking everyone \"What is God?\" There are breathtaking scenes and moments; the gorgeous mountains of 'Little Tibet' to inspiring dances by the indigenous to cancer patients being so selfless. All taking place with great dialogue and a magnificent musical score comprised from moments within the film itself. This movie is not anti-religious or a converting film, its all about self-discovery, what do YOU believe? Its to allow viewers to experience what others believe, to hear their story and discover their religion. If you want to be inspired and moved and learn about humanity, religion and yourself definitely watch this film.",
         "I have been an atheist for quite some time and when I looked at the documentary and its question of what is God, it got me quite interested. However, this movie was truly remarkable: it discussed the notion of God as well as complications of who God is and yet, tells what God may be. The one thing that truly amazed me was the scenery and the serene atmosphere. It captivated me beyond my wildest dreams, be it the extreme snow-covered mountains of the Himalayas, or the lush, mountainside areas of North America. The documentary explores many countries and we are given a basic knowledge of who God really is in different cultures. For some it may be offering a sacrifice to please a deity and for some, it is a \"guidance from above\", as stated by a Mexican. The whole Israel-Palestine issue and the concerning fact of the whole Muslim-extremists issue, which was quite interesting, are also mentioned here. The cancer segment gave tears to my eyes. For those who don't believe in a God may feel outraged-- it may influence the person into believing something that doesn't exist. However, we are encouraged to make our own opinion of God: he could very well \"represent that which we all are.\" In the end, the documentary tries to convey one thing to us: we should all be united as one. We can't be divided by boundaries if we are to live in an utopia society. If you're religious, then you should use God as that uniting force and embrace one another as neighbors, not fear that calling God in some other religion is offensive. If you don't believe in a superior power, that's even better-- believe in peace and love if we are to achieve a harmonious world. \"If a person did one kind act to another each day, the world would be a different place\" - Chandhi Duke Heffner. That's what life should be about.",
         "Sometimes it seems as if there are as many concepts of God as there are people on the planet. And if there really is just one true God, why do people have such a widely varied and often contradictory view of Him/Her/It? Curious about this phenomenon, filmmaker Peter Rodger set out on a tour of the world to try to find some answers to some age-old questions: does God exist, and, if he does, what is He like, why does He allow suffering, and why do people often hate and kill one another in His name? Rodger's journey takes him to places as widely disparate as Texas, New Orleans, India, Australia, Bali, Tibet, Kenya, Mexico, Guatemala, Japan, the politically-charged Middle East, and even what appears to be a Jihadist hideout or training camp. The result is \"Oh My God,\" an interesting, though less-than-penetrating, documentary that provides a panoramic view of religion and faith-based belief systems across the planet. Rodger interviews religious figures, charity workers, celebrities - Hugh Jackman, David Copperfield, Baz Luhrman, Seal, Ringo Starr, among them - and just plain folk from all walks of life and belief systems. He speaks with Catholics, Protestants, fundamentalist Christians, Jews, Muslims, Hindus, Buddhists, Native Americans, Australian aborigines, Druids, agnostics, atheists - you name it, he covers pretty much the entire spectrum of faiths (and non-faiths) that exist in the world today (and a few, like the Mayans,' that long ago faded into the fog of history). One of the things Rodger discovers is that religion is often just a form of tribalism wherein different groups fight against one another for power and gain - which may account for why humans seem obsessed with the \"my god can beat up your god\" line of thinking. Religion as Big Business, religion as an opiate for the masses, religion as a means of confronting the reality of our own mortality - all these get played out in the course of the movie. And Rodger is not afraid to call BS on someone when he feels it's justified - i.e., a young priest at the Vatican justifying the Church's opulent lifestyle in a world where thousands of people die of starvation every day, a Muslim cleric claiming all non Muslims are going to hell but not being able to find a single verse in the Koran to buttress his point. Rodger gets no real answers to his original questions, of course, though he does seem to favor Eastern and indigenous-type views of God and religion over more formalized Western ones. But, then, do we really except to get any answers to questions that have perplexed and eluded the human race from time immemorial? Of course we don't and, thus, \"Oh My God\" is primarily of interest as an anthropological study of Man's myriad ways of coping with the Great Unknown - and that will just have to suffice for the time being.",
         "Just watched the film and I must say Peter Rodger did an excellent job on this movie. It was enlightening to see how all the different believers of various religions interpreted just what is the \"Almighty God.\" From start to finish Rodgers explores the world's religions and gives each believer a chance to explain what is God to them. He is fair to all and rather than press each figure with condescending questions, Rodgers lets each person make their case and all did quite well, albeit one... Some may say there was no solid direction by the film maker and that a perfect conclusion could not be drawn from the film. Don't expect to get a definitive answer to the ever-so-pestering question of what is God? Rather, keep an open-mind and hopefully you'll better understand why God may or may not exist and how it may not even matter!",
         "The summaries and the plots I read about this \"documentary\" made me expect something better; I was not expecting a nice anti-religious movie such as \"Religulous\" or \"Zeitgeist\" but I think there should at least be a main idea in a movie; it could have been more respectful to the above-the-average watcher to give a thesis such as god is there or it's all fake. Instead, the movie consists of some people answering what is god such as \"God is love\", \"God is money\". Most of these \"interviews\" look real fake and not sincere. Especially the religious officials look as if they memorized their part and their faces gives the impression they don't believe what they say. The fact of Hinduism with many gods is neglected where a Hindu girl is saying \"God is one\". I feel like \"Come on man, just Google it before you direct a movie!\" The last part is the double-standard of the movie against Islam. Even though, it shows respect to all the religions when it's Islam, there is attacks against it trying to show it as an aggressive and wild religion where Mohammed is the worst of all prophets. Personally, I really wouldn't mind but it really looks quite unfair when the director's perspective to even tribal religions are fair and earnest. To sum it up, it's a terrible movie. The only good part is the nicely shot scenes from different countries. Stay away unless you have an hour and a half to waste."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Rodger Pictures",
         "Syzygy Productions"
      ],
      "summaries": ["People from all walks of life are asked \"What is God?\""],
      "budget": 1250000
   },
   "movielensId": 86977,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-11-13",
      "dvdReleaseDate": null,
      "directors": ["Peter Rodger"],
      "runtime": 93,
      "movieId": 86977,
      "title": "Oh My God",
      "mpaa": "PG",
      "actors": [
         "Hugh Jackman",
         "Seal"
      ],
      "imdbMovieId": "1326954",
      "originalTitle": "Oh My God",
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "\"Oh My God\" asks people from all walks of life, from celebrities, to the religious, to atheists and the common Man - the question - \"What is God?\"",
      "tmdbMovieId": 38931,
      "avgRating": 2.5,
      "releaseYear": "2009",
      "numRatings": 2,
      "posterPath": "/yiCGrnjCqunxk1SS63nAPFdtGsM.jpg"
   }
}