{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "cartoonist",
            "id": 202399
         }
      ],
      "imdb_id": "tt0099623",
      "video": false,
      "title": "Funny About Love",
      "recommendations": [
         42176,
         32035,
         118991,
         24073,
         58028,
         36709
      ],
      "backdrop_path": "/mSyrGQOUTaKiSLca1Fmc0FQVIQY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Duffy Bergman",
               "gender": 2,
               "credit_id": "52fe46fd9251416c910668ed",
               "name": "Gene Wilder",
               "profile_path": "/7xQjm2yrqAVy4yPjGemWseo1Ovi.jpg",
               "id": 3460,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Meg Lloyd Bergman",
               "gender": 1,
               "credit_id": "52fe46fd9251416c910668f1",
               "name": "Christine Lahti",
               "profile_path": "/oi8w5nVX1yBiP02uR9qGzD41yxL.jpg",
               "id": 77133,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Daphne",
               "gender": 1,
               "credit_id": "52fe46fd9251416c910668fb",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "E.T.",
               "gender": 2,
               "credit_id": "52fe46fd9251416c910668ff",
               "name": "Robert Prosky",
               "profile_path": "/9xpt96AOur6MmLIEaYhRiCQLIOE.jpg",
               "id": 10360,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hugo",
               "gender": 2,
               "credit_id": "52fe46fd9251416c91066903",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe46fd9251416c91066907",
               "name": "Wendie Malick",
               "profile_path": "/w3kIoXuvYDDp2fTTzy4Uq8KZSM2.jpg",
               "id": 61980,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Adele",
               "gender": 1,
               "credit_id": "52fe46fd9251416c9106690b",
               "name": "Anne Jackson",
               "profile_path": "/t6htAqvpvAkWmwdIiwBDZjWS2Ne.jpg",
               "id": 10412,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe46fd9251416c9106690f",
               "name": "Susan Ruttan",
               "profile_path": "/lRoPqX4s1B055Tgk1LQsO2EtFFm.jpg",
               "id": 100060,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe46fd9251416c91066913",
               "name": "Freda Foh Shen",
               "profile_path": "/6jEbQK7XnFtLRjEPhdwfdLX6UdJ.jpg",
               "id": 51754,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46fd9251416c910668f7",
               "name": "Leonard Nimoy",
               "profile_path": "/rTQulQ5WMehA3SSBnGTmayTsF0m.jpg",
               "id": 1749,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fd9251416c9106691f",
               "name": "Norman Steinberg",
               "profile_path": null,
               "id": 111907,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.13824,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39140,
      "vote_count": 8,
      "budget": 0,
      "overview": "When Duffy Bergman, a New York cartoonist, meets Meg Lloyd, a gourmet chef, he discovers the love of his life and they marry -- yet love alone isn't enough to make them happy. Meg decides she wants to have a baby, a goal that initially makes Duffy frantic, but soon becomes his most important desire as well. When they are unable to have a baby, Meg begins concentrating on her career and the two slowly drift apart -- eventually separating. Later, when Duffy is speaking at a convention of the Delta Gamma sorority, he reveals that the Delta Gamma girls have always been his dream girls -- his Love Goddesses. There he meets the young and uninhibited Delta Gamma girl, Daphne Delillo. When Daphne moves to New York to work as a network sports reporter, their mutual attraction and Daphne's spontaneity spark an adventurous new relationship for Duffy. Now Duffy must decide which is more valuable to him -- the relationship he has given up, or the relationship he has always dreamed of having.",
      "similar": [
         95610,
         11472,
         41210,
         9494,
         6280,
         37135,
         810,
         4141,
         2758,
         76494,
         110415,
         195589,
         381283,
         10160,
         9659,
         9732,
         206487,
         332210,
         34806,
         11862
      ],
      "original_title": "Funny About Love",
      "runtime": 101,
      "poster_path": "/pe5TahkiQkBG0jMf4ZbzjgyKznP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1990-09-21",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Everyone has a biological clock. Duffy Bergman's is about to go off.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leonard Nimoy"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Bob Greene",
         "Norman Steinberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099623/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NTI3MzA5Ml5BMl5BanBnXkFtZTcwMTMzMzYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Gene Wilder, Christine Lahti, Mary Stuart Masterson | See full cast and crew »"],
      "reviews": [
         "There is nothing quite so painful as a comedy that isn't, and unfortunately Gene Wilder is is making more and more of them. Normally both Wilder and Christine Lahti are talented performers, but this script would win awards for boring. Not only that, but Lahti and Wilder have no chemistry at all, and it just gets worse when Mary Stuart Masterson is brought into the picture. This is one of those \"slice of life\" 80's pictures that resemble nothing more than a bad Lifetime TV movie. Wilder's reactions run the gamut from unrealistic to inappropriate; when he's consoling Masterson in their break-up scene, it's like a father with a daughter, which (quite frankly) I found exceedingly creepy. The relationship with Lahti falls apart realistically enough, but with no humor, wit, or even insight possible as Lahti plays it straight and Wilder plays it far too broadly, even for a comedy. ** SPOILERS ** When he and Lahti get back together at the end, it's all rushed together, complete with an adopted baby coming out of nowhere, and with Lahti's lipstick still damp on Wilder's lips from their first kiss, she introduces Wilder and baby to a restaurantful of strangers as her family. For that matter, the way his mother dies (and how flip Wilder is about it throughout the rest of the movie) conflicts terribly with the way he treats his father when he starts dating again. Nothing in this movie makes any sense or bears any resemblance to human interaction. In short, no subtlety, no humor, no great or even good performances (none bad either, except the inexplicable Susan Ruttan, doing her autistic impression once again), no connection to reality whatsoever. Let's hope that Wilder hooks up with Mel Brooks and they both turn out something that makes us forget their work from the last fifteen years or so.",
         "...littered with the corpses of competency, credibility and reason. I completely agree with the majority of comments already posted here; this is a very bad movie in every possible way, but I'll skip past the shockingly subpar directing since it's not the worst aspect of the production. (Spock, after all, helmed the best STAR TREK movie I've seen. Okay, THE VOYAGE HOME is the *only* STAR TREK movie I've seen, but it remains the highest-grosser in the series, which must mean Trekkies approved of it.) *SPOILERS* Let's instead consider the writing. The oddest thing about FAL is that nobody seems to notice that Gene Wilder's character is a deranged nutcase. Here's a guy who contorts his face during every conversation; makes tasteless, inappropriate, glib comments about his mother shortly after her death; cradles his girlfriend in his arms like a child with a scraped knee; and, during perhaps the strangest scene in a movie chock-full of them (this one at a fertility clinic), has apparently never masturbated before and hasn't a clue as to how to do it now. He also has a bizarre, unexplained obsession with cappuccino, which I guess is supposed to make him colorful but in reality makes him a weirdo. All of these factors makes him incapable of relating to others in any recognizable human manner, and as a result he has no romantic chemistry with either woman in his life. Which is odd in itself, because both females also exhibit alien behavior. Christine Lahti falls for this nutball for no reason outside their shared previous failed marriages. Like, two dates and Bam! She's moving in with the guy. (Why did the movie have them live together before marriage when the ceremony directly followed the domestic cohabitation? Doesn't anyone wait until marriage before sharing a bed anymore?) She just as quickly dumps the guy, for the unpardonable sin of really, really wanting a child. These neurotics clearly deserve each another, if for no other reason than to keep these freaks out of the dating pool. The pixieish Mary Stuart Masterson also resembles a humanoid. This is a girl who drags her boyfriend into the locker room at Madison Square Garden to have an NBA star tell him she's pregnant. Who, immediately after miscarrying, drops her boyfriend (who's twice her age) and moves across the country for some job that's presumably been waiting for her all this time. (Must be nice to be so needed in your profession right out of college.) Really, what planet are these people from? Maybe all of this is some kind of Vulcan mating ritual the director imposed on the script, for I have no other explanation. One boring yet incomprehensible scene follows another. There are no laughs to be found, nor any real depiction of human love. Not one moment of true interaction between upscale New Yorkers. The last scene of this debacle is the phoniest of all, which had me literally groaning and rubbing my eyes. Out of nowhere a \"happy\" ending arrives, which is so contrived, and so poorly edited, I was, frankly, dumbfounded. In it, Wilder barges into Lahti's restaurant proclaiming his newfound outlook on having a child. He doesn't want one anymore. But, ta-da! Lahti has already adopted a baby, which is conveniently resting in a bassinet in the kitchen. Never mind the questionable practice of keeping a baby in a bustling room full of hot food and busy servers. What happens next? Group hug before Lahti takes them out to the dining room to announce to a room full with patrons, \"This is my family,\" which is met with delighted applause. Check, please. FUNNY ABOUT LOVE is an total embarrassment from beginning to end for everyone involved, especially Wilder. There is no reason for it to be seen other than as a study of abnormal human behavior. p.s. If Gene was still mourning Gilda's death, why did he agree to star in a \"romantic\" \"comedy\"? A dramatic supporting role would have been more suitable.",
         "Gene Wilder struggles manfully to keep this limp, occasionally lame comedy afloat, but he's quickly defeated by unsure Leonard Nimoy direction, shabby editing and writing. A professional cartoonist falls for an attractive female chef (she can't be much of a chef since his first impression of her food is disgust); after meeting cute, they decide to marry, but frustration soon arrives over their failure to conceive a child. Christine Lahti has a warm, ticklish presence, but her character here is so underwritten we're not sure how we're supposed to feel about her; Mary Stuart Masterson is much better as a fraternity sex-bunny, but she belongs in a different movie (with a different partner) altogether. Based on a magazine article by Bob Greene, the picture is full of comic ideas that don't play and dramatic interludes which wilt without the proper handling. *1/2 from ****",
         "This movie should not have been made. It is the only thing that I have seen Christine Lahti in that failed to entertain me. All I kept thinking of while viewing it was that it would eventually get to the good part. Mary Stuart Masterson was cute and Lahti was her usual beautiful self but nothing could save this disaster. I will give it 2/10 for effort.",
         "Cartoonist Gene Wilder's marriage to Christine Lahti falls apart after they fail to conceive a child, but they manage to get back together after Gene has lots of sex with a younger woman. Love might be funny, but this film is something else entirely. Sure, there are a few laughs, but not enough to make this poorly-structured, badly-directed film work. it's about time for Leonard Nimoy to ask Scotty to beam him up. By the way, the soundtrack sucked too.",
         "I've noticed a lowest common denominator here in past reviews. People watched this with the automatic assumption that this was going to be a full-blown, slapstick 'Comedy.' Nothing could be further from the truth, as this isn't the story being told. Had this been made today, it would be considered a 'Dramedy.' It's not story-driven enough to be a full-fledged drama, and it's not sophomoric enough to be a comedy. It lies somewhere in between, and that's not entirely a bad thing. The collapse of Duffy's marriage to Meg is realistic enough. They cannot conceive a child, which Duffy clearly feels he needs at this point in his life. He keeps pushing this with Meg, and what do you think happens? Of course she's going to feel pressure, especially when she's just been handed her dream job. We never really see 'all' of the events leading to their divorce, but this was clearly an event in the making. What follows is what any person would do following the demise of a long-term marriage/relationship. You go out and try and find someone else in order to start again, if anything to prove that the original break-up wasn't entirely your fault. But regrettably, as Duffy finds out, this doesn't always work either. He tries for someone younger (Masterson), but it becomes frighteningly apparent that perhaps it wasn't Meg or Daphne with the conception issues, but Duffy himself. On a side-note, Duffy's a bit of a hypocrite when it comes to relationships, as he lambastes his own father who decides not long after his wife's death, to get married again. Duffy has no problem moving on from Meg, but has distinct thoughts of how his father's life should progress. I do find a particular scene at his mother's funeral to be incredibly touching. A child runs past Duffy, crying. He picks up the child to reassure him/her that everything is going to be all right, and despite his earlier braggadocio with his father, he completely breaks down at his culminated losses. (Namely the loss of his mother and the acceptance of the fact that he and Meg will never have a child.) Is this one of the classics of all time? No. The ending, as referenced elsewhere, is extremely rushed and a little too clinically 'nice' for me. Should scenes have been deleted? Yes. Namely the ice diaper and Duffy donating sperm scene. This two different films squished together, by Leonard Nimoy. Neither of which would've probably been good on their own merits, but together, they try their best to tell a story about flawed individuals. It's about a four out of ten. It's not as bad as other people have made it out to be.",
         "This is the film Wilder made right after the death of his beloved soulmate, Gilda Radner. I suppose he felt that getting back to work might ease the pain. A big mistake, but forgivable under the circumstances. He IS very talented, so be sure to see some of his other work, such as \"Young Frankenstein,\" \"Frisco Kid,\" \"Blazing Saddles,\" and \"Silver Streak.\"",
         "Okay, so it might not be Sherlock Holmes's Smarter Brother, but this film has tons of charm (Lahti is fantastic, as is Wilder), some strange little twists, and reassuring laughs. Watch it on a Sunday;-)",
         "When Duffy Bergman meets Meg Lloyd, he discovers the love of his life and they marry, but love alone isn't enough to make them happy. Meg decides she wants to have a baby, initially making Duffy frantic, but soon becomes his most important desire as well. When they are unable to have a baby, Meg begins concentrating on her career and the two eventually separate. Later, Duffy is speaking at a convention of the Delta Gamma sorority, he meets a young Delta Gamma girl, Daphne. When she moves to New York to work as a network sports reporter, their mutual attraction and Daphne's spontaneity spark an adventurous new relationship. Now Duffy must decide which is more valuable to him, the relationship he has given up, or the relationship he has always dreamt of having... It's an unmitigated disaster, but Wilder is always watchable and there are flashes of geniuses in his withered,pained face. Nimoy is perfunctory at making family movies, but this has been edited within an inch of its life, and it really shows when Masterson is introduced. It's another one of those movies where Wilder gets the beautiful woman, which is a bit hard to swallow, but it's an easy, if predictable watch. It's just very incoherent at times.",
         "Several years after directing \"Funny About Love\", director Leonard Nimoy admitted that making this movie was a mistake, and put the blame on the script. To a degree, Nimoy was correct. The writing found in this movie is truly bizarre at times. Throughout, characters spout out deranged dialogue that no human being with a reasonable amount of intelligence would say. Also, big chunks of time seem to be missing. For example, when Wilder's character and his wife have their first argument, in the next scene she is packing her bags and planning divorce - huh? I don't know if that's how it was written, or if the editing removed some scenes, but the movie is missing important information. While most of the blame is with the script (and possibly with the editing), Nimoy has to share some blame for the performances of his actors. More often than not, Nimoy has his cast acting in a very broad manner that makes the deranged dialogue they speak even worse-sounding. As I indicated in the summary line, this movie is more strange than funny."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Duffy Films",
         "Paramount Pictures"
      ],
      "summaries": ["When Duffy Bergman, a New York cartoonist, meets Meg Lloyd, a gourmet chef, he discovers the love of his life and they marry -- yet love alone isn't enough to make them happy. Meg decides she wants to have a baby, a goal that initially makes Duffy frantic, but soon becomes his most important desire as well. When they are unable to have a baby, Meg begins concentrating on her career and the two slowly drift apart -- eventually separating. Later, when Duffy is speaking at a convention of the Delta Gamma sorority, he reveals that the Delta Gamma girls have always been his dream girls -- his Love Goddesses. There he meets the young and uninhibited Delta Gamma girl, Daphne Delillo. When Daphne moves to New York to work as a network sports reporter, their mutual attraction and Daphne's spontaneity spark an adventurous new relationship for Duffy. Now Duffy must decide which is more valuable to him -- the relationship he has given up, or the relationship he has always dreamed of having."],
      "budget": 0
   },
   "movielensId": 8705,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-09-21",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Leonard Nimoy"],
      "runtime": 101,
      "movieId": 8705,
      "title": "Funny About Love",
      "mpaa": "PG-13",
      "actors": [
         "Gene Wilder",
         "Christine Lahti",
         "Mary Stuart Masterson",
         "Robert Prosky",
         "Stephen Tobolowsky",
         "Wendie Malick",
         "Anne Jackson",
         "Susan Ruttan",
         "Freda Foh Shen"
      ],
      "imdbMovieId": "0099623",
      "originalTitle": "Funny About Love",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["G_VaFbyHdP0"],
      "plotSummary": "When Duffy Bergman, a New York cartoonist, meets Meg Lloyd, a gourmet chef, he discovers the love of his life and they marry -- yet love alone isn't enough to make them happy. Meg decides she wants to have a baby, a goal that initially makes Duffy frantic, but soon becomes his most important desire as well. When they are unable to have a baby, Meg begins concentrating on her career and the two slowly drift apart -- eventually separating. Later, when Duffy is speaking at a convention of the Delta Gamma sorority, he reveals that the Delta Gamma girls have always been his dream girls -- his Love Goddesses. There he meets the young and uninhibited Delta Gamma girl, Daphne Delillo. When Daphne moves to New York to work as a network sports reporter, their mutual attraction and Daphne's spontaneity spark an adventurous new relationship for Duffy. Now Duffy must decide which is more valuable to him -- the relationship he has given up, or the relationship he has always dreamed of having.",
      "tmdbMovieId": 39140,
      "avgRating": 2.55357,
      "releaseYear": "1990",
      "numRatings": 28,
      "posterPath": "/pe5TahkiQkBG0jMf4ZbzjgyKznP.jpg"
   }
}