{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1032207",
      "video": false,
      "title": "Lynch",
      "recommendations": [],
      "backdrop_path": "/tDKtTjUTsSDUhwsukBDIIQ85NqS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "",
            "gender": 2,
            "credit_id": "5959a2eb9251412251012dd8",
            "name": "David Lynch",
            "profile_path": "/3xMyM3kvPqrIgcFQsHT7hVmIwwf.jpg",
            "id": 5602,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5959a337c3a368265d02e590",
               "name": "Jason S.",
               "profile_path": "/m95atFZXufcNF03cR9d452EcRHj.jpg",
               "id": 1843624,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5959a348c3a368253c02ac31",
               "name": "Jon Nguyen",
               "profile_path": null,
               "id": 1673654,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5959a35ac3a36828a1035c65",
               "name": "Brynn McQuade",
               "profile_path": null,
               "id": 1765769,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5959a37e925141088302f60b",
               "name": "Soren Larsen",
               "profile_path": null,
               "id": 1843625,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac2e8ca92514126c102839c",
               "name": "Jason S.",
               "profile_path": "/m95atFZXufcNF03cR9d452EcRHj.jpg",
               "id": 1843624,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.287426,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44443,
      "vote_count": 2,
      "budget": 0,
      "overview": "A film that gives us a rare glimpse into the mind of the man who created films such as Eraserhead, Mulholland Drive, Blue Velvet, Twin Peaks Fire Walk With Me, Wild At Heart, The Elephant Man and more...",
      "similar": [],
      "original_title": "Lynch",
      "runtime": 84,
      "poster_path": "/6fB9EjqJ6vIsutQia8u1E2WacVB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 84,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1032207/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA1MjUzNTI1MTleQTJeQWpwZ15BbWU3MDAyNjM5NDE@._V1_SY317_CR20,0,214,317_AL_.jpg",
      "actors": ["Stars: Jay Aaseng, Jeremy Alter, David Lynch | See full cast and crew »"],
      "reviews": [
         "In the book 'Lynch on Lynch', director David Lynch explains: \"Your mind focuses on a certain thing and it pulls in ideas that will marry to that thing.\" The results, as we see from Lynch's films, can be surreal. It links in to his use of Transcendental Meditation (TM) - a form of concentration developed by repetition of a mantra and used by the Maharishi Mahesh Yogi (to pull in vast amounts of money, among other things). Lynch has used the technique for 32 years, as he explains in this offbeat documentary. We see the camera turned on the director at work - and in moments where he waxes philosophical. He uses TM, \"to dive into pure creativity.\" There have been many critical reports of the Maharishi's methods. Ex- TM teacher, Joseph Kellet says, \"As a teacher I frequently lied to people 'for their own good' because 'they weren't ready yet' to receive the full truth. But the misuse of a technique for financial gain or fame does not, in itself, negate the value of it. Our documentary provides a fascinating insight into the creative processes of someone who is one of the most enigmatic of contemporary experimental directors. His use of TM - as a creative tool - is more accessible than some of the more extravagant claims commonly made for it (by others or by Lynch himself). \"Curiouser and curiouser!\" were the famous words of Alice as she delved deeper down the Rabbit Hole into Wonderland. Investigating anything to do with David Lynch tends to produce a similar sensation. Instead of questions being answered, fascinating new questions are posited. Occasionally, an underlying 'truth' will appear to convey some sort of narrative sense. It's what Lynch has called the 'Surrealist's Trick'. You have a bunch of interesting, open-ended fragments that pull in other fragments, but you need a certain type of idea to come in and tie them all together. Reality becomes the excuse for dreams. But how does the artist dream? We watch Lynch in his musings. He comes out with a story about popping a dead cow. A rabbit disappearing out of the brush. Or someone he knows getting his head bashed by police. He is fascinated by what crawls just beneath the surface of beauty. We wait (as he does) while other 'fragments' are drawn in. He is fascinated with taking still photographs of factory interiors. No agenda - just enjoying them for their own sake. It's a bit like lateral thinking - take some unconnected ideas and find a new connection. Just as ideas are pulled in, just as Lynch's feature films intrigue and pull us in, so does this film use cinematic story-telling techniques to inveigle the viewer. We watch a close up: his hand turns a handle. Emphatic directions to the crew bring an intensity of concentration to bear. There is a strange repetitive noise, a ghostly sound, we cannot identify. Only after the viewer has been entranced does the camera pan back to reveal an old-fashioned gramophone. Lynch is winding the handle that powers the turntable. The stylus is on the endless repeat of the last groove. Sound crew record the noise amplified by the acoustic speaker. As the film gets on to the early stages of filming Inland Empire, he talks about a new technique - about being 'excited' but 'tormented' by 'not knowing'. Usually, by the time cameras are rolling, the ideas have come together and the director knows exactly what is going to happen. But we are given to understand that Inland Empire was deliberately made as a 'work in progress.' This is, in a way, to replicate the situation that happened accidentally with Mulholland Drive. With the earlier picture, existing footage from a scrapped TV pilot was pulled together into a coherent film (admittedly you have to work at it, but a meaningful storyline and/or overall unity is now generally accepted by most serious viewers). In faithfulness to his own surrealist dictum, Lynch is making the 'fragments' before he has found the 'solution'. The photography in the documentary is - appropriately - as whacky as any Lynch film. Multiple screens, masking, slow wipes, different formats. Locked-down shots contrast with relaxed, hand-held filming. An unconnected shot of Lynch (apparently) at his desk in a bunny-rabbit suit. The inventiveness makes us feel like explorers, rather than passive recipients of a dry documentary. \"Lynch\" is a fascinating portrait of an intelligent, celebrated and charismatic director. No doubt it will eventually find its way into the 'extras' of a DVD boxed set. The heavy-handed references to Transcendental Meditation may annoy some viewers - when he gets on to his 'David Lynch Foundation for Consciousness Based Education and World Peace' it easy to sense excess fragments of hippy beads, flowing robes and happy-mantra vibes. But the personal relevance of TM to his own creative work is more believable. \"Lynch\" is a must for all fans of his work and a great add-on to his movie, Inland Empire. However crazy he might be, it's 'creative crazy' rather than 'penniless and certifiable crazy.' As a self-confessed fan of his movies, I hope he goes on making great ones and doesn't fall permanently down any bunny-hole.",
         "The subject of this documentary is David Lynch's creation of Inland Empire, one of his more challenging and powerful films. The documentary is as incoherent as the film itself if you are not someone who inherently understands Lynch. Do not look to this film for explanations or insight of the man himself. Instead, look to it as an example of how the genius makes his art. Lynch speaks almost constantly throughout the documentary. His speech is an endless flood of description, direction, and command. It should be no surprise to those who 'get him' that every second of film he uses is meticulously designed, imagined, visualized, created and very inspired. Lynch/Lynch 2 is a perfect companion to a complex and intense experimental film. While its plot is much more linear than that of the feature, it offers a rare example of true genius at work.",
         "I don't know what it is, but there is something about this film. I saw it just yesterday and I still don't know what to think. on one hand, the story doesn't flow, and I seriously doubt if there is a story at all. if there is, it is very well hidden within the layers of the film, just like in a good Lynch movie. however, don't bother yourselves finding it. I think it's not there... This is basically an elliptical look, shot very nicely on DV, of David Lynch at home and at work. it's not your typical documentary with interviews, history and opinions. rather than that, it's an intimate journey of the filmmaker through some moments he had with Lynch at his house and on the set of INLAND EMPIRE. as such, the movie lacks straightforwardness, which is essential to this kind of documentary. all sorts of different scenes of Lynch talking on the phone, preparing the sets for his film production, painting and telling stories from his life. it would definitely interest any Lynch fan, but as a movie whole this is not satisfactory. The beauty of the film lies within the montage itself, revealing a very real Lynch, not the artist, not the myth, but just the man, the human being who has great ideas for movies and paintings and just loves the \"doing\". this is a key morale to anyone out there who wants to be an artist. these little moments with Lynch alone really worth the watching. they are funny and sometimes surreal. An interesting point: the film was directed by blackANDwhite, a pseudonym for someone, and was produced by absurda, Lynch's own production company. that makes me wonder whether Lynch is the real person behind this film but didn't want to take the credit? maybe he is responsible for the lack of coherent story, just because nothing really important happened in his life, except for making INLAND EMPIRE? maybe this is all Lynch wants to reveal, until the next documentary? if this is true, all I can say is that Lynch is a great businessman as well, keeping us wanting more footage, more glimpse into his life and way of thinking. plus, look at the credits at the end: the thank you credits reveal some names from Denmark, and especially from zentropa productions. it seems the director was influenced by the danish cinema of the last decade. but, again, i'm not sure this is for the benefit of the film.",
         "(mild spoilers) This is unquestionably one of the worst documentaries I've ever seen. It's not even the horrible camera work and pretentious editing, it's how the film portrays Lynch. We're told he's a filmmaker, but we're never shown any excerpts from his films, not even stills. We're told he's a photographer, but only one photograph is shown, on a tiny computer screen, blurry. We're told he's a musician, but we learn nothing about his music. We can see he's a painter, but only one painting is shown in its entirety, for a brief moment, at the very end of the movie, a smallish image in the center of the screen. And what *does* the film show? Well, it shows Lynch talking about popping dead cows, showing his teeth to the camera, shouting the same words over and over again for no apparent reason, congratulating the President of France, swearing, and, finally, admitting, in the midst of making a film, that he doesn't know what he's doing. In other words, the film paints Lynch as a loony. Sure, there's an eccentric side to the man, but there are many other aspects of his personality as well, and none are shown here. Since no work is shown, either, all that remains is eccentricity, shot from awkward camera angles, sometimes blurry, frequently in tiny images in the center of the screen, disjointed, etc. Content is sacrificed to form almost all the time (e.g. when Lynch is talking about a beautiful scene he witnessed and photographed, don't expect the (equally beautiful) photographs to be shown). If you want a good documentary on Lynch, try to find \"Pretty as a Picture: The Art of David Lynch.\" It was made in 1997 as a promotional piece for \"Lost Highway\", but has plenty of Lynch's paintings with good close-ups, Badalamenti and Lynch working on a song together, etc. I recommend only watching \"Lynch (One)\" if you've already seen \"Pretty as a Picture\", and if you're very, very, very interested in Lynch. Only giving it a 3 out of 10 because it has maybe 3-4 minutes of interesting footage.",
         "David Lynch, in my opinion, is the greatest living director in the world. This film is not the most well put together movie I've ever seen but it gets an 8 because it is very interesting to see how David Lynch uses his creativity, hear him tell very interesting stories and seeing him work with his crew. It's a movie that all Lynch fans should look into for those reasons alone. There are some interesting abstractions but ultimately, I didn't think they really fit in with the documentary film that this was attempting to be. Don't expect an amazing, well done film but definitely look forward to learning much more of the mysterious and talented David Lynch!",
         "'Lynch' really reminded me of Pennebaker's \"Don't Look Back\" Dylan documentary. There's no set form or story holding the film together. It's more a series of candid vignettes. David Lynch spins yarns about his days living in Philadelphia, and in Idaho. Cut to: Lynch talking on the telephone, explaining Transcendental Meditation. Cut to: Lynch brooding in a sound studio, upset that he doesn't know what he's doing, and then chews out an employee for not showing up on time. Nearly all the footage was shot in digital video. But don't let that turn you off. There's a very strong sense of mood and visual style in 'Lynch'. (With a director named 'blackANDwhite' how could the film NOT have intense, creepy, visual flair?) What pleased me most about the film was the creative editing. Rather than clumping all the Philadelphia stories together, or clumping all the footage shot at one particular time, together - we just see a tidbit. Lynch relates a story form his past. Then cut to Lynch pondering a painting he's working on. This moment will linger for a while, sometimes accompanied by eerie atmospheric music (the sound design is fantastic.) Then we see him going on a photo expedition in Poland, or carving and painting wood in a workshop. The scenes never grow tiring, because the environment and the activity constantly change. I've seen some documentaries on David Lynch before, where they interview people on the set, and actors explain how he works, etc. 'Lynch' is NOT that kind of film. 'Lynch' gives you a fly-on-the-wall perspective on what it's like to be David Lynch. It's an ideal film companion piece to the book \"Lynch on Lynch\".",
         "I am a huge Lynch fan and enjoyed many scenes in this movie. I always find it interesting to find out about his process and this movie will surely interest his fans. This shows him during the filming of Inland Empire. I loved that movie, though I did feel it could have done with a bit tighter of an edit. And this film is kinda similar. In that sense, this is a good complement to IE. I also agree with previous reviewers who mentioned Lynch on Lynch, there is a similar tone. The movie has much Lynch style with buzzing lights, flicker, strange sounds... Youtube parodies have done it too, so you know what I mean. I got annoyed with it, but then I also kinda liked it. I found Lynch likable, creative and interesting, as always. It's interesting that it can be so easy to enter the mind of director often called incomprehensible or surreal.",
         "If you didn't think David Lynch was weird enough by watching his movies then might I suggest the biographical documentary Lynch. Lynch chronicles David Lynch as he goes about making his most recent film, Inland Empire and the bizarre creative process he went through to make that film. It is a film that attempts to profile a man whose mind I don't think any of us could ever understand. The way Lynch thinks is in a completely different ball park than the normal human brain, and his films show that. After watching Lynch I'm not sure whether the auteur is a genius or a mad man, but I do know that he is a dedicated director who knows what he wants and damn sure gets what he wants. It is always interesting to see a director in front of the camera in their own natural habitat and surroundings, doing what they do best to produce the things we watch. Lynch plenty satisfies this interest as the focus of the entire film is on nothing else but him. David Lynch is the central figure for the entire documentary and everything is about him, which is only appropriate for a film called Lynch. Throughout the film we get to see and experience what Lynch does and what he is about, but I don't feel like I have any better understanding of the man after watching this documentary. Lynch is a film with no coherence and no structure. It is essentially just a bunch of clips, all focusing on David Lynch, strewn together in a meaningless fashion. Honestly, I feel the same way about the structure of this documentary as I do about some of Lynch's own films. And maybe that is what the filmmakers were shooting for, a documentary that paralleled the structure of the films it was documenting. Regardless, it only left me confused and perplexed. If there's one personality trait I can pull from David Lynch after watching this documentary, it is the fact that he is quite pretentious. I was feeling vibes of self righteousness and extreme self importance from everything that Lynch said in this film and it makes it hard to connect with the man. I respect his passion and ambition, but I get the sense that he feels he can do whatever he wants with film. Of course in a way he can, but it is at the expense of others who are getting yelled at by Lynch or those who are left detached because of how distanced and strange Lynch is. But it is through this that Lynch raises an interesting point of where one separates the artist from the art. I love David Lynch films and I always enjoy his bizarreness and disturbing surrealism, but I don't enjoy David Lynch himself nearly as much. He is a visionary, yes, but too full of himself and too strange to really connect with. He is a man in his own world, but when he brings that world to us through film, it is a pleasant experience. I wouldn't call Lynch fun or entertaining, but it is definitely strange and it provides an odd insight into David Lynch. This insight doesn't necessarily give us a clearer understanding of the man, but it certainly paints a picture as to why his films are the way they are and why they are all so strange. Because David Lynch, himself, is the ultimate incarnation of strange.",
         "It's Lonely Being Lynch. The new documentary \"Lynch\" reveals so much about the man and his methods without pretending to understand him. I have been very disappointed by many of the reviews of this film � it seems the reviewers were expecting a different movie and were frustrated they were not seeing the film they imagined or hoped to see. V.A. Musetto writes, \"Provides little new insight into Inland Empire\". Was it supposed to? Variety complained, \"like the feature it loosely chronicles, has no immediately discernible through line and a wide variety of video-image densities\". Again, this sounds less like criticism and more like complaining. The Village Voice, \"Much of this is tedious -- no more or less exciting than surveillance-cam footage of a regional sales manager.\" Expecting excitement seems to be the failure here. And most obtuse of all is Ken Fox's review, \"anyone looking for a general overview of the director will do better looking elsewhere.\" Again this presumes that \"Lynch\" should have been a general overview, when it wasn't meant to be. All of these criticisms sound like blaming an elephant for not being a Zebra. The documentary does assume the audience is already familiar with Lynch, his work and specifically, Inland Empire. I think it would be a fantastic companion piece for the DVD release of Inland Empire. I found the film incredibly illuminating and I have been an avid fan of Lynch's for the past 20 years. I have always respected his refusal to explain things and resistance to simple symbolism. So I didn't expect the film to offer any insight into a man who is so famously inscrutable. But the filmmakers did it right � they simply present the viewers with various vignettes of the man at work and in various moods: joyous, contemplative, angry, frustrated, depressed and inspired. But throughout the work something else emerged about the man: It's Lonely Being Lynch. The man is a slave to his creative urges and it makes little room for close personal relationships. The frustration this causes is palpable and it suddenly hit me that THIS is the source of that peculiar haunted anxiety that typifies what we all now call \"Lynchian\". There is a scene in \"Lynch\" where he stands in an abandoned factory and yells into the cold cavernous space, \"Sally! Do you remember me?\" over and over. It's funny at first but the more he yells the more desperate it sounds and finally haunting, \"Lynchian\". He can fill even a candid moment such as a sound check with so many layers of meaning and emotion he seems more like a conjurer. The filmmakers knew to let the moment go for a long time to let the ghosts emerge. I knew then and there this filmmaker really knew this was the only way to make a portrait of the man. Some people have complained that the film is not chronological enough. It is critical that it isn't. To arrange these vignettes into chronological order would create a sense of narrative and causation � This doc must avoid this kind of editing. To make obvious spatial or causal relations between the vignettes would presume to know more about Lynch than even Lynch seems to know about himself. It's the only kind of approach that could ever work to describe such an inscrutable character. I have studied Lynch for decades and read everything on him I can find. I didn't expect to learn anything from this doc but I did. There are moments of watching him work where his focus is so palpable, his need so urgent that suddenly I had new insights into his work. The insight comes from seeing what gets him excited and getting clues to his motivation. I could even sense my opinions on his films reordering retroactively as I watched this documentary. If you are a fan, do not hesitate to see \"Lynch\". If you are looking for an \"unpacking\" of his motives then you are probably not the kind of person who likes him or his films anyway.",
         "Just watched this doc and I thoroughly enjoyed it. Do not come looking for explanations of his films, or his formula. Lynch is not likely to ever show that. Partly, in my opinion, because he couldn't if he tried. This is what you'll get. You hang out with Lynch and some of his closer crew, for a while. That's it. He tells stories. He talks about creativity. You watch him get and execute ideas. He interacts with his crew and the actors. you get to see him in a bunch of locations. Not only working on the film they are making (Inland Empire), in fact little of it is on set. You get to see and hear him talk about photography and creativity in all forms, of all mediums. He briefly discusses his relationship with meditation which he has practiced for 30+ years. Watching him at work, seeing the way he is, totally destroys the image/stereotype of meditators being yoga masters, always calm and always sitting in the lotus position or something. No. This guy is out there. He is himself, and very alive. He is calm, and he is excited, He is frustrated, and loving. He is compassionate, and blunt. So, unconventional, almost free form (but feels whole in the end). I guess, kinda like a lot of his films... Actually, by the end I was thinking to myself, \"Aww schucks, I wanna hang out some more with you David.\""
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Absurda",
         "Hideout Films",
         "Oneblackarm Films"
      ],
      "summaries": ["Compiled from over two years of footage, the film is an intimate portrait of David Lynch's creative process as he completes his latest film, Inland Empire (2006). We follow Lynch as he discovers beauty in ideas, leading us on a journey through the abstract which ultimately unveils his cinematic vision. The director of the documentary immersed himself in David Lynch's world; living and working at Lynch's home. His unobtrusive style has captured a personal side of David Lynch not seen before. The film reveals Lynch not only as one of the most original and compelling directors of contemporary film but also as an artist who continues to explore and experiment in countless mediums. We witness his \"hands on\" approach to painting, sculpting, music and screenwriting. His enthusiasm is infectious; inspiring us to tap into the well of creativity that Lynch believes we all have."],
      "budget": 0
   },
   "movielensId": 87229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": "2008-08-26",
      "directors": ["blackANDwhite"],
      "runtime": 84,
      "movieId": 87229,
      "title": "Lynch",
      "mpaa": "",
      "actors": ["David Lynch"],
      "imdbMovieId": "1032207",
      "originalTitle": "Lynch",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A film that gives us a rare glimpse into the mind of the man who created films such as Eraserhead, Mulholland Drive, Blue Velvet, Twin Peaks Fire Walk With Me, Wild At Heart, The Elephant Man and more...",
      "tmdbMovieId": 44443,
      "avgRating": 3.45,
      "releaseYear": "2007",
      "numRatings": 10,
      "posterPath": "/6fB9EjqJ6vIsutQia8u1E2WacVB.jpg"
   }
}