{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "falsely accused",
            "id": 769
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0038360",
      "video": false,
      "title": "Black Angel",
      "recommendations": [
         42186,
         45975,
         38964,
         27543,
         30015,
         36330,
         85237,
         36949,
         89751,
         55601,
         1840,
         32887,
         18262,
         18871,
         40954,
         20675,
         43144,
         30162,
         35006,
         21366
      ],
      "backdrop_path": "/7Mf04MVkmyV3qtvZI1ho7eWfzyS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martin Blair",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003417",
               "name": "Dan Duryea",
               "profile_path": "/577hAUPy04u98IwsHKO2rQriJ2e.jpg",
               "id": 64212,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Catherine Bennett",
               "gender": 1,
               "credit_id": "52fe43e0c3a368484e00341b",
               "name": "June Vincent",
               "profile_path": "/b0SZNSaOzmKQm4UOss6SAxTpktT.jpg",
               "id": 38231,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marko",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00341f",
               "name": "Peter Lorre",
               "profile_path": "/6V1Jd8qN0PV76xJce7cJsqkQ55R.jpg",
               "id": 2094,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Captain Flood",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003423",
               "name": "Broderick Crawford",
               "profile_path": "/fCoHg9CyOza4o9Mg1TLd5yXFGM4.jpg",
               "id": 85895,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mavis Marlowe",
               "gender": 1,
               "credit_id": "52fe43e0c3a368484e003427",
               "name": "Constance Dowling",
               "profile_path": "/rB6hilhGoLPQMJrjoya0WZmuy2M.jpg",
               "id": 85896,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00342b",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jake, janitor",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00342f",
               "name": "Hobart Cavanaugh",
               "profile_path": "/ghffG1MGoG7DujiBhcKGfNMnzjr.jpg",
               "id": 85897,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lucky, manager of Rio's",
               "gender": 0,
               "credit_id": "52fe43e0c3a368484e003433",
               "name": "Freddie Steele",
               "profile_path": "/nDwu3IppGvKEMx6eZccUX9J4q9x.jpg",
               "id": 85898,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003437",
               "name": "Ben Bard",
               "profile_path": null,
               "id": 85899,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dr. Courtney",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00343b",
               "name": "Junius Matthews",
               "profile_path": null,
               "id": 57313,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Millie",
               "gender": 1,
               "credit_id": "52fe43e0c3a368484e00343f",
               "name": "Marion Martin",
               "profile_path": "/ci5vfUjqZxm8y27tr1pMKHto7fi.jpg",
               "id": 85900,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Kirk Bennett",
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003455",
               "name": "John Phillips",
               "profile_path": null,
               "id": 127195,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003445",
               "name": "Roy William Neill",
               "profile_path": "/pD7l29uhEQv1Gfh48vIzUczFslg.jpg",
               "id": 25165,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e00344b",
               "name": "Cornell Woolrich",
               "profile_path": "/rsiAv7XyWhQrpQecLDzsYfB1teu.jpg",
               "id": 7748,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e0c3a368484e003451",
               "name": "Roy Chanslor",
               "profile_path": null,
               "id": 70263,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.633967,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20298,
      "vote_count": 15,
      "budget": 0,
      "overview": "A falsely convicted man's wife, Catherine (Vincent), and an alcoholic composer and pianist, Martin (Duryea) team up in an attempt to clear her husband of the murder of a blonde singer, who is Martin's wife. Their investigation leads them to confrontations with a determined policeman (Crawford) and a shifty nightclub owner (Lorre), whom Catherine and Martin suspect may be the real killer.",
      "similar": [
         996,
         513285,
         14638,
         910,
         247,
         2502,
         402,
         642,
         5503,
         426,
         1092,
         9798,
         256591,
         213,
         12113,
         201088,
         241554,
         291805,
         27576,
         9348
      ],
      "original_title": "Black Angel",
      "runtime": 81,
      "poster_path": "/gSpQ7iTM8P3VIW8vlrvtmYBPjap.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1946-08-02",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Duryea! ...that fascinating tough-guy of \"Scarlet Street\"!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Roy William Neill"],
      "runtime": 81,
      "synopsis": "Black Angel begins as we zoom up to a swanky apartment building in Los Angeles as Marvis Marlowe (Constance Dowling) is primping and berating her maid for putting the wrong music on the phonograph. The recording of the song Heartbreak reminds her of her musician husband Martin Blair (Dan Duryea) who wrote the song and is standing downstairs barred from entering by the doorman. When Martin sees the doorman allow Marko (Peter Lorre) up to Marvis apartment he gives up and walks away. Martin and Marvis were married at one time but now she refuses to meet with him which causes emotional reactions in Martin so great that he goes on a drunken bender before going to his current piano-playing job at Als Place, a local saloon. When Martins best friend and custodian shows up, he takes the hapless musician away and locks him in his apartment to sleep it off. In the meanwhile Kirk Bennett (John Phillips) goes to Marvis apartment and discovers the femme fetale dead on the floor and the seeming presence of someone just exiting the apartment. Kirk is held for the murder in the case led by detective Capt. Flood (Broderick Crawford) who can only find a heart-shaped brooch missing from the dead womans apartment. After a trial Kirk Bennett is convicted and is sentenced to execution. Kirks wife Catherine Bennett (June Vincent) goes into action believing that her husband is innocent of murder she tracks down Martin and confronts him about his actions on the night his ex-wife was murdered. Catherine is dismayed when she learns of Martins alcoholism and his obvious emotional vulnerability in regards to his murdered wife, but what really convinces her that he is innocent is that he was locked in his apartment at the time of the murder. Martin decides to help Catherine because he remembers Marko entering the apartment and thinks he may be the murderer. Martin and Catherine concoct a scheme to get a job performing at Rios, the club Marko owns in hopes of getting more information on Marko that may lead to showing that Catherines husband is innocent. They begin finding clues of Markos relationship with Marvis, many of which are secured in a safe in the night club. During this Martin has developed a real connection with June and confesses his feelings for her, but when she rejects him because of her determined belief of Kirks innocence, Martin goes on a drunken bender. When Martin sees a woman wearing the missing brooch from Marvis, he realizes that in an earlier drunken stupor he had given it to her, and the details of the murder slowly become clear.",
      "writers": [
         "Roy Chanslor",
         "Cornell Woolrich"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038360/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MjYzNjU5OF5BMl5BanBnXkFtZTcwMTI5ODUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan Duryea, June Vincent, Peter Lorre | See full cast and crew »"],
      "reviews": [
         "This interesting, creative film-noir is much less widely known than are most of the classics of the genre, but it is well worth seeing both for the story and the cast. In a relatively brief running time, it packs in a satisfying and unpredictable story with numerous turns, with a very good cast that work together quite well. The settings are well-conceived, and together with the photography and the rest of the production, they establish a convincing noir atmosphere. Dan Duryea is always so good at straightforward villainous \"noir\" roles that he sometimes seems not to have received many opportunities to do anything else, and so it's very nice to see him get such an interesting role here. He delivers very well, believably portraying the different sides of a more complex character. He also works surprisingly well with June Vincent, as together they try to solve the mystery. Peter Lorre does not have a very large role, but as you would expect, he makes the most of it. Toss in Broderick Crawford as the police captain, and you have a cast very well suited for film-noir. The story is not all that complex, but it is well-written, features some well-conceived turns, and fits together nicely. Roy William Neill has a good touch with the material, not trying to make it fancier or bigger than it is, but simply crafting a solid, enjoyable movie that has just about all that you could reasonably ask for in a film-noir.",
         "Don't miss this great Universal film noir mystery! Excellent cast brings to life a gritty story of neer-do-well songwriter, the murder of a dispicable sexy blackmailer, and the death sentence of seemingly the wrong man. Throw in wise guy police inspector Broderick Crawford, sinister nightclub owner Peter Lorre (in a fascinating role reversal from \"Casablanca\"--this time HE is the club owner)Peter Lorre is ALWAYS a treat!! What a shame Dan Duryea didn't do more pictures! He's very effective in his role. The beautiful love interest June Vincent is another who should have made more pictures--she's very sweet and believeable. This is another example of the Film Noir genre which was so popular in the 40s and early 50s--gorgeous photography, mood and plot twists!",
         "Dan Duryea appeared in a number of Films Noirs and always brought intensity and conviction to his villain roles. Something about his looks and voice sums up the essence of Noir. Fortunately for Film Noir enthusiasts, \"Black Angel\" has finally been issued on video. This is an extremely enjoyable dark drama with a few variations of its own: first, the casting of Duryea in the lead is a wonderful asset, since he was an excellent actor and his previous screen incarnations had type-cast him as a weakling or a sleazy con artist; second, Duryea's character, a depressed musician is an unexpected turn on the noir hero, not a jaded detective, or ex-con loner. Further, the presence of Peter Lorre in any film, especially playing a villain is always welcome. And Constance Dowling has a memorable moment on screen as a tempermental singer. Based on a Cornell Woolrich story, the movie's intrigue is sufficiently convoluted, though not as much as in some other films of this type. \"Black Angel\" is true Film Noir in its depiction of a down and out protagonist up against a seemingly unstoppable dark force.",
         "\"Black Angel\" (Universal, 1946) is one of the most entertaining films noir of the 1940s, that era when Hollywood discovered the genre and brought to it a high polish. In this outstanding dark mystery, based on the novel of the same name by Cornell Woolrich, director Roy William Neill guides stars Dan Duryea and June Vincent through a byzantine plot that begins with murder and proceeds through the arrest and conviction of an innocent person, then finally ends with the true murderer being uncovered. It sounds simple and straightforward, but Neill keeps the audience off balance throughout. Just when we think one piece of evidence will pay off, it doesn't. When we think another bit of business is benign, it turns out to be a crucial clue to the unraveling of the mystery. Duryea and Vincent are compelling throughout, and they are supported by two excellent character actors, the always-sinister Peter Lorre and future Oscar winner Broderick Crawford. And I like to think that with \"Black Angel,\" Universal finally atoned for the fatal mistake it made with another Woolrich thriller, \"Phantom Lady,\" in 1944. In the book \"Phantom Lady,\" written by Woolrich under his pseudonym William Irish, the plot was a tightly woven murder mystery, with the revelation of the culprit coming as a surprise to all but the cleverest readers. But when the story was filmed in 1944, Universal made the outrageous decision to reveal the killer's identity to the audience from the start. In \"Black Angel,\" the murderer's identity is kept from the public until the end, the suspense is sustained, and the final scenes allow the audience to exhale after an hour and a half of diverting tension. Now that \"Black Angel\" is available in VHS, you can enjoy one of the finest examples of American film noir on your own screen.",
         "It wasn't that Dan Duryea never played nice people. He could be typecast as an evil villain most of the time, but occasionally he got cast as a nice guy. The best examples of this is the movie executive in KATHIE O (1958), who helps a young child actress save her normal life from her mother's clutches, and this film, where he tries to help a condemned man's wife prove the man is innocent. The chief suspect is a crooked nightclub owner (Peter Lorre), and Duryea and the young lady attempt to get the proof to convince a police detective (Broderick Crawford) that Lorre did the the crime. Duryea (a musician) is the boyfriend of the murdered woman, and has an interest in finding the perpetrator. And he does at the end, but at considerable cost. A superior film noir, and well worth the watching.",
         "This is very much the sort of quintessential forties film noir that fanciers of the genre get nostalgic for, with just the right balance of grit and glamor, low-budget ambiance and surehanded Hollywood artistry. Dan Duryea is even better here than in his Fritz Lang films (he's got a better role), Veronica Lake clone June Vincent is refreshingly un Lake-like, and Peter Lorre is utterly adorable as a hard-boiled L.A. nightclub owner with a heart of Viennese schlag.",
         "\"Black Angel\" is an unjustly forgotten film noir based on Cornell Woolrich's novel. Dan Duryea, tagged in the preview as \"he's no angel again!\", adds yet another complex, dark portrayal to his gallery of ambiguous bad guys as Martin Blair, the estranged husband of murder victim Mavis Marlowe (Constance Dowling). Mavis is a devious singer who is blackmailing her married lover, Kirk Bennett (John Phillips). Her immaculately decorated apartment, haunting song \"Heartbreak\" playing in the background, her sheer black gown highlighting what a bad dame she is. Her blackmailer is shrewd, unscrupulous and will stop at nothing to get her way; Dowling's career never fully took off, most likely because of her unconventional screen presence and her independent mind (coincidentally, her sister, Doris Dowling, also appeared in a similar role in another noir of the same year, playing Alan Ladd's unfaithful lush wife in \"The Blue Dahlia\"). Since Mavis has made so many enemies for herself, it's not surprising that she ends up murdered. As he had the most apparent reason of anyone to want her dead, Bennett is arrested, charged and convicted (on rather circumstantial evidence) and sentenced to death. His loyal wife, Catherine (June Vincent, another under-appreciated talent), vows to clear her husband and enlists the help of Blair, who had passed out drunk after he last saw Mavis, and the pair team up to investigate nightclub owner Marko (Peter Lorre, exceptional performance), posing as a singing act. However, as with many film noirs, there are many red herrings, and things are not what they appear to be. The ending is a surprise and the killer's identity will keep you guessing to the film's conclusion. I don't know why this movie is barely remembered. There should have been records of the haunting vocal music. June Vincent, the last surviving cast member (she passed away a few years back), retired from show business relatively early, and it's a shame that she did not progress to more roles like this in A pictures. The DVD looks very good, although it shows faint signs of wear (which is to be expected for a film of its age), and the only extra included is the original theatrical trailer. Any fans of film noir should enjoy this one.",
         "\"The Black Angel\" is really a great film-noir experience - plenty of plot twists throughout to really throw you off and some very interesting characters to boot! Mavis Marlowe (Constance Dowling), a beautiful, heartless blackmailer, is murdered and one of her paramours who is married is accused of the crime. His wife, Catherine Bennett (June Vincent) pairs up with Marty Blair (Dan Duryea) to do some investigating of their own. Marty Blair is the widower of Mavis Marlowe, which keeps things interesting! Enter some other interesting characters, a nightclub owner played by the always interesting and good actor Peter Lorre, who obviously has something to hide - and a Police Captain played by Broderick Crawford whose small part keeps the action going round and round! Someone had to kill Mavis - wonder which one of the characters had the strongest motive? Watch and find out! Now on VHS!!! I rate this film a 10 out of 10!",
         "In Los Angeles, when the singer Mavis Marlowe (Constance Dowling) is found dead in her apartment, Kirk Bennett (John Phillips) is accused for the murder, since he had been blackmailed by the victim. Kirk's wife Catherine Bennett (June Vincent) believes her husband is innocent and joins to Martin Blair (Dan Duryea), the alcoholic former husband of Mavis, to investigate the crime and try to find the killer. They suspect of Marko (Peter Lorre), the owner of a night-club that was seen in Mavis' place in the night she was murdered, and they try to prove his possible guilty. I had no information about \"Black Angel\", but being a great fan of film-noir, I decided to buy the DVD. I have just watched this unknown film, and I can say that it is surprisingly good. The simple and credible story is disclosed in a good pace and the plot point surprised me, since I did not have the slightest guess of who might be the criminal. The performances are very natural, and the black and white cinematography and the work of the camera are excellent, and in the beginning of the movie there is a spectacular traveling of the camera from Martin to Mavis apartment. My vote is eight. Title (Brazil): \"Anjo Diabólico\" (\"Diabolic Angel\")",
         "I have stumbled onto this movie several times. It doesn't seem to make a strong impression. It's well directed and acted but packs relatively little punch. On the other hand, it has quite an amazing cast: Dan Duryea, Peter Lorre, Broderick Crawford ...! The lead female is played by an exotic June Vincent. What really impressed me was the composition of the scenes in the first half: Minor characters are set in the foreground and the action takes place behind them. The set decoration is brilliant. The plot is good but it is not the best Woolrich adaptation, by any means. But it's suspenseful and a lot of fun."
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "Kirk Bennett is falsely sentenced to death for killing blackmailer Mavis Marlowe, ex-wife of nice-guy drunk Martin Blair. Bennett's stand-up wife Catherine tries to prove him innocent, enlisting the aid of Blair, who falls in love with her. Bennett's execution draws near as the two pose as piano player and singer, trying to get the goods on sleazy nightclub owner Marko, a prime suspect. Failing to nail Marko, Catherine goes off to meet with her husband, scheduled to die the next morning, and Blair slips into an alcoholic stupor before the real killer is revealed.",
         "In Los Angeles, when the singer Mavis Marlowe is found dead in her apartment, Kirk Bennett is accused for the murder, since he had been blackmailed by the victim. Kirk's wife Catherine Bennett believes her husband is innocent and joins to Martin Blair, the alcoholic former husband of Mavis, to investigate the crime and try to find the killer. They suspect of Marko, the owner of a night-club that was seen in Mavis' place in the night she was murdered, and they try to prove his possible guilty.",
         "Singing star Mavis Marlowe is murdered just after receiving a heart shaped ruby brooch. Before Kirk Bennett, who discovers the body, can call the police, the brooch is taken by someone he can't see, and he flees in panic. Of course, circumstantial evidence ensures Bennett's conviction. But his loyal wife Catherine doggedly searches for the truth...aided by alcoholic songwriter Marty Blair, ex-husband of the victim, who finds that he and Catherine make a good team.",
         "When Kirk Bennett is convicted of a singer's murder, his wife tries to prove him innocent...aided by the victim's ex-husband."
      ],
      "budget": 0
   },
   "movielensId": 8766,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-08-02",
      "dvdReleaseDate": "2004-07-06",
      "directors": ["Roy William Neill"],
      "runtime": 81,
      "movieId": 8766,
      "title": "Black Angel",
      "mpaa": "",
      "actors": [
         "Dan Duryea",
         "June Vincent",
         "Peter Lorre",
         "Broderick Crawford",
         "Constance Dowling",
         "Wallace Ford",
         "Hobart Cavanaugh",
         "Freddie Steele",
         "Ben Bard",
         "Junius Matthews",
         "Marion Martin",
         "John Phillips"
      ],
      "imdbMovieId": "0038360",
      "originalTitle": "Black Angel",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["XZXNrU53Z28"],
      "plotSummary": "A falsely convicted man's wife, Catherine (Vincent), and an alcoholic composer and pianist, Martin (Duryea) team up in an attempt to clear her husband of the murder of a blonde singer, who is Martin's wife. Their investigation leads them to confrontations with a determined policeman (Crawford) and a shifty nightclub owner (Lorre), whom Catherine and Martin suspect may be the real killer.",
      "tmdbMovieId": 20298,
      "avgRating": 3.3,
      "releaseYear": "1946",
      "numRatings": 40,
      "posterPath": "/gSpQ7iTM8P3VIW8vlrvtmYBPjap.jpg"
   }
}