{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "french",
            "id": 4653
         },
         {
            "name": "port",
            "id": 191026
         }
      ],
      "imdb_id": "tt0030643",
      "video": false,
      "title": "Port of Shadows",
      "recommendations": [
         27053,
         29415,
         32547,
         59950,
         46334,
         186783,
         42131,
         64968,
         1785,
         26614,
         62570,
         31344,
         43000,
         86727,
         15377,
         48365,
         45000,
         5602,
         20372,
         26252
      ],
      "backdrop_path": "/dJOrBtlhgeXCzb5n0B84CqTXCbs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Jean",
               "gender": 0,
               "credit_id": "52fe46f0c3a36847f811ad73",
               "name": "Jean Gabin",
               "profile_path": "/8CxpWkEoipIsBF9P2D0ypzzSHhs.jpg",
               "id": 11544,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Zabel",
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad77",
               "name": "Michel Simon",
               "profile_path": "/xsrKyP90F9Ov1A49ObnPGZv0cBe.jpg",
               "id": 12748,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Nelly",
               "gender": 1,
               "credit_id": "52fe46f0c3a36847f811ad7b",
               "name": "Michèle Morgan",
               "profile_path": "/uqVbTWbEDIjgIZgtw3CCXslDWnY.jpg",
               "id": 35254,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Lucien",
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad7f",
               "name": "Pierre Brasseur",
               "profile_path": "/Ag5OquJVoDniYGJlZBjzSgTc0x8.jpg",
               "id": 24476,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Panama",
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad83",
               "name": "Édouard Delmont",
               "profile_path": "/8FIPdIuNpEiDaGe5frIqy4ODP2i.jpg",
               "id": 69971,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Le peintre",
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad8b",
               "name": "Robert Le Vigan",
               "profile_path": null,
               "id": 49000,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Le docteur",
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad8f",
               "name": "René Génin",
               "profile_path": "/ammAWWvjzhed0C4m4z4G9Y8jxEf.jpg",
               "id": 40969,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Quart Vittel",
               "gender": 2,
               "credit_id": "5538969b92514165180088b2",
               "name": "Raymond Aimos",
               "profile_path": "/pdKOCpsulH6FnT5toQe6OUnBGWL.jpg",
               "id": 308779,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad4b",
               "name": "Marcel Carné",
               "profile_path": "/6ZFHCA0MlQDLIMUzUykmA1Nx08G.jpg",
               "id": 25161,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f0c3a36847f811ad51",
               "name": "Pierre Dumarchais",
               "profile_path": null,
               "id": 135964,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad63",
               "name": "Maurice Jaubert",
               "profile_path": null,
               "id": 18479,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f0c3a36847f811ad69",
               "name": "Eugen Schüfftan",
               "profile_path": null,
               "id": 1758,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f0c3a36847f811ad6f",
               "name": "René Le Hénaff",
               "profile_path": null,
               "id": 37719,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59d88674c3a368623e021424",
               "name": "Jacques Prévert",
               "profile_path": null,
               "id": 25162,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.573465,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 46326,
      "vote_count": 50,
      "budget": 0,
      "overview": "A military deserter in a French port city finds love amidst trouble.",
      "similar": [
         26389,
         2024,
         369885,
         283227,
         4808,
         2013,
         73134,
         1600,
         10876,
         74513,
         11916,
         441,
         2016,
         51241,
         26933,
         23567,
         38688,
         22733,
         446048,
         11958
      ],
      "original_title": "Le Quai des brumes",
      "runtime": 91,
      "poster_path": "/yoiJPfIBWWFC81w1pf1rFDdpRbf.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ciné-Alliance",
         "id": 4781,
         "origin_country": ""
      }],
      "release_date": "1938-05-17",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "...A Story Which the French Have Put On the Screen With Daring Skill!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marcel Carné"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Pierre Dumarchais",
         "Jacques Prévert"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0030643/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzMDMwMjgzMl5BMl5BanBnXkFtZTgwOTgzMTI0NDE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean Gabin, Michel Simon, Michèle Morgan | See full cast and crew »"],
      "reviews": [
         "Was there ever a better example of Poetic Realism (no, but one just as good, Le Jour Se Leve, from the same stable)than this, crafted exquisitely by the onlie begetters of the genre, Jacques Prevert - Marcel Carne. All the ingredients are present and accounted for; low-key lighting, atmos - perm any two from drizzle, sleet, cobbles, out-of-season resorts - and two doomed lovers who come together for one Mayfly moment in the sun before it all ends in tears to the distant sound of hammers striking firing pins and the heady, pungent aroma of cordite. Did anyone, with the possible exception of Bogie, do bruised tough better than Jean Gabin and pre-Audrey Hepburn were there ever so expressive eyes as Michele Morgan brought to the party. The Prevert-Carne team were on top of their game in this one which still holds up sixty years on. Purists may quibble that 'brumes' translates as mist rather than shadows but without a shadow of a doubt this is classic fare.",
         "I've just seen Port of Shadows for the first time in my life, and I must say I really liked it. I'm already a great admirer of old black & white pictures, and I enjoyed The Great Illusion as well. This one is rather different from Illusion, though from the same era and also with Jean Gabin as the quintessential Frenchman. It's hauntingly sad, quietly emotional, and even if it's a bit dated in some places (the pathetic hood played by Brasseur) it still manages to creep up on you and leaves you absorbed with the motifs of human loneliness and the not unreasonable, but ultimately impossible human dream of happiness. So it's not a laugh-riot, and you don't leave the cinema with a happy feeling, but you do feel good about having seen it. It's a masterpiece in French cinema history, Jean Gabin is ideal as the tough-as-butter soldier with a doomed soft spot for Michéle Morgan's beautiful waif, and in the end all you remember is the quiet mists of Le Havre harbor, and the sense of ill-fate and lost chances. Not to mention the beautiful eyes of a very young Morgan!",
         "When I was young this is what I used to call a \"bulger\", the first time I saw it when 18 years old I was so impressed by the bulging murky atmosphere, and the over-riding sense of doom pervading the film I thought it couldn't be bettered. Then I read up on Warner Bros. techniques for their best \"atmospheric\" potboilers such as The Big Sleep and realised it was, as usual, all down to saving money. LQDB is nearly completely studio-bound, therefore the fogs, darkness and even excessive cigarette smoke all came in useful in disguising the limitations created. In this case however the limitations are deliberate as it is the crux of the story, the elemental mist at Le Havre and Man's mental mists playing havoc with lives. Not surprisingly, plenty of erudite praise has been showered down on LQDB over the years. Essentially it remains only a entertainingly depressing adult yarn, with a straight-faced storyline coupled with some gloomy and gleaming but pleasing black and white photography. I think Renoir called it fascist in a patriotic outburst; for Carne to get past the disapproving censor Gabin couldn't even be called a deserter in the film (although his one night stand with Nelly was cheerfully depicted). Needless to say, this has probably led to some confusion over the years as to why Gabin is on the run (more like stroll) anyway! Anyway, Fascism and fascism are both dark and depressing for the majority of us so that would make LQDB a faithful representation! This was the 2nd of Carne's classic 6 consecutive films, culminating in 1945 with Les Enfants Du Paradis. To my mind the quality of this series remains unsurpassed in world cinema - unless you can think of another director who made 6 timeless classics one after another? All subjective, of course! Nevertheless, one of my favourite films, not to be watched too often but always an effective antidote to the real world. Next: Hotel Du Nord.",
         "I took a class in French Poetic Realism and Italian Neorealism this past Fall in which I saw many of the best films I will ever see. The third film we watched in the class was Jean Vigo's L'Atalante, which is just about the most gorgeous experience in film viewing I have ever experienced. I left the building in a cloud of euphoria, and I have never stopped thinking about it. One week later, we watched Le Quai des Brumes (Port of Shadows). It affected me greatly in the opposite direction of L'Atalante. It made me lonely and grief-stricken. That is in no way a criticism; for the most part, any film that transforms my emotions, whether for the better or the worse, is a great film. Le Quai des brumes is about a man played by the great Jean Gabin (the star of La Grande Illusion) who has deserted the army (a fact that is never mentioned specifically, since the French censors refused to let the filmmakers portray such an immoral deed). Everyone who he finds around him is morally corrupt. He finally befriends a dog, the most loyal of all animals, and then Nelly, a young woman who is being torn apart by her gangster suitor, Lucien, and her foster-father Zabel (played by L'Atalante's own Michel Simon). The whole film falls into unavoidable and quite grueling violence. It is so depressing that the French director Jean Renoir (of La Grande Illusion and Rules of the Game) accused it of being Fascist. Those who know the film know this quotation, and have pondered it for the longest time. It does make perfect sense however. Hope leaves quickly after it is seen, and it is hard to get rid of. It fascistically knocks you down. 10/10",
         "SPOILERS! QUAI DES BRUMES is one of those movies that will always exhale cinema history.Not only is it one of the most famous French movies before the second world war,but it has also got scenes and technique that changed film in general. Although I must say that it didn't struck me as much as LA GRANDE ILLUSION it still is a great movie.The dialogue is very poetic and full of references,the story is one of heartbreaking quality with a remarkable climax and the acting is first class.Jean Gabin shows why he is probably the greatest French actor ever and Michele Morgan is striking as his love interest.Michel\"Saddam Hussain after being captured in his lair\"Simon plays her wicked father-tutor.Pierre Brasseur plays the gangsterly type who finally kills Jean in a desperate act of jealousy.Brasseur is the only actor out of place here although he is highly regarded in France. Several one liners and scenes in QUAI DES BRUMES are undoubtedly important for the cinema as a whole.This film reminded me quite a lot to CASABLANCA.The scenes with Gabin and Morgan at their romantic peak(\"T'as de beaux yeux tu sais\") are very similar to Bogart and Bergman(\"Here's looking at you,Kid\").Curtiz took a good look at QUAI DES BRUMES,I think. The gloomy surroundings and the constant foggy city of Le Havre is clearly the basis of the later Film Noir.The use of this technique in QUAI DES BRUMES is great. Like I said,a very important film in cinema history but certainly not the greatest.It misses the greatness of a true classic. 8/10",
         "This atmospheric film, directed by Marcel Carne, presents a case for the poetic realism, a style that was prevalent in the French cinema of that era. Carne and his collaborator, Jacques Prevert, adapted the Pierre Dumarchais novel for the screen giving it a powerful visual style that reflected the way most French film makers embraced for the stories they loved to give their audiences. Mr. Carne was blessed when he selected Eugene Schuffan as his cinematographer, who did wonders with the way he photographed the story. Maurice Jaubert's musical score also is effective in setting the mood. The story centers around Jean, a deserter from the army who is hitchhiking north, hoping to get on a ship overseas out of Le Havre. He is almost killed by the truck driver who stops suddenly in order not to harm him. After that, he offers Jean a ride to the port, but Jean infuriates his rescuer when he overtakes the control of the truck to avoid killing a dog. This action nets him with a true and loyal friend, who obviously is grateful and adores his master. Jean is saved from the police by the drunk Vittel as he is walking on a street near the night club. Inside, Luicen, a local effeminate criminal, Lucien, is trying to scare old Zabel, a shop owner. Vittel asks Jean to go with him to Panama's place, outside the town, by the water. Panama, a kind man with a past, seizes Jean's situation and offers him badly needed food and shelter. It is while he is eating that Jean spots Nelly, a gorgeous young woman who appears either to be a prostitute, or someone awaiting for a rendezvous. Lucien pays Panama a visit, but Panama repels the intrusion. Nelly and Jean leave together the following morning toward the town. It's clear both like each other. Nelly, who goes back to Zabel's shop, finds the older man repulsive, but it appears that not having any other means of support she must stay in the present situation. Jean doesn't have any idea of what's going on. At the night club the following night, Lucien is rough with Nelly, but Jean slaps him back provoking tears in the tough guy. Jean, who has found a possibility to get aboard a ship leaving for Venezuela, is surprised when Panama gives him clothing used by a painter he had met the night before. He seems to be on his way out, but Lucien and his gang have another idea for Jean. The film clearly solidified Jean Gabin's total domination of the French cinema, bypassing the popular Charles Boyer. Mr. Gabin is always a joy to watch in any of his movies. It's easy to see why he was one of France's most beloved figures of the cinema because he was always true to the character he was portraying and he convinces us he is no one but that person in that situation. Michele Morgan, who plays Nelly, one of the great beauties of all time, brings life to this young woman in the story. Her chemistry with Jean Gabin is easy to see. Michel Simon, another great actor from France, is seen as Zabel, a man that loves the young woman, knowing he doesn't stand a chance to get her. Pierre Brasseur is the fiendish Lucien. Eduard Delmont appears as Panama and Raymond Aimos is Vittel. This film showed Mr. Carne at his best. The film is recommended for lovers of the classic French cinema.",
         "...blame it on the \"Quai des Brumes\" !Both the right wing and the leftist reviews were chilly ,calling the movie \" morbid\" .Military censorship quickly banned \"Le Jour se Lève\" which was,if it were possible,even more depressing -and in my opinion even better,though at such a stratospheric level of art,this is minor quibble. \"You do not blame a barometer which forecasts the storm\" was Carné's famous answer. \"Quai des Brumes\" belongs to the legend of the French cinema.In a poll made around 1980,it was 8th best French film of all time (the number one,another Carné's masterpiece \" Les Enfants Du Paradis\" was a safe ,predictable choice ).More than the detective plot (there are many deaths in this film) ,the atmosphere of this misty harbor,with its ships about to sail away for these islands in the sun you'll never know ,is all that counts.It was the triumph of the Réalisme Poétique ,a label Carné himself did not like : these stories were poetic but they were not that much realistic,for they were filmed in studios ;masterpieces of cinema de studio of these golden years ,when the French were the best in the world : the harbor is unforgettable,as are the Canal Saint-Martin in \"Hotel Du Nord\" ,the metro station in \"les Portes de la Nuit\" or Le Boulevard Du Crime\" in \"Les Enfants Du Paradis\". After an odd effort -which is today considered ahead of its time- \" Drôle De Drame\" , \" Quai Des Brumes\" is actually the follow-up to \"Jenny\" (1936).The gallery of sinister-looking persons was already present in Carné's first movie,and Françoise Rosay's last lines indicated that the relatively optimistic ending would mute . \"Quai Des BRumes\" leaves no hope to the viewer .This harbor which should mean freedom,escape is actually a blind alley ;nobody can escape.When Gabin appears in his shabby uniform and the gorgeous Michele Morgan in her raincoat and wearing her famous beret ,we know that their fate is already sealed.All the b.... around cannot understand true love .This is Carné's favorite subject: Michel Simon and Michèle Morgan are the prototype of the director's odd couple :see also Jules Berry and Jacqueline Laurent in \"Le Jour Se Lève\" or Pierre Brasseur and Nathalie Nattier in \"Les Portes De La Nuit\". Extraordinary scenes: Michel Simon,playing loud classical music which becomes \"exotic\" in such a rotten world.The same ,crying his heart out for love which he has never known \"Nobody loves me!\" ;Nelly and Jean on the harbor,exchanging Prevert's haunting lines \" Every time the sun rises ,we hope something fresh will be born,but when it goes down,it the same old gloomy world\" \"The bottom of the sea is full of rubbish\" ;the opening scenes ,with this truck running through a foggy country . All the endings of Carné's movies of that era are mind-boggling:from the sun rising as the tragedy is complete (\"Le Jour Se Lève\") to the still beating hearts (\"Les Visiteurs Du Soir\"),from Baptiste lost in the crowd (\"Les Enfants Du Paradis\" ) to the stunning editing which concludes \"Quai Des Brumes\" : Jean,Nelly,the ship,the dog ,all this ,more than the other endings had a strong influence on more movies I can think of: Yves Allegret 's \"Dédée D'Anvers \",Carol Reed's \"Odd man out\" -also influenced by Duvivier 's 'Pepe le Moko\" are two prominent examples. We may have lost the war...but we have gained another masterpiece by one of our greatest directors and one of our greatest writers.",
         "I know, I know, this isn't film noir, it's 'poetic realism.' Fine with me, but it's still an early example of noir to me. And while this film has many strong points, it's very easy to overrate it. For one thing, it's totally predictable. If you haven't figured out by the halfway point what's going to happen to the Gabin character, you just haven't been to very many movies. For another, the first half of the film is disjointed and just plain dull. However, after the halfway point it begins to pull itself together and ends up working rather well. On to the strong points. Gabin is, well, Gabin. He is one of those rare screen presences who is watchable and enjoyable in anything. And Michele Morgan, who I don't recall seeing before, is beautiful, magnetic, and riveting. It's hard to believe that she was only 18 when she played in this film. And the tone of the film--downbeat, mildly depressing--is a healthy antidote to the relentlessly upbeat Hollywood productions of the time. And the downbeat tone is probably much more appropriate to 1938 as well. Some reviewers have criticized the sets. Personally, I think they worked. This film worked very hard to create an atmosphere, and for this the sets were perfect. The film was also daring for its time, although perhaps not for the French. The Morgan character is strongly hinted to be a woman of easy virtue and, at a time when Hollywood was plagued by the Hayes code that prohibited even a hint of sexuality, there is a very obvious 'morning after' scene in which it is obvious that the Gabin and Morgan characters checked into a hotel room and spent the night together. There is even a scene after the morning after scene in which it is obvious that they are about to go at it again; Gabin grabs Morgan, they embrace and start to fall on the bed, and the scene fades out. Moreover, in an era when such things weren't even hinted at, there is a subtle suggestion that Morgan's godfather/caretaker may have molested her, and there is a less than subtle suggestion that he lusts for her. In these senses the film was way ahead of its time. Definitely worth seeing. 8/10",
         "Interesting what a contrast this movie makes to Carne's \"The Children of Paradise\". The two are almost complete opposites where mise-en-scene is concerned, and yet more interesting is that they both show a filmmaker with a craft of form and expression that rises beyond most other filmmakers, including his contemporaries. \"Port of Shadows\" is about a French army deserter (Jean Gabin, wonderful as usual) who attempts to flee the nation in order to finally begin a life away from the bad luck that's always held him. He appears at a small port town, immediately falls in love, and sets off a chain of events that show an inherent fatalism with a sense of humor, tragedy, and substance. This movie has one of those scripts that's very appealing in the way that it sends characters wandering through the mists, and yet somehow everything comes together and ties up all loose ends by the end. Adding to it the moody, brooding cinematography filled with fog and smoke, and one can't help but immerse oneself gladly into a different world. Also, Carne adds a sense of theatricality and the Carnivalesque that even Fellini couldn't compare to. This is definitely a film that well deserves being called \"a classic of French cinema.\" --PolarisDiB",
         "The version I watched is the one released in 2004 on Criterion. This comes with a 30-page booklet with an essay by Luc Sante and an excerpt from Marcel Carne's autobiography. The DVD has a very clear picture and crisp sound. I found the story quite interesting and was impressed by each the actors. There is one scene which makes use of classical music during a moment of violence. It made me think of a movie made much later, Stanley Kubrick's A CLOCKWORK ORANGE. PORT OF SHADOWS is about degrees of violence. The adolescent thugs who terrorize the little port city of Le Havre have no idea of what is hidden in the lives of the two protagonists: A soldier who has deserted the army after going through something unspeakable in Tonkin and the urbane middle-aged man who has had enough of losing. I think the inevitability of the events in this movie bothers many people who have reviewed it on this database. It doesn't bother me."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Ciné-Alliance"],
      "summaries": [
         "Life's a rotten business, says Jean, a deserter who arrives at night in Le Havre, looking to leave the country. He lucks into civilian clothes, a little bit of money, a passport, and a dog, and he also meets Nelly, a 17-year-old who's grown up too fast. She's the object of lust of men: including a boyfriend Maurice, her putative protector Zabel, and Lucien, a local hood. Jean falls for her, faces down Lucien, and gives her courage to stand on her own feet. A ship is leaving for Venezuela; can at least one of them be on it, or is that just a dream?",
         "A military deserter finds love and trouble (and a small dog) in a smoky French port city."
      ],
      "budget": 0
   },
   "movielensId": 8786,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1938-05-17",
      "dvdReleaseDate": "2004-07-20",
      "directors": ["Marcel Carné"],
      "runtime": 91,
      "movieId": 8786,
      "title": "Port of Shadows",
      "mpaa": "",
      "actors": [
         "Jean Gabin",
         "Michel Simon",
         "Michèle Morgan",
         "Pierre Brasseur",
         "Édouard Delmont",
         "Robert Le Vigan",
         "René Génin",
         "Raymond Aimos"
      ],
      "imdbMovieId": "0030643",
      "originalTitle": "Le Quai des brumes",
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "lK2SjtneKVM",
         "52MtDn6S0m4"
      ],
      "plotSummary": "A military deserter in a French port city finds love amidst trouble.",
      "tmdbMovieId": 46326,
      "avgRating": 3.80405,
      "releaseYear": "1938",
      "numRatings": 148,
      "posterPath": "/yoiJPfIBWWFC81w1pf1rFDdpRbf.jpg"
   }
}