{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt0446930",
      "video": false,
      "title": "The Waiting Room",
      "recommendations": [],
      "backdrop_path": "/60do7jNeeEOPFMPuT8RtcAmEoxJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe481dc3a36847f8158729",
               "name": "Zeki Demirkubuz",
               "profile_path": "/pMablGX4RR8gAcN2cD1BIG7Z232.jpg",
               "id": 145518,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe481dc3a36847f815872d",
               "name": "Nilüfer Açıkalın",
               "profile_path": null,
               "id": 145520,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe481dc3a36847f8158731",
               "name": "Nurhayat Kavrak",
               "profile_path": null,
               "id": 145521,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe481dc3a36847f8158725",
            "name": "Zeki Demirkubuz",
            "profile_path": "/pMablGX4RR8gAcN2cD1BIG7Z232.jpg",
            "id": 145518,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.111399,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 52188,
      "vote_count": 3,
      "budget": 0,
      "overview": "Zeki Demirkubuz plays the lead character Ahmet who wants to make a film about Dostoyevsky's 'Crime and Punishment'. He falls into a deep depression, loses interest in the film and life, pushes those who love him away and cannot complete the film.",
      "similar": [],
      "original_title": "Bekleme Odası",
      "runtime": 92,
      "poster_path": "/mNd7eF9tztq9M2lxnbfnN0JmXb.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [],
      "release_date": "2004-02-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zeki Demirkubuz"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Zeki Demirkubuz"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0446930/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEwOTAxNTgzNTheQTJeQWpwZ15BbWU4MDI2NDAwNjAx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Zeki Demirkubuz, Nurhayat Kavrak, Nilüfer Açikalin | See full cast and crew »"],
      "reviews": [
         "i met Demirkubuz's cinema with a friend recommendation...it was Kader. which i gave 8 on here and a must have...then i started to search on it's previous movies. Bekleme odasi is the final chapter of tales about darkness trilogy so i selected all for advancing more to understand his vision to cinema and ,i wasn't disappointed. Tales about darkness series focusing on sins that we don't like to talk much with anyone even with ourselves. Demirkubuz's cinema is so heart-to-heart made in so close to real life's problems and human relationships. i also love the timing of endings. if you love Nuri Bilge Ceylan and Kim-Ki Duk's movies please take a look at Zeki's intellegently visioned humanious sins called tales about darkness ...frist one yazgi and then itiraf the final is bekleme odası. you won't be disappointed as me...",
         "The third in director Zeki Demirkubuz' \"Tales of Darkness\" trilogy, BEKLEME ODASI (THE WAITING ROOM) has been inspired by Dostoyevsky. Ahmet (Demirkubuz) is a moderately successful screenplay writer working on a version of CRIME AND PUNISHMENT. Eventually he hits a mental block and falls into depression as a result. Unable (or unwilling) to engage with life any more, he maltreats his partner Serap (Nilüfer Açıkalın) and secretary Elif (Nurhayat Kavrak), before allowing wannabee actress Sanem (Eda Toksöz) to share his bed. This final relationship unblocks him, and he begins to write a screenplay with himself as the Raskolnikov character listening to the sounds of the night and looking out of the window. As in his previous movie İTİRAF, Demirkubuz the director explores the destructive consequences of characters refusing to come to terms with their inner demons. Ahmet has become so accustomed to creating cinematic fictions that he has a pathological inability to tell the truth; he lies to Serap, Elif, and naive hobo Ferit (Ufuk Bayraktar) who is persuaded to take on an acting role in Ahmet's (non-existent) film of CRIME AND PUNISHMENT. Once Ahmet's falsehoods have been unmasked, it's not surprising that Serap and Elif leave him for good. BEKLEME ODASI contains echoes of Demirkubuz's earlier film ÜÇÜNCÜ SAYFA in the way it shows the protagonist unable to separate truth from fiction; but in Ahmet's case this handicap proves thoroughly destructive. Ferit's ambitions for cinematic glory land him in jail; while Kerem, Elif's boyfriend (Serdar Orçin) ends up revealing personal truths that would have been better kept secret. It seems as if Ahmet's intellectual frustrations have transformed him into a misogynist, someone actively wanting to hurt those weaker - both physically as well as mentally - than himself. BEKLEME ODASI incorporates several stylistic devices characteristic of Demirkubuz's work; the frequent use of extended fades to black; the superimposition of prison images (window bars, for example) on the characters' faces or at the back of the screen; and shots of Ahmet traveling in his cars that focus on his expressionless side profile or show him from the back looking out of the windscreen at an apparently endless urban road. Such imagery sums up the confinement as well as the aimlessness of Ahmet's life. The Dostyoevsky allusions work well on one level, in the sense that Ahmet receives due punishment for the emotional crimes committed on those foolish enough to fall in love with him; but the story of Demirkubuz's film lacks the ideas of faith and redemption permeating the source-text. Perhaps these notions are no longer achievable in the contemporary world in which illusion seems so much more superficially attractive than truth. BEKLEME ODASI portrays a thoroughly unattractive central character, but does so competently. The film grabs our attention and doesn't leg go throughout its running time of just over ninety minutes."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Mavi Film"],
      "summaries": ["Zeki Demirkubuz plays the lead character Ahmet who wants to make a film about Dostoyevsky's 'Crime and Punishment'. He falls into a deep depression, loses interest in the film and life, pushes those who love him away and cannot complete the film."],
      "budget": 0
   },
   "movielensId": 87996,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2004-02-27",
      "dvdReleaseDate": null,
      "directors": ["Zeki Demirkubuz"],
      "runtime": 92,
      "movieId": 87996,
      "title": "The Waiting Room",
      "mpaa": null,
      "actors": [
         "Zeki Demirkubuz",
         "Nilüfer Açıkalın",
         "Nurhayat Kavrak"
      ],
      "imdbMovieId": "0446930",
      "originalTitle": "Bekleme Odası",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Zeki Demirkubuz plays the lead character Ahmet who wants to make a film about Dostoyevsky's 'Crime and Punishment'. He falls into a deep depression, loses interest in the film and life, pushes those who love him away and cannot complete the film.",
      "tmdbMovieId": 52188,
      "avgRating": 3.5,
      "releaseYear": "2004",
      "numRatings": 5,
      "posterPath": "/mNd7eF9tztq9M2lxnbfnN0JmXb.jpg"
   }
}