{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "vice squad",
         "id": 155545
      }],
      "imdb_id": "tt0046514",
      "video": false,
      "title": "Vice Squad",
      "recommendations": [],
      "backdrop_path": "/pnpST2MUsAMaZU73HDX7TCoA03g.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Capt. 'Barnie' Barnaby",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68b5",
               "name": "Edward G. Robinson",
               "profile_path": "/af1aBRi4UccaxtmDPWEtlfy1vXE.jpg",
               "id": 13566,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mona Ross",
               "gender": 1,
               "credit_id": "52fe49399251416c910a68b9",
               "name": "Paulette Goddard",
               "profile_path": "/8MuOzgtsI1PQUIlj2e2Y1UFLpTc.jpg",
               "id": 14027,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ginny",
               "gender": 1,
               "credit_id": "52fe49399251416c910a68bd",
               "name": "K. T. Stevens",
               "profile_path": "/fV0QHUYSbHIsIML5j6H2PA0SwOR.jpg",
               "id": 89983,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jack Hartrampf",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68c1",
               "name": "Porter Hall",
               "profile_path": "/73hzC2AnpyFHOceuq4ZdUbsNQds.jpg",
               "id": 14975,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Marty Kusalich",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68c5",
               "name": "Adam Williams",
               "profile_path": "/eGdsCvVnd66A57JOEQ2SghzSBJi.jpg",
               "id": 2645,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Al Barkis",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68c9",
               "name": "Edward Binns",
               "profile_path": "/77FaXwoiEOkKCDXDfvvG65Sx788.jpg",
               "id": 2651,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dwight Foreman",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68cd",
               "name": "Barry Kelley",
               "profile_path": "/q1t3gNvtx0A4pGHEGUJATuMIrwZ.jpg",
               "id": 89834,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Frankie Pierce",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68d1",
               "name": "Jay Adler",
               "profile_path": "/vBwdEXvk96OLlIiykTst6cgIl5y.jpg",
               "id": 3343,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Det. Lacey",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68d5",
               "name": "Harlan Warde",
               "profile_path": null,
               "id": 93899,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Carol Lawson",
               "gender": 0,
               "credit_id": "52fe49399251416c910a68d9",
               "name": "Mary Ellen Kay",
               "profile_path": "/uKKJIQurxaYURt9wRcbITzhtyMO.jpg",
               "id": 103102,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Pete Monty",
               "gender": 2,
               "credit_id": "52fe49399251416c910a68dd",
               "name": "Lee Van Cleef",
               "profile_path": "/oEEsdGCBjpyJyVZlx1X8PKvHe7S.jpg",
               "id": 4078,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Cop (uncredited)",
               "gender": 2,
               "credit_id": "5832ddbf92514162d203851f",
               "name": "Murray Alper",
               "profile_path": "/gt2IIpoK6M8YVgmTrqV6A3dDz7j.jpg",
               "id": 14454,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49399251416c910a68b1",
               "name": "Arnold Laven",
               "profile_path": "/lvKXxRX8PVyxRWFVsraflnaNYxi.jpg",
               "id": 55692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49399251416c910a68e3",
               "name": "Lawrence Roman",
               "profile_path": null,
               "id": 70682,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49399251416c910a68e9",
               "name": "Leslie T. White",
               "profile_path": null,
               "id": 144133,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe49399251416c910a68ef",
               "name": "Herschel Burke Gilbert",
               "profile_path": null,
               "id": 55694,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49399251416c910a68f5",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe49399251416c910a68fb",
               "name": "Arthur H. Nadel",
               "profile_path": null,
               "id": 161267,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 1.700629,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85367,
      "vote_count": 5,
      "budget": 0,
      "overview": "A Los Angeles police captain (Edward G. Robinson) ties the case of a slain policeman to a bank robbery, all in a day.",
      "similar": [
         19460,
         100181,
         37131,
         27280
      ],
      "original_title": "Vice Squad",
      "runtime": 87,
      "poster_path": "/jArnXO9eMQ4jB6Uhh3wixmp40b5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sequoia Pictures",
            "id": 4629,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sol Lesser Productions",
            "id": 4213,
            "origin_country": ""
         }
      ],
      "release_date": "1953-07-31",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Holds you... like a gold diggin' woman!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Arnold Laven"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Lawrence Roman",
         "Leslie T. White"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046514/",
      "coverLink": null,
      "actors": ["Stars: Edward G. Robinson, Paulette Goddard, K.T. Stevens | See full cast and crew »"],
      "reviews": [
         "This is not one of Edward G's best films. In fact it may be his worst but it is still watchable. It's pretty much a run of the mill 50's crime story which centers around the activities in one day of a detective's life. Good black and white photography with excellent location shots.....not much use of studio sets. This adds to the realism and if you like old cars, the street scenes are for you! Edward G. is, as usual, top notch and for once gets to be a good guy. An aging Paulette Goddard, whose star was really on the wane, is adequate as the madame of an \"escort service\"....a thinly disguised brothel....her wordplay with Edward G. is sharp and ever so sexy. The supporting cast is familiar to all......and Lee VanCleef pops up as a killer (what else?) in one of his early films before he became an icon in Italian westerns. This is an enjoyable, throw-away film that is worth catching on some late night weekend. Anything with Edward G. is always one to watch.",
         "Vice Squad takes a documentary style approach to a single day in a police captain's life and what he might encounter. Of course the murder of a police officer doesn't ever qualify as an ordinary day, but even on those days when an entire force is mobilized looking for a cop killer, still more mundane matters intervene. Edward G. Robinson was in his B film period which is roughly between All My Sons and The Ten Commandments. Still Robinson always brought a certain class to the films he was doing and Vice Squad is no exception. Second billed in the cast is Paulette Goddard who is a madam at a bordello. She was on a blacklist of sorts herself at the time, not for politics, but because she had antagonized the powerful Cecil B. DeMille during the shooting of The Unconquered. Her career was winding down, but she would be marrying Erich Maria Remarque and be leaving the screen shortly for Switzerland. Goddard and Robinson have a nice bond between them. It's obvious he lets her operate because she can be most valuable as a snitch in a pinch. In fact she does come through with some information that starts the case being cracked. Funny though, ten years earlier Robinson and Goddard as co-stars would have commanded an A list budget, even five years earlier. Hollywood could be very fickle at times. Still for a B police drama, Vice Squad has an impressive cast list of quality players. Best in the film is Porter Hall, a two timing funeral director who Robinson knows saw something, but won't crack because he was spending a night with his girlfriend instead of being out of town as he told his wife. How they manage to keep him 'in the system' so to speak is really quite ingenious much to the exasperation of his lawyer, Barry Kelley who runs a close second to Hall. Mixed in with the hunt for a cop killer are more routine matters like exposing a phony Italian count, dealing with Percy Helton's imaginary crimes and a TV interview for publicity's sake. All in the life of a Vice Squad captain. Fans of Edward G. Robinson and Paulette Goddard will like what they see and Vice Squad is a nice tightly scripted and edited police drama.",
         "This is one of those excellent programmers that studios used to churn out as fillers (second or third features) when a day at the movies was really a day at the movies. Not 90 minutes to two and a half hours, but five hours, followed by a late dinner with your girl friend, boy friend, spouse, or kids. Robinson knocked this film (and several other excellent ones) he did in the early 1950s because his days of movie stardom seemed over (due to blacklisting, as well as a messy divorce). It was a bitter time, and his memories were colored by that bitterness. Yet in this period he did films with Paulette Goddard, Ginger Rogers, Alan Ladd, John Forsythe, and Barbara Stanwyck (the last a western). He even did a second film with his old film co-star (and nemesis) George Raft. Not bad for a barren period. Considering the number of films he did appear in, and comparing his situation to that of ... John Garfield, Robinson did not do too badly. This film was made shortly after \"Detective Story\" with Kirk Douglas, William Bendix, and George Macready. While that was a good film too, it was based on a successful stage play. This is based on a script from Hollywood originally. But it is one of those \"day in the work life of a police officer\". Robinson is shown trying to find the two goons (Edward Binns and Lee Van Cleef) who killed one of his men in a robbery. He is also handling problems with a fake-Italian fortune hunter, a scared little man (Percy Helton), and even a television news spot he has to give. He handles everything with considerable professionalism and aplomb. \"Detective Story\" may have initiated this period of films like this, but in actuality \"Detective Story\" centered on the emotional problems of \"good\" cop Kirk Douglas, and how he resolves them by sacrificing himself to catch an armed criminal (Joseph Wiseman). A better film to compare it with is \"Gideon's Day\", an odd film made a few years later by John Ford. Unlike most of Ford's films it was shot in England, and starred Jack Hawkins. The \"Gideon\" novels were popular detective stories at the time, and \"Gideon's Day\" dealt with Chief Inspector Gideon tracking down the thieves who fatally injured a policeman who tried to stop them. Ford's film dealt with other incidents in the officer's day, including meeting a new constable who is something of a stumble-bum, who ends up being re-introduced to him as his daughter's new boy friend. Although minor John Ford, it has some good moments (such as Hawkins talking to the dying police officer in the hospital, which is shown from the point of view of the officer going in and out of consciousness). Except that it takes place in London, not L.A., it is a match for \"Vice Squad\". But somehow \"Vice Squad\" works better. Except for the comedy about Gideon's daughter and her new boy-friend, most of \"Gideon's Day\" is definitely set in England, and yet Ford can't get his Irish-Americanism totally out of himself. At one point an angry Gideon has to restrain himself from taking a poke at an arrested perpetrator. That would not have been normal in England, where that type of reaction is usually not met with. It would have happened in the 1950s (or even the 2000s) in any American city, but that seems to be expected. \"Vice Squad\" has some good performances holding it up. Binns and Van Cleef do their normally professional jobs as the killers. Percy Helton plays a timid rabbit of a man, who has seen Robinson before (the scene humanizes both men, for Robinson knows Helton's fears are based on psychological problems and has been trying to get him to see a doctor). Porter Hall plays possibly the funniest schlemiel type he ever had the luck to play, as a man who was out on a private toot but is paying for it again and again because he was at the scene of the crime, so he is possibly a witness. Ironically Hall never saw anything, but Robinson still manages to use him effectively against somebody who can unlock the mystery. Even Hall finally realizes that it's to his advantage not to deny anything, but to play along with Robinson's hunch. The two did well together in \"Double Indemnity\", and it pleasant to see they still well together here. Paulette Goddard's performance is smaller than one would have wanted, but she makes the most of the role of the head of the \"escort\" services. If the rule twisting here seems out of date, please remember this is from 1953. The Warren Court had not started changing the open door policy for police investigations yet.",
         "I totally enjoyed this movie! I especially liked that EGR played his character cool, calm and collected. You don't see him yelling at his men and gesticulating all over the place! He portrayed his character as an adept psychologist, an independent thinker, who exhibits grace under fire. He uses compassion and sensitivity in a reassuring way. He sees all of the pieces to a puzzle and knows exactly where to place them in order to make a full picture. The locations, cars and clothes just blew me away. I grew up in Los Angeles during the early 50's, and I remember riding in a 1949 Ford and 1953 Buick that my father owned. The way the men looked in their full dress suits and sky highs (slang term for hats); and the women in their quiet elegance (never without gloves); is one of the reasons I love movies from the 40's and 50's. Even to this day, if I pass through an old part of Los Angeles that is somewhat still intact (which is rare) from that time; it brings back old sweet memories, and I want to stay in that time warp and never come out. If you like EGR, cars, great locations, clothes, coolness and justice....Then you need to see this movie. All I need is for this movie to be released on DVD.",
         "EDWARD G. ROBINSON viewed this period in the early '50s as his B-film era, but VICE SQUAD is an efficient, if low-budget product that gives him a chance to show his stuff in a story about the day to day activities of a police precinct in '50s L.A. PAULETTE GODDARD gets top female billing in what is essentially a cameo role as her career was obviously in decline at this point. She's sassy and brittle as the head of an escort club who agrees to cooperate with Robinson's police investigation. Robinson is seen adroitly handling a number of sticky situations, including the death of a policeman and the reluctance of a witness to talk; the discovery that a bank heist is about to take place; and the effect of the cop killing on a gang of car thieves. It's interesting to catch an early glimpse of LEE VAN CLEEF as one of the car thieves. There's a film noir look to Joseph Biroc's first rate B&W photography with excellent use of light and shadows and it's directed in brisk style by Arnold Laven. All of the intertwined stories are smoothly coordinated but the tension doesn't start building until about forty-five minutes into the bank heist sequence. Actually the police tactics shown are pretty underhanded, so it's not exactly a flattering portrait of police procedures--but they do seem credible. Packs just as much suspense as another crime melodrama with a New York locale--THE NAKED CITY. The shots of L.A. in the early '50s establish atmosphere from the start. Well worth viewing.",
         "I heard that Edward G Robinson referred to this as his \"B\" period. After seeing this movie, I'm really sorry he felt that way. Vice Squad is the story of a Chief of Detectives in LA dealing with a half dozen related problems, but primarily with a cop killing that is tied in with a bank robbery. There will be comparisons to Detective Story - and there are similarities - but despite it's puny budget, over the hill or unknown stars, and poor production values I think this is a better movie. In fact for the reasons above, it seems to have a more realistic feel. The action sequences and dialogue are, for the most part, really believable. EGR was under suspicion by HUAC when this was made and I think it was reflected in his underplayed performance, which I think was an improvement. Paulette Goddard was totally irrelevant. Her part could have been played better by somebody like Isabel Jewell. Porter Hall and Jay Adler were never better. I am sorry this film never got the attention it deserved. I'm sorry that Eddie G thought so little of it. But most of all, I am sorry that most people will never get to see it. I am an avid movie buff and it took me almost 50 years before I ever knew it existed. Please, see it if you can.",
         "Vice Squad starts off like a sip of espresso: dark, strong, with a scorched aftertaste. But soon it grows lukewarm. It had the makings of a solid �50s crime drama but dilutes them with quirky human-interest vignettes that bear no relation to the central story. Less film noir than a dutiful police procedural, it looks like an attempt to reprise the more intense Detective Story of two years earlier. Still, it's not a bad movie, if humdrum, centering on the killing of a cop by two members (Ed Binns, Lee Van Cleef) of a gang planning a bank job. All the plot strands lead to Chief of Detectives Edward G. Robinson (did anyone ever enunciate English more precisely?). Among them are witness Porter Hall, reluctant to get involved because he was seeing his mistress (Joan Vohs); his big-shot, big-mouthed attorney, Barry Kelley; ritzy madam Paulette Goddard, deputized to pick up information from clients she and her girls `escort;' reluctant stoolie Jay Adler; and gang member Adam Williams, who's losing the nerve to go through with the heist. Populating the more remote subplots are Percy Helton, who thinks he's pursued by `television shadows' and a phony Italian `Count' pulled in for marriage bunco. The bank job comes off, but not quite as planned, as plainclothes police are planted on the scene. But Binns and Van Cleef manage to nab a hostage.... The busy plot advances clearly enough (despite some lapses in continuity: The mistress' name is `Vicki' in an address book but `Vickie' on her mailbox). The most arresting part of Vice Squad are the scams, subterfuges and outright blackmail the police use to pressure witnesses to talk. They're presented not as expedient short-cuts to find a policeman's murderers but as routine � business as usual. In that regard it reflects the super-patriotic climate of America during the Red-Scare years, though there's not a Communist in the movie, let alone any suggestion that officers of the law may be overstepping their bounds.",
         "Excellent cast. Paulette Goddard, basic minor role but still has the oomph. E.G. Robinson never ceases to amaze me, he is always the main force in all the movies he is in, I never tire of seeing him on film. The film did a very good job of developing the day to day business of a major city police station without making the police to appear as super human beings.",
         "If you're old enough to remember L.A. in the early fifties, this is particularly fun. Lot's of location stuff, downtown, Long Beach or San Pedro. And the bank robbery takes place in Beverly Hills on Camden or Roxbury Drive, just below Little Santa Monica Blvd. Edgar G. Robinson is great as always. It's a cousin to Noir, lots of great faces and character acting. They couldn't afford a lot of sets, or any star beyond E.G.R., which is part of the charm of the movie. And if you like Detroit when it still had character, you'll love the great early fifties cars.",
         "Veteran TV series director and producer (The Rifleman, Law of the Plainsman, Gunsmoke...) Arnold Laven give to the USA fifties cinema story the first movie showing clearly a call girls house activity and that is why this picture will remain in the spectator mind. The madam is a mature Paulette Goddard at may be one of his best roles on the screen. Edward G. Robinson plays with his usual professionalism police officer Captain Barnaby. Good supporting actors, including Italian born Lee Van Cleef much before meet Sergio Leone and his famous spaghetti-western series."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": [
         "Gramercy Pictures (II)",
         "Sequoia Pictures",
         "Sol Lesser Productions"
      ],
      "summaries": [
         "When a police officer is shot arresting a car thief, Captain Barnaby uses his skills and contacts to track down the culprits and uncovers a bank heist plan in the process. Barnaby has no qualms about bending the law to achieve his ends, including trumped up charges to persuade his only witness to cooperate or detaining some call girls to coerce their madam to help him. In the meantime he deals with everyday police business, juggling seemingly trivial matters with more serious ones.",
         "Police procedural film following a few cases assigned to LAPD captain of detectives Barney Barnaby."
      ],
      "budget": 0
   },
   "movielensId": 88228,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-07-31",
      "dvdReleaseDate": null,
      "directors": ["Arnold Laven"],
      "runtime": 87,
      "movieId": 88228,
      "title": "Vice Squad",
      "mpaa": "",
      "actors": [
         "Edward G. Robinson",
         "Paulette Goddard",
         "K. T. Stevens",
         "Porter Hall",
         "Adam Williams",
         "Edward Binns",
         "Barry Kelley",
         "Jay Adler",
         "Harlan Warde",
         "Mary Ellen Kay",
         "Lee Van Cleef",
         "Murray Alper"
      ],
      "imdbMovieId": "0046514",
      "originalTitle": "Vice Squad",
      "genres": ["Crime"],
      "youtubeTrailerIds": [],
      "plotSummary": "A Los Angeles police captain (Edward G. Robinson) ties the case of a slain policeman to a bank robbery, all in a day.",
      "tmdbMovieId": 85367,
      "avgRating": 1.75,
      "releaseYear": "1953",
      "numRatings": 2,
      "posterPath": "/jArnXO9eMQ4jB6Uhh3wixmp40b5.jpg"
   }
}