{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0056093",
      "video": false,
      "title": "If a Man Answers",
      "recommendations": [
         43506,
         19096,
         25848,
         32021,
         29601,
         39214,
         4940,
         14604,
         40718,
         43096,
         14750
      ],
      "backdrop_path": "/rGIujOMH9rsDuM8DMGWVnjSKlus.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Chantal Stacy",
               "gender": 1,
               "credit_id": "52fe46e3c3a36847f8117e4f",
               "name": "Sandra Dee",
               "profile_path": "/ePJuenWz5ZtbbKSTKrQG4I3K2PH.jpg",
               "id": 89808,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Eugene Wright",
               "gender": 2,
               "credit_id": "52fe46e3c3a36847f8117e53",
               "name": "Bobby Darin",
               "profile_path": "/nxouujzS0fm2iDvqRGTmXhO2Kxu.jpg",
               "id": 89809,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Germaine Stacy",
               "gender": 1,
               "credit_id": "52fe46e3c3a36847f8117e57",
               "name": "Micheline Presle",
               "profile_path": "/l3JEGPsntAwicRgZaNelmVoYGmg.jpg",
               "id": 34595,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "John Stacy",
               "gender": 2,
               "credit_id": "52fe46e3c3a36847f8117e5b",
               "name": "John Lund",
               "profile_path": "/hCnrqgBFMfgL2WJWOqCl8zbPZUD.jpg",
               "id": 95313,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Robert Swan / Adam Wright",
               "gender": 2,
               "credit_id": "52fe46e3c3a36847f8117e5f",
               "name": "Cesar Romero",
               "profile_path": "/fdPXkT3PDFCvVpfI1MUdbEMuz3n.jpg",
               "id": 4355,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe46e3c3a36847f8117e63",
               "name": "Stefanie Powers",
               "profile_path": "/xjK7ytgxD9MVkB1vTgjHgn83xMS.jpg",
               "id": 39762,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Richard",
               "gender": 0,
               "credit_id": "52fe46e3c3a36847f8117e67",
               "name": "Christopher Knight",
               "profile_path": null,
               "id": 1170235,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe46e3c3a36847f8117e6b",
               "name": "Charlene Holt",
               "profile_path": "/sakwwfzGw1GQLmyXSGrtGYBXudd.jpg",
               "id": 50970,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Florist",
               "gender": 0,
               "credit_id": "52fe46e3c3a36847f8117e6f",
               "name": "Ted Thorpe",
               "profile_path": null,
               "id": 1196203,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e3c3a36847f8117e4b",
               "name": "Henry Levin",
               "profile_path": "/613QaBnCNzpb9DuaoWg4Df1J6sU.jpg",
               "id": 39743,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a485a6f925141032000b321",
               "name": "Richard Morris",
               "profile_path": null,
               "id": 43817,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a485a79925141030e00b0d2",
               "name": "Ross Hunter",
               "profile_path": "/6bceImSg6xhZMdimjBIm6rdMjXx.jpg",
               "id": 41408,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.99633,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46081,
      "vote_count": 9,
      "budget": 0,
      "overview": "Chantel worries about her new marriage to photographer Eugene failing so she decides to take her mother's advice and manipulate him. First, her mother gives her a book that will solve all her problems about how to treat a husband - namely a book on how to train dogs. Then, her mother gives her a second trick, an imaginary boyfriend who used to come in handy during her own marriage to Chantel's father. However, if Chantel's mother made this man up, what is she going to do when Eugene brings him home for dinner one night?",
      "similar": [],
      "original_title": "If a Man Answers",
      "runtime": 102,
      "poster_path": "/gBe6ojFkr8m0LHsVW6yfjo8oc6a.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
            "name": "Universal International Pictures",
            "id": 10330,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ross Hunter Productions Inc.",
            "id": 1830,
            "origin_country": ""
         }
      ],
      "release_date": "1962-10-10",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Levin"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Richard Morris",
         "Winifred Wolfe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056093/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5NDE3Nzc1Ml5BMl5BanBnXkFtZTcwNzI5ODUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sandra Dee, Bobby Darin, Micheline Presle | See full cast and crew »"],
      "reviews": [
         "Some people seem to have to trash any movie as if that's being a critic. This is a very fun movie to watch. Chantal's (Sandra Dee) marriage has become ho hum and her husband seems to be more interested in work, with models no less, then his new wife so Chantal sets out to renew the spark their relationship once had but she finds no success. Then her mother suggests a book on training a dog to her. At first Chantal is repulsed but having no success any other way why not give it a try. The result is a madcap, whirlwind comedy from the good old days with the tables being turned on Chantal and her mother. This movie isn't on video but if it ever airs on TV again don't miss it! You'll enjoy being entertained and won't even miss the shock content directors add these days. The movie is a film of the play by the same name. Don't miss it and don't let jaded psuedo-critics dissuade you from watching this fun movie with more then one insightful point to ponder.",
         "This film, adapted from Winifred Wolfe's novel, has its moments and most of them are given to us by a very rare character in fifties comedies: an irresistibly attractive woman in her forties. Micheline Presle plays Sandra Dee's mother, and the dispenser of some delicious advice: Treat your husband like a dog. Sandy's taken aback, like everyone else, until Mother points out that dogs are treated with affection and respect - husbands often get neither. And then wives are surprised when they don't come home. Oh, there are other pleasures - Dee and Darin are agreeable, and Stefanie Powers gets to be the bitchy girl friend. But Presle is such a joy, she's worth the price of a ticket.",
         "I am so fortunate that this delightful, romantic, funny romp is now available on DVD (as are \"Come September\" and \"That Funny Feeling\"), so people can indulge in this fun fest and the chemistry between Sandra Dee and Bobby Darin (then married in real life). The plot concerns a wealthy young socialite, Chantal Stacy (the lovely and priceless Dee) who as trouble finding Mr. Right, until she meets photographer Eugene Wright (the cute and hilarious Darin). After she marries him, she tries to use her mother's advice by treating him like a pet, thinking that will make him a more affectionate and attentive husband. It works for a while, until Chantal spills her \"secret\" to her school friend (a young Stefanie Powers), who, just slightly tipsy, lets Eugene in on it, and leaving Chantal to find a different way to get his attention. Again, she turns to her mother for advice for some jealousy tactics. Micheline Presle is a gem as Chantal's mother, while John Lund is perfect as Chantal's protective father. And Cesar Romero is impeccable as Eugene's \"dirty old man\" artist father taking part in one of the schemes. And the cute dogs and the new little \"addition\" to the family . . . . . Dee and Darin were an adorable couple, and this movie confirms it. Don't listen to the critics' opinions about this blast from the past - it's a jewel. It's great that so many of these older movies are being released on DVD, as they so justly deserve to be. Now a whole new generation can enjoy them!",
         "If you love the lighthearted, romantic comedies of the 1960s, then you'll consider this one of the all time classics. In the same genre as the wonderful Doris Day movies of the same era, this will provide fun, wholesome viewing. A must-have for movie collectors of this time period!",
         "Okay, so Dee ain't Day, and Darin is hardly Hudson. There's a couple of surprises in this movie. In fact, there's a delicious exception to the rule: a woman in her forties who is wise, glamorous and a successful wife and mother. Micheline Presle plays Dee's mother, and she's the one who advises her daughter to treat her husband like a dog. \"Husbands often leave home; pets never do. There must be a reason.\" And, \"Most husbands are not given the affection and consideration of the average dog.\" She smiles knowingly, and Dee begins to follow instructions: \"Never lose your temper with your puppy...Praise him lavishly when he does something right...Make living with you so much fun he never wants to go anywhere else...\" And it works. Food for thought.",
         "Saw it on DVD. Not very high quality picture and sound, but OK for an early 1960s movie. Having seen \"Beyond the Sea\" last week, Kevin Spacey's tribute to Bobby Darin and Sandra Dee, watching this original with them in it was great fun. They had only been married a short time in real life, and here Sandra Dee is still only 19 during filming, but seems so much more mature. If one sees Dee in a good cross-section of her roles, you find out that she was a much more accomplished actress than many credit her for. This movie is very stereotyped. Dee's mother, originally from Paris, coaches her daughter on how to find and keep a husband. Even dad says \"When are you going to get married?\" A job change has them moving from Boston to Manhattan, and there she meets photographer Darin. Mom's secret is to treat the husband as if he were a pet dog, and use the same training techniques. Old friend played by a very young Stephanie Powers creates some tension, but the movie is all comedy, nothing to be taken seriously, and very un-sexy even though there is a running romantic theme. I enjoyed it, for what it is, a 1960s comedy with two young talents.",
         "A lot of cute fun with some wonderful moments. Sandra Dee is adorable and Bobby Daren is even better. The actress who plays Dee's mother, Micheline Presle, is the highlight of the film. Just like in Molly Hewitt's contemporary humor book \"Men Are Dogs: In the Best Possible Sense!\", she advises her daughter that if you think of a man as a completely different species from women (i.e. that they're dogs) then you will understand why they behave very differently from women. But the point of both the movie and the book, it's okay, men and women just aren't the same thing, and it's the little differences that are so funny. And if you haven't seen \"Beyond the Sea\" check it out. It's the Bobby Darin bio pic that will be in theaters soon.",
         "And this comes from a lifelong feminist. I saw this film on TV back in 1973, along with \"That Funny Feeling\". I have just bought both movies on DVD. They're both cute movies made in the early 1960s. I take them for what they are. They're funny, sweet flicks that leave something to the imagination. I liked Chantal's mother....yes, an attractive woman over 40. How often do you see that today in youth-obsessed Hollywood? Everyone dressed age-appropriately and not a pair of fake breasts to be seen! Sandra looked lovely, as always. There are too many things in this world these days to get bent out of shape about - this movie is not one of them.",
         "This is nothing but a \"feel good\" movie, and sometimes those are the very best kind to watch. I saw this movie years and years ago but haven't forgotton it. Why haven't they released it for home viewing yet? I want it on DVD...but I'd take it on VHS. I JUST WANT IT!!!!",
         "This lush Ross Hunter film of 1962 which attempts to patch together some BREAKFAST AT TIFFANY'S New York romantic sex comedy imagery and fashions (and scenes) along with a PILLOW TALK / LOVER COME BACK farce script almost succeeds in being enjoyable in 2011 by the fact it is well made. BUT and it is a massive BUT, it is miscast and relies on twee marriage drivel to put across some risqué (at the time) script and situations. Sandra Dee and Bobby Darin might have been a screen team du jour but are not of the calibre of actual adults. Had this been an Elvis Movie instead of Bobby Darin then we might have been in a soon to be classic 60s movie, as he would have the screen charisma Darrin lacks. Dee is fine fun and well dressed, her father the silly sort of role Eddie Albert plays better, and the art direction and set design terrific. But overall it is trite and sexist and really contrived. It is likable but you really have to be kind to it and accept the mentality of the time. The music has the foghorn sounds of forced farce and the silly xylophone tinkling of sitcoms like Bewitched, a TV show this precedes but points to. It gets some good sex talk across by the dubious method of having a French mother sexually prep her ripe daughter!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Ross Hunter Productions",
         "Universal International Pictures (UI)"
      ],
      "summaries": [
         "Rich socialite, Sandra Dee meets and marries photographer Bobby Darin and attempts to \"train\" him to be the perfect husband. Look for a very young Stephanie Powers as the devious friend .",
         "Chantel worries about her new marriage to photographer Eugene failing so she decides to take her mother's advice and manipulate him. First, her mother gives her a book that will solve all her problems about how to treat a husband - namely a book on how to train dogs. Then, her mother gives her a second trick, an imaginary boyfriend who used to come in handy during her own marriage to Chantel's father. However, if Chantel's mother made this man up, what is she going to do when Eugene brings him home for dinner one night?",
         "Rich socialite Chantal marries Eugene, a photographer, and everything seems blissful until her envious friend attempts to break them up. In desperation, she turns to her mother, but the advice she receives may do more harm than good."
      ],
      "budget": 0
   },
   "movielensId": 8824,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-10-10",
      "dvdReleaseDate": "2004-08-03",
      "directors": ["Henry Levin"],
      "runtime": 102,
      "movieId": 8824,
      "title": "If a Man Answers",
      "mpaa": "",
      "actors": [
         "Sandra Dee",
         "Bobby Darin",
         "Micheline Presle",
         "John Lund",
         "Cesar Romero",
         "Stefanie Powers",
         "Christopher Knight",
         "Charlene Holt",
         "Ted Thorpe"
      ],
      "imdbMovieId": "0056093",
      "originalTitle": "If a Man Answers",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Chantel worries about her new marriage to photographer Eugene failing so she decides to take her mother's advice and manipulate him. First, her mother gives her a book that will solve all her problems about how to treat a husband - namely a book on how to train dogs. Then, her mother gives her a second trick, an imaginary boyfriend who used to come in handy during her own marriage to Chantel's father. However, if Chantel's mother made this man up, what is she going to do when Eugene brings him home for dinner one night?",
      "tmdbMovieId": 46081,
      "avgRating": 3.5,
      "releaseYear": "1962",
      "numRatings": 18,
      "posterPath": "/gBe6ojFkr8m0LHsVW6yfjo8oc6a.jpg"
   }
}