{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0111735",
      "video": false,
      "title": "Without Warning",
      "recommendations": [
         100032,
         66795
      ],
      "backdrop_path": "/wGlI6gqAMT4ibmWDbPnzooxujhP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4677c3a36847f8100b79",
               "name": "Sander Vanocur",
               "profile_path": null,
               "id": 936089,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Caroline Jaffe",
               "gender": 1,
               "credit_id": "52fe4677c3a36847f8100b7d",
               "name": "Jane Kaczmarek",
               "profile_path": "/s03JyfEdklnzXsgC8dFop9FuL00.jpg",
               "id": 27725,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Herself (as Bree Walker Lampley)",
               "gender": 1,
               "credit_id": "52fe4677c3a36847f8100b81",
               "name": "Bree Walker",
               "profile_path": null,
               "id": 173184,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Barry Steinbrenner",
               "gender": 0,
               "credit_id": "579b7d409251414779002595",
               "name": "John de Lancie",
               "profile_path": "/bb3j02gYvgs5ApK2l2qKCweYW5z.jpg",
               "id": 11077,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. Kurt Lowden",
               "gender": 2,
               "credit_id": "579b7d58925141477900259f",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Barbara Shiller",
               "gender": 1,
               "credit_id": "579b7d77c3a368116100368e",
               "name": "Gina Hecht",
               "profile_path": "/heybFsT6FKB7CdZ8Uj6cxt52EwY.jpg",
               "id": 156818,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Paul Whitaker",
               "gender": 2,
               "credit_id": "579b7d99925141471a002732",
               "name": "James Morrison",
               "profile_path": "/g0FoKjXMxeX4bA7GpCOKHtNzAfQ.jpg",
               "id": 62003,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Matt Jensen",
               "gender": 2,
               "credit_id": "579b7db5c3a36847180020fd",
               "name": "Dwier Brown",
               "profile_path": "/qipSMklcWJtFjxILumRzywancMt.jpg",
               "id": 23974,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mike Curtis",
               "gender": 2,
               "credit_id": "579b7de3c3a36811610036c1",
               "name": "Brian McNamara",
               "profile_path": "/aemVY13WmPKj3TOWSvtbWs7Vgzu.jpg",
               "id": 27238,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4677c3a36847f8100b75",
            "name": "Robert Iscove",
            "profile_path": "/lLwUcEJ4OpT1Ocssv1fevkA0VQd.jpg",
            "id": 64815,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 0.584864,
      "production_countries": [],
      "id": 44117,
      "vote_count": 7,
      "budget": 0,
      "overview": "A television program is interupted by a news network announcing that three meteors have hit the United States, France and China. At first it seems natural but after interviews by scientists and eyewitness seems to suggest that it is not. Three more meteors are coming and the various Earth governments combine forces to stop them.",
      "similar": [
         10285,
         949,
         336843,
         8834,
         4638,
         189,
         2832,
         181283,
         1949,
         2163,
         9411,
         996,
         2048,
         2502,
         13811,
         9798,
         180,
         281,
         19959,
         274855
      ],
      "original_title": "Without Warning",
      "runtime": 100,
      "poster_path": "/qpUAlhzzUqK7s1kQPBjespg86yI.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-10-30",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Iscove"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Jeremy Thorn",
         "Walon Green"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111735/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NDM2NjI0NV5BMl5BanBnXkFtZTcwNjE0ODgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sander Vanocur, Jane Kaczmarek, Bree Walker | See full cast and crew »"],
      "reviews": [
         "This is without a doubt, one of the greatest made for TV movies I've ever seen. The first time I saw it, I actually thought what was being reported was really happening, so I changed the channel to CNN to see if they were also reporting on it. This movie is a great way to scare someone by making them think what their watching is real.",
         "I saw this pretty late at night, and it draws you in so much. The plot twists and turns in an amazing story that mirrors a real-situation, so much that I thought it was a real news broadcast too. Only the appearance of Q from Star Trek, and references to 1994 gave the game away. The end sequence, from the destruction of the 3 meteors onwards was as tense as many of the scenes in films like Scream. It also showed man's darker side, and gave many lessons for the future. It wouldn't work on the big screen, but on the small screen it is one of the best films I have seen in a long time. And that's saying a lot for a film of such small stature!",
         "As the final commercial comment said, a realistic depiction of fictional events that never occurred. For Halloween of 1994, CBS paid homage to the Orson Welles radio broadcast of \"War Of The Worlds\" with a story about asteroids colliding with Earth. The movie is told in a style of interrupted TV broadcasts, eventually becoming on the air news of the destruction of the world. It is told like a series of newscasts breaking up normal broadcast television. (In fact, the movie opens up with a clip from a Mario Bava picture.) This is the movie's greatest strength. To add to the realism, they used real news caster Sander Vanocur as the \"star.\" It may seem kind of redundant, but, Vanocur does play a fake newscaster well, as if it is real. In too many cases, like say sports stars, it's hard to act playing your profession on screen. He lends the film believability, much the same way he does to the news scenes in \"Street Fighter: The Movie.\" With cameos by, as themselves, Arthur C. Clarke and a bevy of people who you probably wouldn't know playing themselves, one might be forgiven for believing it if they came in on the middle on this. Only the appearances of established actors John de Lancie, Dennis Lipscomb (From another disaster epic, \"The Day After.\") Philip Baker Hall, and she who would become the mother of Malcolm In The Middle reassure anyone who hasn't been watching from the beginning that it's a fake. The only real problem with this production are a few science fiction cliche's thrown into the story. Yes, we know we humans are barbarian. But, how else would you react when directed asteroids were being hurled your way, even if they may (Or may not.) have been under control of an alien, peaceful intelligence merely trying to send us a message? You take steps to prevent them from crashing into you. And, yes, blowing things up is a violent reaction, but, if you were an alien trying to peacefully contact Earth, would you rain down stone armageddon (Excuse the pun.) from the skies? All in all, the final result is a pleasing surprise of extended, building suspense and (mostly) logical story progression. The ending is a nice surprise, where the denoument doesn't extend too long, for once. I'm glad I taped this during its first run, as I've not seen it air anywhere in the US since. Another perfect unknown candidate for a video release.",
         "Shown 30 October, 1994, the Anniversary of the radio broadcast of War Of The Worlds, Without Warning is a tribute to the legendary radio broadcast. The film effectively represents the feel of War of the Worlds, by using a real life news anchor, Sander Vanocur, and newslike camera work. The effect was so real, that thousands of people called TV stations asking if it was real. Without Warning is a well executed salute to the War of the Worlds broadcasts of the 1930s. I highly recommend it for anyone interested in War of the Worlds, and the recent asteroid movies, Deep Impact and Armageddon.",
         "Now, in my defense, before i go on, i have to say that on the night in question (last night,) I was at home alone in my small room suffering a cold and had a small fever. I had also taken some cold medication and hadn't actually taken any notice of the title as I was watching movies back to back just trying to get over the cold. In addition, the lousy plan that my hotel had locked me down to didn't even afford me one news channel so that I couldn't verify what I was seeing. I started watching it and it went to the news flash portion. I must say that I was almost sucked in from then on. A few things I couldn't believe entirely but obviously I did in the end, as by the time they came up to the 9 minute deadline I'd put on my boots and hightailed it up to my local bar which was only 3 doors away and informed my mates. And didn't I cop it when I finally got to see that it wasn't even being broadcast on CNN or BBC. HAR HAR. I am going to pay dearly for that for some time. Although I was so convincing in my explanations of what was about to happen, the impending doom, that a couple of the guys started mentioning they wouldn't even have time to say goodbye to their children. I gotta say, Im also laughing as I write this as I am usually the sciatic. It will remain with me forever and although yes! I looked the jackass, its also something I doubt I will ever experience again. Im happy to have that. If you are reading this then its already too late. (Har har, thats what my mates kept saying over the beers.) You cannot possibly experience the same emotions. Phew! So glad it wasn't real. hehe.",
         "i saw the movie about 6 to seven years ago, and i'm searching for the movie online now (2003), that will say how much the movie impressed me. i was watching it at home in malaysia and it hit me that this movie may be a reality one day (very very slim chances). after watching the expression of the last newscaster saying his last words to his family and knowing that the time is over very soon is one of the scenes a remember until now. never mind the story line maybe a bit odd once you start to think about it after watching the movie, but, the movie gives u a chance to look at life again and remember that life can over within seconds. so make use of the time that u have. thats the message i got from tis movie. sad that it is not released on vcd or any other form. I would surely like to own one copy of it. can anyone help? i would recommend anyone this movie.",
         "Before watching this movie/ or whatever u call it. My no 1 alien movie was in confusion between these few titles i will mention. War of the worlds(2005) , Altered(2006), Contact(1997) Close encounters of the third kind (1977). I love complicated/hanging (sort of unfinished business type) endings in a movie. But after watching this 1, i fear meteors and the possibility of an intergalactic war far more worse now. Giving me the creeps and chills every now and then when i go to bed (it just wont go off). This 1 is very well done.So bold, so direct, the fact that everything was happening so fast in the movie without breaks was So SCARY!. Forget about the acting.. this movie took me on a deep journey that i felt acting wasn't necessary anymore in alien movies. The story and the idea deserves an Oscar. Came across it a little bit late as it was released in 1994. But well worth it in the end. Therefore this is my no.1 alien encounter movie undoubtedly for now and for a long time to come. Didn't even need fancy CGIs or Alien costumes. Nowhere to be seen yet so disturbing. Wud recommend this to any sci-fi fan. 10/10",
         "Some Television movies leave you feeling like you ate a TV diner if you devote a whole hour and a half to it. However this one will make you craving for another hour and half after the credits. It could have let us off the hook with a nice resolution but no. Just when you think this will be a TV movie softball it gets some teeth, no fangs and delivers. Put in the MUST REMAKE file! Never mind some of the actors betray the slice of life shockumentary format. The overall density and rapid moving plot move you past that. Many of the seasoned actors actually let the plot take you on the ride. I wish this would have had more impact as an actually genre rush like Paranormal Activity and the found video chain. This movie is that good. It is worthy of Orsonwells, Bradbury, and Serling.",
         "Are they just random asteroids? Or are they something more? It's a 1990s twist on War of the Worlds, this time, reported through the lens of the TV camera. As the story unfolds, we come to realize these asteroids are more than just hunks of rock. 20 years later, it's surprising how well Without Warning holds up. The acting, and enacting, are convincing enough to lock you into the story, and the presentation is done so much like real network newscasting that you occasionally have to pinch yourself and remind yourself this isn't actual event coverage. The story itself has plenty of plot twists and unexpected developments that keep things interesting. It was definitely entertaining, exciting, and pretty convincing as a docudrama, and I can see how somebody tuning in midway through could have been fooled by it for awhile. The movie's a good diversion for anybody who enjoys speculative fiction. There, I'll stop, and allow those who haven't seen it yet to look away. Spoilers and a bit of nitpicking ahead: The story unfolds interestingly, but there are places in this movie where I'm unclear where they're going... and I'm not so sure they are either. There are many clear references to Biblical prophesy, including speaking in tongues, Armageddon, and, clearly (in the scene where the entire inhabitants of \"Faith, Wyoming\" disappear off the face of the earth), \"the rapture\". But in this case, it's not God, but unseen aliens, who are performing the miracles. What are they suggesting? That God is going to fulfill Biblical prophesy by sending aliens to earth...in the form of asteroids? Another puzzling assertion, first suggested by a scientist who broke away from NASA to speak the truth of the situation to reporters, and reinforced by Sander V in the final words of the movie, is that the aliens were ticked with the earthlings, and we brought destruction upon ourselves. Why? Because, after the aliens said \"howdy\" by dropping three big asteroid fragments on us, the military stepped in and blew up the next one before it could impact the north pole. The aliens' next move was to counter-attack against our three most-powerful cities, and when that failed, to obliterate the entire planet. That's like throwing a rock through somebody's window, and when the residents board up the window, blowing up their house. Cummon! :-)",
         "The film starts off in a parallel fashion to the famous Orson Wells radio drama of 1938; opening with \"ordinary programming,\" which is then cut in upon by a brief news bulletin that reports of meteors had struck the Earth, in three countries: France, China, and the USA. After that, this story diverges from the War of the Worlds, but bears some similarities. It was a fun idea to mix actors and actual newscasters: Sander Vanocur is the anchorman following the rapidly unfolding story, and handles the increasing level of tension in the script pretty well. Bree Walker also succeeds in blending her journalistic talent with drama. The mystery is effectively spooky, and this was, after all, like the radio play, an effort to say \"Boo!\" on Halloween. The interviews with people speculating on what was going on were just what you would expect if such a scenario was real. The interview with Arthur C. Clarke was intelligent, even fact-finding. The newscasters advancing on the sites of the meteor impacts was a good touch. Loud whines from the craters, burned survivors speaking in strange tongues, and the disappearance of two air force pilots: some eerily cool stuff. My favorite is the Faith, Wyoming sequence. This scene, was masterful in its simplicity. The narration by the newscaster describing the bizarre and inexplicable events there was a highlight of the sinister tone of the movie's events. The movie starts to run out of gas in the latter stages, resorting to some clichés. This may be owing to the fact it had done such an immense buildup in its realistic news cast depictions, that it had to resolve the story in the bombastic way it does. There is some dialouge that nobody would say in the context of what transpires. Even with the flaws, a good premise, skillfully executed. A fun and deliciously eerie movie."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "Wolper Organization, The",
         "Mountain View Productions",
         "Warner Bros. Television"
      ],
      "summaries": ["A television program is interupted by a news network announcing that three meteors have hit the United States, France and China. At first it seems natural but after interviews by scientists and eyewitness seems to suggest that it is not. Three more meteors are coming and the various Earth governments combine forces to stop them."],
      "budget": 0
   },
   "movielensId": 88347,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-10-30",
      "dvdReleaseDate": null,
      "directors": ["Robert Iscove"],
      "runtime": 100,
      "movieId": 88347,
      "title": "Without Warning",
      "mpaa": "R",
      "actors": [
         "Sander Vanocur",
         "Jane Kaczmarek",
         "Bree Walker",
         "John de Lancie",
         "Philip Baker Hall",
         "Gina Hecht",
         "James Morrison",
         "Dwier Brown",
         "Brian McNamara"
      ],
      "imdbMovieId": "0111735",
      "originalTitle": "Without Warning",
      "genres": [
         "Action",
         "Drama",
         "Science Fiction",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A television program is interupted by a news network announcing that three meteors have hit the United States, France and China. At first it seems natural but after interviews by scientists and eyewitness seems to suggest that it is not. Three more meteors are coming and the various Earth governments combine forces to stop them.",
      "tmdbMovieId": 44117,
      "avgRating": 3.22727,
      "releaseYear": "1994",
      "numRatings": 11,
      "posterPath": "/qpUAlhzzUqK7s1kQPBjespg86yI.jpg"
   }
}