{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "comedy",
         "id": 10267
      }],
      "imdb_id": "tt0380277",
      "video": false,
      "title": "The Cookout",
      "recommendations": [
         27360,
         70576,
         40505,
         17216,
         36911,
         44250,
         129798,
         36984,
         22165,
         30319,
         53347,
         14351,
         15581,
         53335,
         32305,
         13280,
         47816,
         83078,
         17952,
         50023
      ],
      "backdrop_path": "/v90maoWhSbtspu8NJEfTqNnzH67.jpg",
      "revenue": 12,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "blin bling",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b8db",
               "name": "Ja Rule",
               "profile_path": "/rXvVP8d4NWBdHxcTu3GTUrybZlX.jpg",
               "id": 61658,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "LEROY",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b8df",
               "name": "Tim Meadows",
               "profile_path": "/4V8Jde8DuFBnXOFPGjTVxs7lqlt.jpg",
               "id": 51857,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lady Em",
               "gender": 1,
               "credit_id": "52fe477f9251416c7509b8e3",
               "name": "Jenifer Lewis",
               "profile_path": "/yMClokTiKKwa3KWSfxT1wsy9YZ.jpg",
               "id": 15899,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "WES",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b8e7",
               "name": "Jonathan Silverman",
               "profile_path": "/khx8B9Ln5isYyag7gG48DogOHHx.jpg",
               "id": 55265,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Becky",
               "gender": 0,
               "credit_id": "52fe477f9251416c7509b8f7",
               "name": "Eve",
               "profile_path": "/3V7Um9JXpwcuTx6wnO2u1hZ1Jfa.jpg",
               "id": 230176,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "(NA)",
               "gender": 2,
               "credit_id": "5847f197c3a3681411007482",
               "name": "Kevin Phillips",
               "profile_path": "/uzP2sGuAtoHTrO0IORDTEiWcy9Z.jpg",
               "id": 150666,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe477f9251416c7509b8ed",
               "name": "Shakim Compere",
               "profile_path": null,
               "id": 84107,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe477f9251416c7509b8f3",
               "name": "Otis Best",
               "profile_path": null,
               "id": 84108,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "558dba6b9251415ce0000418",
               "name": "Lance Rivera",
               "profile_path": "/63QvbOSj05FEMmkdb0RnUIf3EaI.jpg",
               "id": 302339,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5914c8adc3a368423c011c33",
               "name": "Charlotte Scott",
               "profile_path": null,
               "id": 1815002,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.660751,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18475,
      "vote_count": 12,
      "budget": 16000000,
      "overview": "When Todd Anderson signs a $30 million deal with his hometown team, the New Jersey Nets, he knows that his life is set for a big change. To keep things real, he decides to throw a barbeque at his place -- just like the ones his family used to have. But when you have new and old friends, family, agents, and product reps in the same house, things are bound to get crazy.",
      "similar": [
         435126,
         228165,
         812,
         10530,
         20943,
         10719,
         703,
         50620,
         49013,
         51828,
         37247,
         16290,
         289,
         947,
         67308,
         62206,
         270946,
         372058,
         329865,
         277547
      ],
      "original_title": "The Cookout",
      "runtime": 97,
      "poster_path": "/2AvpBLs8BgMXsui5kWzgOXDh9QS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cookout Productions",
         "id": 3494,
         "origin_country": ""
      }],
      "release_date": "2004-09-03",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "This summer, get your grill on!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lance Rivera"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Queen Latifah",
         "Shakim Compere"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0380277/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MzYyNzQ5Ml5BMl5BanBnXkFtZTcwNjMwMzYyMQ@@._V1_SY317_CR17,0,214,317_AL_.jpg",
      "actors": ["Stars: Quran Pender, Jenifer Lewis, Ja Rule | See full cast and crew »"],
      "reviews": [
         "First, I'd like to start of by saying I'm black. So I took especial dislike to this film along with the regular dislike due to the absolute horridness of this movie. I can imagine the conversation at the studios regarding this mess of a movie... Exec 1: Hey, I've got a great idea for a movie. Exec 2: Shoot Exec 1: Well, it's going to aimed at the black community. So it'll make money without us having to spend money. Exec 2: Or use creativity! Exec 1: Exactly. We use the Black movie formula. Number one, find a topic that the black \"community\" can relate to. You, know, something that's solely afrocentric. Like \"da hood\", or rap, or dancing, or how \"da sistas\" play games with men, or basketballs, or like... a cookout! Number 2, stuff a bunch a race relation jokes in it and pass it off as comedy. Number 3, get one good actor, a rapper, and a white person (you know, so the race relation jokes seem at least semi-relevant), then get a bunch of no name actors. And number 4, put some type of easily grasp high concept, like family or community. And wa la! You've got a movie that'll make money without the makers putting anything (and I mean anything) into it! Exec 2: It's gold! Unfunny, uninspiring, unoriginal, and insulting to your intelligence whether you're black, white, Asian, native American, Arabic, south Asian, Hispanic or pacific islander, but especially if your black. This is what Hollywood thinks black people want. Mindless entertainment that panders to their race. And frankly, it makes me angry. The story was uneven, the jokes failed to illicit even a chuckle, the acting is bad, and the \"high concept\" was lost in the swirling mass of awful that was this movie. A complete and utter waste of time.",
         "I'm a white guy and if I was black i would have been insulted by this film. In no way was this film funny, in no way did this film have a story. The Cookout wasn't even the main focal point. This film should have been called The Family. People should look at this film as a very very poor interpretation of the black community. Barbershop was a far better film with far better writing, directing and acting. Danny Glover was in this film, WHY? He was in one of the greatest buddy cop movies of all time, does he need the money? How does this crap get made, who thought this was a good idea and did anyone watch the dallies? If you are looking to not laugh, be insulted and fall asleep go rent this crap fest of a film.",
         "This movie was a disgrace. It was racist towards more than just black people. I mean, seriously, I'm black and I have never seen a black mama behave the way the character was portrayed. She was always going off at the mouth and nothing she said was believable or fully in character. I really just wanted to jump out of my seat and dropkick the screen by the time the cliché \"homosexual\" chefs made their \"dramatic exit\". But instead I settled for launching into conversation with my nearest neighbor. All of the white characters were unbelievable, the father was a disgrace, and the entire movie was just pitiful. And I've never been to a cookout where they served chitterlings. It's too dang on hot in the summer to be eating chitterlings or collard greens. I did rather enjoy Queen Latifah though, even in a ridiculously written role she was believable and hilarious. She made it worth my while.",
         "I can't believe anyone financed this garbage. I feel bad that money went towards this movie and not something else worth while. Everyone person in this movie has tainted their careers by being in this pile of crap. And now I'm going to right random letters to fill the comment paragraph. Whoever wrote this movie should be ashamed, this is by far the stupidest movie I've ever seen. Freddy Got Fingered is horrible, but at least I laughed when i watched it. This is bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad Do not waste your time with this movie",
         "I once read that if you want to watch a movie and just to be entertained, then take your brain out and relax. I thought this movie would fit into this category. When I first saw the trailers, and bits and pieces of the movie I thought it was worth watching. So I did. To be honest I was disappointed. With all of the big names like Danny Glover, Farrah Fawcett, Jenifer Lewis, Queen Latifah, and Frankie Faison to name a few, I had thought this would be great. At best I felt the movie was slow and the lines delivered as if they were being read. As for the morality of the movie, one could argue it set the tone for being responsible about money. But I also saw a contradiction in moral and racial issues. The first issue is the smoking of marijuana. To see a \"judge\", Danny Glover smoking it, what does this say about the real world? The movie played on the fears of predominately white segregated, walled communities. At least that part was true. The third item was in regards to the black male and white female role in an interracial marriage. Why in the end was everyone happy to see Danny Glover (Judge Crowley) dominate his white wife, Farrah Fawcett (Mrs. Crowley), yet Frankie Faison (JoJo Anderson) is submissive to his wife Jenifer Lewis (Lady Em)? Does this mean that all black men in an interracial marriage should be \"Master and Commander?\" Does this state that black men marry outside of their race because the black woman is too strong and dominant? Does this mean that all white females become submissive when dominated by a black man? I don't think so as I am in an interracial marriage and took offense to those messages. With the above aside, I took my brain out and tried to just be entertained. I laughed through a few parts, and the rest of the plot I could see through. Would I see it again? Maybe. I had expected more with all of the big names and maybe this is the problem.",
         "This movie did not deliver. I love black comedy like the Friday movies. This movie was NOTHING like Friday. In fact, it was extra lame. There were a few funny scenes but not that funny. That old man with a stick was kind of goofy. Tim Meadows was the highlight of the movie and his lines totaled approximately 5 minutes of dialogue. I love cookouts and love the music but geeze, there are no family gatherings that I know of where a Butler named JEEVES is hanging around. Those grotesque fat twins were annoying. The pot smoking scene with them and Mertaw from LETHAL WEAPON was horrendous. I was disgusted with the way they looked and acted. Ja Rule was very annoying as Bling Bling and his sidekick was just awful. The dude BIG PUSSY from The Sopranos was OK as a doo doo salesman. All in all, I would say avoid this piece of trash.",
         "usually, black films are quite funny. this one is at some points. mainly, this movie is comic able but fails to make anyone want to see if there is a part 2 or not. Silverman plays a agent very well. you can tell he paid attention to his own agent to pick up the ins and outs. the judge who decides to get high, his white wife, the dog that has a identity problem, where is the basis of a story line? movie fails similar to the way the \"Friday After Next\" did. writing is pathetic so acting cant even cover up the horrible script. nice to see Eve finally play a sweet character. for a hardcore rapper who always plays tough minded characters, was nice to see her be sweet and soft. the gold digger, black, white, green or yellow, she is hot. shes a horrible actress, but with a body like hers and a face like hers, she doesn't need to act!",
         "The movie had a good message about being responsible and down to earth even after hitting pay dirt. But, the message was nearly drowned in the cheesy delivery. As a result, this ethnic comedy comes off somewhat spoofish because of the mugging and overacting (which obviously was on purpose). I think of The Cookout (2004) as (one of the characters in the movie so aptly put it) a \"Black Beverly Hillbillies,\" like the TV series The Beverly Hillbillies (1962) that was definitely satirical. Although it is true that the stereotypes were carried to the extreme, which explains why some viewers are offended by the material, the same could be said of other spoofs, which purposely border on the ridiculous. The Cookout (2004) is okay to rent, if you take if for what it is. You know, this would have been a good TV movie.",
         "The Cookout is a pretty lame comedy that really delivers nothing new. #1 NBA draft pick Todd Anderson's star is on the ascendant after signing to his home team, the New Jersey Nets. Trying to stay grounded in reality, he throws a big barbecue for his family, not realizing that mixing them with his new agents and reps might lead to a crazy afternoon. The plot is fairly simple, something similar to the Barbershop films. The Cookout fails to be like Barbershop though. Everyone that's at the cookout is a stereotype. The filmmakers apparently were trying to include every stereotype about blacks possible. The script is very weak and needed a lot of work. The acting wasn't very good either with the best being Queen Latifah. She is pretty much the only saving grace in this film. However, her role in this film is small and its hard to believe she helped with the writing. Tim Meadows and Danny Glover are also pretty good but they can't save this film. Other people worth mentioning are Meagan Good and Jonathan Silverman. Ja Rule does a terrible job and he pretty much kills the film. Farrah Fawcett is in the film for some reason and she does a decent job. Everyone else is very annoying and do a bad job of acting. On a side note, Queen Latifah's mom has a role and Eves role is more or a cameo. Lance Rivera directs his first film and hopefully he can improve. Barbershop talked about important issues however, The Cookout didn't as it just had cheap laughs and it was a pretty boring film. The runtime is only 97 minutes long. Even with the short runtime it drags a lot and most of the film is pretty unrealistic. The Cookout is defiantly not worth watching unless your really, really big fans of anyone involved. Rating 3/10, a boring and forgettable film.",
         "This movie is very so-so.(i.e. the acting, directing, story) This movie has a lot of dislikeable characters the first moment you see them which made this movie a little hard to watch. Also a lot of streotypes of whites. I was surprised I didn't see any watermelon eating in this movie. The plot is, a basketball player (Storm P) wants to have the annual family cookout in his new house surrounded by \"WHITE PEOPLE\" who believe he is a \"GANG BANGER\". His mother (Jennifer Lewis) was the first dislikeable character to me. Because she is always yapping her mouth like she does in every movie shes in. This movie also did not flow well. For example, something could be happening and then maybe one character has to leave and go do something. They never show what happens after that character does after. It was like this movie had a thousand deleted scenes.Just like Johnson Family Vacation, which was a bad movie cause it was trying to be a National Lampoon film.In summary, it was a lot worse than I expected. I think Storm P(Quran Pender), Ja Rule, Queen Latifah, & Tim Meadows kept this movie watchable. 6/10 **"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Cookout Productions",
         "Flavor Unit Entertainment"
      ],
      "summaries": ["When Todd Anderson signs a $30 million deal with his hometown team, the New Jersey Nets, he knows that his life is set for a big change. To keep things real, he decides to throw a barbeque at his place -- just like the ones his family used to have. But when you have new and old friends, family, agents, and product reps in the same house, things are bound to get crazy."],
      "budget": 0
   },
   "movielensId": 8834,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-09-03",
      "dvdReleaseDate": "2005-01-18",
      "directors": ["Lance Rivera"],
      "runtime": 97,
      "movieId": 8834,
      "title": "The Cookout",
      "mpaa": "",
      "actors": [
         "Ja Rule",
         "Tim Meadows",
         "Jenifer Lewis",
         "Jonathan Silverman",
         "Eve",
         "Kevin Phillips"
      ],
      "imdbMovieId": "0380277",
      "originalTitle": "The Cookout",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Todd Anderson signs a $30 million deal with his hometown team, the New Jersey Nets, he knows that his life is set for a big change. To keep things real, he decides to throw a barbeque at his place -- just like the ones his family used to have. But when you have new and old friends, family, agents, and product reps in the same house, things are bound to get crazy.",
      "tmdbMovieId": 18475,
      "avgRating": 2.25,
      "releaseYear": "2004",
      "numRatings": 40,
      "posterPath": "/2AvpBLs8BgMXsui5kWzgOXDh9QS.jpg"
   }
}