{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "dam",
            "id": 9862
         },
         {
            "name": "argentina",
            "id": 10596
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "whip duel",
            "id": 207668
         }
      ],
      "imdb_id": "tt0017449",
      "video": false,
      "title": "The Temptress",
      "recommendations": [],
      "backdrop_path": "/tw64yF55gCasRSmH0is6QYh4ocz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe499a9251416c750cd571",
               "name": "Greta Garbo",
               "profile_path": "/c0ozpVYhtozDHWtFxH29rUd7JXl.jpg",
               "id": 19549,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Manuel Robledo",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd575",
               "name": "Antonio Moreno",
               "profile_path": null,
               "id": 30555,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "M. Fontenoy",
               "gender": 0,
               "credit_id": "52fe499a9251416c750cd579",
               "name": "Marc McDermott",
               "profile_path": null,
               "id": 98026,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Canterac",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd57d",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Marquis de Torre Bianca",
               "gender": 0,
               "credit_id": "52fe499a9251416c750cd581",
               "name": "Armand Kaliz",
               "profile_path": "/GuunjZspjLmY3YsVpPDq4KWcq7.jpg",
               "id": 128160,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Manos Duras",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd585",
               "name": "Roy D'Arcy",
               "profile_path": "/pCk3zupUHQ1ar5Fn6k0Mh4zs4j7.jpg",
               "id": 90067,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pirovani (as Robert Andersen)",
               "gender": 2,
               "credit_id": "543e7542c3a368251f0021f0",
               "name": "Robert Anderson",
               "profile_path": null,
               "id": 1374201,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Duras Henchman (uncredited)",
               "gender": 2,
               "credit_id": "5a5ee98a0e0a264d4200483e",
               "name": "Constantine Romanoff",
               "profile_path": null,
               "id": 148402,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd56d",
               "name": "Fred Niblo",
               "profile_path": "/yjXS4cg0BAFf1GST2HQFF8SNy3o.jpg",
               "id": 108106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "543e71a10e0a266f8b0021d0",
               "name": "Vicente Blasco Ibáñez",
               "profile_path": null,
               "id": 130705,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "543e71b10e0a266f7700225b",
               "name": "Dorothy Farnum",
               "profile_path": null,
               "id": 1096777,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a4868cc925141031700b64a",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.65973,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 95956,
      "vote_count": 4,
      "budget": 0,
      "overview": "In a masked ball in Paris, Manuel Robledo, a young Argentinian architect, meets Elena, the Marquess of Torre Blanca. Later, the young woman is rightly accused causing the misfortune and loss of wealth of Fontenoy, a man who fell for her charms. To escape social criticism, the Marquis of Torre Blanca transfers his residence to Argentina. There, Elena meets again Manuel, when he is building a river's dam. Manos Duras, a thug, harasses Elena, and when Manuel intervenes, he defies him to a whip duel. The duel is long and vicious, both men suffering many cuts on their faces and naked chests, but in the end, the thug is vanquished and humiliated. Manos Duras sets up an ambush to murder Manuel, but the Marquis of Torre Blanca is killed instead. Now, there only two men in love for Elena, the eternal temptress",
      "similar": [
         979,
         26390,
         4771,
         281,
         281957,
         1949,
         10575,
         868,
         445954,
         133805,
         2142,
         25376,
         21484,
         1266,
         3134,
         9769,
         49950,
         4638,
         10285,
         948
      ],
      "original_title": "The Temptress",
      "runtime": 117,
      "poster_path": "/m5H4206d0nGKrX4JbwYGVZIl5Py.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1926-10-03",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Fred Niblo",
         "Mauritz Stiller"
      ],
      "runtime": 117,
      "synopsis": "It is spring in Paris. Elena [Greta Garbo] is in attendance at a masked ball when the Marquis de Fontenoy [Marc MacDermott] asks her a question. Elena replies that she doesn't love him and never will, and she then runs from him. Making her way through the crowd of boisterous revelers, Elena goes out to the garden where she encounters the Argentine engineer, Manuel Robledo [Antonio Moreno]. They remove their masks and fall immediately in love. They pledge themselves to each other, Robledo gives Elena a ruby ring, and she denies belonging to another man. Unfortunately, it's a lie. Elena is actually married to Robledo's old friend, the Marquis de Torre Bianca [Armand Kaliz], as Robledo finds out the next night when he drops by for a visit. Robledo, Elena, and the Marquis attend a large dinner party thrown by Fontenoy. As they begin a round of toasts, Fontenoy picks up his glass and toasts Elena, whom he calls \"the Temptress,\" \"who asks for nothing -- but takes all a man can give -- and more!\" As Robledo looks on in distaste, Fontenoy blames Elena for his financial ruin and pulls the jewels from her neck, claiming that he gave them to her. He then promptly keels over dead from the poison he has placed in his own drink. Even though he approved of Fontenoy's gifts, the Marquis is now POed at Elena for disgracing his name. When he complains about not being able to pay his \"debts of honor\" now that Fontenoy's cash flow is cut off, Elena empties her jewelry box in his lap. Totally disillusioned by Elena, Robledo returns to his home in the Argentine, where the entire village welcomes him back, including his four best friends -- Canterac[Lionel Barrymore], Pirovani [Robert Andersen], Timoteo [Francis McDonald], and Rojas [Hector Sarno] -- and the sweet and demure Senorita Celinda [ Virginia Browne Faire]. Robledo throws himself into the work of constructing a dam, made difficult because the sinister bandit, Manos Duras [ Roy D'Arcy], keeps stealing his horses and enticing his workers away. Still, the work progresses steadily until, one day, the Marquis de Torre Bianca shows up looking for work. Of course, he brings his wife, Elena, with him, since it was Elena who actually financed the trip with her jewels. Robledo is not pleased that she is there, but he offers to let them stay at his house. Elena, in her high heels, nylons, sultry eyes, French cloche, and fashionable European clothes, far outshines the local girls with their bare feet, peasant garb, and pigtails. In no time, Elena becomes the center of every man's attention, including Robledo's friends and the not-so-friendly Manos Duras, who comes with his band of caballeros to serenade Elena and to steal a kiss. When Robledo balks, Duras challenges him to a duel using Argentine whips. The confrontation is brutal, with Duras, a master of the whip, trying to put out Robledo's eyes. As Elena watches the two men, bare-chested, sweaty, and dripping in blood while fighting for her, she is certain that Robledo is still in love with her. In the end, Robledo bests Duras. As Elena lovingly dresses Robledo's wounds, he pushes her away and denies that he fought for her. Suddenly, a shot is heard from outside the window. Duras has made an attempt on Robledo's life, but his bullet hits the Marquis instead. Now that Elena is a widow, the men begin vying for her, buying her presents, throwing fiestas in her honor, neglecting their work, even forgetting their own wives and children. Concerned over her disruptive influence, Robledo purchases a ticket for Elena on the next boat back to Paris. Elena tries to convince him to go with her, but Robledo refuses. On the night before Elena is to sail for Europe, Canterac, forgetting the wife waiting for him in Paris, throws a fiesta for Elena, luring half of the work force to make merry with him. When Canterac takes a few moments alone with Elena to sip champagne and express his love for her, Pirovani surprises them by showing up just as Canterac steals a kiss. A fight breaks out, and Canterac ends up running his military sword through Pirovani. In horror, Elena runs off. Robledo advises Canterac to go away asap and goes off to find Elena. In a tirade, Robledo blames Elena for causing Fontenoy's ruin, for the death of her husband, and now for the death of Pirovani. Elena tries to explain that those things happened because of the men's desire for her body and for their own happiness, not for hers. Once again, she tries to convince Robledo that her love for him is genuine, but he scoffs. Suddenly, a loud explosion is heard. Manos Duras has seized the opportunity to blow up the dam. In the villagers' haste to build a barricade and keep the dam from flooding, Elena is forgotten for the moment. She returns to her room, where she finds a note attached to her door with a dagger. It is from Duras. \"My songs could not touch your heart -- perhaps a symphony in dynamite will be more to your taste.\" It begins to rain, and the barricade breaks, almost carrying Robledo away in the rushing waters. Robledo returns to his house, mad as a hornet and swearing to never allow Elena to ruin another man. He tries to choke her, fully intending to kill her, but finds that he cannot. He winds up kissing her instead. Realizing that he is still in love with Elena, Robledo collapes in her arms and promises to go anywhere with her. Not wanting to see Robledo discontinue his work or to be the cause of his destruction, Elena slips out of the house while Robledo sleeps and returns to Paris. Six years pass. Robledo has rebuilt the dam and decided to visit Paris again, this time with his fiancee...sweet Celinda. As the two of them get into a taxi, Robledo notices Elena, tired, haggard, disheveled, drunk, and watching him. Robledo sends Celinda on and follows Elena to a sidewalk cafe. He approaches her and calls her by name, but she denies knowing him, replying only, \"I meet so many men.\" When he asks if there's anything he can do for her, she asks him only to buy her a drink and refuses his offers of help. Robledo slips some money into her handbag and walks away. Looking across the cafe, Elena sees a bearded man who suddenly seems to transform into a haloed Jesus. From a little pouch she keeps close to her heart, Elena removes the ruby ring and gives it to him. Alternate Ending: Six years pass. Robledo has rebuilt the dam and is being honored for his work. As he looks out over the gathered crowd, he sees Elena, beautiful as ever. In his speech, he thanks her for being the woman who provided him with the inspiration and courage that led to his success. He then leaves the dais and takes Elena into his arms. [Original synopsis by bj_kuehl]",
      "writers": [
         "Vicente Blasco Ibáñez",
         "Dorothy Farnum"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017449/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxODg4Mzc3OF5BMl5BanBnXkFtZTYwMjk3MTI2._V1_SY317_CR17,0,214,317_AL_.jpg",
      "actors": ["Stars: Greta Garbo, Antonio Moreno, Marc McDermott | See full cast and crew »"],
      "reviews": [
         "THE TEMPTRESS (Metro-Goldwyn-Mayer, 1926), personally directed by Fred Niblo, from the novel by Vicente Blasco-Ibanez, stars Swedish actress Greta Garbo in her second Hollywood production, following her American debut in THE TORRENT (1926), and the first to place her name on top of the casting credits. As with her MGM debut, Garbo plays a girl of Spanish origin (this was the last to do so), and like so many films that were to follow, especially during the silent era and early talkies, she would portray a woman (usually unhappily married) who satisfies her emotions with illicit affairs, finding the one man she truly cares about, and destroys those around her before reaching bottom herself, committing suicide, or both. THE TEMPTRESS would set such a pattern. The story opens in Paris at a masquerade party where the unhappy Elena (Garbo) meets Manuel Robledo (Antonio Moreno), an Argentine engineer. After removing their masks, they fall in love under the stars. Later when he comes to visit his friend, Marques De Torre Bianca (Armand Kaliz), Manuel is stunned to learn that his wife happens to be Elena. At the dinner party, Marquis Fontenoy (Marc MacDermott), a middle-aged banker permitted by Bianca to have Elena be his mistress in order for them to be financially secure, distracts the guests by making a startling speech on how Elena, the temptress, has ruined his life, and dropping dead at the table after taking his drink of poison. Disgusted by the ugly truth, Manuel decides to forget Elena by leaving for the Argentine where he accepts a water dam building project. Just as Manuel is slowly forgetting Elena, she arrives with her husband, and by doing so, causes frustration and destruction to both men, and others as well, with Manuel, who feels she to be responsible for the murder of his friend and husband, as well as the near destruction of his dam dynamited by his enemy, finds he still cannot resist her. The supporting players include Lionel Barrymore as Canterac, one of the construction workers who falls victim to Elena; Robert Anderson as Pirovani, the friend Canterac kills because of Elena; and Virginia Browne-Faire as Celinda, the pretty young girl who silently loves Manuel. Adding to sin and destruction is Roy D'Arcy as Manos Duros, the bandit leader, in a menacing performance as Manuel's arch enemy who, after forcing his intentions on Elena, is challenged by Manuel to a duel, with the bandit's method being the use of whips. The bull whip duel is one of the high points in the story, resulting to whip scars on the bare torsos covered with blood, as well as Manos, who fights dirty, aiming for the eyes, being quite graphic for its time. THE TEMPTRESS, an important project that helped advanced the screen career of Greta Garbo, at long last, premiered January 24, 2005, on Turner Classic Movies cable channel, accompanied by a new score composed by Michael Picton. Scoring a silent movie is challenging, as mentioned in the half hour special that preceded the movie, and minutes into watching THE TEMPTRESS, the result of Picton's work is satisfactory and rewarding. In spite the fact that host Bob Osborne announced THE TEMPTRESS as making its world television premiere, it actually did play on television, but many years ago. THE TEMPTRESS was one of the selected 13 silent films shown weekly on the public television series in commemoration of MGM's fifty years titled \"Movies-Great-Movies,\" (WNET, Channel 13, in New York City from August to October of 1973) hosted by Richard Schickel, movies accompanied by an an orchestral score (and in the New Jersey area as part of the 1974 series, \"Films of the Gatsby Era,\" with same movies, different hosts, on WNJM, Channel 50). THE TEMPTRESS made its final TV run on WNET in the spring of 1978 when it became part of the double bill five week movie tribute to Garbo and Katharine Hepburn. Schickel, as did Osborne, talked about how Garbo's discoverer, Mauritz Stiller, started out as the film's director, but due to complications during production, was replaced by Fred Niblo. The information regarding THE TEMPTRESS remains the same, with the exception of its time length. When shown in the 1970s, the running time was about 114 minutes. TCM's print runs at 105. But regardless of its length, possibly due to projection speed, THE TEMPTRESS is a welcome addition to the TCM lineup, and well worth viewing again after many years or the first time ever. While THE TEMPTRESS belongs to Antonio Moreno, whose name is almost forgotten today, it owes its success to the temptress herself, Greta Garbo, which is the sole reason for its rediscovery. (***)",
         "This is a very good silent film, though I had just watched two other Greta Garbo films that were incredibly similar to this one--as she plays the vamp in all three! I can't blame Ms. Garbo for this, as MGM definitely type-cast her despite her objections. In fact, she was so irritated by this theme that she went on strike to try to force the studio to give her different roles. But, considering that the public loved the films and they were all very successful, MGM wasn't about to mess with a tried-and-true formula. This film is at least a little different in that much of the time men were destroyed when they fell for Garbo in this film, but she was never directly responsible for their downfall. She was more like the old \"Typhoid Mary\" character--someone who just seems to have bad things follow her where ever she goes! The problem with this is that no matter how sultry and alluring Ms. Garbo might have been, no one is THAT seductive that man after man after man destroy themselves in order to try to get her! However, the story does have a few new elements and the overall production values are exceptional. So, if you view this film WITHOUT considering how derivative it is, then it's an awfully good film. By the way, the TCM DVD includes an alternative ending that was apparently used when the film was shown in rural settings. Instead of the marvelous original but sad ending (that, in my opinion is perfect), there is an upbeat and sappy one that just doesn't ring true.",
         "This silent drama provides an interesting role for Greta Garbo, who was still rather young at the time. It also has some good set pieces created by directors Fred Niblo and/or Mauritz Stiller, which liven up the story considerably. The supporting cast also features a couple of good performances, and all of the strengths help to make up for a rather downbeat story. As \"The Temptress\", Garbo is certainly believable as a woman who attracts the attention of every man around. What makes it more interesting than most such scenarios is that both the script and Garbo's performance leave some ambiguity about what the character is really like inside, and in any case she has a lot more depth than the male characters. The best supporting performances come from Lionel Barrymore and Marc McDermott, as two of the many men who desire her. Several sequences are filmed very nicely. Fontenoy's dinner party is an effective display of the hollow lifestyle it depicts, and there is some real danger and menace in the fight scene between Robledo and Manos Duras. The pace overall is uneven, and it does have some slow stretches that add unnecessarily to the running time, but the good parts make up for this. At least one DVD version includes a variant ending that changes the tone considerably, so there must have been some uncertainty about how it should close. Garbo's talent and screen presence are both easy to see, and in later features her characters would give her better opportunities to show them. She does a very good job here, and makes her character much more interesting than it would have been with a lesser performer in the role. Overall, it's a movie worth seeing for silent film fans, with some real highlights that make up for the occasional shortcomings.",
         "Why had I heard nothing about \"The Temptress\" and almost nothing about its director, Fred Niblo, before TCM aired the movie this September? Niblo definitely deserves more credit for the fine work he did bringing Ibañez's story (which I admit I haven't read) to the screen. Its opening, tinted blue, has a scene of revelry reminiscent of the ending of the French classic \"Children of Paradise.\" In that movie Baptiste is hampered by the crowd as he runs toward someone, and in this movie Elena is hindered as she runs away from someone. Finally making it outside, Elena enters into a scene that's so well choreographed and so evocative of a fragrant, exhilarating spring night that I have played it again . . . and again . . . and again, much as one would listen to a favorite song. And indeed, the music certainly enhances the mood of the scene, not just here, but throughout the film. To my surprise, even my son's teenage friends, who had never seen a silent film, said they found this movie interesting and did not want to watch something else. I guess it helps that there's plenty of action as well as beauty in this production, along with a bit of levity. What more can you ask for? Well-written intertitles, perhaps? Well, you have them in the words chosen by Marian Ainslee, who likes to punctuate with a heavy dose of dashes. You also get a wallop of a message delivered when you don't expect it, and events that are hard to predict. OK, so the villain's expressions are overdone�they're no worse than the broad gestures screen legend Douglas Fairbanks employed. And OK, maybe the banquet scene could have been cut just a little. But the other dinner scene�where Elena enters like a piece of Limoges among earthenware pots�is so entertaining, it seems to end too soon. Another part of the movie is quite touching; I will always remember this: there were tears in my husband's eyes when Elena doesn't say, \"I love you.\"",
         "At 117 minutes this is way too long and ought to have been cut by half an hour. It was Garbo's second MGM film, and like the first, was derived from an Ibanez novel. Ibanez, as a source, proved beneficial for Valentino (THE FOUR HORSEMEN OF THE APPOCALYPSE), but not for Garbo. For most of the film, she just stands around and does what she is good at, enticing men to make fools of themselves over her - and wouldn't you know it, they then blame her! Her weakling husband sells her to a banker, who ruins himself for her and commits suicide. The husband is shot by a bandit. Two friends of the main character vie for her and one kills the other. Our hero keeps vascillating, he loves her but hates her for ruining men's lives. She, like most women of her type, lived as best they could - in a man's world, a plaything, she survived as a courtesan, securing jewelry for her support. Yes, she is weak, but she is not to blame. The second half of the film is set in the Argentine where our hero has gone to build a dam, which the villain blows up, but which our hero rebuilds. Garbo does have one stunning outfit - a slinky black thing, edged in white ermine with an orchid pinned over her right breast. Garbo DOES get to act but only in the last sequence. Back in Paris, a successful architect, Antonio Moreno encounters the fallen Garbo, who drunkenly does not remember him -\"I meet so many men.\" It is of course a lie, but one to make him forget her. Mistaking a fellow drunk for Christ, she gives him a ruby and wanders off into the sunset. Garbo is quite fine in this sequence but it is the only thing of value in the film, which is turgidly and boringly directed by her mentor, Mauritz Stiller (who was fired from the project part way through) and Fred Niblo (who completed it and got sole credit). The cinematography contains two interesting silhouette shots, an amusing \"under the table\" sequence at a dinner party where men and women's legs and feet engage in some risque flirting - and the ubiquitous MGM long banquet table tracking shot (we'll see it again in ANNA KARENINA, not to mention a number of other MGM films.) This one plays on Turner Classic Movies occasionally and is worth catching for Garbo alone. It has never been released commercially on video (one of only three Garbo silents which have not - we wonder why).",
         "Greta Garbo's second Hollywood feature is an irresistible meller, done to a turn by director Fred Niblo at his finest. (Dig those parallel tracking shots; first over a formal dining table laden w/ service & delicacies, and then under the same table, now heavy w/ service & delicacies of a rather different nature.) At this point in her career, Garbo was still playing femme fatale types (watch how she cups her lover's face in her hands) and in this adaptation of a rum Blasco-Ibanez novel, she drives four men to their ruin without lifting a finger. The plot takes us from Parisian highlife (a superb masked ball, a suicide at a banquet, overnight love in a park) down to the Argentine for dam building, a duel of honor played out with whips, sabotage & floods (with remarkable effects), and then back to Paris for our moral. When he's at his best, co-star Antonio Moreno is a bit like Brian Donleavy, alas he usually just looks vaguely surprised. But Roy D'Arcy & Lionel Barrymore get to whoop things up splendidly. Note that Garbo's regular lenser Wm Daniels shares credit with Tony Gaudio. But everyone deserves a prize, including one for the fine newly commissioned score.",
         "\"The Temptress\" has a lot going for it, but it begins so sloooowly, and contains far too many intertitles. I couldn't help thinking how much better it could have been with, maybe, Ernst Lubitsch or D.W. Griffith directing. This is supposedly a MOTION PICTURE, not a novel. Still the directors gave us some wonderful shots and angles. One particular sequence is told with a shadow! Superb. And some running shots, with horses and a wagon, are worthy of the best of John Ford. Then one particular action scene, a duel, is as exciting, and surprisingly graphic, especially for 1926, as one could hope for. Still, overall, the story is somewhat dull and it's told often dully. If it weren't for the chance to watch movie history, including early Garbo, and the action scenes, and the often interesting direction and photography, it might not be worth watching. But it is, especially the new version at Turner Classic Movies, with a new score by young Michael Picton. Maestro Picton might well turn out to be a new Elmer Bernstein, who has -- it pains me to say -- passed on, but who was one of the greatest composers of the last 100 years.",
         "It is important to recognize that this film, \"The Temptress\", is almost 80 years old. The entertainment sensibilities were different then. This movie is silent, and large, white subtitles are superimposed, telling us a snippet of what is being said. But the actors are also very animated in their delivery of lines, and watching their body language is also important. Most of the lines would be considered \"cheesy\" by today's standards. This was Greta Garbo's 8th movie. Filmed when she was only 20, her character is Elena, and whom we figure out quickly is the Temptress of the title. In Paris she meets Robledo (Antonio Moreno, 38), an Argentine engineer, they dance, and he is smitten. He tells her she is the woman he has waited all his life for. She tells him that she \"has no other man.\" What she fails to mention is that she is married and has a rich lover (Fontenoy) already on the side. Her husband puts up with it, because of the expensive jewels she gets. Robledo finds out about the husband the next day when he calls on him, strictly a change encounter. That evening, at a big dinner party, wealthy Fontenoy exposes his affair with Elena, tells everyone he is going broke, and kills himself with poison in his drink. Elena and her husband become news. Robledo cannot understand how she could profess to love him, when she already had a husband and a lover. He travels back to the Argentine to build a dam. Disgraced in Paris, Elena and her husband travel also to the Argentine, a pretty big country, but happen to pull up right into the small village Robledo was in. A thug, Manos Duras, gives them trouble, there is a fight, Robledo prevails, injured. The two men and Elena seek to live in harmony in the Argentine. An interesting movie for Greta Garbo. I had only seen her as a more mature woman, and didn't really understand why she was considered one of the great beauties in the history of film. Now I know. As a 20 year old, she was simply spectacular. That comes across even in this old, black and white film shown on the TCM network. The story itself is overly melodramatic, but that was what was required for the period it was made for.",
         "I watched this for the first time on TCM with an original musical score by Michael Picton and was fascinated by the score and Garbo's stunning appearance. I'm not a Garbo fan and some of her films are really hard to enjoy by today's standards of film-making (and acting), but this one is watchable enough even though it drags occasionally. It's gorgeously photographed and Garbo is given the royal camera treatment. In fact, she's treated royally by everyone except the man she loves who discovers too soon that in matters of love, she has a strange code of conduct. Well worth viewing if you're a fan of Garbo's films. Otherwise, you may not make it to the finale since it's rather overlong for such a simple story. Handsomely produced. Antoneo Moreno is interesting in the male lead.",
         "This movie played on Turner Classic Movies on (I think) Sunday night, 30 July 2000. I started viewing it near the mid-way point. I first stayed with it to see and wonder who this very attractive actress was. The movie was a find story of love lost. The overall acting was excellent - truly more than I expected from an old movie. The body language, the facial expressions and timing from the leading male are what one only hopes to see. That said, the music, which can add so much to a silent movie, was beautiful. Beautiful. To me, it was the highlight of the movie. The music was so clear (no noise) that I question if it was as old as the movie (reprocessed perhaps?). The Temptress is worth viewing and hearing."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "In a masked ball in Paris, Manuel Robledo, a young Argentinian architect, meets Elena, the Marquess of Torre Blanca. Later, the young woman is rightly accused causing the misfortune and loss of wealth of Fontenoy, a man who fell for her charms. To escape social criticism, the Marquis of Torre Blanca transfers his residence to Argentina. There, Elena meets again Manuel, when he is building a river's dam. Manos Duras, a thug, harasses Elena, and when Manuel intervenes, he defies him to a whip duel. The duel is long and vicious, both men suffering many cuts on their faces and naked chests, but in the end, the thug is vanquished and humiliated. Manos Duras sets up an ambush to murder Manuel, but the Marquis of Torre Blanca is killed instead. Now, there only two men in love for Elena, the eternal temptress^Å",
         "An architect tries suppressing his passion for a seductive woman."
      ],
      "budget": 669000
   },
   "movielensId": 88595,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-10-03",
      "dvdReleaseDate": "2005-09-06",
      "directors": ["Fred Niblo"],
      "runtime": 117,
      "movieId": 88595,
      "title": "The Temptress",
      "mpaa": "",
      "actors": [
         "Greta Garbo",
         "Antonio Moreno",
         "Marc McDermott",
         "Lionel Barrymore",
         "Armand Kaliz",
         "Roy D'Arcy",
         "Robert Anderson",
         "Constantine Romanoff"
      ],
      "imdbMovieId": "0017449",
      "originalTitle": "The Temptress",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a masked ball in Paris, Manuel Robledo, a young Argentinian architect, meets Elena, the Marquess of Torre Blanca. Later, the young woman is rightly accused causing the misfortune and loss of wealth of Fontenoy, a man who fell for her charms. To escape social criticism, the Marquis of Torre Blanca transfers his residence to Argentina. There, Elena meets again Manuel, when he is building a river's dam. Manos Duras, a thug, harasses Elena, and when Manuel intervenes, he defies him to a whip duel. The duel is long and vicious, both men suffering many cuts on their faces and naked chests, but in the end, the thug is vanquished and humiliated. Manos Duras sets up an ambush to murder Manuel, but the Marquis of Torre Blanca is killed instead. Now, there only two men in love for Elena, the eternal temptress",
      "tmdbMovieId": 95956,
      "avgRating": 3.3,
      "releaseYear": "1926",
      "numRatings": 5,
      "posterPath": "/m5H4206d0nGKrX4JbwYGVZIl5Py.jpg"
   }
}