{
   "tmdb": {
      "original_language": "pl",
      "keywords": [],
      "imdb_id": "tt1360887",
      "video": false,
      "title": "Sweet Rush",
      "recommendations": [37060],
      "backdrop_path": "/rg2lcyx02S1ViyO1wb8rDdvyOJ7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "pani Marta",
               "gender": 1,
               "credit_id": "52fe47dec3a36847f814ca3b",
               "name": "Krystyna Janda",
               "profile_path": "/v1WhK7TNvAdw9a2xRuyPLy5sF4u.jpg",
               "id": 2807,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Boguś K.",
               "gender": 0,
               "credit_id": "52fe47dec3a36847f814ca5b",
               "name": "Pawel Szajda",
               "profile_path": "/zsX6W0XfPELmGDOvKLOUb22eaFB.jpg",
               "id": 558517,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "doktor, mąż Marty",
               "gender": 0,
               "credit_id": "52fe47dec3a36847f814ca3f",
               "name": "Jan Englert",
               "profile_path": "/tC0jrgM8RfEp2hEL3IXFDVdZHtw.jpg",
               "id": 107633,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Halinka",
               "gender": 0,
               "credit_id": "52fe47dec3a36847f814ca47",
               "name": "Julia Pietrucha",
               "profile_path": null,
               "id": 589281,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "gosposia",
               "gender": 0,
               "credit_id": "52fe47dec3a36847f814ca4b",
               "name": "Roma Gąsiorowska",
               "profile_path": "/9inB5HtIitt3DbYRTPpxhx2wfWY.jpg",
               "id": 140661,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "55a4dfb992514147e40011d8",
               "name": "Jadwiga Jankowska-Cieślak",
               "profile_path": "/iPk571TlEjMAsAe9hIa4XlfW1B8.jpg",
               "id": 1138528,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47dec3a36847f814ca31",
               "name": "Andrzej Wajda",
               "profile_path": "/5qXVjs0C7EUye57zBFV5lZVN73w.jpg",
               "id": 2801,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47dec3a36847f814ca37",
               "name": "Andrzej Wajda",
               "profile_path": "/5qXVjs0C7EUye57zBFV5lZVN73w.jpg",
               "id": 2801,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47dec3a36847f814ca51",
               "name": "Paweł Mykietyn",
               "profile_path": null,
               "id": 589283,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5544edb7c3a368573b001730",
               "name": "Pawel Edelman",
               "profile_path": "/siaYFlq36sl3jtlU8ZNcYsv6dFm.jpg",
               "id": 3561,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.314899,
      "production_countries": [{
         "iso_3166_1": "PL",
         "name": "Poland"
      }],
      "id": 51010,
      "vote_count": 4,
      "budget": 0,
      "overview": "As an aging woman married to a workaholic doctor by chance meets a young man who makes her feel young again. All of this is films by a director making a film about her which cuts in and out of the on camera and off camera drama.",
      "similar": [],
      "original_title": "Tatarak",
      "runtime": 85,
      "poster_path": "/edyDny22vVgylMF9Xt0PFpolPOW.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Akson Studio",
         "id": 10826,
         "origin_country": ""
      }],
      "release_date": "2009-04-23",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Jaroslaw Iwaszkiewicz",
         "Krystyna Janda"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt1360887/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNzgwOTcwMV5BMl5BanBnXkFtZTcwMzcxMDkyMg@@._V1_SY317_CR131,0,214,317_AL_.jpg",
      "actors": ["Stars: Krystyna Janda, Pawel Szajda, Jan Englert | See full cast and crew »"],
      "reviews": [
         "First off the English name of the title is a little misleading, it does not regard the effect of consuming sugar, it's referring to plants that grow by the riverside. But don't worry it's still good! It is a film within a film, although the purpose here is not so much a treatise on film making. The inner film is based on Jaroslaw Iwaszkiewicz's short story Tatarak. This concerns a melancholic doctor's wife Marta, living a slow-paced life in iron curtain Poland, I think the story is set around 1960. It is a very short story, the movie is only 85 minutes long, and half of it is the film outside the film. Marta has a measure of survivor syndrome following the war, and misses having young people around the house, and so strikes up a relationship with a sweet young working class man called Bogus, who is the boyfriend of a girl who sees herself as superior because she is a university student. She is pressurising him to be more than he is, and so his rendezvous with Marta is an escape for him too. One of my favourite shots in terms of pure image craft in the movie is in the dining room of Marta's house, the set table is covered over in a white table-cloth (a formality of a bygone era?), and is reflected in a large ornate mirror on the back wall which tilts out at an angle as it is hung like a picture. This throws the image of the table so that it takes up almost the entire mirror, and it somehow is surrounded only in darkness, you cannot see any of the rest of the room. It is a shot that reminds me of the existential fragility of many of the old still life paintings for example of Adriaen Coorte. The plant in question is more commonly known as Calamus or Sweet Flag. It has two quite different odours, the root is pungent whilst the blade is more sweet smelling. This is a metaphor for the transitory nature of happiness in the movie, the root is death, the blade is life. The rendezvous take place among the sweet rushes. The Greeks had a story for the origin of the rush, told in Nonnus's Dionysiaca, where, upon the drowning of his lover during a swimming race in the river, Calamus drowned himself in sympathy and turned into a sweet rush. So the soughing of the wind in the rushes is a lament. Krystyna Janda, who plays Marta in the film, was married to Wajda's frequent collaborator cinematographer Edward Klosinski. He had a rather nasty cancer during the filming of Tatarak, and died. The film then becomes at some level a memorial for him. We see how the grief of the cancer infused Krystyna during the performance. We also see her deliver a monologue regarding her experiences with her husband around the time of his death, which are very sad. Mostly she is in a spartan room, delivering a monologue, but also we see her sometimes on set of the film, before or after shooting, and once, heartbreakingly in the rain. Tatarak won the Alfred Bauer Prize at the Berlin Film Festival, the award is \"given to a movie which opens new perspectives in film art\". Well that is exactly what this movie does. You can scarcely watch a better film.",
         "In Tatarak,great Polish cinéaste Andrzej Wajda has filmed what is important in life for all human beings.This is the reason why he has shown cinema,death,love and suffering as things which make a lot of sense for humanity.In some ways it can be said that his film is a beautiful ode to joys of love and film making.Both these creative processes are shown in great details.What is absolutely amazing to watch is the manner in which the film changes its tone.There are many moments where one feels as if a serious story is taking place. However, this is not entirely true as Andrzej Wajda ensures that his film is a good mix of all kinds of human emotions.This film has been made memorable by Krystyna Janda's excellent acting performance.She plays her role so convincingly that one is forced to believe that she is not acting but trying to be near her deceased husband.If excellent cinematography is a criteria then Tatarak would surely be acclaimed for the manner in which some of underwater scenes have been filmed. Acclaimed film critic and translator Lalit Rao saw Tatarak at 14th International Film Festival of Kerala 2009.",
         "The bleak dark room where Krystyna Janda recalls the illness and death of her husband is the root of the sweet rush lurking in the dark, muddy bed of the river - the reality. The contrasting nectar of life given so well and poignantly through the beautiful imagery, the light, the lush nature, the music, and the wonderfully naive scenes of Bogus and Maria, you can't help loving this film above its flaws. It feels like the Krystyna Janda real life scenes were made for the actress rather than for the audience. And though heart breaking it is, these monologues are a bit too long and too raw and end up like a dull paraphrasing of a poem. Probably this is intended, but still, I would rather see that time used for more on the characters, on the story and its questions.",
         "As a great fan of Polish cinema, I have given Wajda many chances to prove himself as a worthy director, and he has failed admirably in my opinion. \"Popiol i diament\" (Ashes and Diamonds) was a complete let-down, \"Katyn\" was offensive in its badness and even Janda's dedicated acting couldn't save the staleness of \"Pan Tadeusz\". I still have to watch \"Czlowiek z zelaza\" (Man of Iron) and \"Czlowiek z marmuru\" (Man of Marble), though, and reliable sources have told me they're good. But Tatarak was certainly different. Well-paced, with a sad and introspective tone, this understated film will punch you with pathos and tragedy during the credits, even if you thought you were bored during it - you weren't, that was just your mind not knowing how to deal with the horrible truth about death.",
         "Marta is the middle aged wife of a doctor in a small town. She has lost both her sons in the war and leads a monotonous life. Unknown to her she is also dying of lung cancer. One day she meets a lad who could be her son's age and feels physically attracted to him. But their riverside rendezvous ends in terrible tragedy. Now the director Andrzej Wajda complicates this simple story by weaving in another dimension. The actress playing Marta was reluctant to work in the film because of her husband's chemotherapy. While the film's tragic sequence is being shot underwater, she receives the death of her husband. It is an interesting idea but fails to deliver the dramatic impact since most of the second story is related in a long monologue by the actress. Wajda actually ends up ruining the first story too by one disastrous act of cutting between film and reality. A huge disappointment from the Polish master."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Akson Studio",
         "Agencja Media Plus"
      ],
      "summaries": ["An aging woman married to a workaholic doctor meets a young man who makes her feel young again. While having a swim in the river, the man drowns, which causes Marta to reexamine her life."],
      "budget": 0
   },
   "movielensId": 88649,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "2009-04-23",
      "dvdReleaseDate": null,
      "directors": ["Andrzej Wajda"],
      "runtime": 85,
      "movieId": 88649,
      "title": "Sweet Rush",
      "mpaa": "R",
      "actors": [
         "Krystyna Janda",
         "Pawel Szajda",
         "Jan Englert",
         "Julia Pietrucha",
         "Roma Gąsiorowska",
         "Jadwiga Jankowska-Cieślak"
      ],
      "imdbMovieId": "1360887",
      "originalTitle": "Tatarak",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "As an aging woman married to a workaholic doctor by chance meets a young man who makes her feel young again. All of this is films by a director making a film about her which cuts in and out of the on camera and off camera drama.",
      "tmdbMovieId": 51010,
      "avgRating": 3,
      "releaseYear": "2009",
      "numRatings": 5,
      "posterPath": "/edyDny22vVgylMF9Xt0PFpolPOW.jpg"
   }
}