{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt1523980",
      "video": false,
      "title": "Sins of My Father",
      "recommendations": [],
      "backdrop_path": "/npMOzzizJ6eUjMzg4beFZuNyeM7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46ffc3a36847f811e137",
               "name": "Nicolás Entel",
               "profile_path": null,
               "id": 136868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ffc3a36847f811e13d",
               "name": "Nicolas Entel",
               "profile_path": null,
               "id": 136869,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ffc3a36847f811e143",
               "name": "Pablo Farina",
               "profile_path": null,
               "id": 136870,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.078365,
      "production_countries": [
         {
            "iso_3166_1": "CO",
            "name": "Colombia"
         },
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         }
      ],
      "id": 46558,
      "vote_count": 15,
      "budget": 0,
      "overview": "Nicolas Entel's searing documentary tells the story of Pablo Escobar -- Colombian drug kingpin, murderer and family man -- through the eyes of his son Sebastian as well as the sons of two of Escobar's most prominent victims. Sebastian shares stories of living in luxury and on the lam, but more significantly, he attempts to end the cycle of bloody retribution and make peace with two of the men his father so deeply wronged.",
      "similar": [],
      "original_title": "Pecados de mi padre",
      "runtime": 94,
      "poster_path": "/mPcy3bINUEAlaNoEH15EyN0nAQp.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "2009-12-10",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nicolas Entel"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Nicolas Entel",
         "Pablo Farina"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1523980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0NTc4NTU3MF5BMl5BanBnXkFtZTcwMzc5MTIzNA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Pablo Escobar, Luis Carlos Galán, Sebastian Marroquín | See full cast and crew »"],
      "reviews": [
         "This movie tells the story of the infamous and notorious drug dealer Pablo Escubar. It is told for the first time from the perspective of Escubar's son and juxtaposed with the same story told by a man whose politician father was murdered at Escubar's command. Their story is absolutely gripping from beginning to end. The climax of the movie comes with a meeting between the sons of 2 assassinated politicians and Escubar's son. The director catches the whole meeting from the very first time they lay eyes on each other and the impact is strong. Check out this documentary. The English version is called My Father, Pablo Escubar and was recently aired on Channel 4.",
         "\"Juan Pablo Escobar has agreed to tell the story of his life with his father, Pablo Escobar, once described as the 'World's Greatest Outlaw'. It is also the story of the sons of Pablo Escobar's most prominent victims. It is the story of a country torn apart by violence and revenge, of death and reconciliation, and of a son's attempt to atone for the sins of the father.\" Ultimately it is up to the viewer to decide whether or not the actions of Sebastian Marroquin could ever have the impact that he so clearly desires. But as a snapshot of the human side of drug trafficking and the misery heaped upon the families of the victims, from all sides of the equation, My Father, Pablo Escobar is a brilliant and hard-hitting documentary. SM",
         "So I watched the documentary from 2009 Sins of my father, well was it good, I say Si. This documentary was about the worlds most ruthless drug lord, \"el jefe\" the now deceased Pablo Escobar. However, that is just part of the tale that is told. The main story is actually about his son Sebastian, and his journey to find peace in his own life. He has not followed in his father's foot steps, and in fact wants nothing to do with the world his father lived in, but shows that he loved his father very much and bears the guilt for his fathers atrocities. A big part of the story is about Sebastian seeking forgiveness, from the sons of two of the men his father had assassinated. The story of Pablo Escobar is fascinating, his son's story is fascinating, the story of the sons of the men Pablo killed is fascinating. This movie was simply incredible. There are several times throughout the movie you see Pablo as a dedicated father and family man. You even hear him sing opera at one point, very well I might add. I have long waited for a movie about the life of Pablo Escobar, this real life tale is better than anything Hollywood could ever imagine and far more moving than a gangster flick could ever be. if you like concise reviews of interesting films please read my other reviews at http://raouldukeatthemovies.blogspot.com/",
         "The main reason why I think people should watch this documentary is because it shows, in less than 90 minutes and based on the true story of a country, where corruption, the pursuit of power and drug trading can take you to. Just like many drug dealers don't think about how they will end up ruining their lives by entering the business, Pablo Escobar, one of the most successful of them all, most likely never thought it would ruin his life and affect his family's even decades after his death. Fortunately their stories remain there as a warning that we shouldn't ignore and that \"Sins of my father\" reminds the audience. This documentary is everything from the personal struggle of Escobar's son to deal with his father's life, to the fight of a country trying to become a better place but finding powerful obstacles inside and outside of its borders. It is about the human nature of doing good and about the human nature (which can be awaken early during the childhood) to do bad and destroy. Finally it is a story about regret, forgiveness and the direction in which we all should go: \"pa' adelante\".",
         "This has to be one of the best documentaries I have ever seen, I believe have ever been made. I stumbled onto it by accident on Netflix and I am so glad that took the time to watch it. The myth of Pablo Escobar is examined and the damning repercussions that he had on his family, and the family of the victims of his violence is made bare before us. The idea to document this all is absolutely amazing, and serves as a stark reminder of how power corrupts and how sometimes you have to stand up for something whatever the cost may be. We have all seen Scarface and marveled at Tony Montana excessive life, but this is the real deal and you get to see the highs and the lows. Make sure you catch the animation at the start of the documentary which is meant to show you the journey of cocaine from the plant to our streets. Its very well done set against the backdrop of a lush jungle and gunshots. Two thumbs up for this documentary. And another one for the sons who got together to try and \"break bread\" and move forward with no hard feelings.",
         "the scumbag Colombian drug lord and murderer/executioner and want to be Colombian political power- a very well made documentary but one which I found totally disgusting a man who, at one time, supplied 80 per cent of the cocaine consumed a man who, in my mind, was a total leech the story is indeed a look at what lawyers guns and money can accomplish in the hands of someone who considers himself above the law more-so considers himself -The Law The true story of a man better left forgotten His place in history is a blank best left unfilled A documentary of substance but the substance was a white powder and a trail of death,,,,,,,,"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Red Creek Productions",
         "Arko Vision"
      ],
      "summaries": ["This is the incredible story of Pablo Escobar, the infamous boss of Colombia's Medellin drug cartel, told for the very first time by his son, Sebastian and his widow Maria Isabel Santos. In Nicolas Entel's film Sebastian tells of his extraordinary childhood, growing up with a father he loved but whom he knew to be Colombia's enemy number one. He tells of times of extraordinary luxury and extravagance, and other times on the run. And Sebastian and his widow open the family vaults to share their private and long hidden archives. But this is also the story of two of Escobar's most prominent victims, the Minister of Justice and a politician about to be elected President of Colombia, as told by their sons. They were among hundreds that Escobar had killed in the 1980's. The film follows Sebastian as he tries to break the cycle of revenge and assassination by seeking reconciliation with the sons of his father's victims."],
      "budget": 0
   },
   "movielensId": 88788,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2009-12-10",
      "dvdReleaseDate": "2011-01-18",
      "directors": ["Nicolás Entel"],
      "runtime": 94,
      "movieId": 88788,
      "title": "Sins of My Father",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "1523980",
      "originalTitle": "Pecados de mi padre",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": ["NL6L2XwEJ1I"],
      "plotSummary": "Nicolas Entel's searing documentary tells the story of Pablo Escobar -- Colombian drug kingpin, murderer and family man -- through the eyes of his son Sebastian as well as the sons of two of Escobar's most prominent victims. Sebastian shares stories of living in luxury and on the lam, but more significantly, he attempts to end the cycle of bloody retribution and make peace with two of the men his father so deeply wronged.",
      "tmdbMovieId": 46558,
      "avgRating": 3,
      "releaseYear": "2009",
      "numRatings": 12,
      "posterPath": "/mPcy3bINUEAlaNoEH15EyN0nAQp.jpg"
   }
}