{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0317052",
      "video": false,
      "title": "AKA",
      "recommendations": [
         89608,
         238965,
         40940,
         22093,
         17731,
         4676
      ],
      "backdrop_path": "/h3cJmbTzfAcsbg4ydfMENuEL2GC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dean Page",
               "gender": 2,
               "credit_id": "53d7237c0e0a260337000bf1",
               "name": "Matthew Leitch",
               "profile_path": "/nIsSrvUw4HVqnhuhUijITAtQek8.jpg",
               "id": 141770,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lady Gryffoyn",
               "gender": 1,
               "credit_id": "55ddf041c3a3684a7f00029e",
               "name": "Diana Quick",
               "profile_path": null,
               "id": 163422,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "David",
               "gender": 0,
               "credit_id": "55ddf04a9251417444002de9",
               "name": "George Asprey",
               "profile_path": null,
               "id": 1243338,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Stella Primrose",
               "gender": 0,
               "credit_id": "593bb521925141059300abbc",
               "name": "Rachel Pickup",
               "profile_path": "/paSFHcLTDBmR6n04bIpCyJA3rSA.jpg",
               "id": 1232889,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4658c3a36847f80f9ccb",
               "name": "Duncan Roy",
               "profile_path": null,
               "id": 129992,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56f07f57c3a3687189000e5d",
               "name": "Duncan Roy",
               "profile_path": null,
               "id": 129992,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56f07f75925141183d000bf1",
               "name": "Duncan Roy",
               "profile_path": null,
               "id": 129992,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.763034,
      "production_countries": [],
      "id": 43657,
      "vote_count": 5,
      "budget": 0,
      "overview": "A story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family. In order to make something of himself, Dean assumes another identity and manages to enter high society. As he navigates this decadent new world, he meets a host of characters, including David, an older gay man who desires him, and Benjamin, a young hustler from Texas who has also managed to find a place among the aristocracy. Can Dean find love while living a lie? How much is he willing to sacrifice in order to pull off his charade? Presented through three simultaneous frames rather than one.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "AKA",
      "runtime": 123,
      "poster_path": "/xH1XqsnlHYZQd328NxWcqw3jOm5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2002-01-19",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Lies are like wishes: tell enough of them... some of them come true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Duncan Roy"],
      "runtime": 123,
      "synopsis": null,
      "writers": ["Duncan Roy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0317052/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1MzU2MTI5OF5BMl5BanBnXkFtZTcwMDk3NjYyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Leitch, Diana Quick, George Asprey | See full cast and crew »"],
      "reviews": [
         "Director Duncan Roy has a most interesting story to tell in this first film of his own late Seventies experiences as an 18-year-old gay working class boy who posed successfully as a lord till he went to jail for fraud. But even if this may all have really happened, it doesn't always work as a movie, nor is the acting at key moments up to par. Though good looking enough to pose as somebody, Matthew Leitch, as Dean Page, the boy who is kicked out of his home by his abusive father (later we learn he was sexually abusive as well), is extremely wooden and timid much of the way through. Toward the end he finally becomes bolder, but by then it's too late. It's hard to believe anyone so backward could con people into thinking anything, least of all that he's a lord. Whether this is inadequacy on the part of the actor or on the part of the director or both is hard to say. `AKA' is told on triple screens, which provide alternate angles or takes on the scene being shown. Though this may seem novel or elegant to some and to underline the hero's divided personality, it's chiefly just an annoying device that calls undue attention to itself and seems created as a distraction from the movie's occasional amateurish qualities, the haste with which it was made, the low budget, the fact the footage was all shot on video. First we see young Dean being regaled with tales of the upper class by his ma, who works as a waitress at a chic restaurant and embroiders upon her glimpses of posh people at work by reading gossip magazines. Then Dean runs away and is picked up by a well bred old queen who lives off Eaton Square. Emboldened by this, he approaches someone his mother has spoken of, a certain Lady Gryffoyn, the proprietress of a London art gallery, who momentarily adopts him, which leads to his spending time at the Gryffoyn country house while people are away. Lady Gryffoyn's son Alexander subsequently humiliates Dean and he accepts it as his due, but goes off with their credit cards and winds up in Paris impersonating the son, becoming part of a trio including a wealthy gay man named David Glendemming and his gigolo, a boy from Texas named Benjamin Halim (Peter Youngblood Hills, in the film's best, and only involving, performance: Hills has the intensity, and somewhat the look, of Billy Crudup). One is shocked to encounter Diana Quick, who was so suave and lovely in `Brideshead Revisited,' playing Lady Gryffoyn as a crude and garish harridan. Again one wonders if the actress is in sad decline, or the director misguided, or both. If Roy is settling scores, that's no excuse for such a charmless portrayal. Part of the clumsiness of `AKA' is that Dean not only doesn't show real self-confidence, but also doesn't really acquire a posh accent until he has been pretending to be young Gryffoyn for some time. I'm afraid I was unmoved by Lindsay Coulson, beloved in England for her TV roles, as Dean's mother. She seems merely sad and bedraggled. The sleazy credit card investigators who appear and disappear periodically, sometimes interviewing the mother, add little more than confusion. Whether class matters in England now as it once did is uncertain, but the habits of mind and behavior remain, and in that sense `AKA' touches a nerve. The film is also a bizarre coming of age story in which embracing a gay identity is occasionally considered in rather searching and realistic terms \u0096 particularly in the perhaps over-long sequence where Benjamin Halim and Dean finally have sex and then talk about it. There's no doubt about the fact that the content of `AKA' is racy and thought provoking. But the treatment is not up to the level of the raw material. Perhaps Roy, who like his creation Dean was arrested and made to serve ten months of a fifteen-month sentence for `falsification of identity,' was really like the reserved, inert person played by Matthew Leitch and it worked. This seems highly doubtful, though, and reports on Roy himself suggest his is a powerful personality. In any case, what actually may have happened and what succeeds in a movie are two different things. Many of the scenes are raw and crudely emotional, further suggesting that the experiences being conveyed have not been fully digested or welded into an artistic whole. We are watching psychodrama when what was needed was social comedy. `AKA' is scheduled to be shown at the Sundance Film Festival in 2003. It has been shown and awarded at several North American gay film festivals (the theme of wearing masks appeals to a gay audience) and it has enjoyed a London run at The Other Cinema near Leicester Square. Viewers who saw it there understandably express some disappointment after all the favorable publicity the film has received. The reaction is often, and justifiably: Duncan Roy's life is quite a fascinating story -- why didn't he tell it better? It was told most interestingly in `The Guardian' of September 21, 2002 by Caroline Roux. Too bad it wasn't more effectively told by Roy himself in `AKA.' Perhaps as a born imposter, he can't get his own story straight. Somebody else ought to make a movie out of it.",
         "In Britain, while the class divide is no longer relevant to most people's lives in terms of access to education or employment, there is still a great fascination with the lives of the rich. This takes the form of magazines such as 'Hello!' and 'OK!', various TV shows (particularly 'Faking it' in which a person of a certain profession/background/up-bringing is taught to behave in an opposite manner) and the enduring popularity of 'My Fair Lady' on the London stage. AKA deals with this fascination with the upper class and the way a person might assimilate into the group by deceit. Plot-wise the film is therefore quite similar to 'The Talented Mr. Ripley' and indeed also includes the homo-eroticism of that film (a symptom of privileged all male education perhaps?) as well as a certain similarity between the two leads (Matthew Leitch particularly reminds the viewer of Matt Damon when he smiles). This is another excellent film by the recently deceased Film Four in its Film Four Lab guise (following 'Jump Tomorrow', 'My Brother Tom' & 'This Filthy Earth') which allowed for some experimentation in the cinema - which in this case means the entire film is shown in triple split screen. Creating an image even wider than 2.35:1 this does mean the viewer has to look from one third of the picture to another to entirely follow the action, but unlike Mike Figgis' 'Time Code' this is never distracting as each of the images is chosen to complement the others - for example a shot of two people talking is split between two images with the third providing a close up - and the audience does get used to this after a couple of minutes when it becomes second nature experiencing a film in this way. There doesn't seem to be a particular reason why the film is set up in this fashion at first, but it does compliment the duplicity of the lead character and the layered facades the other characters in the film hide behind (especially Benjamin). It also obviously provides a way for a 4:3 DV image to fill the cinema screen. Coming from TV backgrounds, all the actors put in reasonable performances, especially the 'adults' but Matthew Leitch in particular (who, like Peter Youngblood-Hills, comes from 'Band of Brothers') gives a commanding performance and it is no surprise that he followed this film with a Hollywood movie (David Twohy's 'Below'). While there are a few problems with the plot - the film implies that homosexuality stems from childhood abuse - an occasional problems with the quality of the sound (due to the budget) this is nevertheless a brilliant feature debut for writer director Roy, and together with his lead actor, I will be surprised if an impressive career does not follow...",
         "This offering was recently presented on Sundance Channel without much fanfare. I had never heard of it before, in fact. The comparison to \"Mr. Ripley\" is immediately obvious at about thirty minutes in. If I had not subsequently learned more about evidence of an autobiographical source, I would have judged it a poor copy of the Highsmith novel and film. Nevertheless, I rather liked it as a whole. The version I saw was limited not so much by any split-screen device as it was by extremely shoddy editing. Great gaps in both story line and character development occur almost from the start, and I was left floundering from time to time until I could infer this or that bit by slogging onward. Had it not been for a great supporting cast I might have switched it off before other redeeming pieces fell into place. Those better features included an accurate social setting for 1978, some interesting costumes, and one or two experiences of the character played by Matthew Leitch in Paris that approximated some of my own contemporaneous involvements with that city. In other words, I am not able to be completely objective, and will say no more.",
         "those of you who saw this in the theater (cinema, for any Brits reading this), as i did, might be interested to know that i have been told that the DVD release is in single-screen format. because of this, i intend to have another look at this film, on DVD. while i found the triptych format interesting at first, it came to be a distraction when used for the film's entire length. that device is not sustainable for such a long time and detracts from the film, as the viewer becomes more focused on form than on content, IMHO. others who saw this in theaters and were disappointed by it might want to give it another try on DVD this time.",
         "For some reason, Canal+ Film2 channel is showing on my boyfriend's TV. This movie was on this morning. I didn't even know it's name, I just searched with the name of a character since I felt I should comment on this. AKA is most likely a movie not many people have seen, since it deals quite heavily with things that are often swept under the carpet, such as homosexuals and drugs. This is not a bad movie. I can't see why so many people seem to have rated it 1/10. I gave it 7 since it's not excellent, but still worth viewing. The main thing is the tension between British middle class and aristocrats. Do you remember the episode of Faking it where a sales girl was taught to be a lady? Well this is the same thing but with a boy and no one to teach him. The main character Dean Page is a mama's boy who must leave home and soon finds himself in Paris, pretending to be Lord Alexander Gryffoyn. David and his lover boy Benjamin take Dean/Alex under their wings, unaware of who he really is. Upper class proves to be mostly a bunch of arrogant cocaine sniffers that treat outsiders like s***. Notice when Dean returns home there is a pile of dog poop on the road. The ending is quite predictable, but what's said about David is quite funny.",
         "I did buy the Dutch release of this movie by Home Screen. On this DVD you can find the split screen version (that a lot of people seem to hate so much), but fortunately also the normal (= single screen) version. I did watch this normal version only, because I don't want to have a headache or I don't want to feel dizzy. And I must say that you can follow the story very easily then. This Duncan Roy movie is not a masterpiece, but it's an entertaining film and I liked it. It's not as good as \"The Talented Mr. Ripley\" (that's almost impossible), but it's a real story and that makes it peculiar. Watch the single screen version and you will see it's not bad at all !",
         "How did I miss this 2002 film? Never even heard of it before watching it on Sundance the other day. Quite fascinating. Excellent acting by all. A troubling set of themes in this film, including the old stand-by--incest/rape--as well as class & economic cleavage and, to spice things up, some sexual episodes of interest! Surprisingly well filmed and directed. An absolute sleeper this unusual film! Can't wait to read what reviewers thought of it. ***(And now the most ridiculous requirement from Internet Movie Database that one must fill in 10 lines of comments, so here I must add filler, and more filler, and even more filler until--aha!--the minimum number of line has been reached.)",
         "I have avoided this film after seeing D Roy's Dorian Gray - which has to possibly be the worst film that has ever had the misfortune to see the light of day....anyone who put money into that film should be unbelievably ashamed of Roy's profligate waste of hard invested cash....not to mention the audience's money being flushed down the drain the moment the first frame appeared....dreadful dreadful dreadful. I digress - AKA - another disaster. The split screen device only serves to demonstrate that this film was seeking a way to save itself. It didn;t work. There is a fantastic story in this film somewhere and a google of D Roy reveals that like his alter ego in the film he too is a little bit of a fantasist - interviews reveal a somewhat arrogant personality (as was evident in the comments he made about Elizabeth Hurley)....sadly arrogance only masks insecurity and this in turn clearly underpins his lack of skill at being able to make or direct a good story. It is clear that this director neither trusted the actors nor people around him to write a credible and direct a worthy entertaining script. I think this film is a tragic lost opportunity. It casts suspicion on the near faultless direction of his film Clancy's Kitchen which was a fun well made featurette. I am not sure this director will ever eclipse that little success.",
         "I enjoyed this film. I started out with the full screen version on the DVD. The story is interesting. Leitch gives a quiet sparse performance. The general feel of the film matches the story line...a little tattered and edgy. When I watched the first 20 minutes of the film in the triptych I really liked it. Had my TV been bigger, and had I not just watched the whole film, I think the original presentation would have been even more interesting. This film, to me, is more of an art piece than what one might expect of a perfectly polished Hollywood blockbuster. Anything it may lack can easily be overlooked in deference to the gestalt. Finally, the soundtrack is really good.",
         "I'm a bit spooked by some of these reviews praising A.K.A. Not only do they sound as if they were written by the same person, but they contain all kinds of insider information that surely you could only find by reading the press book from cover to cover. Please don't tell me that the director is writing his own reviews as that would just be too sad to contemplate. Afraid I'm another one of those who hated the film and was surprised by its unapologetic amateurism. Great idea, shame about the execution. And it was most disconcerting to watch so many good actors (as well as some very bad ones including the leaden lead) all apparently thinking that they were appearing in a series of very different films. I wish that A.K.A. had been audacious, innovative or just simply interesting. Sadly it was like watching an unintentionally hysterical home video with arty aspirations. A missed opportunity."
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["AKA is the story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family. In order to make something of himself, Dean assumes another identity and manages to enter high society. As he navigates this decadent new world, he meets a host of characters, including David, an older gay man who desires him, and Benjamin, a young hustler from Texas who has also managed to find a place among the aristocracy. Can Dean find love while living a lie? How much is he willing to sacrifice in order to pull off his charade? Presented through three simultaneous frames rather than one."],
      "budget": 0
   },
   "movielensId": 8895,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-19",
      "dvdReleaseDate": "2004-09-14",
      "directors": ["Duncan Roy"],
      "runtime": 123,
      "movieId": 8895,
      "title": "AKA",
      "mpaa": "",
      "actors": [
         "Matthew Leitch",
         "Diana Quick",
         "George Asprey",
         "Rachel Pickup"
      ],
      "imdbMovieId": "0317052",
      "originalTitle": "AKA",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story of a disaffected youth's search for love, status, and identity in late 1970s Britain. 18-year old Dean is handsome and bright, but feels hampered by his working-class background and by his family. In order to make something of himself, Dean assumes another identity and manages to enter high society. As he navigates this decadent new world, he meets a host of characters, including David, an older gay man who desires him, and Benjamin, a young hustler from Texas who has also managed to find a place among the aristocracy. Can Dean find love while living a lie? How much is he willing to sacrifice in order to pull off his charade? Presented through three simultaneous frames rather than one.",
      "tmdbMovieId": 43657,
      "avgRating": 3.25862,
      "releaseYear": "2002",
      "numRatings": 29,
      "posterPath": "/xH1XqsnlHYZQd328NxWcqw3jOm5.jpg"
   }
}