{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fire",
            "id": 657
         },
         {
            "name": "mutation",
            "id": 2766
         },
         {
            "name": "disaster",
            "id": 10617
         }
      ],
      "imdb_id": "tt0072750",
      "video": false,
      "title": "Bug",
      "recommendations": [
         46878,
         143928,
         42218,
         40929,
         40729,
         41972,
         27786,
         26978,
         21512,
         38125,
         16214,
         18414,
         31676,
         89904,
         38986,
         16405,
         69007,
         241432,
         76297,
         29338
      ],
      "backdrop_path": "/y8QGFaKYxXOx4Bq2zkBfVakLvcp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Prof. James Parmiter",
               "gender": 2,
               "credit_id": "52fe4689c3a368484e09609f",
               "name": "Bradford Dillman",
               "profile_path": "/zmoOkQTh6c7VwQlEl86r73pYFFw.jpg",
               "id": 18647,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Carrie Parmiter",
               "gender": 1,
               "credit_id": "52fe4689c3a368484e0960a3",
               "name": "Joanna Miles",
               "profile_path": "/pLxo4VRibbJWjWkjuudGQPYWPSX.jpg",
               "id": 106765,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gerald Metbaum",
               "gender": 2,
               "credit_id": "52fe4689c3a368484e0960a7",
               "name": "Richard Gilliland",
               "profile_path": "/wGFWVVIFCluds0tvaPSAQ86zVGa.jpg",
               "id": 42169,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Norma Tacker",
               "gender": 0,
               "credit_id": "52fe4689c3a368484e0960ab",
               "name": "Jamie Smith-Jackson",
               "profile_path": "/7tElVSdRpjqZbYeW1ObgxWmWUIw.jpg",
               "id": 132875,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Prof. Mark Ross",
               "gender": 2,
               "credit_id": "52fe4689c3a368484e0960af",
               "name": "Alan Fudge",
               "profile_path": "/fNdXqSyy3dyF5a2rkpN0lry3RJS.jpg",
               "id": 124131,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tom Tacker",
               "gender": 2,
               "credit_id": "52fe4689c3a368484e0960b3",
               "name": "Jesse Vint",
               "profile_path": "/yJKMTKJgvoqEdy4ExnJlNjrszVi.jpg",
               "id": 12123,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4689c3a368484e0960b9",
               "name": "Jeannot Szwarc",
               "profile_path": "/mIW7mgLr83qyGovTWAigrPX66v3.jpg",
               "id": 16187,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4689c3a368484e0960bf",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4689c3a368484e0960c5",
               "name": "Thomas Page",
               "profile_path": null,
               "id": 235819,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a21e16c0e0a264cc80b2d5e",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a21e25b0e0a264cd00ad383",
               "name": "Michel Hugo",
               "profile_path": null,
               "id": 78387,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a21e26ec3a3680b930adc27",
               "name": "Allan Jacobs",
               "profile_path": null,
               "id": 1176925,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 2.913722,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62697,
      "vote_count": 26,
      "budget": 0,
      "overview": "An earthquake releases a strain of mutant cockroaches with the ability to start fires, which proceed to cause destructive chaos in a small town. The studies carried out by scientist James Parmiter, however, reveal an intent with much more far-reaching consequences.",
      "similar": [
         707,
         5919,
         296,
         254128,
         11596,
         395991,
         296524,
         19898,
         8329,
         841,
         928,
         95,
         17654,
         7191,
         9738,
         14161,
         435,
         9426,
         98566,
         36586
      ],
      "original_title": "Bug",
      "runtime": 99,
      "poster_path": "/r4XeZIpoQqYWj0rPEa3DwOgG9FZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "William Castle Productions",
            "id": 10324,
            "origin_country": ""
         }
      ],
      "release_date": "1975-06-06",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Out of the worst nightmare!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeannot Szwarc"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Thomas Page",
         "William Castle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072750/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5OTk2NDE5OV5BMl5BanBnXkFtZTcwODM5MzYyMQ@@._V1_SY317_CR24,0,214,317_AL_.jpg",
      "actors": ["Stars: Bradford Dillman, Joanna Miles, Richard Gilliland | See full cast and crew »"],
      "reviews": [
         "I saw this movie once about 20 years ago. If you read other's comments you'll find that just about everyone hates the second half of the movie. For me it was the reverse. The first half wasn't particularly interesting. Bugs starting fires, BIG DEAL. Then the movie apparently ends and you're wondering what else could happen. That's where it gets interesting. I liked the doctor's slow descent into madness. It was highly original and refreshing twist. The bugs on the wall just rocked! If you want to make more sense of the doctor's actions read the book, The Hephaestus Plague. The book actually continues on beyond where the movie ends. I'd really recommend this movie unless of course you want stupid CGI instead of plot and character development.",
         "This is a dandy little nature-run-amok film, in which giant cockroaches from the center of the earth make their appearance in a small farming community. Bradford Dillman was never better than he is here as the tortured Dr. Parmiter. He fairly sweats acting genius through his beard stubble.",
         "This movie isn't really that bad at all. I have a very fond memory is of this passing through our local drive-in, me wishing that I was one of the big kids and that I could go see such a terrifying violent horror movie. I remember tha period, you know, Day Of The Animals, Grizzly, Don't Go In The House, The Swarm, etc. What a great era man! So - I just watched this movie for the second time (I saw it once before but don't remember when). It's great as a \"capsule in time\" . Things I liked - some decent shots, some not hideous special effects - the cast giving it their best shot to keep a straight face. And would agree with a few others, the second half, after, I would also agree the snorefest of \"experiments\", things take a turn for the better. Darker, unpredictable, actually kind of scary, and completely over the top zany, I didn't see that coming. So not bad at all entertaining enough to rent on a Thursday night. OK - now I'm gonig to watch NO DEPOSIT NO RETURN...buhhh bye now..buh bye",
         "This movie I can tell you, it freaked me out very much when I first saw it. I now own it on vhs and to this day I still get freaked out everytime I watch it. This movie along with others that were done about 30 yrs. ago approximately especially the ones with insects were done very well and some are a lot better than the ones of today.",
         "This scared the hell out of me when I saw it.Roaches that rub their legs together kill everything and everyone.Bradford dillman is a good actor and I think this movie is his best work.The ending of the movie is really strange and I think This is the best of killer bug films.A good companion to this movie is the nest [1988]Only in this film they kill by using teeth.",
         "Despite the lurid exploitation title, this is for the most part a grim and weird semi-art-house sci fi movie, more akin to PHASE IV than something like THEM or even THE BIRDS. BUG benefits greatly from the intense and nervously twitchy central performance of BRADFORD DILLMAN as the scientist who goes off the deep end after his wife is set ablaze by the title critters. The insect photography is well-done and the soundtrack whenever the bugs make an appearance is a prototypically 70's art-house exploitation hybrid--a series of scratches and electronic pops--but it becomes unnervingly effective. The scenes near the end where Bradford Dillman starts performing bizarre experiments upon the BUGs and establishing some sort of contact with them remain potent and eerie and all of the scenes where he finds them crawling loose in his farmhouse are disturbing; If you are willing to forgive some poor special effects near the climax you wont be disappointed by Bug. It is a genuinely creepy movie, one which manages to conjure up a disturbing atmosphere of heat and paranoia and eventually crumbling insanity. Worth a look.",
         "In 'Chinatown' John Huston has a line that goes something like, 'Politicians, ugly buildings and whores get respectable if they last long enough.' Well, based on the nostalgia-based fondness so many reviewers have for this film, 'Bug' is an old whore. Playing out like a combination 70's disaster film (with none of the budget\u0085the town is populated by 30 people) and 50's mutant monster flick, 'Bug' gets points for weirdness and occasional moments of creepy tension, but to enjoy these, one has to put up with some of the worst acting ever set to film. The plot is familiar in that 'Mystery Science Theater 3000' kind of way: earthquake releases plague of indestructible bugs that shoot flames out of their butts. The star of the film is Bradford Dillman. THE STAR! Bradford Dillman has always struck me as one of those actors who should be kissing the ground daily for even having a career. He is almost aggressively bland and charisma-free, yet I can scarcely recall a 70's TV show that his zero-wattage star power didn't grace. *SPOILERS* With Dillman as the star and giving the film's best performance, one gets a hint of what is in store\u0085one young actor cast as the boyfriend of a screaming hippie farmgirl is so inexpressive and stiff that I found myself looking in the credits to see if it was the director's son or something. Cute Patty McCormack from 'The Bad Seed' has an underwritten bit part but at least has a hilarious death scene, and an actress named Joanna Miles should have sued for being given a role without a character to play. As stated, the plot per se isn't bad, but the execution is; awkward camera set ups, draggy pacing, clumsy special effects\u0085 'Bug' is so bad that it's actually surprising that it wasn't directed by William Castle (he produced) who seemed to have learned absolutely nothing from being involved with 'Rosemary's Baby.' However, when I saw that it was directed by that hack Jeannot Szwarc, it all made sense. 'Bug' has nostalgia appeal, a great cheesy 70's look in its costumes and sets, is fun in a guilty-pleasure kind of way, but it's a terrible movie pure and simple.",
         "Silly, but truly horrifying account of a new breed of cockroach/beetle that infest a small town after a major earthquake. These little creatures possess the ability to emit sparks from their underside, making them capable of setting fires. A concerned young lad is the first to discover the bugs and shows them to his biology professor, who in turn becomes obsessed with the creatures and begins his descent into madness. Very unsettling and equally suspenseful, this film will make you get that \"there's-a-bug-on-me!\" feeling that we all hate-- over and over and over again. I was amazed at the cockroach-wrangling as well, especially when they all grouped together to spell out \"WE LIVE\" on the protagonist's living room wall. This was horror master William Castle's last film.",
         "Viewers who may be having some insect problems in their own abode may feel a bit better about their domestic situation when they see what the residents of a small California desert town have to contend with, in 1975's \"Bug.\" After a seismic event releases the titular nasties from deep underground, the ugly, beetlelike creatures start making trouble, setting fires wherever they go by rubbing their chitinous rear antennae together. And then things get even more problematic, when a balmy biology teacher (excellently portrayed by Bradford Dillman) decides to cross the \"Firebug\" with the ordinary domestic roach! OK, first let me say what \"bugged\" me about this film. It is occasionally slow moving and, other than Dillman's character, there is no other character of any depth or interest to speak of. And since even Dillman's character goes bonkers halfway through, there's really nobody for the viewer to root for or identify with. There is, however, plenty of good news. The film IS creepy as can be (roachaphobes, be forewarned!) and features an eerie electronic score by Charles Fox and interesting directorial touches from Jeannot Szwarc. And those bugs really are something! I could not tell half the time if I was looking at a genuine insect or the result of some special FX wizardry; probably a cunning mixture of the two. And the four bug attack sequences, three of them on women, are gruesomely effective and well done. A tip of the hat to producer and co-writer William Castle, who, in this, his last film, demonstrated that he still knew how to deliver a gripping entertainment. (Come to think of it, the Firebug almost looks like a pint-size Tingler!) My buddy Rob has astutely pointed out to me the picture's skillful use of establishing shots, prolonged silences, \"disturbing imagery\" and \"unnerving stillness,\" and I must admit that a repeat viewing revealed the film to be not so much slow as deliberately paced. Ending on as bleak a note as can be, the picture will most likely send viewers off to the hardware store to pick up a preventive pack of Combat!",
         "Hadn't seen this since I was 8,so I didn't know what to expect,since it was directed by the infamous Jeannot Szwarc,who helmed such big budget disasters such as Supergirl & Santa Claus The Movie,have to say it was very creepy,well made, & even scary in some spots,believe me,after watching this,you'll be up all night spraying your kitchen with heavy doses of Raid.I hope that Paramount releases this on DVD.Check It Out!!!"
      ],
      "genres": [
         "Sci-Fi",
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["William Castle Productions"],
      "summaries": ["An earthquake releases a strain of mutant cockroaches with the ability to start fires, which proceed to cause destructive chaos in a small town. The studies carried out by scientist James Parmiter, however, reveal an intent with much more far-reaching consequences."],
      "budget": 0
   },
   "movielensId": 8902,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-06-06",
      "dvdReleaseDate": "2004-09-14",
      "directors": ["Jeannot Szwarc"],
      "runtime": 99,
      "movieId": 8902,
      "title": "Bug",
      "mpaa": "PG",
      "actors": [
         "Bradford Dillman",
         "Joanna Miles",
         "Richard Gilliland",
         "Jamie Smith-Jackson",
         "Alan Fudge",
         "Jesse Vint"
      ],
      "imdbMovieId": "0072750",
      "originalTitle": "Bug",
      "genres": [
         "Science Fiction",
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "i0OnDYxdilk",
         "hlT_4kmVAhY"
      ],
      "plotSummary": "An earthquake releases a strain of mutant cockroaches with the ability to start fires, which proceed to cause destructive chaos in a small town. The studies carried out by scientist James Parmiter, however, reveal an intent with much more far-reaching consequences.",
      "tmdbMovieId": 62697,
      "avgRating": 2.51163,
      "releaseYear": "1975",
      "numRatings": 43,
      "posterPath": "/r4XeZIpoQqYWj0rPEa3DwOgG9FZ.jpg"
   }
}