{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "star",
            "id": 3412
         },
         {
            "name": "microchip",
            "id": 3523
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "boss",
            "id": 5306
         },
         {
            "name": "filmteam",
            "id": 8075
         }
      ],
      "imdb_id": "tt0364343",
      "video": false,
      "title": "The Final Cut",
      "recommendations": [
         9357,
         2163,
         6963,
         8870,
         4965,
         2067,
         11258,
         9886,
         178,
         10384,
         10153,
         10685,
         9271,
         9566,
         9922,
         8080,
         9620,
         11088,
         11022,
         11058
      ],
      "backdrop_path": "/oietrN2BtowR4edUZqDvF5KodgX.jpg",
      "revenue": 548039,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Alan W. Hakman",
               "gender": 2,
               "credit_id": "52fe43f79251416c750246d9",
               "name": "Robin Williams",
               "profile_path": "/5KebSMXT8uj2D0gkaMFJ8VEp53.jpg",
               "id": 2157,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Delila",
               "gender": 1,
               "credit_id": "52fe43f79251416c750246dd",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Fletcher",
               "gender": 2,
               "credit_id": "52fe43f79251416c750246e1",
               "name": "Jim Caviezel",
               "profile_path": "/koyFOeFdQyyFs26DNyDHWluBibB.jpg",
               "id": 8767,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Thelma",
               "gender": 1,
               "credit_id": "52fe43f79251416c750246e5",
               "name": "Mimi Kuzyk",
               "profile_path": "/cNgDKhThTItP4z4lowcHnndky6N.jpg",
               "id": 65471,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Isabel Bannister",
               "gender": 1,
               "credit_id": "52fe43f79251416c75024701",
               "name": "Genevieve Buechner",
               "profile_path": "/fjkyFv3WsMMF4N0BpIHl12Us8fN.jpg",
               "id": 46903,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Nathalie",
               "gender": 0,
               "credit_id": "52fe43f79251416c75024705",
               "name": "Leanne Adachi",
               "profile_path": null,
               "id": 25388,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Hassan",
               "gender": 2,
               "credit_id": "52fe43f79251416c75024709",
               "name": "Thom Bishops",
               "profile_path": null,
               "id": 209505,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Jennifer Bannister",
               "gender": 1,
               "credit_id": "52fe43f79251416c7502470d",
               "name": "Stephanie Romanov",
               "profile_path": "/xD0YDW0lT7ww3amHRKeK2db6bs7.jpg",
               "id": 159485,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f79251416c750246b1",
               "name": "Omar Naim",
               "profile_path": null,
               "id": 68020,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f79251416c750246b7",
               "name": "Omar Naim",
               "profile_path": null,
               "id": 68020,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750246bd",
               "name": "Nick Wechsler",
               "profile_path": "/1HeDC5sNgXBN09SiyoPs3VcUQsH.jpg",
               "id": 6468,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750246c3",
               "name": "Brian Tyler",
               "profile_path": "/22QWiNJj03amY6GT1QPUs7dbdcB.jpg",
               "id": 6041,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750246c9",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43f79251416c750246cf",
               "name": "Dede Allen",
               "profile_path": "/20uUxDktTl18s4Y20oPipmWHRJD.jpg",
               "id": 6453,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750246d5",
               "name": "Robert Brakey",
               "profile_path": null,
               "id": 52750,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f79251416c750246f1",
               "name": "Guymon Casady",
               "profile_path": null,
               "id": 53758,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.935231,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11099,
      "vote_count": 241,
      "budget": 0,
      "overview": "Set in a world with memory implants, Robin Williams plays a cutter, someone with the power of final edit over people's recorded histories. His latest assignment is one that puts him in danger.",
      "similar": [
         1562,
         745,
         1374,
         334,
         335,
         425,
         637,
         675,
         744,
         10795,
         1579,
         829,
         1381,
         36648,
         12113,
         95,
         101,
         470,
         322,
         402
      ],
      "original_title": "The Final Cut",
      "runtime": 95,
      "poster_path": "/8YPAz6LdWatGQWhZkGCxSWUzPNt.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/eNdCXEfW6rDxjnO3VdqIzWVuviH.png",
         "name": "Lions Gate Films",
         "id": 35,
         "origin_country": ""
      }],
      "release_date": "2004-10-15",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "In the end, he sees everything.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Omar Naim"],
      "runtime": 95,
      "synopsis": "In this futuristic tale, Alan Hakman (Robin Williams) witnesses the death of his childhood friend who had fallen off a plank of wood in the abandoned building in which they were playing. Flash to the present, and chips called \"Zoe\" are inserted into the brain at birth and record a person's entire life; when the person dies, the video is edited and shown at the funeral. Video editor (\"cutter\") Alan Hakman edits the recordings of people's lives according to the wishes of the subject's survivors, interviewing the person's family members to get an idea of what to look for in the recordings. Of course, in the case of some unscrupulous people, the bad parts are of course left out, but the entire recording of a person's life is therefore subject to scrutiny. So, in some cases, Hakman was knowingly burying the bad and highlighting the good. As a result, Alan is turned into a cold megalomaniac, but things change when he stumbles across a subject's memory of his friend, whom he thought was dead. In searching for a record of his friend's Zoe chip, he finds none, as only 20% of all people have the implants. What he does find is a record of his own implant, of which he was unaware. He goes about accessing the memory, which shows that Alan's friend was still breathing, and the \"blood\" Alan thought he remembered stepping in as he was leaving the building turned out to be paint. Meantime, the Zoe chip of his subject was destroyed during a confrontation in his office. Confronted by activists who want his subject's life opened to all, Alan attempts to flee because his memory chip recorded what he saw of the subject's life, but is shot and killed by the activist, who justifies his actions, hence Alan was not killed in vain. Mira Corvino and James Caviezel also star.",
      "writers": ["Omar Naim"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0364343/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjkxNjA4NjM0M15BMl5BanBnXkFtZTcwMTU3MDcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robin Williams, Jim Caviezel, Mira Sorvino | See full cast and crew »"],
      "reviews": [
         "Set during an unspecified future era, or perhaps an \"alternate universe\" present era, The Final Cut posits a world in which \"first person viewpoint\" computer chip implants are possible for those who can afford it. These record a person's entire life from a first person viewpoint--the \"camera\" sees what the person sees, hears what they hear. The intention is to have an accurate, documentary-like record after the person dies. These are presented as films at their funerals. Citizens known as \"cutters\" (just a slang for a film editor) pare down one's life to a feature length presentation. There are also those who protest the implants. The Final Cut is the story of the latter days of a cutter, Alan W. Hakman (Robin Williams). While The Final Cut is enjoyable enough, it has tremendous squandered potential. As one would expect, Williams turns in an incredible performance, but the script, by writer/director Omar Naim, could have used a lot of work. The premise is fabulous. It opens many philosophical and psychological cans of worms. Some are dealt with, but only cursorily. Surely cutters go through a lot of emotional trauma as they vicariously experience the lows and the mundanities of other person's lives. Naim shows us this briefly with a recording of someone who was an abuser. But as soon as he shows us this material, he drops it. The film is advertised as a thriller. How much more exciting would it have been to embed Hakman in the middle of some grand, suspenseful plot, the details of which became known to him through data from an implant? As one of the opponents of the implant technology remarks, the implants have changed the way people relate to each other. That is a good point--it would have a profound impact on that. So why aren't we shown instances of this in the film? This could have been another hinge for a very intriguing, tense plot. There are also issues of invasion of privacy, surveillance paranoia, consent (the implants are shown being put into infants and being permanent), and \"misuse\" of the data. Most of these are barely touched. Often they're only broached with a single comment, or a protester's sign. Other fascinating issues brought up by the idea of the technology are not even mentioned. Surely, such technology would prove to be invaluable as evidence in crimes. And surely many people, especially victims, would voluntarily offer a \"tap\" into their implants so they can be witnesses. Why not comment on these kinds of possibilities? The Final Cut is also oddly understated with such a far-reaching sci-fi premise in this era of rubber reality films. A number of plot points, such as the one involving Louis Hunt, have almost disappointingly mundane resolutions. For that matter, for a sci-fi film set in the future or an alternate reality, there isn't much that is different about the world except for the implants. Probably the lack of differences was due to budget. It costs a lot of money to build alternate realities. This might sound far too negative for the film to warrant a 7 out of 10 from me, which is equivalent to a \"C\" letter grade. Much of the film is saved by the performances. In combination with direction that is more often than not interesting and unusual, it's easy to focus on the promise of the premise rather than the unfulfilled extensions of the same. Hakman, and presumably the other cutters, have odd dispositions. Their task is to make everyone look good--like a mortician making up a mangled body so it's \"presentable\" at a funeral. They spend hour upon hour as voyeurs. They are something like archivists, but also have to play detective. It makes them strangely aloof and dour. It's difficult for them to have relationships. Naim gets in a couple cracks that portray the cutters and their social relationships as similar to geeky \"Internet addicts\". This is all good stuff, and it's excellently played by Williams. The flow of the film is a bit odd, and especially the ending (which I praised for its relative nihilism) is eventually abrupt in a way that doesn't exactly work (and I usually love abrupt endings). Being generous, we could take the wonky flow as a \"level-removed\" kind of self-reference. Of course Naim was faced with cutting the film to make it look good, but it's a bit awkward and arbitrary-feeling, just as a cutter's work would likely be when faced with having to produce a coherent 90-minute film out of 80 years' worth of material. Being less generous, Naim simply needs to learn how to better tell a story, and there was no intention of real-world reflexivity with his fictional material. The Final Cut is worth seeing, especially if you're a Robin Williams fan as I am, but it's a disappointment considering what it could have been.",
         "I have always been a Robin Williams fan. From watching him goof around in Mrs. Doubtfire when i was a kid to seeing him actually creep me out in One Hour Photo, probably his best movie to date. So i am willing to see anything he has to offer. I got a chance to see The Final Cut for free, so i took it. The plot seemed real interesting and it was a first. Later into the movie though, the plot was getting cut more than people's memories. Williams romance with Mira Sorvino (which was gag-worthy to begin with) doesn't have any closure, and the \"cutting\" procedure and the whole \"chip in the brain\" thing didn't seem too thought out. Robin Williams is good as always and he tries his best to keep you interested, and the opening of the movie was promising. I even think with a little work that director Omar Naim can make some really quality flicks. This one, however, seems like it was cut together from a better movie. Which is a shame because it was a really cool idea. 5/10",
         "I've seen the movie several times in Berlin February 2004. The first time I watched it I was blown away by the end of the movie. The last couple of scenes have so much power, great music and awesome acting performances (actually the whole movie does). The ending was great and I had to think a little longer what I should think about the rest of the movie. Of course I liked it, but I didn't now how much, till I watched the movie for the 2nd, 3rd and 4th time. It's an absolutely awesome movie and it got better and better everytime I watched it. The camerawork is amazing, directing from Omar is perfect and the acting performances (especially Robin and Thom Bishops) are the best of their carreer. I can't help it, but I have to compare this movie with One Hour Photo. Compared to that movie, this one is more thrilling and I think a lot more accessible for a lot of people. The great thing about Robin is that in this movie he gives the other actors the opportunity to shine. I've read several reviews that were negative about everything they could be negative about. Omar should've been a bad director and writer, Robin was robotic and the set decoration didn't fit in. Well, I think Omar did a great job, Robins performance was even better than in One Hour Photo (and I thought Robins best performance was in One Hour Photo), the set decoration is very human and warm and the music by Brian Tyler is absolutely fantastic. Ok, one thing in the script/story may be doubtful, but I don't think that makes this movie instantly as bad as other critics say. I completely understood each character and I understood why they did things the way they did it. I hope this movie will get a lot of positive reviews soon, because everyone who worked on this project fully deserve it!",
         "I saw \"The Final Cut\" at the Berlin Film Festival, I was surprisingly absorbed by the questions raised. The plot evoked feelings I felt after reading, George Orwell's, \"1984\". The questions of privacy and morality. As a first film, Omar Naim does a credible job at directing Robin Williams, Mira Sorvino, and Jim Caviziel. Their preformances matched the morbidity of the world created in the film. Some of Robin's most reserved and pulled back acting, great seeing Caviziel transform from Jesus to a villan. Thom Bishops who I never heard of before was suprisingly impressive as the light point in the film. To me, this film comes at a time when this subject is pertinent as social commentary on where our society is headed. There was a couple of plot holes though, and I felt that the romance between Mira Sorvino's character and Robin's could have been more developed.",
         "Unlike Brainstorm (1983), The Final Cut tries to introduce the fascinating idea of recorded memory, yet the final product doesn't quite make the cut. This intriguing idea isn't developed well in its subtle controversy and the storyline plays more like a mystery thriller with a typical horror movie ending. Brainstorm gave us virtual reality, a fantastic vision along with some of the more high production value focus on a singular plot line. In the Final Cut, there are two story lines attempting to interweave themselves in some form of fancy twist when only one plot would have been sufficient. The Final Cut tries too hard to impress. Robin Williams' character isn't much of a stretch from his earlier more innovative dramatic works such as Insomnia (2002), Death to Smoochy (2002), One Hour Photo (2002). Even as early as The Fisher King (1991) and Awakenings (1990) or Dead Poet's Society (1989), such earlier characters were more compelling. Here as Alan Hakman, we've seen his portrayal before and there isn't much in the way of substance here, it's almost as if Mr. Williams is operating on inertia in this movie or that the character as developed by the script didn't really have much more. In One Hour Photo, Mr. Williams character was empty, but his performance was stark and captivating nonetheless. The Final Cut is more confusing, cerebral trying to have a heart, yet it ends mostly in tatters without any real satisfaction. Six out of Ten Stars.",
         "The plot is timely and intriguing, providing lots of food for thought as to the perhaps not-too-far future prospects of technology and our own legacies. I agree the relationship between Williams' character and his love interest was too sketchy. With a few extra minutes expanding on those two, the film might have been more fleshed out. Overall, I enjoyed the movie. It really gave us pause to reflect on the pros and cons of the \"Zoe Implant\" and \"rememories.\" Appreciated the intense acting abilities of Williams and Caviezel; otherwise, the movie might have lagged even more. I thought the angles of the camera shots were interesting.",
         "Well, I just saw The Final Cut over the weekend and I am finding myself very disappointed in the movie. From the previews I had imagined something a little different with a lot more action that what took place. There were certain scenes that I felt were good and like them, but all in all I would rather have waited to just rent the movie than to have gone to see it in the theaters. It was a pretty slow moving movie when I was expecting more suspense and action. Robin Williams did a great job in the part, just to clarify. Once again, it was just my view of the movie as a whole that I did not like. The overall plot was good and the storyline had a great theme but as I watched, I just became more and more disappointed. Then at the end, it just kind of ended. To me, I was left with the feeling that there should have been more than just a sudden ending like it had.",
         "As the summary reads, great idea. But there are some major problems with this movie. The relationship--very poorly done. We have no idea why Mira Sorvino is attracted to Robin's character. She even has lines that beat you over the head with the theme of the movie \"What about your life?\" or \"You have to live your own life.\" We get it, we don't need to be told that Robin lives his life through others. In one scene she tells him she doesn't want to be with him in the bookstore(paraphrasing), and fifteen or twenty minutes later she's back over his place. Why does she act this way? I don't know. Her character was poorly drawn. The best part about their relationship was when she discovered that Robin had been watching her with her previous boyfriend. That added some complexity to the situation and Robin's character. Jim Caviezel--I usually like him. He was good in Count of Monte Cristo, Frequency, The Passion. But he was just GOD AWFUL in this movie. Every line he spoke in this movie was so forced and way over the top. His line to end the movie almost made me laugh at how overly theatrical it was. He didn't need to say anything at the end I thought. Just by showing us what he was doing, I believe that the director made his point. But no, he beat us over the head again with the message. The (sub)plot concerning the head business guy--I couldn't tell what plot was supposed to be the focal point of this movie. He's working on this rememory, then discovers he has an implant, and the movie seems to lose direction. The grieving wife--Near the end, Robin goes to tell her that the disc has been destroyed so that he will be unable to do the rememory. She is WAY too forgiving and accepting here. To her, this is the last way she will be able to connect with her husband, whom she apparently loves very much (enough to fight a court battle to get the implant released). Instead, she just nods her head and basically tells Robin \"that's okay you've destroyed my last chance to experience my dead husband.\" He did blame it on a technical malfunction, of course, but I don't think that would have lessened her anger really. Robin has an implant--WHOA! Cool idea for a twist, but did the Director not think this through? Perhaps I'm wrong about the facts of the movie, so I'll lay out what I think is true: The cutters work for the company that makes the implants, right? Do you seriously think that when Robin applied to be a cutter, the company didn't have him in some sort of database as one of the implanted people? Don't you think they'd want to check on that? Especially considering they probably asked him questions about his personal life. It's just too hard to willingly suspend disbelief this far. Granted, he obviously told them he had no implant, but still, wouldn't that be in a computer somewhere? Social Commentary/Thematic Material--The protesters, the stigma of being a cutter, etc. These were cool ideas but poorly expanded upon. It's tough for me to explain why, because I would argue what wasn't in the movie, as opposed to what was. Feel free to rip me apart. Again, I thought this was a great idea and the Director has shown us some promise. But there were some major problems with the film.",
         "\"The Final Cut\" is a dark cross between \"Eternal Sunshine of the Spotless Mind\", \"One-Hour Photo\" and \"Citizen Kane.\" While this is an original screenplay by writer/director Omar Naim, it is faithful to a Philip Dick-type imagining of a techno-world in the not-so-distant future, with the bleakness, of both the excellent production design, cinematography, music and the story, only briefly mitigated. I like how gradually we see the explanations and issues of memories from many different view points and issues, while one lives and dreams and how one lives on in other people's memories, as a multiplier effect in touching other people and our own souls. Just as the interviews of family recall the journalist trying to understand Kane, the fine scene is a nice visual play on his famous mystifying \"Rosebud,\" ironically demonstrating that someone outside one's head can never understand what is significant and meaningful to an individual, what goes into making that unique personality. While I'm not sure it's such a bombshell that eulogies --in this case as visually edited \"re-memories\" culled from brain implants--are whitewashes (as pointedly satirized by Tom Wolfe in \"Bonfire of the Vanities\") and the political protesters seemed almost to be satirically out of a T. C. Boyle novel, James Caviezel's seriousness keeps them out of Unabomber territory. One awkward miscast is Mira Sorvino. As if it's not already obvious why a Robin Williams would be attracted to a blonde bombshell, another layer of motivation is added, but it just makes absolutely no sense why she was drawn to him. Not only does this seem yet another instance of film's older man/younger woman tendencies, the character would have made a lot more sense as an older woman with a past. The effective multiple screens showing the editing of \"re-memories\" may be difficult to distinguish on the eventual DVD, but I wasn't sure if the blown-up look was from projection issues.",
         "Wouldn't it be great if one could just be able to cut parts of one's life and make that life appears as though a person had only good qualities and helped humanity in some sort of way? Alas, by editing those parts which are not good, a different sort of person emerges. In the end, if all these bad moments in life are erased we could see how people lived in a perfect world, yet, how can one justify wars, famine, holocausts and all those things mankind has seen again, and again. The idea of being able to implant a chip that will record one's existence on earth is an interesting theory. When a chip can be loaded into a computer device and past moments of that person's life can be seen by anyone with the proper equipment, it can prove a brilliant tool, but since all good and bad moments are recorded forever, at the end of a life, editing what was painful can be deleted with the help of the computer that enabled to have the device implanted, in the first place. Omar Naim, the director of \"The Final Cut\", has some provocative ideas for his viewers. Yes, we all go along with what he presents to us, but when Alan Hakman, the mysterious editor at the center of the film, discovers something that will damage a man's reputation, why not expose that aspect of the flawed character, even though it might be painful for the people still damaged by his actions. Robin Williams is an actor that working with the right director, can give excellent performances, as proved here. Jim Caviezel is seen as the mysterious Fletcher. The only discordant note from the casting is Mira Sorvino, whose Delila doesn't add anything to the story, and has no chemistry with Mr. Williams' character. \"The Final Cut\" would have been an excellent film, had the director tried to explore some of the possibilities that are opened when a \"cutter\" gets a hold of the chip that contains a life. The film will not disappoint sci-fi fans though as it shows a promising new director, Omar Naim."
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Lions Gate Entertainment",
         "Cinerenta Medienbeteiligungs KG",
         "Industry Entertainment"
      ],
      "summaries": [
         "The story is set in a world where implanted microchips can record all moments of an individual's life. The chips are removed upon death so the images can be edited into something of a highlight reel for loved ones who want to remember the deceased. Caviezel portrays the leader of the organization that opposes this technology's development.",
         "In a near undefined future, people may have a Zoe microchip implanted in their nervous system to permit their families retrieve the best moments of their memories and watch on video after their deaths. This process is called \"Rememory\" and Alan H. Hakman (Robin Williams), a man traumatized by an incident in his childhood, is the best cutter of the Eye Tech Corporation. The company is facing groups that oppose to the \"Rememory\" and the ex-cutter Fletcher (Jim Caviezel) is leading these opponents. When Alan is assigned to prepare the final cut of the memories of the Eye Tech lawyer Charles Bannister, his Zoe chip is disputed by Fletcher. Meanwhile, Alan finds that he has also an implanted microchip, which is against the rules of a cutter.",
         "Omar Naim's The Final Cut is startlingly different than a conventional science fiction film. It's a compelling fable that offers a vision of a world where memory implants record all moments of a person's life. Post mortem, these memories are removed and edited by a \"Cutter\" into a reel depicting the life of the departed for a commemorative ceremony, called a Rememory. Robin Williams' powerful portrayal of Alan Hakman, a troubled \"cutter,\" propels this character driven story that forces us to question the power of our memories and the sanctity of our privacy.",
         "Set in a world with memory implants, Robin Williams plays a cutter, someone with the power of final edit over people's recorded histories. His latest assignment is one that puts him in danger."
      ],
      "budget": 0
   },
   "movielensId": 8939,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2004-10-15",
      "dvdReleaseDate": "2005-03-22",
      "directors": ["Omar Naim"],
      "runtime": 95,
      "movieId": 8939,
      "title": "The Final Cut",
      "mpaa": "PG-13",
      "actors": [
         "Robin Williams",
         "Mira Sorvino",
         "Jim Caviezel",
         "Mimi Kuzyk",
         "Genevieve Buechner",
         "Leanne Adachi",
         "Thom Bishops",
         "Stephanie Romanov"
      ],
      "imdbMovieId": "0364343",
      "originalTitle": "The Final Cut",
      "genres": [
         "Drama",
         "Mystery",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["zw-JFzMb6r0"],
      "plotSummary": "Set in a world with memory implants, Robin Williams plays a cutter, someone with the power of final edit over people's recorded histories. His latest assignment is one that puts him in danger.",
      "tmdbMovieId": 11099,
      "avgRating": 3.19458,
      "releaseYear": "2004",
      "numRatings": 794,
      "posterPath": "/8YPAz6LdWatGQWhZkGCxSWUzPNt.jpg"
   }
}