{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0360025",
      "video": false,
      "title": "Stella Street",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "",
               "gender": 2,
               "credit_id": "588f9408c3a36860ce00ac9e",
               "name": "Phil Cornwell",
               "profile_path": "/xZSHsL2uSrvsfARAZhMEN7KYeNd.jpg",
               "id": 191601,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "588f9414c3a36860b300a181",
               "name": "John Sessions",
               "profile_path": "/oLBcHRhah5FxyodfZECIHCrROwG.jpg",
               "id": 26860,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "588f941dc3a36860ac00ae28",
               "name": "Ronni Ancona",
               "profile_path": "/g2nwbxRjkHuuassIoZT7NsIuNf0.jpg",
               "id": 47723,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Narrator (voice) (uncredited)",
               "gender": 2,
               "credit_id": "588f9439c3a36860c400a0f6",
               "name": "Harry Enfield",
               "profile_path": "/69VuLSm5uyyZ9rDdlHnx9W54Wit.jpg",
               "id": 66161,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "588f945a925141019f00b85c",
               "name": "Peter Richardson",
               "profile_path": "/hczRKPE98UIjA460KmOFxTOtALT.jpg",
               "id": 36086,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "588f946ac3a36860af00a4c7",
               "name": "Phil Cornwell",
               "profile_path": "/xZSHsL2uSrvsfARAZhMEN7KYeNd.jpg",
               "id": 191601,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "588f9476c3a36860c400a125",
               "name": "Peter Richardson",
               "profile_path": "/hczRKPE98UIjA460KmOFxTOtALT.jpg",
               "id": 36086,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "588f9480c3a36860bd00a2d5",
               "name": "John Sessions",
               "profile_path": "/oLBcHRhah5FxyodfZECIHCrROwG.jpg",
               "id": 26860,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.303978,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 202587,
      "vote_count": 3,
      "budget": 0,
      "overview": "Michael Caine, Robert De Niro, Jack Nicholson and Roger Moore all live on a quiet street in Surbiton and Mick Jagger and Keith Richards run their corner shop - who knew?",
      "similar": [],
      "original_title": "Stella Street",
      "runtime": 80,
      "poster_path": "/58CEfpHS4zXrhVX2B9esp4FE5i.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Columbia TriStar",
            "id": 177,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "absolutely productions",
            "id": 85999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "stella street ltd.",
            "id": 86000,
            "origin_country": ""
         }
      ],
      "release_date": "2004-01-26",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Warning: Some Celebrities May Be Impersonated",
      "adult": false,
      "homepage": "http://www.bbc.co.uk/comedy/stellastreet/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Richardson"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Phil Cornwell",
         "Peter Richardson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0360025/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NzYyOTUyOV5BMl5BanBnXkFtZTcwODY3NTcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Phil Cornwell, John Sessions, Ronni Ancona | See full cast and crew »"],
      "reviews": [
         "I found this on DVD at my local blockbuster among the ex rental titles for 2.99 and bought it as I used to watch the TV show of the same name. What happened with this movie?I had not as much as read a review of it in any magazine (and I read them all), seen an ad or even heard of it being in the pipeline? Was it a secret, did it just appear on DVD shelves overnight? Anyway now that I have found it and watched it, I can say that it will appeal to fans of the TV series,its not cinema at its best but it has transfered quite well to the big screen (or DVD small screen)with the same sort of humour. The DVD has a fair few extras as well that are quite entertaining.",
         "In the 1960's, the Beatles took up residence in a small suburban street starting a minor trend for celebrities moving into the unassuming Stella Street. Decades later, in the 1990's, Michael Caine convinces Jack Nicholson to move into the street, bringing a load of other Hollywood stars to the area including Joe Pesci, Al Pacino and two of the Rolling Stones. However the influx of stars brings burglars, tourists and a criminal plot to rob the stars of all their money. If you have never seen the 10 minute programmes that make up the series Stella Street, this film version is certainly not the place to start! The rough impressions and rather loose plots and storylines will almost certainly not be to everyone's tastes - a fact that was reflected in the film going straight to video and being screened on the BBC within a week of it being released. Can't understand the logic to that myself - why not just wait a few months at least and keep it quiet, that way at least fans will buy it not knowing it was due to TV. Anyway, not being a massive fan, I forced myself to wait the week to see it on TV and save myself £15 (nice job BBC - that'll recoup your million investment!). The film manages to do a better job at creating a plot than series three did, but is still a bit episodic until the final 25 minutes where the stars lose their cash. The first 10 minutes will also be quite meaningless for fans as it just sets up the street and why all the stars are there. In some ways the film actually steps backwards as we have Dustin Hoffman moving into Hill's house here where he already had in the series. It still works pretty well though; the characters are funny for the same reasons they were in the series - being juxtapositioned with the English suburb and having their characters and mannerisms exaggerated. If you enjoy the series for what it is then it is likely you will enjoy this film. The plot may not be great but that shouldn't be a problem if you are used to the episodic nature of the series. The cast (all three of them) are really good. The impressions are never spot on but many of them sound pretty good and the fact that they aren't the actual people is part of the joke! Sessions and Cornwall work together really well and the `shooting from back of head' trick when they are playing two characters in the same scene is not overused or very obvious. The addition of Ancona is important to move the plot forward, but she also gets a few funny parts as Madonna and Posh Spice. Overall I enjoyed this film but then I have always enjoyed the series. If you are a fan then this will be good enough for you but it is an acquired taste that will likely alienate as many first time viewers as it pleases.",
         "This Stella Street 'Movie' is basically a retelling of the original concept right from the start with a couple of new subplots thrown in for good measure, although those who followed the original series will be a little disappointed to hear many jokes taken directly from earlier episodes. All in all it does capture the essence of the series quite well and has most of the original characters (plus some additional ones provided by the always good Ronni Ancona), so I just have one question - where was Roger Moore? P.",
         "to be honest i prefer films that either make me think or make me want to watch them again to make sure i didn't miss anything.. but i saw the TV series of stella street and thought it was blatant but good comedy. hell i didn't even know they had made a movie until last week when it was shown on TV... i made sure i had a few beers by me as i sat and watched this film. I knew what to expect and i was left in stitches laughing my ass off to most of the sketches and scenes. the old house cleaner helping jimmy greeves and then getting wasted on class a, to David bowie pretending he doesn't care that no one likes his singing. this is a decent attempt at a comedy from the British. it beats sex lives of the potato men and the rest easily... in my opinion only blackball is as good as this... again a brit flick but you cant compare a British movie to a Hollywood blockbuster unless you have the monetary figure behind it to back you up... i would recommend stella street the movie to anyone who likes British movies, odd comedys, or a dodgy movie to have a laugh with your mates.",
         "*Spoilers* An impressive impressionist cast of just 3 people act as a whole range from film people from Al Pacino to Jack Nicholson to Davie Bowie, as the rich money-infested actors who get conned out of all their gold. Although there are just two men covering the actors, they get it almost spot on and you won't get impressions like this anywhere. Although it got a little boring at times and I didn't understand some of it, when it was good, it was great. So the badness can be forgiven. One of the most enjoyable films of 2004. My rating: 7.25/10",
         "After being a big fan of the ten minute T.V episodes of 'Stella Street', I awaited this film with excitement and anticipation. Unfortunately I was left feeling very disappointed. I was dismayed by the way that nearly all of the gags and one liners were directly lifted from the T.V Episodes, and delivered with much less enthusiasm and comic timing, as if the actors had said them once, and couldn't be bothered to say them again. I bought my copy on DVD and felt cheated that I had parted with my hard earned cash to watch the same jokes over again. *SPOILERS* The plot of the film starts with Stella Street (a normal English street in Surrey), gradually being populated by 'some of the most famous people from stage and screen of the last forty years', including Michael Caine, Al Pacino, Jack Nicholson and The Rolling Stones. All the celebrities in the street end up being conned out of their entire fortunes by a local fraudster, and are forced to live like tramps and common working class people. There are some nice moments, but on the whole, the writers manage to take an interesting idea and make it pretty boring. *END OF SPOILERS* In the T.V Episodes, all the characters are performed by John Sessions and Phil Cornwell (including females), but in the film Ronni Ancona is added to the cast. I think this was a mistake. Her impersonations weren't funny, and it felt like her characters were included in the story just to give her something to do. If you were not a fan of the episodes of Stella Street, you may find this film entertaining. But if you were a fan, I think you may walk away feeling a little bit cheated. 4/10",
         "I am finding that this film improves with age. I didn't watch the original series, but this works for me as a movie - got enough plot, well-put together and shot, pacey and off-beat - and kind of intelligent about celebs. The star of the show has to be though the definitely not star- struck Mrs Huggett who \"does\" for them all. Unphased, obviously a bit of a goer when she was younger although a bit stooped now, exceptionally fond of Michael Caine - Mrs Huggett on acid is one of the highlights of this movie. Others include Len the gardener's wise words - and the great bit at the beginning where we meet the Jagger parents. The character creations are out of this world. Yep, it's moving onto my top movie shelf.",
         "This movie is a great comedy of the life of super-stars that move to a rural area of London, where their lives take many strange turns. The rumor is quite mellow. There are no \"in your face\" jokes like Americans consider comedy. This is more along the lines of subtle humor, more British I would say. The characters are ALL over-dramatized, in which I am sure the director intentionally did. Each character is acted in such a way that a person watching this movie can tell the director takes a part of the actual actor and accentuates it incredibly. (For instance, if you are a David Bowie fan, you will notice he sings almost every one of his lines.) I loved this movie and have watched it several times, though I admit, this movie is not for everyone, but it is very worth renting.",
         "If like me, you're a fan of shows where celebs are impersonated, then this is exactly want you want. The Movie stars Phil Cornwell who some of you may have seen on Dead Ringers, often doing Greg Dyke in Michael Caine's voice. Well, on the street, he actually does Michael Caine, and is perfect at it. His other main character is Jack Nicholson, which is also impersonated to almost perfection. Other stars include John Sessions, who plays Joe Pesci and Al Pacino. Ronni Ancona also stars who many of you will have seen alongside Alistair McGowan in his show and Lee Mack in The Sketch Show. So, basically, all these famous people move into the street. The story follows the stars who get on or don't, with each other, the people they require, like builders and cleaners and how they fall apart when criminals manage to nick their cash. If you want to see it, buy the DVD, which also features many quality special features. The most clever and funniest comedy ever to hit the TV. Great!",
         "Like Kev above I'm a fan of the now-defunct TV series which had plot only as a peg on which to hang silly gags and good funny characterisations of famous movie actors and rock stars. I spent the first 20 mins of the movie worrying that it was'nt like the show, but then its an 80 minute film so it would'nt be! Once I'd got my head round the format it works perfectly well. All the \"stars\" are present and correct and the story does allow some nice sequences such as the idea that Jack Nicholson can play cricket :) If you have never seen Stella Street the TV series then you should settle into this quicky and enjoy the performances (though some of the venacular may leave you scratching your head). If you know the show then just prepare for \"a period of adjustment\". Mike."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Absolutely Productions",
         "Stella Street Ltd."
      ],
      "summaries": [
         "A satirical glimpse at the early 21st century in which impressionists Phil Cornwell and John Sessions send up celebrity culture, including: Keith Richards and Mick Jagger, who run a corner shop; Jack Nicholson and Al Pacino, who rub shoulders in a leafy lane in suburbia; and David Bowie, who has his underpants starched and ironed by an uptight cockney charlady named Mrs. Huggett. Megastars come and go, but nothing escapes the watchful eye of their long-suffering neighbor, Michael Caine.",
         "As the Beatles did in the 1960s, Michael Caine convinces Jack Nicholson, Joe Pesci, Al Pacino, Mick Jagger and Keith Richards to move to Stella Street, an unassuming residential area of Surrey. But along with the new neighbors come hoods and thieves, all determined to make off with the stars' cash. Based on the BBC sketch comedy series."
      ],
      "budget": 0
   },
   "movielensId": 8953,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-01-26",
      "dvdReleaseDate": "2005-01-18",
      "directors": ["Peter Richardson"],
      "runtime": 80,
      "movieId": 8953,
      "title": "Stella Street",
      "mpaa": null,
      "actors": [
         "Phil Cornwell",
         "John Sessions",
         "Ronni Ancona",
         "Harry Enfield"
      ],
      "imdbMovieId": "0360025",
      "originalTitle": "Stella Street",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Michael Caine, Robert De Niro, Jack Nicholson and Roger Moore all live on a quiet street in Surbiton and Mick Jagger and Keith Richards run their corner shop - who knew?",
      "tmdbMovieId": 202587,
      "avgRating": 2.83333,
      "releaseYear": "2004",
      "numRatings": 9,
      "posterPath": "/58CEfpHS4zXrhVX2B9esp4FE5i.jpg"
   }
}