{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "province",
            "id": 2065
         },
         {
            "name": "algerienkrieg",
            "id": 2506
         },
         {
            "name": "french",
            "id": 4653
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "gay relationship",
            "id": 10198
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "in the closet",
            "id": 11524
         },
         {
            "name": "gay sex",
            "id": 15135
         },
         {
            "name": "gay man",
            "id": 33458
         },
         {
            "name": "heartbreak",
            "id": 34265
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "lgbt teen",
            "id": 163037
         },
         {
            "name": "broken heart",
            "id": 192394
         },
         {
            "name": "1960s",
            "id": 208992
         }
      ],
      "imdb_id": "tt0111019",
      "video": false,
      "title": "Wild Reeds",
      "recommendations": [
         183834,
         105584,
         12812,
         33199,
         29933,
         70806,
         52205,
         45133,
         47903,
         86482,
         27099,
         20525,
         26232,
         236630,
         50769,
         84900,
         48210,
         290969,
         79926,
         91515
      ],
      "backdrop_path": "/zCC5Han27o5AxhdNJ86b5YhLhIS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "François Forestier",
               "gender": 2,
               "credit_id": "52fe4522c3a368484e04a5a9",
               "name": "Gaël Morel",
               "profile_path": "/zl4IaGnSDlgw2a9BYYvEe875sSt.jpg",
               "id": 49855,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maïté Alvarez",
               "gender": 1,
               "credit_id": "52fe4522c3a368484e04a5ad",
               "name": "Élodie Bouchez",
               "profile_path": "/27tWcI5AjtrIOyzkXUJmLaWkvUj.jpg",
               "id": 59807,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Serge Bartolo",
               "gender": 2,
               "credit_id": "52fe4522c3a368484e04a5b1",
               "name": "Stéphane Rideau",
               "profile_path": "/7Ac5MHZVXcGIFOKU70nWRcA4DYx.jpg",
               "id": 49859,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henri Mariani",
               "gender": 0,
               "credit_id": "52fe4522c3a368484e04a5b5",
               "name": "Frédéric Gorny",
               "profile_path": null,
               "id": 96628,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Monsieur Morelli",
               "gender": 2,
               "credit_id": "52fe4522c3a368484e04a5b9",
               "name": "Jacques Nolot",
               "profile_path": "/xnbNdfSWDKBaYH1WJxSNkMd5m3B.jpg",
               "id": 40304,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Pierre Bartolo, the Groom",
               "gender": 0,
               "credit_id": "52fe4522c3a368484e04a5bd",
               "name": "Eric Kreikenmayer",
               "profile_path": null,
               "id": 96629,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Irène, the Bride",
               "gender": 0,
               "credit_id": "52fe4522c3a368484e04a5c1",
               "name": "Nathalie Vignes",
               "profile_path": null,
               "id": 96630,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Madame Alvarez",
               "gender": 1,
               "credit_id": "5617a16892514166e200159d",
               "name": "Michèle Moretti",
               "profile_path": "/8Nw5bRGpITncsuryF6oYLD8sGHs.jpg",
               "id": 19936,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Monsieur Cassagne",
               "gender": 0,
               "credit_id": "5617a18d9251412aec002323",
               "name": "Michel Ruhl",
               "profile_path": null,
               "id": 28147,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4522c3a368484e04a5a5",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4522c3a368484e04a5c7",
               "name": "Olivier Massart",
               "profile_path": null,
               "id": 1186221,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4522c3a368484e04a5cd",
               "name": "Gilles Taurand",
               "profile_path": null,
               "id": 50538,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5617a1b6c3a3680fae002663",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5861f37292514115c703b900",
               "name": "Martine Giordano",
               "profile_path": null,
               "id": 41524,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5861f36792514115c703b8f8",
               "name": "Jeanne Lapoirie",
               "profile_path": null,
               "id": 26097,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5861f37bc3a3681a77039b78",
               "name": "Georges Benayoun",
               "profile_path": null,
               "id": 72669,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861f382c3a3681a6b03a61e",
               "name": "Chantal Poupaud",
               "profile_path": null,
               "id": 1202972,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861f38c92514115ca03b695",
               "name": "Paul Rozenberg",
               "profile_path": null,
               "id": 1683604,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5861f392c3a3681a77039b96",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861f39cc3a3681a7d03739b",
               "name": "Pierre Soula",
               "profile_path": null,
               "id": 1728393,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5861f3a392514115be03a0ce",
               "name": "Pierre Soula",
               "profile_path": null,
               "id": 1728393,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5861f3aac3a3681a65035721",
               "name": "Elisabeth Tavernier",
               "profile_path": null,
               "id": 20859,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.497888,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 26933,
      "vote_count": 23,
      "budget": 0,
      "overview": "As the Algerian War draws to a close, a teenager with a girlfriend starts feeling homosexual urges for two of his classmates: a country boy, and a French-Algerian intellectual.",
      "similar": [
         449176,
         380874,
         47643,
         184352,
         26280,
         258034,
         338189,
         413666,
         376867,
         383526,
         26371,
         398818,
         4927,
         425193,
         428493,
         383559,
         52799,
         382475,
         104634,
         340684
      ],
      "original_title": "Les Roseaux Sauvages",
      "runtime": 115,
      "poster_path": "/vPPsAieu9KEVZcI06xKHl9zztUO.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ima Films",
            "id": 30576,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Alain Sarde",
            "id": 635,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "IMA Productions",
            "id": 4790,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept-Arte",
            "id": 11332,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Société Française de Production (SFP)",
            "id": 6849,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1994-05-05",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["André Téchiné"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Olivier Massart",
         "Gilles Taurand"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0111019/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMTMxMDQxNF5BMl5BanBnXkFtZTYwMjc4MDc5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Élodie Bouchez, Gaël Morel, Stéphane Rideau | See full cast and crew »"],
      "reviews": [
         "It is absolutely impossible to make a film like this one without carrying out the personal memories of an our own teenage time. That's why this so called 'teenage movie' is so far away from all other experiences within this field. Téchiné had written and directed a part of his own life. Villeneuve-sur-Lot, Paris, Lisbon, who cares? This is the movie of my life. And if it is so, it's not only because of the unexpected beauty of all frames on the movie, but, essentially because that I felt every inch of the road walked by the characters of this film, as if their experiences, a long time ago, in a galaxy far, far away, were my own teenage experiences and hopes. I saw this film ten years ago, and still I can remember every image, every phrase... And I kept these memories as a guideline for a future life, when I was 23 years old. I know what I have lived, I still don't know what the future reserves to me. But, on those days, ten years ago, I have increased my hope. I found that there was people like me, and like the others around me... The time and the place doesn't matter. No film will never make me feel so strongly about my youth, and, simultaneously, about my future as a man. This is not a 'teenage movie', it's a collection of memories about the construction of our personality. And, we all, with that age, were a little bit of François, Serge, Henri and Maite. And we still are. (...I'm sorry about my English...)",
         "This film is truly amazing. I saw it and was so moved by it that I couldn't stop thinking about it for a very long time. It is heavily based on the director's (Andre Techine) real life experiences. In this film Techine manages to create a realistic and palpable universe which seems which if you know anything about film is a very hard thing for directors to accomplish. I asked a French DP and a friend of Andre Techine about Les Roseaux Sauvages and he told me that it was originally made for television and that it was such an enormous sensation in France that it later was released in the theaters and won many awards at the Cesars in Paris - France's equivalent of the Oscars. I will admit that some American friends of mine went to see this film and didn't get it. What a pity for them.",
         "The slightly loose and episodic feel of this charming coming-of-ager doesn't matter because the characters and the conflicts are so well presented that we are enthralled throughout. Three boys on the verge of manhood (with the French-Algerian conflict smoldering in the background) are in residence at a boarding school in the south of France in 1962. One is gay, the second is bi-sexual and the third is straight. Through their interactions we (and they) discover their sexuality. Francois Forestier, played attractively by Gael Morel, is gay as he discovers one night when Serge Bartolo (Stephane Rideau), an athletic schoolmate with a natural style, awakens his sexuality by seducing him. For Serge it is just a school age sexual adventure; for Francois it is love so intense he is transformed. The third boy, Henri Mariana, who is from Algeria, is a little older and a little more cynical. He finds heterosexual love with his enemy, Maité Alverez, who is a hated communist. Elodie Bouchez, whom I recall from The Dreamlife of Angels (1998) for which she shared a Cannes Best Actress award, plays Maité whose style is earnest, witty and brave. As it happens I was in France during the period of this film, and a teenager as well. The Algerian conflict haunted the young men because as soon as they were of age they could be sent away to fight. Also the Communist Party was strong in France and an attraction to some who opposed what they saw as French colonialism in Algeria and Vietnam. Director André Téchiné who characteristically explores human sexuality in his films (e.g., Rendez-Vous (1985) with a young and vital Juliette Binoche; Le lieu du crime (1986) with Catherine Deneuve; and Ma Saison Préférée (1993) also starring Catherine Deneuve) attempts to integrate these larger issues into his film but I don't think is entirely successful. Serge's older brother is killed in Algeria and his teacher blames herself for not helping him to escape his military service and suffers a nervous breakdown. However this story is not well-connected with the rest of the film. Also more could have been done with the divergent views of Maité and Henri. What I loved was the club scene where suddenly the French girls are twisting to Chubby Checker's \"Let's Twist Again\" which propelled me back to 1962 when indeed the Twist was all the rage in France. What makes this film superior is the warm and truthful way in which the sexual awakenings are realized. The kids seem absolutely real and the dialogue is sharp and authentic. Morel is very winning. I especially liked the earnest way he confronts and then accepts his sexuality. Interesting was the scene in which he seeks out the shoe salesman whom he knows is gay for his advice on how he should cope with unrequited homosexual love. This is a film about young people for open-minded adults attractively done. For many it will strike a strong cord of recognition. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "«Les Roseaux Sauvages» (in Portuguese, «Juncos Silvestres») isn't just an ordinary film about the awakening of adolescence: it is a romantic treatise, an unforgettable example of delicacy and fidelity in the approach of such sensible themes such as the sexual ambiguity in adolescence and, above all, the love as a superior statement, domineering - even metaphysical. Although I haven't seen much of Téchiné (I saw, besides «Les roseaux sauvages», the movies «Loin», «Les égarés», and the recent «Les temps qui changent»), I believe that, to the date, this is without a doubt his best film, the most ravishing. Téchiné tells us the story of four teenagers: François Forestier (interpreted sublimely by Gaël Morel in his eternal look of sweet innocence), Serge Bartolo (interpreted by Stéphane Rideau, the eternal seducer confirmed later in «Loin», «Presque Rien», «A toute vitesse»...), Maïte Alvarez (interpreted by the well known Élodie Bouchez) and Henri Mariani (Frédéric Gorny). The film starts with François talking to Maïte about the movie «Såsom i en Spegel» (that reports us to the idea of 'search for the real truth'), from the Swedish director Ingmar Bergman, although that isn't said. Truly, the entire film is the search for the truth by the 4 teenagers. François is Maïte's boyfriend, although that relationship is more of a platonic protection against adulthood pressures than a physical passion. At the same time, François, Serge and Henri study in the same masculine boarding school, where they share rooms. Serge, in his sexual ambiguity, desires Maïte and at the same time seduces François, and ends up having sex with him. From that day on, François faces the homosexual desires that he had yet not perceived, while he falls in love for Serge and feels excited by Henri. On its turn, Serge, although always hesitant, breaks the relationship with François to search a more peaceful village life, next to any woman that fulfills his needs. The scene where Serge first breaks with François is brutal and pungent. François, always interpreted as the most fragile and delicate of the four, meets Serge while the last is walking to the river to drown his cat's cubs. At the same time that he tells François (always sensitive) in cold blood that «they are not good for each other», he throws the innocent cubs into the river. For the first time in his life, François' heart is broken, in a scene that reminds us the archetype «the lost of innocence». From that moment on, François is always searching for fortuitous encounters with Serge, living as, in his own words, a «thieve stilling moments»: one time he travels in a motorcycle hugging Serge, in another time he sleeps next to him, etc. The scenes in the classroom are bright, solar, reminding the purity of childhood; and alternate with the scenes taken place at night, that are incredibly sensual. François is also portrayed as an intellectual that reads Jean-Arthur-Nicolas Rimbaud, a homosexual writer revolted against the world, that leaves everything to live with the also writer Paul Verlaine, while he was still a teenager. That is what François wants to be. Maïte, on her side, is a communist that, after knowing about François passion for Serge, is jealous, but finally realizes the true platonic nature of her relationship with him. After a while, she falls in love with Henri, a pied-noir (French born Algerian) teenager revolted against the situation in his native country. He is also in love with her, although ideologically they are rivals. And this is why love, in this film, is taken as a superior and dominant statement: it surpasses all human ideologies, even the most complex and rooted ones; it surpasses intellectuals who read Rimbaud and even the most practical persons. The action takes place in 1962, at the same time as the Algerian crises, that is not exploited, although, to a certain pace, it is. The soundtrack confirms the excellence of this film, with Chubby Checker giving a sixties atmosphere, and the Adagio for string by Samuel Barber yielding the dramatic dimension that the film deserves, like in the highly stylized scene where Henri his sleeping by the river, or when François travels in the motorcycle hugging Serge. In the end, François meets a shoe salesman that everyone knows his a homosexual, in a scene that represents the almost desperate search for a way to destroy the lowliness, incomprehension, and lack of role models that are destined by his sexual orientation. Although he doesn't find the answer for his problems, because there isn't one, François remains optimistic &#8722; and this is another lesson that this film teaches us: to stay in the fight, always optimistic in a future happiness. This is one of those movies where I would like to penetrate and live in forever, between Maïte, Serge, Henri and, above all, the character unifying the destiny of the four, François, 'searching the truth'. I have seen films in the come-of-age theme, but this remains my favorite. Some good ones are «Presque Rien» (with Jérémie Elkaïm and Stéphane Rideau), «A cause d'un garcon» (also with Jérémie Elkaïm), «Maurice» (based on E. M. Forster homonymous work) and «Beautiful thing». It remains to be said that this film won four César (in the Cannes festival): best film, best director, best script and best actress-revelation for Élodie Bouchez.",
         "On all fronts WILD REEDS is a top-notch drama - offering a look into the lives of 4 teenagers at a boarding school in rural France in the early 60s, this film is complex and immaculately well-made. Unusual in films depicting adolescence, WILD REEDS is complex and sophisticated, respectful of its' characters' varying sexualities (and their struggles to accept same), while also offering other glimpses of their intelligence and growing independence: views on the Algerian war, which was then raging, and on communism (with one character defined as communist, and another as an ardent anti-communist). The lush cinematography is summery and beautiful throughout, and the cast (most whom have gone on to other notable films) is great throughout. Techine's direction gives the many strands of this story a great, personal feel - the shoe store scene stands out as an honest depiction of an individual recognizing and trying to accept his sexuality, and attempting to identify other gay people, as a way of lessening isolation, and in an attempt at spontaneously finding some sort of role model. Very thoughtful and very well-made.",
         "This was a really sensitive and perceptive story about growing up and some of the pain and confusion that goes along with that. The movie is quite quiet and doesn't feel the need to comment on everything as so many American movies do. It is the story of four young French people growing up in Provence in France in the 60s and one of the boys has a homo-erotic experience and thinks that the other boy with whom he has the experience must have enjoyed it. The other boy regrets the experience that he had and when his brother dies in the war in Algeria, he feels obliged to support his family and so declines to pursue any sort of homosexual relationship. He wants to live a respectable sort of life and doesn't want to cause any trouble. The young gay boy is very confused but is a good friend to the teacher's daughter. They enjoy dancing and seeing films and learning about various things. The girl ends up falling for a rather lazy young man who has very different political views than herself. The movie is beautifully filmed and very relaxed and slow. It is a nice reflective movie on the nature of youth and some of the struggles that kids go through. The kids handle the struggles in the typical manner of kids. Sometimes they don't handle them very well and other times they show remarkable grace and common sense. But all in all it is a wonderfully gimmick free movie which really shows how difficult it is to be a kid in any place and at any time. I would really recommend this movie to people.",
         "This is Techine's masterpiece and it is doubtful whether he will ever top it. It is a flawless, poetic film (no chain-smoking brain surgeons here, as in 'My Favorite Season'), and the only one in existence that deals (among many other themes)with budding homosexuality in an adolescent with such class and empathy. My favorite scene is when Techine refuses to offer any dialogue and lets the scene hang when Mrs.Alvarez meets the wife of Prof.Morelli who's been sitting in the car during Morelli's lunch with her (Mrs.Alvarez). I will not explain any further, you will have to see for yourself; great films are meant to seen and reseen as many times as it takes to erase the memory of mediocre ones.",
         "I liked the movie even if I was left with the feeling that there was no real end to it (a common thing in French movies). It was superbly acted by four young comedians perfectly cast. The relations between them are ambiguous. Still, more depth could have been given to their characters and the story. Nevertheless, there is an overall subtlety to the movie, something that makes it light even if the topics are not always light (Francois discovers he is gay and have some problems dealing with it, Henri is a pied noir in France at the end of the Algeria war and is in a delicate situation, not speaking about Serge who loses his brother to that same war and Maite who is somewhat oppressed by her mother who is a die hard communist militant). It was very refreshing to see. You need to be familiar with the history of Algeria war and the tensions of that time though to fully follow. A film I would recommend to many people.",
         "I absolutely adore this movie. When I first saw it, I loved it because I could identify with the lead gay character, but I have seen it since then, and i love it now for its portrayal of the complexity of adolescence life. This is by no means part of the American teen melodrama genre. It deals with everything from homosexuality to mental illness to war to racism to feminism to communism. It has a deep political, psychological, and emotional message. I urge you to see this movie.",
         "This is a genuine and convincing portrayal of how teenagers from different backgrounds facing different problems find their true selves, and how they shape and transform their philosophies of life through the mutually interwoven processes of love, hate, learning, accepting and enlightening. This is a story on how purity and love will transcend across very different people and help them become awake to what they are and what they long for when facing the real world. A beautiful masterpiece that would move you without doing something \"big\". The 4 lead characters delivered convincing and promising performances, each making them very likable people without glorifying, stereotyping or idolising any ideology. All in all, a highly recommended beautiful, genuine and poetic gem."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Ima Films",
         "Les Films Alain Sarde",
         "Canal+"
      ],
      "summaries": ["In a village in the Southwest of France, 1962. Maite and Francois are 18 years old. They are friends, not lovers. In Francois's classroom, there are Serge, whose brother has just married to try to escape from the war in Algeria, and Henri, a pied-noir (Algerian-born Frenchman). Francois and Serge will have a homosexual relationship, but Serge wants to marry his brother's wife..."],
      "budget": 0
   },
   "movielensId": 896,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1994-05-05",
      "dvdReleaseDate": "1998-01-14",
      "directors": ["André Téchiné"],
      "runtime": 115,
      "movieId": 896,
      "title": "Wild Reeds",
      "mpaa": "",
      "actors": [
         "Gaël Morel",
         "Élodie Bouchez",
         "Stéphane Rideau",
         "Frédéric Gorny",
         "Jacques Nolot",
         "Eric Kreikenmayer",
         "Nathalie Vignes",
         "Michèle Moretti",
         "Michel Ruhl"
      ],
      "imdbMovieId": "0111019",
      "originalTitle": "Les Roseaux Sauvages",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Xqtewf347TU"],
      "plotSummary": "As the Algerian War draws to a close, a teenager with a girlfriend starts feeling homosexual urges for two of his classmates: a country boy, and a French-Algerian intellectual.",
      "tmdbMovieId": 26933,
      "avgRating": 3.67892,
      "releaseYear": "1994",
      "numRatings": 517,
      "posterPath": "/vPPsAieu9KEVZcI06xKHl9zztUO.jpg"
   }
}