{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "clone",
            "id": 402
         },
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "climate change",
            "id": 2210
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "escape",
            "id": 10685
         }
      ],
      "imdb_id": "tt0273689",
      "video": false,
      "title": "It's All About Love",
      "recommendations": [
         26781,
         18711,
         37850,
         10109,
         32162,
         32150,
         32229,
         206,
         74718,
         64832,
         32241,
         77504,
         29977,
         82469,
         25655,
         73897,
         32157,
         13941,
         13311,
         162006
      ],
      "backdrop_path": "/1sQmaInvljaOmM72d1INctTry3S.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe45219251416c7504cbd9",
               "name": "Joaquin Phoenix",
               "profile_path": "/cK0BTrAM1xcsto8kVvHhd9AV8dW.jpg",
               "id": 73421,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe45219251416c7504cbdd",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marciello",
               "gender": 2,
               "credit_id": "52fe45219251416c7504cbe1",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Michael",
               "gender": 0,
               "credit_id": "52fe45219251416c7504cbe5",
               "name": "Douglas Henshall",
               "profile_path": "/ofbU3w8hlafOJfQ1uiAwjL1QSRw.jpg",
               "id": 35862,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe45219251416c7504cbe9",
               "name": "Alun Armstrong",
               "profile_path": "/bndjwAJEebKYUGmLLgGD8VfP9N4.jpg",
               "id": 2629,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Betsy",
               "gender": 1,
               "credit_id": "52fe45219251416c7504cbed",
               "name": "Margo Martindale",
               "profile_path": "/4YmmVgOGKsDsGGLunCHmigj2TbV.jpg",
               "id": 452,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Arthur",
               "gender": 2,
               "credit_id": "54f5ac2dc3a36834fa001e42",
               "name": "Mark Strong",
               "profile_path": "/svq7VWJqKN4Fq8ZJK1Yd8W711rn.jpg",
               "id": 2983,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cbf3",
               "name": "Thomas Vinterberg",
               "profile_path": "/1lChKBPVLqbn7Kl8lHghybBVzgw.jpg",
               "id": 4453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cbf9",
               "name": "Thomas Vinterberg",
               "profile_path": "/1lChKBPVLqbn7Kl8lHghybBVzgw.jpg",
               "id": 4453,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45219251416c7504cbff",
               "name": "Bo Ehrhardt",
               "profile_path": null,
               "id": 67454,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cc05",
               "name": "Peter Aalbæk Jensen",
               "profile_path": "/9Zpmo9qyvyH6ZTO61VsJvQLbBx9.jpg",
               "id": 1174,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cc0b",
               "name": "Lars Bredo Rahbek",
               "profile_path": null,
               "id": 71159,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cc11",
               "name": "Paul Webster",
               "profile_path": "/fze6uF1oCdDYJFA5tbVhKX9nwW3.jpg",
               "id": 21378,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45219251416c7504cc17",
               "name": "Nikolaj Egelund",
               "profile_path": null,
               "id": 73486,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cc1d",
               "name": "Zbigniew Preisner",
               "profile_path": "/bBebcS5dznOr7l9lBZqzISgeYYC.jpg",
               "id": 1135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45219251416c7504cc23",
               "name": "Anthony Dod Mantle",
               "profile_path": "/wpdk8Wo8xGhvZ4WVee2miDSfPj8.jpg",
               "id": 1570,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45219251416c7504cc29",
               "name": "Valdís Óskarsdóttir",
               "profile_path": null,
               "id": 4475,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe45219251416c7504cc2f",
               "name": "Birgitte Hald",
               "profile_path": null,
               "id": 1559,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.831301,
      "production_countries": [
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12777,
      "vote_count": 31,
      "budget": 0,
      "overview": "The story of two lovers and their attempts to save their relationship in a near-future world on the brink of cosmic collapse. John, and world-famous ice skating star, Elena, are about to sign divorce papers when they realise that, in spite of everything happening around them, their love is worth fighting for. It's All About Love is a fresh take on modern love and future life as two lovers struggle in a conspiracy of epic proportions.",
      "similar": [
         12088,
         605,
         604,
         1635,
         281,
         17431,
         19959,
         83542,
         335984,
         10447,
         9381,
         185,
         180,
         5548,
         9693,
         18,
         19,
         78,
         76341,
         198663
      ],
      "original_title": "It's All About Love",
      "runtime": 104,
      "poster_path": "/g6Qxm8kLeAoOadXrun11eQMwVnV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/26JWW5ooRJoQBolVjG0x8SZmFRs.png",
         "name": "Nimbus Film Productions",
         "id": 11672,
         "origin_country": ""
      }],
      "release_date": "2003-01-10",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "DKK ",
      "directors": ["Thomas Vinterberg"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Mogens Rukov",
         "Thomas Vinterberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0273689/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMzc1MDI3NV5BMl5BanBnXkFtZTcwNDQyMzcyMQ@@._V1_.jpg",
      "actors": ["Stars: Joaquin Phoenix, Claire Danes, Sean Penn | See full cast and crew »"],
      "reviews": [
         "'It's All About Love' is a true oddity. It feels almost like someone recorded all the strange ideas that came into their head for a week, and chose a common topic, i.e. 'Love', and wrote a screenplay from their notes. But that's not to say it's a bad movie. In truth, I quite enjoyed it, although I came out of it feeling like I'd woken up from a dream, or possibly a nightmare. It's quite unsettling. The plot is both incredibly simple and incredibly complex: John (Joaquin Phoenix) goes to New York to get a divorce from his famous figure skating wife, Elena (Claire Danes). While he's there, he notices that Elena seems to be in the middle of a vast conspiracy, and together they try to escape it, rediscovering their love at the same time. The film is set in the near future, although it doesn't really need to be. I like the future in this film, because it's not radically different (except for flying Africans...go figure) but feels like twenty odd years from now. In the near future, people who are lonely or suffer a great loss will often drop dead. And the people of the near future merely walk over their bodies. John and Elena are Polish, although they don't need to be. It adds certain poignancy, two foreigners not quite in place in a world that keeps putting them out of place. Joaquin Phoenix and Claire Danes, while both very good (I think...it's hard to tell in a film as strange as this) could possibly have used some accent work. At times they speak with no accent at all, and it seems to distract. On that note, I would like to point out how brilliant Claire Danes is. Ever since I saw Brokedown Palace, I have been astounded by her acting ability (although, that said, she doesn't do heart-wrenching crying very well). I won't spoil it, but under the circumstances of what happens to her character(s), she's incredible. Also thrown into the mix is Sean Penn playing John's brother. I honestly couldn't see why he was in the movie, except maybe to oversee all the weather changes (think a far more subtle, low budget Day After Tomorrow with more meaning. For instance, it snows in New York in July, and there are days when all the fresh water freezes) I'm not saying it's a bad point, but another end that wasn't loose, but still needed tightening. As I mentioned, the plot is incredibly complex. It twists a fair bit, until it seems to cut all things loose and start a new movie some twenty minutes before the ending. Still another way this movie unsettles me. Visually, the film is stunning. It looks like a far more mainstream film than it obviously is. And while the film is beautiful, it still feels hard to watch, like there's something dreaded under the gloss. If this reads as an ambiguous review, that's probably a good thing. I like this movie, quite a lot. But I also dislike it. It's easy to see why the DVD cost me $10. I also like the fact that I own this movie before America even get an official release date. As an Australian, always open to release dates getting pushed back by three months, or movies being on DVD in America for about a year before we even get a theatrical release, this gives me a strange sense of superiority. An incredibly strange movie and most certainly not everyone's cup of tea, I'll have to be careful of who I recommend this movie to. But see it yourself, as it's a movie that deserves an audience, just a very select one. 7/10",
         "If Dogville shows the new directions taken by Director Lars von Trier since Dogme, It's All About Love shows the very different creativity of Dogme co-founder Thomas Vinterberg. John (Joaquin Phoenix) is planning to meet his wife Elena between flights in order to have divorce papers signed. Their marriage has broken down some years ago. It is as if their 'calendars are written in different languages.' Things are not what they seem. And things don't go as planned. It's All About Love is set in the near future but defies the sci-fi or any other genre tag. Attention is focussed on the title, what love is really about. What happens when a relationship ends? When you still \u0091love' someone but no longer want to be part of each other's world? When the other person seems like almost another person to the one you knew? It's All about Love looks at parallel emotional dislocation and its extension into the physical world, a world near the brink of cosmic collapse. It contains images of stunning beauty and is also jarring and artistically innovative. It's probably also the quirkiest movie since David Lynch's Mulholland Drive.",
         "Some movies are well done, come are excellently directed, but there's another kind of movies, the beautiful movies. the second Vinterberg's are one of this kind of movies that don't make you think, just make you feel. i think this is a beautiful movie and you have to see it without any thought in your mind, just enjoy the great cinematography, the great scenes and a very blue movie. Just check it out and be prepared to feel and feel very nice! maybe it's a misunderstood film, because of the entire plot are \"absurd\" in some moments, but, i say again, that you don't need to think about the pictures on screen, you need to feel the cold of the movie, the cold in the hearths, the cold in the room, i mean its a film to enjoy no to think.",
         "This remains a strange notion, although it has inspired several features by now (there's one of those burlesque X Files episodes with a similar motif), but Vinterberg fetches it far, far out. OK, inhale... Could it be that we're doing more damage to the environment, not just by keeping our heavy industries and disposing of toxic waste but, actually, through coldness, indifference and alienation from each other? Is the coldness of heart somehow projected on to the earth's gravitation field and climate, causing bizarre atmospheric anomalies, eventually bringing the next ice age upon humanity? If that is the case, there must be a critical number of couples in love, who are somehow radiating there emotions, and thus, keeping the global climate in balance. Should it fall below the critical value, the nature will retaliate, turning us all into icicles!? Could this be the reason, the Marchevsky's (Danes, Phoenix) become so important for the plot? Maybe, they're this critical couple, whose emotions happen to determine the course of possible cataclysmic events, also making them a target of some vague conspiracy. If Elena fails to get back with John, her clonettes are trained to fill in for her, whether as a loving wife or an ice skating champion. Basically, the script has so many loose ends that you could go on speculating forever, which is ok, if the director's actual intention was to provoke speculation. Also, while I was watching it, the monotonous pace and a chilling atmosphere made me half asleep, except for a few unexpected lines in my native language uttered by one of the clonettes. To sum up - intriguing idea, beautiful art direction/photography, decent acting, disastrous script. So, if you happen to be a speculator, environmentalist, climatologist, or particularly keen on the idea of 'reversed meteoropathy' (there's probably a more suitable term for this), It's All About Love should be interesting for you. Otherwise, be patient and wait for the next attempt by this undoubtedly talented director.",
         "Reading the plot of the movie and watching some wonderful scenes in addition to knowing that Preisner is making the score and Sean Penn is in it , i was so much intrigued to watch this film ; what a pity and what a waste of so much potential by the director . It all begins quite interesting , but soon enough you realize that the director tries so hard to prove nothing, Hitchcock, Lynch, Trier, all mixed up . It's not lyrical but tries to be , it's not poetic but tries to be , it's not a thriller but tries to be , it's not a love story but tries to be ; in vain .",
         "I don't think I really spoil the film, considering the flying Ugandans are my only direct reference. But just in case... My comments are more general and hopefully helpful if you're thinking about seeing the film. If you're looking for fast-paced action, this is too leisurely and curious a pace. If you're not in the mood to be intrigued without explanation, then save this one for when you are! I don't know you, so I don't know if you'll like it! I can't even say (for myself) but to have you read my thoughts... I think I liked it. What got me here, writing to you, is those darned flying Ugandans! Being just a tad OCD, I couldn't not read all the comments in hopes of finding some kind of insight on this film and it's peculiar end image.... I do recommend you read the director's explanation of this film at www.cinema.com (Also quoted in one of the comments.) This is a helpful view to keep in mind! I can't say I'm a film buff nor am I as well-read as some of the others who've commented. Just as well, here's my 2¢... THE ACCENT: As far as I understand, the characters portrayed by Phoenix and Danes are supposed to be Polish. The accent thing is mildly annoying. Only that it caused some struggle in me to understand if the characters were Polish, Russian or Americanized Polish, etc. THE ACTING: Moderate. Difficult to accuse the actors, script, director, etc. It seems to vary with how it's received. And given the bizarre nature of the film, no one character struck me as having been BADLY acted. VISUAL ART: Definitely! Beautiful and well crafted. Tone, rhythm, perspective, harmony... Very detailed and constructive. DIALOGUE: I tend to agree that the dialogue was weak. Mostly because I felt I had to focus so much and barely comprehend! What intrigued me most was how much attention I'd compelled in hopes of discovering... something! FIGURE SKATING: I'm a fan. But the entourage is exaggerated. It is an international sport. And it doesn't seem to really be of consequence whether or not it's ever going to be that big of a sport! It's just the way the movie goes. So go with it! Otherwise, the lack of athleticism displayed or \"who'd ever care about figure skating\" will really get you going! GENRE: Certainly, I found myself trying to fit the film, as it unfolded, into a genre I already understood. And I was thwarted at every turn! It seemed a journey that was purely in my mind as well as an emotional exploratory. And I think the idea of printing a dream fits best. MY THOUGHTS: This film really gets under your skin, yea or nay! Whether you hate it or love it or somewhere in between, that fact that you've gone so far as to read this comment already invokes some kind of meaning. (Providing you've also seen it!) I saw this last night on the Sundance channel. I'd like to see it again to find my opinion. But for now, it seems the most settling explanation is that I've just viewed someone else's dream. Dreams often don't make sense to the dreamer, but do have some kind of plot as you are dreaming it! No character is immutable. So the weakness of character may be just that... an ever-changing character to suit the moment? And dreams are often of the subconscious and/or unconscious. Things we have a opinion, concern or feelings about but not yet thought-out. So the anachronistic view feels like fragments of ideas trying to become something effable. I like that it is provoking... thoughts, emotions, etc. Definitely an interesting topic of conversation on many levels. What you think, feel and say are personally revealing, if you explore it like a dream. And fun to share, especially about those silly scenes and the ideas that just can't be helped.... The best part is how heartily I can laugh at the silly scenes and the collective \"WHAT?\" that we all share. I feel the need to know! So, those discontinuous points and lapse in plausibility or plain nonsense did bug me. WHY? WHY? WHY? But again, as a dream, I guess we should be asking ourselves why we have these questions, eh? All in all, I can't say I'm coming up with much I didn't like. It was darned weird! But I didn't feel like it was a waste of time. I could have switched the channel or turned it off, but didn't. The weirdness level was entertaining in itself! Like enjoying your own dream then finding disappointment that you've awaken, ...just because! And reading about it was even more fun! The best part is all the intrigue about those flying Ugandans!!! I'll buy it as a dream. If anyone has insights about the flying Ugandans, please feel free to share! But based in reality, I can't help but wonder why the laws of gravity only affect the people of Uganda and not the objects and animals. Why the Ugandans? Where were the Chinese folks in the world of 2021? What happens when the never-landing plane flies over this selective zero-g area? Every other nonsensical is quite viable in dream-state. But those (tethered) flying Ugandans...what does that mean?@!#@# Freud? Jung? Anyone? How about: Inability to see the global impact via prevention of floating or flying in dream-state? ...Or those wanting to see truth but are somehow tied to a fictitious or contrived alternate reality? Or perhaps, it's the \"exit button\" in the dream-state? Any takers? =o) I give it 7 out of 10 because I liked it more than I disliked it. A curious nature will tend to like it. If you want an explanation or simple summary you'll likely NOT like it!",
         "I loved \"The Celebration\" and was very disappointed when I saw this at Sundance. In brief, this suffers from the same delusion as \"Eyes Wide Shut\": namely that implication = meaning. There is implied tension, implied sexuality and an implied conspiracy, none of which are delved into, and a barrage of imagery that is neither satisfactorily abstract nor clearly explicated. Joaquin Phoenix is too passive to be much of a lead and Claire Danes, while beautiful, lacks depth. The picture IS gorgeous, and kudos to the DP and design team.",
         "The one movie I've seen in the last 2 years that doesn't actually telegraph what's happening 2 frames ahead. i took the wrong fork in the mystery, got surprised, loved the production values, enjoyed some great music, the best mood music with ice since Smilla's sense of snow, and a video store find turned out to be the best in 4 rentals. This movie got slammed by a lot of critics, who seemed to resist what the director was trying to present. life is a well choreographed, visually designed mystery with randomness thrown in. The terrestrial back story to the anomie in the societal makeup brings the character;s focus and hope in clearer definition. is the headline craziness in this film any weirder than what's actually in the headlines today? There is a post-Katrina resonance to the topography agitating for notice in the periphery, and i actually wondered if it was written by Philip K Dick, there is a first-The Matrix freshness here that backs up our suspicions, that nightmare incidence of a look over your shoulder, when not only is something there, but it's not good, and you can actually see all the way down its gaping maw. see it.",
         "I have just watched \"It's All About Love\", and while I generally appreciate the recent Danish slew of art movies, this was one that just didn't do it for me. I was bored throughout most of it. Parts I got, other parts I was very confused by. The whole thing with the world freezing over because of lack of love is clear enough, and the point is well taken, although nothing much was done with this point besides simply stating it. No remedy was offered. There should have been a way out by letting John and Elena get back together again, rediscovering their love, but even though this happened, the world was (apparently) still doomed. As for the Elena doppelgangers and their assassination - I just have no idea what that was about. None. Sure, some bad greedy people tried to exploit her by finding and training doppelgangers (they weren't actually clones, were they?), which contributed to the diluting of genuine human emotion and identity - but who was the assassin, why did he shoot the wrong Elenas, and why didn't it make any difference in the end that the real one escaped? And what about the first doppelganger, who didn't seem to be the same kind as the ones that were shot? These things I don't understand. And no, I didn't quite understand the thing about the flying Ugandans, either, although I suspect that the ability to fly symbolizes the ability to wonder and see the beauty of the world - which is the attitude that Sean Penn's character chiefly embodies. But he can't save the world, either. Do the flying Ugandans represent some last sliver of hope that love can be kept alive? After all, the shot of them flying only comes after the rest of the movie has ended... Well, I don't know. Even if this is the case, it feels hollow and inconsequential. The movie struck me as artistically ambitious, but also artistically naive. It kept emphasizing obvious things, while at the same time introducing confusing things that didn't make sense. I was apprehensive while watching it, waiting for something interesting and fairly sensible to happen, but it never did. I was never surprised, because weirdness was something I was expecting. But I wanted some kind of possible explanation of the most grating weirdness, and I didn't get that. (I will say, though, that unlike some commenters, I found the acting to be very good all-round, and I think the accents worked well. This just couldn't save the underwhelming impact of a strangely structured movie.) European art movies often want to be art rather than entertainment, not realizing that they could and should be both at the same time. It seems more important for the film-makers to distance themselves from the Hollywood type of product than to create something that will feel good to the audience while also enlightening them artistically. I have to decry that attitude as stubborn, immature, puritanical, elitist and pseudo-intellectual - despite the fact that I like a great deal of these movies. The only thing they lack in order to be perfect is proper *entertainment value*, which is another area where \"It's All About Love\" falls grievous short. It's goddamn boring. The best art movies are the ones disguised as terrific romps - movies like Matrix, The Fifth Element, Fight Club, O Brother Where Art Thou. Great movies that can be watched over and over, giving their underlying messages the maximum opportunity to sink in. Also, a good movie must be upbeat. It is not an absolute rule, but it is a *generally* true one. People will eat up the message if they're enjoying watching it, and feel good at the end of it. I'm not saying tragedies are bad, but they are an art form that primarily belongs in the past. People need to be cheered up in this day and age. Otherwise the descent into the numbing apathy represented by the developing ice age in \"It's All About Love\" becomes the most obvious reaction. We don't want downers, we want uppers! If you, the artists, have something important to tell us, put it into an entertaining package! If you can't do that, maybe you haven't got what it takes to be an artist after all, because that's how the most effective art works! Y'all need to study your Shakespeare to see how it's done. My rating for \"It's All About Love\": 5 out of 10. It's on to something, but ultimately it disappoints. (Edit: It struck me later that one way in which this movie *does* make sense, is if the ice and cold represent love. It would jibe well with the movie's title, and we do see a glass of water freeze over when the characters make love. Based on the way Vinterberg uses symbols in his subsequent movie, \"Dear Wendy\", it makes sense that he would use artistic devices that reverse our usual perception. If this is the case for \"It's All About Love\", then the on-coming ice age actually represents a realm of love descending on the world. Would be nice if that were to be the case!)",
         "Before I went to see this film, I had read a lot of reviews that said that it wasn't good; it lacked a properly fleshed-out story, it was too superficial. After I saw it, I could understand why the reviewers felt like this, but I wholeheartedly disagree with them. This film isn't supposed to be a credible social drama with a probable storyline and believable characters. The nature of this film is light, almost ethereal. From start to finish this is a fairytale, an intangible voyage through events and interactions with one overshadowing theme: It's all about love. I was reminded, when I saw this film, of the stories of Oscar Wilde, they too possess an immaterial, poignant view of the fleeting nature of love (or happiness for that matter). The air of the film is amplified immensely by the beautiful images and the hauntingly sweet music by Zbiegniew Preisner (who has composed the music for many of Kieslowskis films). Especially the huge panoramas in connections with the planes are some of the most beautiful images I have ever seen on film. The film's use of close-ups takes a little getting used to, but is very effective at communicating the characters' emotions. Among the actors, I was especially impressed by Sean Penn, who provides a sort of philosophical voice-over to the entire film. Also Joaquin Phoenix was a positive surprise, he was much more toned down than I have seen him before. The cast that make up the tiny community around the main character Elena is eminently selected, with a wide range of memorable characters. The actors are some of the best supporting actors around. Thomas Vinterberg has made a film that is decidedly different from \"Festen\", but in my opinion almost as good. I can't wait to see what his next project will be."
      ],
      "genres": [
         "Drama",
         "Thriller",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "CoBo Fonds",
         "Danmarks Radio (DR)",
         "Det Danske Filminstitut"
      ],
      "summaries": [
         "It's All About Love is the story of two lovers and their attempts to save their relationship in a near-future world on the brink of cosmic collapse. John, and world-famous ice skating star, Elena, are about to sign divorce papers when they realise that, in spite of everything happening around them, their love is worth fighting for. It's All About Love is a fresh take on modern love and future life as two lovers struggle in a conspiracy of epic proportions.",
         "The time is out of joint: it's July, 2021, but snow falls in New York City, people freeze in Uganda, gravity has lost its power in parts of Africa, and hearts give out suddenly. John, an academic on his way to Calgary, stops in New York to meet his wife Elena, a world-renowned skater, at the airport for a quick signing of divorce papers. Instead, she sends bodyguards who take John to her hotel where he catches whiffs of a plot that may place her in mortal danger. Can he trust her brother, Michael? Meanwhile, his own brother, Marciello, circles the globe in a plane observing the onset of global winter. Is there a corner of the world where love is safe?"
      ],
      "budget": 86000000
   },
   "movielensId": 8963,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-10",
      "dvdReleaseDate": "2005-09-13",
      "directors": ["Thomas Vinterberg"],
      "runtime": 104,
      "movieId": 8963,
      "title": "It's All About Love",
      "mpaa": "",
      "actors": [
         "Joaquin Phoenix",
         "Claire Danes",
         "Sean Penn",
         "Douglas Henshall",
         "Alun Armstrong",
         "Margo Martindale",
         "Mark Strong"
      ],
      "imdbMovieId": "0273689",
      "originalTitle": "It's All About Love",
      "genres": [
         "Drama",
         "Romance",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0MxquUjCTi4"],
      "plotSummary": "The story of two lovers and their attempts to save their relationship in a near-future world on the brink of cosmic collapse. John, and world-famous ice skating star, Elena, are about to sign divorce papers when they realise that, in spite of everything happening around them, their love is worth fighting for. It's All About Love is a fresh take on modern love and future life as two lovers struggle in a conspiracy of epic proportions.",
      "tmdbMovieId": 12777,
      "avgRating": 2.64729,
      "releaseYear": "2003",
      "numRatings": 129,
      "posterPath": "/g6Qxm8kLeAoOadXrun11eQMwVnV.jpg"
   }
}