{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "coffee",
            "id": 2439
         },
         {
            "name": "plantation",
            "id": 3136
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "south america",
            "id": 18266
         },
         {
            "name": "flood",
            "id": 173272
         }
      ],
      "imdb_id": "tt0047050",
      "video": false,
      "title": "Green Fire",
      "recommendations": [],
      "backdrop_path": "/vKBKdYx0pq2O25F2YwgJcZhzhMe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Rian X. Mitchell",
               "gender": 2,
               "credit_id": "52fe47af9251416c91072655",
               "name": "Stewart Granger",
               "profile_path": "/vRcMlIV1NTpiXQibMdsl5N4J6gl.jpg",
               "id": 41235,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Catherine Knowland",
               "gender": 1,
               "credit_id": "52fe47af9251416c91072659",
               "name": "Grace Kelly",
               "profile_path": "/2dNjXRNbhOmovybmr5iCdAhqdwl.jpg",
               "id": 4070,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Vic Leonard",
               "gender": 2,
               "credit_id": "52fe47af9251416c9107265d",
               "name": "Paul Douglas",
               "profile_path": "/vXikiygQljU0at92pLe84ptTqaJ.jpg",
               "id": 111578,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Donald Knowland",
               "gender": 2,
               "credit_id": "52fe47af9251416c91072661",
               "name": "John Ericson",
               "profile_path": "/cOrRIIJyxHev6Oy0sVxVbQFxyN0.jpg",
               "id": 41231,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "El Moro",
               "gender": 2,
               "credit_id": "554384c8c3a3680ce8001de8",
               "name": "Murvyn Vye",
               "profile_path": "/PAJTJO03eQMl674Bvn3KYX6tVY.jpg",
               "id": 20100,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Manuel",
               "gender": 0,
               "credit_id": "554384d6925141586f001cd9",
               "name": "José Torvay",
               "profile_path": "/A5s0VGXCnVQsym4QaZkwyh3psvc.jpg",
               "id": 30307,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Father Ripero",
               "gender": 0,
               "credit_id": "554384e4c3a3680cd5001e83",
               "name": "Robert Tafur",
               "profile_path": null,
               "id": 1461590,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47af9251416c91072645",
               "name": "Andrew Marton",
               "profile_path": "/nY91bRdDR6MfgUhEst0tzHEevfG.jpg",
               "id": 57142,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5543848d925141586d001d90",
               "name": "Ivan Goff",
               "profile_path": null,
               "id": 57624,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5543849dc3a3680cd7001ea2",
               "name": "Ben Roberts",
               "profile_path": null,
               "id": 57625,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "554384a9925141586f001ccd",
               "name": "Miklós Rózsa",
               "profile_path": "/1eAU1ckh7SUNMP9IZeii9qX5xa.jpg",
               "id": 7647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "554384b69251415868001cd7",
               "name": "Paul Vogel",
               "profile_path": null,
               "id": 96427,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.936358,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80241,
      "vote_count": 5,
      "budget": 0,
      "overview": "Set in the coffee fields of Colombia, Green Fires stars Stewart Granger and Grace Kelly. Granger plays emerald prospector Rian X. Mitchell, who intends to explore an old deserted mine despite the protests of his partner Vic Leonard Paul Douglas and the threat of death at the hands of local bandit El Moro Murvyn Vye. Ms. Kelly costars as Catherine Knowland, whose coffee plantation lies at the foot of the mine where Mitchell labors away. Such natural disasters as rain and flood, coupled with such man-made weapons of destruction as guns and dynamite, continually thwart Mitchell's search for riches.",
      "similar": [
         24420,
         1259,
         1643,
         1024,
         979,
         13,
         38,
         627,
         46705,
         86331,
         68718,
         1903,
         276,
         332872,
         290762,
         13523,
         226,
         50546,
         225886,
         72105
      ],
      "original_title": "Green Fire",
      "runtime": 100,
      "poster_path": "/tKXAcQ4CgqtKJg1uXevVxXAFLJe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1954-12-29",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Lovely GRACE KELLY in a new kind of man-danger!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Marton"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Ivan Goff",
         "Ben Roberts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047050/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4OTgxMjk2MV5BMl5BanBnXkFtZTYwNDYxODM2._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Stewart Granger, Grace Kelly, Paul Douglas | See full cast and crew »"],
      "reviews": [
         "A handsome looking early Cinemascope/colour romantic adventure story is probably about all that makes MGM's GREEN FIRE (1954) an entertaining enough movie. Produced by Armand Deutsch it was routinely written by the usually more astute Ivan Goff and Ben Roberts and directed without an awful lot of spark by Andrew Marton. However it did have its compensations in Paul Vogel's spirited Cinematography and a stunning score by Miklos Rozsa. Starring in the film was a mixed bag of talent! Stewart Granger and Paul Douglas are a pair of Emerald miners prospecting in the hills of Colombia. And Grace Kelly is a neighbourhood coffee planter who Granger has the hots for. The thinly plotted adventure also has some local bandits headed by the infamous El Moro (Murvin Vye) who, of course, wants any and all of the yet unearthed green stones for himself leading to an action filled finale. Although a constantly busy actor Stewart Granger never did have a hugely distinguished career in film. Appearing in a number of unmemorable British films in the forties the London born actor landed himself the lead in Metro's \"King Solomines Mines\" in 1950 followed by a contract with the studio where - with the exception of the fine swashbuckler \"Scaremouche\" (1952) and \"The Wild North\" (1951) - he continued on his merry way of churning out a load of indifferent pictures (including a most unfortunate and ill advised attempt at a western in 1957 called \"Gun Glory\"). Also Grace Kelly was, to my mind, a quite unremarkable actress! She never really impressed me like she did the public in general. Her role here in GREEN FIRE is tame and forgetful which is probably due to her part being so poorly written. Nevertheless in GREEN FIRE she is quite unimpressive! Two years later the lady would star in MGM's \"The Swan\" (1956) the story about a girl being groomed to marry a crown prince. The actress then retired from films and did exactly that - becoming a real life princess. How about that?? But Paul Douglas is the most curious bit of casting! He simply doesn't suit the part of the intrepid adventurer! Always a very likable character actor Douglas was more at home in urban dramas and light comedies. The film's most tangible aspect is Miklos Rozsa's music! It is also something of a curiosity! GREEN FIRE is the great composer's most tuneful score and it actually has a theme song which is a great departure for Rozsa. He always had an aversion to theme songs and under no circumstances did he ever wish to go down the Dimitri Tiomkin road. So what ever possessed him to have his pivotal and quite beautiful main theme - with lyrics by Jack Brooks - sung over the titles is anyone's guess! That said, the chorus performing the song do an admirable job and their effort strikingly and vividly adds an attractive harmonic flourish to the piece. Also, with the picture being set in Colombia the music has an engaging Latin flavour and there are plenty of indigenous folk tunes mixed through Rozsa's lovely score. The highlight of the score (and the movie) is the brilliant, exciting and intense cue that comes towards the end for the picture's climax where the composer uses an ingenious, frantic and rhythmic clock ticking sound in the orchestra for the build-up of tension as Granger sets the timer on the explosives charge that will literally bring down the mountain on the marauding bandits. GREEN FIRE is by no means a great movie but with lovely Cinemascope Cinematography, a spectacular mountain avalanche and a great Rozsa score there are, I suppose, worse ways to spend 100 minutes!",
         "Before writing this review I looked up emeralds in Wikipedia and found that Paul Douglas was wrong when he said during the film that emeralds are only found in two places, Colombia and the Soviet Union, specifically Siberia. They are found in all kinds of places including some areas of the USA. Would that were the only thing wrong with this film. Still Colombia is the area best known for it and until recently when you thought of Colombia you thought of emeralds and coffee. Now sad to say you think drug cartel. But back in 1954 it was emeralds that was on the minds of adventurers Stewart Granger and Paul Douglas. They've discovered an abandoned mine that they think was abandoned prematurely. And the only place to get laborers is from the nearby coffee plantation owned by brother and sister Grace Kelly and John Ericson. Young Ericson is hot to trot to help Granger and Douglas, Kelly less so. But she does have an eye for Granger even with both men pursuing her. And of course there's bandit chief Murvyn Vye who actually does own the land where the emeralds might be found. But he'd just as soon let others do the back breaking work of digging them out. Now with all the information I've given I think 99% of viewers would see where this one is going. In fact that's Green Fire's main problem, it's your basic routine action/adventure flick on which MGM decided to spend a ton of money. For one thing it's best asset is the color location cinematography in the Colombian jungles. After King Solomon's Mines and The African Queen, American audiences would not accept back lot jungles any longer. Note that Stewart Granger was the star of King Solomon's Mines and he got first crack at every jungle picture that came along after that. Green Fire is hardly as good as King Solomon's Mines. Grace Kelly seemed pretty distant in this film, looking like she was a Philadelphia débutante rather than a coffee plantation owner. She did a flock of good films this year, Rear Window, The Bridges At Toko-Ri and her Oscar winner The Country Girl in 1954. Green Fire just isn't in the class of the others. In short, admire the flora and fauna of Green Fire and the story is something you can live with.",
         "The movie really is good enough for its genre. The story well written and paced, the characters well portrayed, especially by Granger and Douglas. Granger was a natural as the adventurous treasure hunting mining engineer , Douglas, solid and humane , played his long time partner and friend. Together, they fought the hardship of mining, the bandits, sometimes each other, and for the girl Kelly. Kelly was a bit out of place here. She though was very beautiful but somehow too civil and too dignified for the south American jungle background. Her romance with Granger lacked intensity and passion. Fortunately, the story and some actions provided enough intensity and excitement , made the movie quite enjoyable",
         "This colorful picture is set in Columbia, South America , and specifically at the treacherous jungle . There prospector Rian Mitchell (Stewart Granger) comes across what he thinks may be an important emerald site . A bit later on , emerald miner Mitchell is wounded by some bandits , however meets plantation owner named Catherine Knowland (Grace Kelly) and nursed back to health . Catherine along with her brother Donald (John Ericsun) runs a coffee plantation. Rian goes back to get his colleague Vic Leonard (Paul Douglas) to join him in his mining venture . When they come back to the location , they must deal with a nasty native , El Moro, who claims he has rights for the land the major mine is on . Meanwhile , Mitchell and Catherine fall in love and they subsequently are threatened by El Moro . This exciting film contains adventures , thrills , a love story and colorful outdoors well photographed by cameraman Paul Vogel . Plenty of a Hollywood all-star cast as Granger, Kelly , Douglas and Ericsun ; however ordinary script complications muddle the tale . Director Andrew Marton likes lots of big , noisy explosions , especially at its finale , when he doesn't know what else to do . Heat and ills affected the crew and main actors but they surprised for her resistance . During location shooting in Columbia actors lived aboard a huge barge moored in a river , when the river suddenly into spate , the boat broke loose and was drifting at speed down the river when the natives in canoes rescued the players . Special mention to musical score by the classical Miklos Rozsa , a great composer expert on impressive atmosphere in Noir cinema and epic films . The motion picture was professionally directed by Andrew Marton , though with no originality and some moments result to be a little boring . Marton was a specialist on Wartime movies as : ¨The thin red line¨ , ¨The longest day ¨and adventure movies as ¨African Texas style¨, ¨Around the world under the sea¨, ¨Clarence , the cross-eyed lion¨, and ¨King Salomon's mines¨(1950) co-directed by Compton Bennett and Andrew Marton directed the second unit , he then was tasked with replacing Compton Bennett as director after the latter had been taken ill . One of his more prestigious assignments came about by chance to lay in some excellent work as second-unit director , notably in charge of the chariot race for William Wyler's ¨Ben-Hur¨ (1959), as well as of the Normandy invasion sequences for the World War II . After his contract with MGM expired in 1954, Marton founded his own production company in conjunction with fellow Hungarian émigrés Ivan Tors and Laslo Benedek . He later concentrated on TV adventure series, helming the pilots, respectively for \"Daktari\" (1966) and \"Cowboy in Africa\" .",
         "\"Green fire. Emeralds burning like blue fire. So rare. So precious to own.\" So goes the theme song of this echt-1950s Hollywood adventure in an exotic land. Those lyrics, which do not hang upon the cheek of this movie like a rich jewel in an Ethiope's ear, no matter how hard I try to love them, are about on a par with the rest of the story. Greedy Stewart Granger and skeptical Paul Douglas are two mining engineers determined to find emeralds in a South American country. They set up a camp on a promising mountain and spend a good deal of time fraternizing with the owners of a neighboring coffee plantation -- Grace Kelly and her callow brother, John Ericson. Granger and Kelly fall in love under the tropical moon. Douglas falls too, but he's fat and older and not nearly as smooth as Granger. I believe, though, that Kelly, had she thought about it, would have found Douglas's Philadelphia accent engagingly familiar. \"Oh, come awn, I'm no sub-stee-tute for Stewart Granger.\" Inevitably, there is conflict. It comes in two forms. First El Moro, this greaseball bandido, finds the idea of stealing any emeralds, those stones so precious to own, appealing and lets the two miners know that he'll return when circumstances call for it. Second, the mine shaft that Granger, Douglas, and a handful of men have dug into the mountain has collapsed. This means that they either return as failures or they \"step mine,\" which we would call \"strip mining.\" And this requires lots of dough, which they don't have, and is labor intensive. Granger the greedy implements a simple solution without Douglas's knowing about it. He talks Ericson into funding the mining enterprise with the plantation's entire kitty, and Ericson brings all the plantation workers to the mine, leaving Kelly with a ripe crop of coffee beans and nobody to harvest and process them. Other tribulations follow. Ericson is accidentally killed. The sluice from the mine changes the course of the river and threatens Kelly's plantation, on which the women of the village are now working tirelessly as a replacement for the absent men. El Moro shows up, eyes beady, teeth glistening, phonemes slurring. A shoot out at the climax, and all the bad guys die in an avalanche while all the good guys live, and the river changes its course, and the plantation is saved, and Granger has an epiphany, and it ends happily. Frankly, I kind of enjoyed it. Granger is tan and fit and leaps around like Errol Flynn. Grace Kelly is the most beautiful and least probable owner of a tropical empire you've ever seen. She looks almost sassy in those starched blouses and tight slacks. Paul Douglas is always easy to identify with because he completely lacks any of the social graces. John Ericson -- what is he doing in this movie? What was he doing in ANY movie? The special effects are good for their period. The gun fight at the end, with the bandidos peppering away at the human springbok Granger, had some novel sounds and original minor effects. Bullets zip through the air. And when they ricochet, it's with a soft \"ptew\" rather than the traditional loud, vibrating \"whanggggg.\" If they hit a wooden object, a chip flies off. Now, this all sounds like a matter of little consequence, but it was new at the time and quite exciting. But, Dios mio, this is an OLD story. Warners and the other studios were grinding them out like Sonicburgers back in the 30s and thereafter. Reckless, materialistic adventurer goes into the wilderness, falls in love with a local, and is redeemed. Well, I'll just mention \"His Majesty O'Keefe\" as another typical example. This one happens to be more entertainingly done than most.",
         "Grace didn't make many movies, she should have made one less! Silly adventure isn't wretched nor is it very good. Her only film to lose money on original release. The movie is a standard jungle picture typical of the fifties made better then it should be by the cast. Grace and Stewart, who most definitely did not hit it off during filming-Grace found him boorish and puffed up, handle what little romance there is well enough. However the best performance as was often the case comes from Paul Douglas. Even though he didn't have leading man looks he had a bruised dignity that softened his blustering demeanor and made him a sympathetic character. Some nice location photography and a decent if preposterous climax but this is without question the worst picture Grace Kelly made during her brief Hollywood heyday.",
         "By far, the cast overshadows this routine action/adventure tale of a duo of soldiers of fortune seeking emeralds in Columbia. Kelly seems out of place as the young maiden running a coffee plantation, who eventually confronts Granger over labor and water rights. The location shots are of interest, and Granger and Douglas do the best they can with the script. Hackneyed ending provides no surprises.",
         "There is a whole subset of movies from the 1930's to the early 50's which revolve around the plot of a man who becomes so obsessed with the idea of succeeding at the task he has taken on for himself, that he temporarily loses his sense of decency and alienates - always in this order - his best friend/colleague, his girlfriend/fiancée, and finally, all the men who work for him and worship the ground he walks on. The main character is usually an engineer with a new idea that will make him lots of money, but the real motivation for him is proving his idea will work. Examples of this type of film would be Pat O'Brien in \"China Clipper\", John Wayne in \"Tycoon\" and James Stewart in \"Thunder Bay\". Green Fire is one of the last of this type of film, and one of the most beautifully shot. It has some action sequences thrown in - a couple of short gun fights with the local bandit leader, for example, an avalanche or two and an almost devastating flood. There is also a love triangle of sorts. This one is set in Colombia, South America, and the idea is to find the emeralds in an old mine that the conquistadores first opened. Stewart Granger is the mining engineer, Paul Douglas his partner and best friend. Granger is presented as a lovable rogue who cons his buddy into staying on for one more adventure. Nearby to their mine is a large coffee plantation, owned by Grace Kelly's character and her brother. She is devoted to this plantation as it has been in the family for 4 generations. The brother is young ands restless and doesn't care \"beans\" about coffee, which of course makes him a great patsy for Granger to con into backing the mining operation. Granger and Kelly fall in love, but she is afraid he will be ever the wanderer and she's firmly rooted to her plantation. Granger becomes more and more ruthless in his pursuit of the emeralds - first alienating his friend Douglas, then Grace and eventually his actions endanger the lives of everyone in the region, and may destroy the plantation. But of course it all works out in the end, he comes to his senses, regains his moral balance and kisses the girl in the rainstorm at the end of the film. A very routine plot line, set in what was then a rather exotic locale. Granger was a limited actor, but this was not a demanding role and he does well. Douglas is probably the best among the cast as the best friend with more common sense and stronger moral compass. Grace Kelly is lovely as always, but not very convincing in the role - she just never really was the \"outdoors type\". The film is shot in beautiful widescreen color, some location shooting seems to have taken place, but most of it was on very nicely done sets and backlots. At 1 hour and 40 minutes, the film tells its story pretty briskly with not much extraneous material. It's not a timeless classic, but it is a good example of typical 1950's adventure films, and is entertaining enough to watch once every few years.",
         "\"Rian X. Mitchell\" (Stewart Granger) is an ambitious mining entrepreneur who is looking in Columbia for a long-lost emerald mine built by the Conquistadors in 1687. He finds it but some bandits also find him and he is shot, robbed, pushed off a hillside and left for dead. He manages to stumble away but is then attacked by a jaguar. Fortunately, a village priest named \"Father Ripero\" (Robert Tafur) happens to be there and shoots the jaguar before it can kill Rian. Father Ripero then takes him to a nearby coffee plantation where \"Catherine Knowland\" (Grace Kelly) manages to tend his wounds. When he recovers he tells her that he has a partner, \"Vic Leonard\" (Paul Douglas) that he has to see right away but that he will return. Once he and his partner return to the coffee plantation they begin to work on the emerald mine which creates difficulties for all concerned. Anyway, having given the initial plot I will stop right here so as not to spoil the movie for anyone who wishes to view it. That said, while the entire cast performed in a decent manner the film seemed slow in some parts and lacked energy. Part of the problem may have been that the romance between Rian and Catherine lacked passion. Likewise, the action was solid but not very unique or original. In short, this is a decent movie with beautiful scenery and a capable cast. But with all it had going for it I believe it should have been better.",
         "MGM adventure set in Columbia (and beautifully filmed there). Stewart Granger plays a somewhat hapless, but charming, down-on-his-luck mining engineer, hoping to make a big emerald strike. Paul Douglas plays his solid, more practical partner, who's about to quit the game and take a job in Canada, when he's persuaded by Granger to give it one last go. Granger has an accident and ends up recuperating at a comfortable coffee plantation owned by lovely Grace Kelly and her brother, John Ericson. Granger and Grace fall for one another, but complications ensue, including conflicting ethics. Yes, you've seen it all before, and despite top stars and first-class production values, as well as landslides, animal attacks, a villain called El Moro, and Granger with his shirt off, the picture still comes across as a bit of a potboiler. On the plus side, Granger and Kelly are both more nonchalant and casual than usual. In a far cry from her Hitchcock outings, Grace even drives a Jeep, rides horseback, gets dirty and wet, and performs manual labor. All in Helen Rose designs. If you don't take any of it very seriously, you'll probably enjoy \"Green Fire.\" It's one of those movies that doesn't grip you right away, or even in the first hour. When movies were meant to be seen in theaters, filmmakers were free to set up the story slowly, because the audience wasn't going anywhere. They weren't going to change the channel. This picture sets everything up solidly, eventually leading to an exciting climax and satisfying conclusion."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Rian Mitchell discovers an emerald deposit in South America, but gets chased away before he can start to mine. He tricks his partner, Vic, into returning to the site. While there, he meets Catherine and Donald Knowland, siblings who run a coffee plantation. Rian falls for Catherine and is torn between his love for her and his love for the \"green fire\" of emeralds.",
         "In Columbia, prospector Rian Mitchell comes across what he thinks may be a major emerald find. He is wounded however and and nursed back to health by the beautiful Catherine Knowland who along with her brother Donald runs a coffee plantation. He returns to get his partner Vic Leonard to join him in his mining venture. When they return to the site, they must deal with a bandit, El Moro, who claims he has a deed for the land the mine is on. Mitchell and Catherine fall in love but Vic falls for her as well. All of them will have to fight for what they want however.",
         "In Colombia, mining engineer Rian Mitchell discovers Carrero, the lost emerald mine of the Conquistadors, but has to contend with notorious local bandit El Moro's gang and with coffee planter Catherine Knowland's love."
      ],
      "budget": 1768000
   },
   "movielensId": 89658,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-12-29",
      "dvdReleaseDate": "2010-03-02",
      "directors": ["Andrew Marton"],
      "runtime": 100,
      "movieId": 89658,
      "title": "Green Fire",
      "mpaa": "",
      "actors": [
         "Stewart Granger",
         "Grace Kelly",
         "Paul Douglas",
         "John Ericson",
         "Murvyn Vye",
         "José Torvay",
         "Robert Tafur"
      ],
      "imdbMovieId": "0047050",
      "originalTitle": "Green Fire",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set in the coffee fields of Colombia, Green Fires stars Stewart Granger and Grace Kelly. Granger plays emerald prospector Rian X. Mitchell, who intends to explore an old deserted mine despite the protests of his partner Vic Leonard Paul Douglas and the threat of death at the hands of local bandit El Moro Murvyn Vye. Ms. Kelly costars as Catherine Knowland, whose coffee plantation lies at the foot of the mine where Mitchell labors away. Such natural disasters as rain and flood, coupled with such man-made weapons of destruction as guns and dynamite, continually thwart Mitchell's search for riches.",
      "tmdbMovieId": 80241,
      "avgRating": 2.625,
      "releaseYear": "1954",
      "numRatings": 4,
      "posterPath": "/tKXAcQ4CgqtKJg1uXevVxXAFLJe.jpg"
   }
}