{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0037932",
      "video": false,
      "title": "My Name Is Julia Ross",
      "recommendations": [
         30102,
         43269,
         19335,
         35546,
         36635,
         37482,
         35009,
         30196,
         84298,
         84274,
         41073,
         42325,
         164687,
         30022,
         29113,
         43385,
         29835,
         42061,
         36332,
         23022
      ],
      "backdrop_path": "/ipn7ldrYwmZnpLy6MOICwDYTVjC.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "528bd56019c2952938280ffa",
         "content": "We're doing everything in our power to make you well again. \r\n\r\nMy Name Is Julia Ross is directed by Joseph H. Lewis and adapted to screenplay by Muriel Roy Bolton from The Woman in Red written by Anthony Gilbert. It stars Nina Foch, Dame Mary Witty, George Macready, Roland Varno, Anita Sharp-Bolster and Doris Lloyd. Music is by Mischa Bakaleinikoff and cinematography by Burnett Guffey. \r\n\r\nJulia Ross (Foch) out of work and in debt arrears to her landlady, hastily accepts a in-house secretarial position to Mrs. Hughes (Whitty). Starting work in the Hughes house in London the first night, she wakes up two days later in a cliff-top mansion in Cornwall. She is told she has been away with mental health problems, her name is Marion Hughes and she is married to Ralph Hughes (Macready)... \r\n\r\nA very important film in the career of the great Joseph H. Lewis, My Name is Julia Ross would effectively put the director on the map, with noir fans subsequently rewarded with the likes of Gun Crazy and The Big Combo. Compact in running time (65 minutes) and budget, it's a film that showcases just what real good work could be achieved by a director and photographer noir team working under tight restrictions; classical noir production if you like. \r\n\r\nStory as it is is pretty straightforward and familiar, but atmosphere and visual smartness ensure this is no walk down retread lane. It falls into the Gothic noir spectrum of films, following in the traditions of Rebecca, Gaslight and Suspicion. In fact, it's also very much \"old dark house\" on staple terms, with eerie staircase, wood panelled rooms, secret passageways and even a black cat. While the setting, house on a seaside cliff where the mist rolls in at night, is splendidly moody. \r\n\r\nThe characterisations (very well performed by the cast) are vivid and odd, with us clearly meant to note that Julia Ross is clearly the only normal being in the Hughes household! Best of the bunch is Macready's Ralph Hughes, the catalyst for all the things that are happening, he fondles his knives like a fetishist, a truly memorable noir antagonist. \r\n\r\nUltimately it's what Lewis and Guffey bring to the fore that makes the film better than it is on the page. Expressionistic touches are here of course, but it's the skew-whiff camera placements and up close POV shots that bring the viewer into Julia's confused new world. Memorable scenes are frequent, be it a rain sodden street or Julia peering through the bars of her bedroom, there's visual treats aplenty here. \r\n\r\nThe ending is all to quick and as is often the case in this type of narrative, implausibilities need to be ignored. But that is easy to do, because with atmosphere unbound and not a shot wasted, this is a safe recommendation to the Gothic noir faithful. 8/10",
         "url": "https://www.themoviedb.org/review/528bd56019c2952938280ffa"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Julia Ross",
               "gender": 1,
               "credit_id": "52fe45ebc3a36847f80e22f7",
               "name": "Nina Foch",
               "profile_path": "/jd5qWtnZdEvfwuo57CpJVzazYc0.jpg",
               "id": 13026,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. Hughes",
               "gender": 1,
               "credit_id": "52fe45ebc3a36847f80e22fb",
               "name": "Dame May Whitty",
               "profile_path": "/qOZnX0Lyrz6bE2CBnyHCgQeuKUf.jpg",
               "id": 14299,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ralph Hughes",
               "gender": 2,
               "credit_id": "52fe45ebc3a36847f80e22ff",
               "name": "George Macready",
               "profile_path": "/t1xXYLfj7KSn2YQ3cKJ4V5ZYoQV.jpg",
               "id": 14564,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dennis Bruce",
               "gender": 0,
               "credit_id": "52fe45ebc3a36847f80e2303",
               "name": "Roland Varno",
               "profile_path": "/nLwBAGNGmfWcP0E9H7Z8QgOvGAW.jpg",
               "id": 2907,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Sparkes (as Anita Bolster)",
               "gender": 1,
               "credit_id": "5997a9ba925141260100258d",
               "name": "Anita Sharp-Bolster",
               "profile_path": "/vE66AJitCdBtsm97wuMbrNSs5tP.jpg",
               "id": 98495,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Mrs. Mackie",
               "gender": 1,
               "credit_id": "5997a9c8c3a3682b8100271a",
               "name": "Doris Lloyd",
               "profile_path": "/4QJ0iSrOQ9rwfgEaDnqTaXem6c5.jpg",
               "id": 21878,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Alice (uncredited)",
               "gender": 1,
               "credit_id": "5997a9fb925141258f002763",
               "name": "Queenie Leonard",
               "profile_path": "/a0La7jUQRkLKmK7d70jkQ3JDc1C.jpg",
               "id": 39802,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Bertha (uncredited)",
               "gender": 0,
               "credit_id": "5997aa08c3a3682b8100276b",
               "name": "Joy Harington",
               "profile_path": null,
               "id": 1540998,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Peters (uncredited)",
               "gender": 2,
               "credit_id": "5997aa15c3a3682268002d9a",
               "name": "Leonard Mudie",
               "profile_path": "/4CxqJ3QP34J48L71lGXmR0H7ccW.jpg",
               "id": 101742,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Mrs. Robinson (uncredited)",
               "gender": 1,
               "credit_id": "5997aa41c3a3682268002dd4",
               "name": "Ottola Nesmith",
               "profile_path": "/vGFs5Z2Skm9XVYRkOnc7rfnLavw.jpg",
               "id": 111585,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45ebc3a36847f80e22f3",
               "name": "Joseph H. Lewis",
               "profile_path": "/lMwmKsspovp268RzuoWXmhuQRI9.jpg",
               "id": 86004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ebc3a36847f80e2309",
               "name": "Muriel Roy Bolton",
               "profile_path": null,
               "id": 105478,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ebc3a36847f80e230f",
               "name": "Anthony Gilbert",
               "profile_path": null,
               "id": 166912,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ebc3a36847f80e2315",
               "name": "Wallace MacDonald",
               "profile_path": "/arKR5gyowGRHzyP8cV7sZTqXWp1.jpg",
               "id": 96725,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ebc3a36847f80e231b",
               "name": "Burnett Guffey",
               "profile_path": "/n0fwvI4T2c3alt6PXyonPT8zVEE.jpg",
               "id": 6452,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ebc3a36847f80e2321",
               "name": "Henry Batista",
               "profile_path": null,
               "id": 34428,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Mystery",
         "id": 9648
      }],
      "popularity": 1.444867,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42077,
      "vote_count": 15,
      "budget": 0,
      "overview": "Julia Ross secures employment, through a rather nosy employment agency, with a wealthy widow, Mrs. Hughes, and goes to live at her house. 2 days later, she awakens - in a different house, in different clothes, and with a new identity. She's told she is the daughter-in-law of Mrs. Hughes, and has suffered a nervous breakdown. I'd Julia really 'Julia', or, is it true, that she's lost all memory of who she is?",
      "similar": [
         996,
         562,
         275,
         4771,
         14638,
         270487,
         910,
         33107,
         1939,
         8834,
         8090,
         12493,
         1571,
         193893,
         14869,
         2163,
         25376,
         186,
         1586,
         8271
      ],
      "original_title": "My Name Is Julia Ross",
      "runtime": 65,
      "poster_path": "/hWFHSFz3MA0TREQSGvuzMDhPZIZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1945-11-08",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "She went to sleep as a secretary ... and woke up a madman's \"bride\"!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Joseph H. Lewis"],
      "runtime": 65,
      "synopsis": null,
      "writers": [
         "Muriel Roy Bolton",
         "Anthony Gilbert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037932/",
      "coverLink": null,
      "actors": ["Stars: Nina Foch, Dame May Whitty, George Macready | See full cast and crew »"],
      "reviews": [
         "A toothsome little potboiler whose 65-minute length doesn't seem a second too short, My Name is Julia Ross harks back to an English tradition of things not being what they seem -- Hitchcock's The Lady Vanishes is one example. Out-of-work Julia Ross (Nina Foch) finds a dream job at a new employment agency in London, whose sinister representative seems very anxious to ascertain if she has living relatives or a boyfriend. After reporting to duty, she wakes up (Having Been Drugged) in a vast Manderley-like pile on the Cornish coast, supposedly as the barmy-in-the-crumpet wife of George Macready, who displays an alarming interest in knives and ice picks. His doting, enabling mum is the irresistible Dame May Whitty (this time a model of bustling efficiency on the other side of good-vs-evil than she occupied in The Lady Vanishes). The nightmare vision of this tale unfolds claustrophobically; we know what's going on but are powerless to tell poor Julia. This movie, curiously, is regularly accorded a place of honor as one of the earliest (and very few British) films noirs. I think it's closer to the Gothic old-dark-house tradition than the American one of wet cobblestones and urban corruption; it does, however, evince a more modern, psychoanalytic cast of mind. Whatever you call it, it remains a sharply satisfying thriller.",
         "I can second the emotions of other comments about this taut thriller. It's extremely well-acted, especially by Nina Foch, a fine actress whose close resemblance to Ann Baxter may have limited her opportunities. George Macready, man of the golden voice, is good as poor Marian/Julia's \"husband\". His mother's reactions to his violent psychopathic tendencies are among the film's best moments. Dame May Whitty is at her best as the scheming, protective mother. The film does NOT seem too short. Its only fault is an over-reliance on convenient plot devices like a sleeping draught, a nightdress tossed out the window, a mysterious cat, an intercepted letter etc. Yet Lewis's direction is noteworthy for its economy and for the way he generates Hitchcockian suspense without overdoing anything. Three years later, Dame May Whitty would also appear in Columbia's THE SIGN OF THE RAM, in which she embodies a meddlesome busybody. That film and MY NAME IS JULIA ROSS would make a fine double-bill.",
         "Having watched this film strictly on the strength of reviewers' ratings I was most pleasantly surprised. Although clearly low-budget, it bears the signs of clever ingenuity. For example, when Julia wakes in the strange house and looks out the window I found myself thinking that her sense of isolation would be enhanced with an exterior shot focused on her face and then moving backwards to include the house and its isolated location. And lo and behold! the next scene was exactly that last shot of the house standing lonely on the cliff at the water's edge. There are other examples of how a clever director can elevate his film to the level of a very enjoyable thriller. Savvy viewers will surely spot them but should rest assured they will not be disappointed. As to the performances, George Macready is his usual creepy self, barely maintaining his composure while suggesting a capacity for unadulterated violence. Nina Foch was surprisingly good as the no-nonsense working girl who's not about to submit without a fight. But Dame May Witty, oh boy, she even had me doubting my own eyes and believing she could get away with her evil schemes. This a real diamond in the rough and not to be missed.",
         "Second-feature concerns a young woman in London desperate for a job, happy to accept live-in secretarial position with an elderly woman and her son. Thrillers about people being held in a house against their will always make me a little uneasy--I end up feeling like a prisoner too--but this rather classy B-film is neither lurid nor claustrophobic. It's far-fetched and unlikely, but not uninteresting, and our heroine (Nina Foch) is quick on her feet. Rehashing this in 1986 (as \"Dead Of Winter\") proved not to be wise, as the plot-elements are not of the modern-day. \"Julia Ross\" is extremely compact (too short at 65 minutes!) but it stays the course nicely until a too-rushed climax, which feels a little sloppy. *** from ****",
         "A demented little thriller from low-budget genius Joseph H Lewis. It's the film that finally got him noticed in Hollywood. The cinematography is by the great Burnett Guffey and he starts us off with a stunning shot of a rain-soaked street reflecting brilliant sunlight in our eyes. We're in a Hollywood version of England throughout, the whole film is virtually studio-bound. The paranoid plot has Julia kidnapped by a family desperate to cover up a murder by son George MacReady (who calmly slashes up cushions to show us how crazy he is). They pretend to everyone that Julia is the dead wife and that she's lost her mind - that way it'll be no surprise when she turns up dead, the victim of \"suicide\". The plot is imaginative, silly and strange, and Lewis compliments it perfectly with driving camera moves and striking compositions. Check out how Lewis covers three pages of dialogue with half an hour's shooting - a closeup of Julia's eyes, her face masked by MacReady's threatening shoulder...",
         "Nina Foch delivers a surprisingly strong performance as the title character in this fun little Gothic nail-biter. She accepts a position as secretary to a London society dowager (played imperiously by Dame May Witty) and her creepy son (the effete and bothersome George Macready). Before she knows it, she awakens to find herself in a seaside manor she's never seen before, where Witty and Macready are calling her Marian and trying to convince the servants and the nearby townspeople that she's Macready's mad wife. Of course this pair can only be planning dastardly deeds, and even though we know Julia has to eventually escape her trap, director Joseph Lewis builds real suspense in answering the question of just how she'll manage it. \"My Name Is Julia Ross\" has nothing stylistically to set it apart from any number of films that came out at the same time period, but I was surprised by how well it held together despite its shoe-string budget and B-movie pedigree. There are quite a few moments that just may have you on the edge of your seat, and I found myself really rooting for Julia as she caught on to the scheme underfoot and began to outsmart her captors. In any other Gothic thriller, the heroine would have swooned, screamed and dithered, waiting for her hero to come and save her. So I can't tell you how refreshing it was to have the heroine in this film use her brain and figure out how to save herself. Well done. Grade: B+",
         "For those who think of Dame May Witty as the kindly, slightly batty, old lady from Hitchcock's The Lady Vanishes, this movie requires an adjustment. Here, she's anything but kindly or batty. Instead, her son, George Macready is the loony one. Just don't give him a knife, otherwise his eyes light up and no furniture cushion in the house is safe. Now we know what he has in mind for the trapped Nina Foch if he can just get out from under Mother's domineering hand. Really tight little woman-in-danger film that keeps the suspense on high throughout. The script never strays from Foch's dilemma. She's held prisoner in a big old Gothic house on the edge of an angry sea. They're going to kill her, but why. Her predicament makes no sense. The tension mounts as she tries one escape ploy after another, but even strangers seem against her. We begin to feel her helplessness and mounting paranoia as the world turns away from her. Director Joseph H. Lewis took a big step toward cult status with this film and understandably so. Then too, watch Foch run subtly through a gamut of emotions without once going over the top. Witty too shines as a really intimidating matriarch who knows what she wants and how to get it if she can just keep her wacko son in line. My one reservation is the climax which seems too contrived considering the timing of the events. Nonetheless, it's a good, nerve-wracking way to spend a little over an hour, courtesy Columbia studios.",
         "MY NAMES IS JULIA ROSS is a neat little thriller from Columbia later remade in '87 as DEAD OF WINTER with Mary Steenburgen as the unfortunate girl who finds herself prisoner in a strange household. Here it's NINA FOCH who answers an employment agency ad and ends up in a household ruled by DAME MAY Witty and GEORGE MACREADY--and a plan that must have seemed daring and original when the story first appeared in '45. Seems that she wakes up after a drugged night of sleep and finds out she has a new identity--no longer Julia Ross. Macready declares that he's her husband and Dame May Witty calls her by a different name. The two of them are conspiring to keep her there until their ultimate plan is carried out. Foch, of course, intends to get to the bottom of the thing and free herself from their hold on her. What really hurts the story is the manufactured ending which is much too abrupt and too full of coincidence and loopholes to be believable. But still, while you're watching the story unfold, it does have its share of tension and suspense. Personally, I prefer the more elaborately plotted remake with Mary Steenburgen and Roddy McDowall which came along in the '80s, called DEAD OF WINTER.",
         "Julia Ross (Nina Foch) agrees to take a position as a secretary with the rich Hughes family to get over her boyfriend leaving her. Almost immediately she is drugged and shipped off to the family's estate in Cornwall. When she awakens they keep telling her she's Marion Hughes, has been mentally ill and keep her locked up...but why? You'll probably guess why but won't mind because this one is fun. Along with \"The Narrow Margin\" and \"Face Behind the Mask\" this is one of the best B pictures ever made. (B pictures were low budget pictures made quickly with low budgets and no major stars). It's just as long as it needs to be (only 65 minutes), is well-directed, fast paced and exciting. It only stumbles at the end which I found a bit too implausible to buy. Foch (a good actress) is just OK in the lead but Dame May Witty is great and George Macready is excellent (and frightening) as the villains. Well worth catching. A perfect example of how you can make a great movie on a small budget.",
         "This was a typical grade B movie in 1940s Hollywood and yet it succeeded way beyond its expectations. Why? It has a wonderful plot and backed up by Nina Foch, George MacReady and Dame May Witty, as a female villain, of all people. When a young lady answers an advertisement for a secretary, she certainly gets more than she bargained for. The only talents her employers are seeking are those which will lead to her demise. Seems that Witty and MacReady want to pass her off as their daughter-in-law and wife, respectively. MacReady killed his real wife and wants to do Foch in as well so that a body can be claimed. The film deals with how Foch tries to get town people to believe her and how she is thwarted in practically everything she does. Why don't people believe her?"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Julia Ross secures employment, through a rather-noisy employment agency, with a wealthy widow, Mrs. Hughes, and goes to live at her house. Two days later, she awakens in a different house in different clothes and with a new identity. She is told she is the daughter-in-law of Mrs. Hughes and has suffered a nervous breakdown. She soon learns that the son of Mrs. Hughes, Ralph, has murdered his wife, disposed of her body and, with his mother's help, plans to pass Julia off as his wife. And then plans to eventually kill her and pass it off as a suicide.",
         "Julia Ross is a young woman alone in the world and is in search of a job. She is hired by an elderly woman named Mrs. Hughes to act as her live-in personal secretary. One of Mrs. Hughes' stipulations is that whomever she hire treat this job as one of a long term nature, meaning no current boyfriends or marriage on the horizon. The closest person to Julia was Dennis Bruce, who lived at the same boarding house and who was somewhat sweet on Julia but left to get married to another woman. As such, Julia is grateful for her new job. When Julia awakens after her first night at the Hughes home, she learns she has been asleep for two days. She is no longer in the urban London home she knows as Mrs. Hughes' home, but rather a sprawling and isolated estate by the sea in Cornwall. All evidence of her being Julia Ross has disappeared. And everyone in the house, including Mrs. Hughes, Mrs. Hughes' son Ralph, and all the household servants, try to convince her that she is Marion Hughes, Ralph's wife who is recovering from a nervous breakdown. Julia is certain of who she is, and suspects the Hugheses are going to kill her for whatever reason. Julia is alone with no one to support her claim and thus help her as the Hugheses have made her seem crazy to whomever she has spoken. However, initially unknown to the Hugheses, Dennis Bruce, who ended up not getting married, returned to the rooming house just before Julia's departure and made a date with her. Since she didn't keep the date, he goes looking for her."
      ],
      "budget": 175000
   },
   "movielensId": 89767,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1945-11-08",
      "dvdReleaseDate": null,
      "directors": ["Joseph H. Lewis"],
      "runtime": 65,
      "movieId": 89767,
      "title": "My Name Is Julia Ross",
      "mpaa": "",
      "actors": [
         "Nina Foch",
         "Dame May Whitty",
         "George Macready",
         "Roland Varno",
         "Anita Sharp-Bolster",
         "Doris Lloyd",
         "Queenie Leonard",
         "Joy Harington",
         "Leonard Mudie",
         "Ottola Nesmith"
      ],
      "imdbMovieId": "0037932",
      "originalTitle": "My Name Is Julia Ross",
      "genres": ["Mystery"],
      "youtubeTrailerIds": [],
      "plotSummary": "Julia Ross secures employment, through a rather nosy employment agency, with a wealthy widow, Mrs. Hughes, and goes to live at her house. 2 days later, she awakens - in a different house, in different clothes, and with a new identity. She's told she is the daughter-in-law of Mrs. Hughes, and has suffered a nervous breakdown. I'd Julia really 'Julia', or, is it true, that she's lost all memory of who she is?",
      "tmdbMovieId": 42077,
      "avgRating": 3.4,
      "releaseYear": "1945",
      "numRatings": 10,
      "posterPath": "/hWFHSFz3MA0TREQSGvuzMDhPZIZ.jpg"
   }
}