{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "ex husband",
            "id": 5982
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         }
      ],
      "imdb_id": "tt0436639",
      "video": false,
      "title": "Green Chair",
      "recommendations": [
         61952,
         25660,
         142499
      ],
      "backdrop_path": "/9o8nJjj9AWk4tD6IVgk46qdqWP8.jpg",
      "revenue": 2000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kim Mun-hee",
               "gender": 1,
               "credit_id": "52fe43f79251416c9100091f",
               "name": "Suh Jung",
               "profile_path": "/zP8OZLLYp40eRTVvFTu1q8P4rsf.jpg",
               "id": 69698,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Seo-hyun",
               "gender": 0,
               "credit_id": "52fe43f79251416c91000923",
               "name": "Shim Ji-ho",
               "profile_path": "/zRndAUmRBymuSygd77OPFXjGnKy.jpg",
               "id": 105612,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Su-Jin",
               "gender": 1,
               "credit_id": "52fe43f79251416c9100092d",
               "name": "Oh Youn-hong",
               "profile_path": "/qiYaTmWfoaX8OCK8KHH9yB8oDi9.jpg",
               "id": 927756,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Seo Hyun's mother",
               "gender": 1,
               "credit_id": "55b380469251411e18011ca6",
               "name": "Kim Hye-ok",
               "profile_path": "/7aCdBpxidYt0MhVCN47iqAcJ97w.jpg",
               "id": 145363,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Journalist",
               "gender": 0,
               "credit_id": "55b380ccc3a3682ff9010dfa",
               "name": "Jun-han Kim",
               "profile_path": null,
               "id": 1109732,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe43f79251416c91000929",
            "name": "Park Chul-soo",
            "profile_path": null,
            "id": 105617,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.851793,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 30043,
      "vote_count": 11,
      "budget": 0,
      "overview": "When an ordinary housewife is convicted for seducing a minor, reckless love leads to obsession and creeping doubt. Mun-hee (Seo Jung), a married woman in her thirties, has been arrested and convicted for having sex with an underage, Hyun. After being sentenced for 100 hours os social work, Mun-hee is released only to find reporters hungry to sell her story to the press, and among them, Hyun is standing alone. Leaving those hyenas, the two head for nowhere and stop at a small hotel. Day and night they indulge into each other through endless sex. After 5 days of sex and enjoyment, Mun-hee undergoes extreme changes of emotion, and suddenly says goodbye to Hyun. However, Moon-hee finds herself still lingering on to Hyun...",
      "similar": [
         281007,
         449176,
         398818,
         41357,
         376660,
         9779,
         2105,
         112160,
         85350,
         84892,
         14,
         8055,
         10229,
         391713,
         76726,
         11421,
         43923,
         340485,
         308369,
         26371
      ],
      "original_title": "녹색 의자",
      "runtime": 98,
      "poster_path": "/kQnA6T17qqXdSnjHdBJybD0ZGc8.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Park Chul-Soo Films Ltd.",
         "id": 6636,
         "origin_country": ""
      }],
      "release_date": "2005-06-10",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Cheol-su Park"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Jun-han Kim",
         "Cheol-su Park"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt0436639/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0MDcwNTA5NV5BMl5BanBnXkFtZTgwNjU4ODkwMzE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Jung Suh, Ji-ho Shim, Yun-hong Oh | See full cast and crew »"],
      "reviews": [
         "After witnessing Cheol-su Park's few intriguing cinematic jolts, I knew this film would at least be as fascinating as his other work, even if not easily and visually digestible to a human eye. It starts out with the release of the woman convicted of having sex with a minor. After a little heckle from the reporters the young man approaches and we see their long awaited reunion and their total carelessness toward the swarming of the press. The remainder of the film showcases their insatiable lust for sex, Hyun's Iron Chef-like cooking abilities and Mun-hee's new duty as a social worker in a mental house for elders. They also have few struggles and debates regarding their future but instead of drilling us with heavy sentimentality they make everything work with simple humor and their natural chemistry. My only complaint is that perhaps they could have showed us how they actually hit it off, but I guess that's already obvious and would only prolong the good pacing of the film. There are moments when you are about to rule out the believability of a certain situation, but just as you might, the director reveals it to be an imagination sequence, which really helps the film to highlight the realistic modesty of their unique relationship. The final scene in particular was a very refreshing way to a end a film which could have gone into many different directions. It's not completely conclusive and satisfying, but it's neither frustrating, forced nor depressing, which is why I ultimately enjoyed this film, because that's just how life is sometimes. I only wish that Lifetime movies dealing with forbidden sex were this insightful and stimulating, but that would be like wishing for Hollywood to stop remaking Asian films.",
         "The love story among a grow up woman and an under aged guy. The movies starts from the moment she is released from jail, and follows the next steps of the love, and sex, affair. In the surrealistic ending of the movie, all the main characters are called to express their point of view on the uncommon relation of the couple. Even though not formally perfect, this movies scores a point. It gives a great representation of sex as joy and communication, without being too-sweetly romantic. Nothing is \"stolen\" to any one, no tragic-ending is waiting there to punish people that give themselves to passion. It gives a new, and joyful, point of view to the whole thing. Deserves to be seen...",
         "The director being Park Chul-soo (301/302) and the plot being compared to the media-blitzed saga of Mary Kay Letourneau, it was hard to have any definite preconceptions about this film. Still, I didn't expect such humanity and, more importantly, the scope of the central relationship, which conveys the romantic idea that love is knowing and loving every last thing about your partner. Those expecting kinkiness and power dynamics will be disappointed, as the relationship is a model of unusual egalitarianism, and the sex scenes only confirm this. Their connection, rocky at first, becomes ever more real and intimate, even when faced with a Greek chorus of outsiders who would condemn their union. Also, a lot of hot sex scenes and a lot of tension-breaking humor. A true and real romance, highly recommended.",
         "Green Chair is a good movie that has a good combination of drama and eroticism. The story is about a male High School and his relationship with a female divorcée.It centers on the progress of that relationship from a sexual-oriented love affair to a love relationship.It has entertaining sex scenes. The film was a psychological movie that is not for everyone as it is not meant to entertain but rather for the audience to see the character development between the main characters. The acting is commendable as Su Jung excels as the female divorcée.While the rest of the cast are decent. I would recommend this to anyone who wants another view at a May-December affair especially when maturity comes into place."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Park Chul-Soo Films Ltd."],
      "summaries": [
         "Kim Mun-hee is a 32 year old divorced woman. She eventually engages in an affair with 19 year old Seo-hyun, who considers Kim to be his first love. However, according to Korean law, when it comes to sex, you are not of full age until 20. Kim is arrested and has to spend a few days in prison for seduction of minors, before she is set free and sentenced to do some hours of community service. After being released, the press and Seo-hyun wait for her outside of the prison. Mun-hee and Seo-hyun rent a room and stay there for some time, where they spend almost all of their time having sex. Mun-hee slowly starts to understand that this kind of relationship won't work forever, and wants to split up with Seo-hyun. But the boy insists that he really loves her, and that he won't let her go. The two find shelter at the home of a friend of Mun-hee, Jane",
         "When an ordinary housewife is convicted for seducing a minor, reckless love leads to obsession and creeping doubt."
      ],
      "budget": 1500000
   },
   "movielensId": 90019,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2005-06-10",
      "dvdReleaseDate": "2007-09-25",
      "directors": ["Park Chul-soo"],
      "runtime": 98,
      "movieId": 90019,
      "title": "Green Chair",
      "mpaa": null,
      "actors": [
         "Suh Jung",
         "Shim Ji-ho",
         "Oh Yun-Hong",
         "Kim Hye-ok",
         "Jun-han Kim"
      ],
      "imdbMovieId": "0436639",
      "originalTitle": "녹색 의자",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When an ordinary housewife is convicted for seducing a minor, reckless love leads to obsession and creeping doubt. Mun-hee (Seo Jung), a married woman in her thirties, has been arrested and convicted for having sex with an underage, Hyun. After being sentenced for 100 hours os social work, Mun-hee is released only to find reporters hungry to sell her story to the press, and among them, Hyun is standing alone. Leaving those hyenas, the two head for nowhere and stop at a small hotel. Day and night they indulge into each other through endless sex. After 5 days of sex and enjoyment, Mun-hee undergoes extreme changes of emotion, and suddenly says goodbye to Hyun. However, Moon-hee finds herself still lingering on to Hyun...",
      "tmdbMovieId": 30043,
      "avgRating": 2.75,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/kQnA6T17qqXdSnjHdBJybD0ZGc8.jpg"
   }
}