{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "opera singer",
            "id": 164920
         }
      ],
      "imdb_id": "tt0043053",
      "video": false,
      "title": "The Toast of New Orleans",
      "recommendations": [],
      "backdrop_path": "/6uXwIhR2sITuB0GL8dPTazUobo8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Suzette Micheline",
               "gender": 1,
               "credit_id": "52fe4845c3a36847f815f29f",
               "name": "Kathryn Grayson",
               "profile_path": "/nQMdc5MqaePfSE7tmtiIaLGUA6X.jpg",
               "id": 82407,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pepe Abellard Duvalle",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2a3",
               "name": "Mario Lanza",
               "profile_path": "/kpakuiivHcQdydXlxrIlo5EhwZH.jpg",
               "id": 232024,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jacques Riboudeaux",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2a7",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nicky Duvalle",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2b1",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2b5",
               "name": "James Mitchell",
               "profile_path": "/jr1tVqkgnUScgfbRBCC4rMR1Cce.jpg",
               "id": 100918,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Maestro P. Trellini",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2b9",
               "name": "Richard Hageman",
               "profile_path": null,
               "id": 88673,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Oscar",
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2bd",
               "name": "Clinton Sundberg",
               "profile_path": "/ird4IaorvWN07a4CBQmy6Xl7oL.jpg",
               "id": 94112,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mayor",
               "gender": 2,
               "credit_id": "52fe4846c3a36847f815f2c1",
               "name": "Sig Arno",
               "profile_path": "/mG2lMhpjvVkQBdZekHwP6Dr0MQA.jpg",
               "id": 48064,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe4846c3a36847f815f2c5",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Manuelo",
               "gender": 2,
               "credit_id": "52fe4846c3a36847f815f2c9",
               "name": "Romo Vincent",
               "profile_path": "/9VgRtGWzJKtx5Bp3PFIBJs5SQOL.jpg",
               "id": 120307,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4845c3a36847f815f2ad",
               "name": "Norman Taurog",
               "profile_path": "/nDz17mvGRWV4BeJwgr9FVq1xIGH.jpg",
               "id": 82800,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4846c3a36847f815f2cf",
               "name": "Sy Gomberg",
               "profile_path": null,
               "id": 343201,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4846c3a36847f815f2d5",
               "name": "George Wells",
               "profile_path": null,
               "id": 19094,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5542c009c3a3680cdb0005c7",
               "name": "William E. Snyder",
               "profile_path": null,
               "id": 41709,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5542c0139251415876000579",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5542c024c3a3680cdf00058f",
               "name": "Joe Pasternak",
               "profile_path": "/gAAbsb5OoV0NVlQ13ScOwq7sXz0.jpg",
               "id": 94115,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5542c033c3a3680cd90005b7",
               "name": "Walter Plunkett",
               "profile_path": null,
               "id": 11491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5542c03ec3a3680cd90005b9",
               "name": "Helen Rose",
               "profile_path": null,
               "id": 3647,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5542c066925141586100058c",
               "name": "Gene Ruggiero",
               "profile_path": null,
               "id": 19409,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5542c072925141587600057e",
               "name": "Daniel B. Cathcart",
               "profile_path": null,
               "id": 1012327,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5542c081c3a3680ce6000639",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.292467,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52847,
      "vote_count": 3,
      "budget": 0,
      "overview": "Snooty opera singer meets a rough-and-tumble fisherman in the Louisiana bayous, but this fisherman can sing! Her agent lures him away to New Orleans to teach him to sing opera, but comes to regret this rash decision when the singers fall in love.",
      "similar": [
         872,
         11224,
         224141,
         14128,
         16119,
         15121,
         11970,
         812,
         824,
         8587,
         10020,
         11631,
         621,
         703,
         3933,
         196867,
         114,
         252,
         10882,
         10530
      ],
      "original_title": "The Toast of New Orleans",
      "runtime": 97,
      "poster_path": "/3nqEdseQw6TAnq3HZZGPywKUz4f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1950-08-24",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "M-G-M's Technicolor fiesta!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Taurog"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Sy Gomberg",
         "George Wells"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043053/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MzM3NDY0N15BMl5BanBnXkFtZTcwODE4NTAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kathryn Grayson, Mario Lanza, David Niven | See full cast and crew »"],
      "reviews": [
         "I've watched this film more than 50 times, and as much as I watch as much as I like best. Mario Lanza was just unique, I agree that he did not educated his voice enough, but his natural voice was so wonderful, none of the best tenors hadn't his magnificent voice, is enough to know that Mo. Toscanini said that was \"The Voice of the Century\". This film is fresh and light and romantic, Mario's performance of \"Be my love\" as a duet is nice too, and \"Madame Butterfly duet\" is the greatest I've ever heard. David Niven, J. Carroll Naish and Rita Moreno, each one in the role they played are just wonderful too. Mario Lanza should be in the opera stage but if so, common people didn't had the opportunity to be delight with opera.",
         "With the success that Mario Lanza and Kathryn Grayson had in That Midnight Kiss, MGM knew it had a box office team of appeal. The following year the two of them moved from contemporary Philadelphia to pre-World War I, New Orleans. People paid their money to hear Mario sing and really didn't care about the plots of his films. Lanza was cast as an opera singing truck driver in That Midnight Kiss, as an opera singer drafted into the army in Because You're Mine, and the greatest opera singer of all in The Great Caruso. I think we can see a pattern forming here. In The Toast of New Orleans Lanza plays a shrimp fisherman who works on the boat with his uncle J. Carrol Naish. When opera singer Kathryn Grayson comes to town, Lanza boisterously and impulsively joins her in a duet of Be My Love. Her manager and New Orleans opera kingpin, David Niven is as impressed as everyone else was in 1950 with Mario's voice. He's even willing to overlook to some extent the fact he's moving in on Grayson. Acting wise The Toast of New Orleans is no strain on anybody. Mario and Kathryn play a pair of singers and Mario as in all of his films, just played himself. It's interesting that the only times he attempted to play a role from classic operetta, The Student Prince and The Vagabond King it didn't work out for him. As for David Niven, he's as debonair and charming as he always was. Niven carried more films on the strength of his charm than any other star in the sound era. But no one worried about acting and a plot in this film. Like That Midnight Kiss, The Toast of New Orleans has a nice mixture of classical opera and some good songs by Nicholas Brodzsky and Sammy Cahn to round out a very full score. One of the songs, Be My Love, became Mario Lanza's signature song, his biggest selling record on RCA Victor Red Seal label. You could not go ANYWHERE in 1950 without hearing Be My Love coming out of some radio. Be My Love was nominated for Best Song in 1950, but lost to Mona Lisa. Norman Taurog directed Mario in this film, he had previously won an Oscar for Skippy and had directed Spencer Tracy to his second Academy Award in Boy's Town. Taurog was an interesting choice for a director to pilot a picture with a personality like Lanza. Later on Taurog would end his career directing nine of Elvis Presley's feature films, another instance of him directing a mega-pop personality successfully. The Toast of New Orleans is for Mario Lanza fans everywhere and this review is dedicated to my father who was a big fan.",
         "\"Toast of New Orleans\" is an interesting little period musical, an admirable vehicle for Mario Lanza and his opera songs. This is my third Lanza musical after \"Because You're Mine\"(1952) and \"For the First Time\"(1959) and so far it is my favorite. In spite of being an MGM musical, \"Toast of New Orleans\" is more in line with the nostalgic period froths and extravaganzas that were common at the Fox studio. The Technicolor and period costumes here are as enchantingly garish and gorgeous as those at Fox. Lanza plays a Bayou fisherman who is discovered by David Niven and falls in love with a fellow opera star named Suzette played by Kathryn Grayson. I found their love scenes somehow cold and unmemorable; however, the songs \"Be My Love,\" and some arias from Madame Butterfly, Carmen, and La Traviata are sublimely potent and unforgettable.",
         "Using the formula that worked so well in \"That Midnight Kiss,\" Mario Lanza, this time one Pepe Duvalle, is again discovered by someone with connections to the opera world while he's singing his heart out doing his normal job. Here he's a bayou fisherman, but after the loss of their boat, Pepe and his Uncle Nicky (J. Carrol Naish) head to New Orleans to look up the opera director (David Niven) who offered Pepe an opportunity after hearing him in the village when Pepe joins his prima donna (Grayson) in song. Pepe finds himself in love with the somewhat cold diva, who is being pursued by Niven. Lanza is in fine form as a crude, loud, uneducated man who, in order to fit into New Orleans society and the opera world, has to learn manners, as well as how to dance and dress. A natural actor, he makes his complete transformation believable. He sings Jose's aria from \"Carmen\" beautifully, and this film introduces his hit, \"Be My Love\" to audiences, which he sings with Grayson. With the diminutive soprano, he also does \"Libiamo\" from \"La Traviata.\" In the days in which this story is set, a singer like Grayson would have sung \"Traviata,\" though audiences aren't used to hearing a fluttery coloratura sing it any longer. The two perform the love duet from \"Madama Butterfly\" as well - an absolutely horrid choice for Grayson, calling for a much weightier voice. Obviously the repertoire was chosen with Lanza in mind. Had MGM not used \"Lucia\" in \"That Midnight Kiss,\" they could have perhaps used it here. Grayson gets to use her high extension in \"Je suis Titania,\" but the rest of the aria suffers from pitch difficulties. Lanza really helped to commercialize opera in the United States, but he did it without the help of MGM. Is it necessary for Niven to give the wrong explanation for the duet \"La ci darem la mano?\" And why, during the Butterfly duet, which is total foreplay, does Grayson constantly try to get away from Lanza? No matter her personal feelings, she was on stage playing a role. Grayson looks lovely in an assortment of magnificent gowns and hats, and if her voice doesn't match Lanza's, it doesn't mean she could not have sung opera, which is often the criticism. There is definitely a place for coloratura sopranos in the opera world - just not singing with spinto tenors. J. Carrol Naish plays an embarrassing, annoying stereotype as Uncle Nicky; Niven is wonderful, if underused, and his perfect voice and smooth manners are in great juxtaposition to Lanza's bumbling Pepe. James Mitchell, known to soap opera audiences now as Palmer Courtland on \"All My Children\" has a good featured part as a friend of Pepe's from the bayou, and he and a very young Rita Moreno, who's in love with Pepe, do a spirited dance number. Lanza's reign at MGM was disappointingly short, and yo-yo dieting and drinking would claim his life nine years after this film. But what years, in which he gifted the world with his fresh, passionate, Italianate sound and thrilled millions of people all over the world.",
         "This is without a doubt the most consistently cheerful of Lanza's movies, and a real hoot. Mario's hitherto unknown comedic skills are a big surprise, and the supporting cast of J Carroll Naish and David Niven is wonderful. I wish I could say the same for co-star Kathryn Grayson, but her shrill coloratura, grating vibrato and minimal acting skills make her a poor match for Lanza. This is the film that introduced Lanza's signature song, Be My Love. The scene in which the song is first sung (as a duet between Grayson and Lanza) is great fun to watch, with both singers trying to outdo the other. The Madama Butterfly Love Duet scene is even better, as Lanza throws caution to the wind and shows Grayson the true meaning of PASSION. Were it not for Grayson, the movie would merit the highest evaluation. Despite this one casting flaw, Toast of New Orleans is an excellent vehicle for newcomers to opera. Like the man himself, Lanza's screen character's lusty ways and thorough lack of pretentiousness are a breath of fresh air, and he sings impressively throughout. Highlights include the Libiamo (much better than his commercial recording), a gorgeous Bayou Lullaby and the aforementioned Butterfly Love Duet. Following this movie, Lanza would go on to star in The Great Caruso, the pinnacle of his movie career and the film that has influenced more singers than any other in cinematic history.",
         "Mario Lanza's second film bursting with energy and musical talents with Kathryn Grayson in old New Orleans. Mario is discovered by David Niven and teamed up with Kathryn and they are the Toast of New Orleans. Mario is the scruffy seaman and his partner J. Carrol Nash, who provides the comedy. The music includes arias from Aida, Madame Butterfly, and La Boheme, etc. Mario does imitations of various people and this is a delight to all. The glorious voice of Lanza still lingers on!",
         "This is a variation on the much repeated love story in which a cloistered upper class girl must choose between marrying a safe but dull man of her class or a dashing Romeo rogue. Examples include some of MGM's most popular films of the '30s and '40s,such as \"Gone with the Wind\", \"Captain Blood\" and \"The Adventures of Robin Hood\", as well as the poorly received musical \"The Pirate\". In \"The Belle of New York\", Fred Astaire's character incorporates both of these elements. Thus, the conflict for Vera Ellen involves trying to reformulate his character so as to bring out the best mix for her(every woman's fantasy!).That is also what this love story is about:making a gentleman as well as a talented opera singer out of a boisterous rough hewn bayou fisherman with a golden singing voice(Mario Lanza), without making him too dull and unromantic. The film begins with the festivities surrounding the annual blessing of the fishing fleet of a small early 20th century bayou fishing village. Evidently, the village mayor has contracted to have an opera star(Kathryn Grayson) and her manager/escort(David Niven) arrive for this festival. Mario spends too long looking at the beautiful Kathryn and grounds his uncle's boat so that they miss having it blessed with holy water: a bad omen, as things turn out. Mario wants to impress Kathryn the only way he knows how: by impulsively joining in her song, and later practically forcing her to join in the local folk dance. This makes Kathryn look foolish twice over. Is that any way to catch a woman of her upper class breeding? Certainly not, but subsequent events might make her change her mind. After his uncle's boat is wrecked in a storm, Mario reluctantly gives up fishing for a possible career as an opera singer.He is groomed as Kathryn's costar, but only after he gets an education on how to behave around upper class opera patrons. His relationship with Kathryn ocillates from cold to warm and back. She is a very difficult woman to consistently please or figure out! Meanwhile, they both do much singing, solo and as a duet, not actually a lot of heavy opera until the finale \"Madame Butterfly\" performance. At one point, Kathryn asks the unemotional Niven to marry her, apparently to resolve the conflict in her mind about how to respond to Mario's strong romantic overtures. Now, for the very puzzling behavior of Kathryn during and after their \"Madame Butterfly\" love duet. Obviously, she often looks very anguished and is trying to push Mario away during most of this performance, in contrast to what she should have been doing. Some have interpreted this as the real Kathryn reacting to the real Mario, reflecting her well known aversion to his advances toward her, garlic eating, and other rude behaviors between takes. I can't believe MGM would allow this to show so blatantly, although it may have been a contributing factor. Rather, I favor the following interpretation as being the dominant explanation: Before this performance, Kathryn, as well as several of Mario's village friends complain that he has become too much of a gentleman, afraid of showing his impulsive rogue persona that village girls found so irresistible. Basically, she's playing hard to get, again, hoping the old Mario will break through his gentlemanly facade to sweep her off her feet. Meanwhile, Mario has gotten a hint from Niven that he should do this. Symbolically,this happens in his forceful treatment of her during their duet, a subsequent chase around the stage area, and when he breaks through her locked dressing room. End of story. Yes, Kathryn's character was a complicated and difficult woman to fathom, which some reviewers interpret as bad acting. Not so! I found J Carrol Naish an entertaining and sometimes hilarious 'sidekick' for Mario, providing comedic relief throughout, along with the Mario-Kathryn unlikely pairing comedy. His character remained unimpressed with NO high society culture,refusing to be transformed by it, as Mario had been. Naish had been incorporated into several of Fox's high profile Latino-oriented musicals of the early '40s, again as a somewhat humorous supporting character. David Niven retains his British upper class reserve and charm throughout, as Kathryn's chaperon, overseer and probable lover: the alternative safe choice for Kathryn as a husband.",
         "Mario Lanza only did 10 movies, and only two with Kathryn Grayson. She could not get along wt him due to his temper and alcohol abuse. That is a real shame as the two together on the Oscar-nominated \"Be My Love\" was pure magic. (It lost to \"Mona Lisa\" in another crash of Academy voters.) Current moviegoers can hear Lanza sing in Zodiac or The Polar Express, but why settle for one song when you can enjoy a half dozen by this wonderful tenor. Those who think of Pavarotti when they think of tenors, will be surprised by Lanza's looks. He is more like Sly Stallone with good looks that the typical rotund singer. This movie was a joy to behold as it was funny and sweet. The great David Niven (Separate Tables, Eye of the Devil) was fantastic.",
         "David Niven discovers Mario Lanza, a Cajun fisherman who leaves the Bayou and falls in love with opera singer, Kathryn Grayson. Lushly photographed in the usual grand MGM manner of gaudy costumes and lots of background color, the simple storyline serves as an excuse to have Lanza belt out some ringing tenor numbers and blend his voice with Grayson for some tuneful arias. Opera fans will love it--others beware! The humor gets a bit overdone with J. Carrol Naish straining for laughs and there's only a glimpse of Rita Moreno in a dance number. But brimming over with arias from \"Carmen\", \"La Traviata\" and \"Martha\", music lovers should have no complaints. Lanza and Grayson are both in fine voice and one would never suspect that she soon tired of his boorish antics on the set and would later refuse to co-star with him when MGM wanted her to do one more film with Lanza.",
         "Hokey almost beyond belief but also bright and colorful this can be enjoyed in a mindless way. The story is meaningless anyway since the picture serves merely as an excuse to highlight both Kathryn Grayson and Mario Lanza's voices and on that basis it succeeds well. As for the rest of the movie it provides a very young Rita Moreno one of her first roles of any size as Mario's wharf-side spitfire girl, she performs well and has a nice dance number with James Mitchell. David Niven does what he can to make something out of his nothing role as Kathryn's benefactor and his dignity does much to balance out the overacting hamminess of J. Carrol Naish's Uncle Nicky. The real reason to watch this though is a great deal of good music highlighted by the beautiful Be My Love."
      ],
      "genres": ["Musical"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Snooty opera singer meets a rough-and-tumble fisherman in the Louisiana bayous, but this fisherman can sing! Her agent lures him away to New Orleans to teach him to sing opera, but comes to regret this rash decision when the singers fall in love."],
      "budget": 0
   },
   "movielensId": 90172,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-08-24",
      "dvdReleaseDate": "2007-07-24",
      "directors": ["Norman Taurog"],
      "runtime": 97,
      "movieId": 90172,
      "title": "The Toast of New Orleans",
      "mpaa": "",
      "actors": [
         "Kathryn Grayson",
         "Mario Lanza",
         "David Niven",
         "J. Carrol Naish",
         "James Mitchell",
         "Richard Hageman",
         "Clinton Sundberg",
         "Sig Arno",
         "Rita Moreno",
         "Romo Vincent"
      ],
      "imdbMovieId": "0043053",
      "originalTitle": "The Toast of New Orleans",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Snooty opera singer meets a rough-and-tumble fisherman in the Louisiana bayous, but this fisherman can sing! Her agent lures him away to New Orleans to teach him to sing opera, but comes to regret this rash decision when the singers fall in love.",
      "tmdbMovieId": 52847,
      "avgRating": 2.75,
      "releaseYear": "1950",
      "numRatings": 2,
      "posterPath": "/3nqEdseQw6TAnq3HZZGPywKUz4f.jpg"
   }
}