{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "migration",
            "id": 1729
         },
         {
            "name": "immigration",
            "id": 1900
         },
         {
            "name": "agriculture",
            "id": 5888
         },
         {
            "name": "latinx lead",
            "id": 9310
         },
         {
            "name": "food",
            "id": 10637
         },
         {
            "name": "human rights",
            "id": 18339
         },
         {
            "name": "pesticide",
            "id": 18378
         },
         {
            "name": "environment",
            "id": 33577
         },
         {
            "name": "children's rights",
            "id": 33580
         },
         {
            "name": "migrant farmworker",
            "id": 33582
         },
         {
            "name": "labor",
            "id": 33585
         },
         {
            "name": "child labor",
            "id": 33587
         }
      ],
      "imdb_id": "tt1981703",
      "video": false,
      "title": "The Harvest (La Cosecha)",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4816c3a368484e0e8bbd",
            "name": "U. Roberto Romano",
            "profile_path": null,
            "id": 232190,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.0075,
      "production_countries": [],
      "id": 70875,
      "vote_count": 0,
      "budget": 56000,
      "overview": "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.",
      "similar": [
         16427,
         282297,
         124075,
         294682,
         62323,
         305140,
         230421,
         472817,
         40090,
         114562,
         166184,
         98616,
         439728,
         303973,
         459189,
         339519,
         230038,
         130905,
         388279,
         350735
      ],
      "original_title": "The Harvest (La Cosecha)",
      "runtime": 80,
      "poster_path": "/6btGmzZzHJm4nS7cafJDKjBX8GN.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-07-29",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.facebook.com/theharvestfilm",
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["U. Roberto Romano"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1981703/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNjcwODQyOF5BMl5BanBnXkFtZTcwMjMyOTExNg@@._V1_SX214_AL_.jpg",
      "actors": [],
      "reviews": [
         "\"The Harvest (La Cosecha)\" is a documentary directed by U Roberto Roman which premiered on July 11, 2011. The film exposes the lives of the people responsible for collecting most of the produce consumed in the United States. People who live in urban areas are often completely unaware of the living and working conditions of these families. Nonagricultural workers are protected by more strict labor laws. Agricultural workers are not entitled to a minimum wage, overtime pay, or limits on hours worked per day. It is also legal for children to work in fields that have dangerous levels of pesticides. Families who pick produce have to migrate to different states to follow the harvest and continue working. Entire families work 12-14 hour days to make, on average, a combined income of $17,500 per year. Children of these families have a severely reduced access to consistent education. Migrating several times per year equates to transferring schools more than once a year. Hours out of school are reserved for work, which leaves little time and energy for homework. This way of life is often a cycle from one generation to the next. Economic pressure leads to a high drop-out rate among the children. This film brings light to the injustice of the lives of these families. In the United States 400,000 children work conditions of high pesticides, heat, and strenuous labor that pose a detriment to their health and ability to develop. These families should be protected by labor laws. The Documentary is simply a look into the lives of three migrant families over a one year period. Scenes from each family focused mainly on the life of one of the children. Zulema Lopez Victor Huapilla, and Perla Sanchez were the focus characters of the film. These families travel to different states several times a year to follow the harvest. The film shows the specific hardships faced by these three families, including pesticide poisoning, hunger, lack of access to consistent education, a stable home, unemployment, general depression, poverty, excessive work days, and exhaustion. The film also focuses on the emotions, hopes, and dreams of the parents for their children and of the children for their futures. Zulema started picking crops before she can remember. In the beginning of the film she expresses deep distress for her families' way of life. She isn't sure if her families' way of life allows her to dream. Helping her family out at $64 a week takes precedence over her studies. She desires to go to school and have a life more similar to her friends. Her work frustrates her and sometimes she wants to quit and refuses to work for several hours. Zulema's mother wants her to go to school so she can have a different life. At the end of the film, after leaving her life for nine months, voluntarily returns to her family with a new attitude. Her concluding statements reveal that she still hasn't found a dream or a reason to. After being given the opportunity to have a different life, she embraces the lifestyle she was born into because she works alongside her family. She comes to peace with her life. Perla's emotions about her family profession are similar to Zulema's. She is very unsatisfied with her life and dreams of going to college to help other migrant farm workers. She feels very hopeless because she has already been held back in school as a result of her grades not transferring while her family was following the harvest. Perla expresses the discrimination her family has faced as migrant farm workers. Her brother bleed to death because he was refused treatment at a hospital because of their minuscule income. Her family faces unemployment, her mother is diagnosed with cancer, and her father also becomes ill. Still through all these hardships, toward the end of the film she becomes more hopeful. Victor is much less emotionally distressed by his families' way of life. He migrated from Mexico to the United States with his parents and younger sisters. He is happy to work with his parents because it allows his younger siblings to go to school. In the beginning of the film, he and his parents are saving money so his two older sisters can come to live with them. They achieve their goal during the course of the film but the great expenditure consumes the families' funds needed to follow the harvest. Although they are hungry during this time of unemployment, they are very grateful to have a better life and be unified. Victor is proud of his work and doesn't seek glamor out of life. He just wants to be able to sustain himself and his family. The film conveys first-hand information about the living conditions of migrant farm workers. This information is important because it give insight into the injustice allowed by United States labor laws for Agricultural workers. Most people in Urban America are unaware that children in the United States live under these conditions and assume that it is illegal.",
         "The Harvest / La Cosecha follows the lives of three young people and their families as they support themselves, following the harvest and picking the fruits and vegetables that populate our breakfast, lunch and dinner plates. One cannot help appreciating, if only partly, the grinding and dispiriting challenges these children and their families face on a regular basis. While the film does not admonish those of us who are comparatively blessed for not caring or doing more, it's possible a person who has looked upon migrants with disregard or even contempt might feel the film aims to induce feelings of guilt in its audience. Regardless, what the film actually does is depict migrant life and the toll this nomadic and precarious existence takes on childhood development and opportunity. It is similar to a 2001 documentary about migrant farm workers, In The Land Of Plenty, in that such films do not offer policy prescriptions for making the lives of migrants better, but instead they lay the foundation upon which the policies of a just and equitable society may be built, by bringing to light and to focus that which is normally out of sight and out of mind. La Cosecha's closing credits are interspersed with portraits of a handful of very successful people, e.g. a businesswoman and a neurosurgeon, who grew up in the fields. While these persons' biographies are individually inspirational, in the context of this documentary, they are a reminder of how so very few who run this gauntlet emerge unscathed by the obstacles portrayed in the film - breathing pesticides, missed school, families unable to help with school work, families broken apart by economic circumstances and legal obstacles, persistent economic uncertainty and attendant psychological stress, etc. In the film's final scene, a toddler walks along a row of plants, stoops over, and picks up a cucumber as big as her arm. Such bucolic imagery is normally the stuff of fond childhood memories, and La Cosecha leaves one hoping that for this little one, that's all it will ever be."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Globalvision",
         "Romano Film & Photography",
         "Shine Global"
      ],
      "summaries": ["The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America."],
      "budget": 560000
   },
   "movielensId": 90355,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-07-29",
      "dvdReleaseDate": null,
      "directors": ["U. Roberto Romano"],
      "runtime": 80,
      "movieId": 90355,
      "title": "The Harvest (La Cosecha)",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1981703",
      "originalTitle": "The Harvest (La Cosecha)",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of the children who work 12-14 hour days in the fields without the protection of child labor laws. These children are not toiling in the fields in some far away land. They are working in America.",
      "tmdbMovieId": 70875,
      "avgRating": 3.66667,
      "releaseYear": "2011",
      "numRatings": 3,
      "posterPath": "/6btGmzZzHJm4nS7cafJDKjBX8GN.jpg"
   }
}