{
   "tmdb": {
      "original_language": "zh",
      "keywords": [{
         "name": "chinese province",
         "id": 9495
      }],
      "imdb_id": "tt1308138",
      "video": false,
      "title": "Mulan: Rise of a Warrior",
      "recommendations": [
         63963,
         41172,
         17808,
         310574,
         56251,
         42190,
         408360,
         113388,
         19611,
         124471,
         65852,
         56485,
         25655,
         48417,
         10257,
         22025,
         28772,
         63210,
         13970,
         16657
      ],
      "backdrop_path": "/KsRyXfjjlYcGdpW8dXCu4Ibcvg.jpg",
      "revenue": 13380561,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Mulan",
               "gender": 1,
               "credit_id": "52fe44ef9251416c91021e81",
               "name": "Zhao Wei",
               "profile_path": "/ordYxKFtHIYs5OM6Sm0q48oVKhO.jpg",
               "id": 77304,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wen Tai",
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e3f",
               "name": "Chen Kun",
               "profile_path": "/1LWRlfzLWHNIKY8pswIyspirfbD.jpg",
               "id": 109809,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Mao Dun",
               "gender": 0,
               "credit_id": "52fe44ef9251416c91021e85",
               "name": "Hu Jun",
               "profile_path": "/4IvAvKpnacqsriMSQmpuxbs2Ht6.jpg",
               "id": 96862,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Fei XiaoHu",
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e43",
               "name": "Jaycee Chan",
               "profile_path": "/sQriiYmETZUsJAezWyuy3Hg1No4.jpg",
               "id": 64435,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Hu Guei/Turtle",
               "gender": 0,
               "credit_id": "5747c311c3a3682853000891",
               "name": "Li Jiuzhe",
               "profile_path": null,
               "id": 109810,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Rouran Princess",
               "gender": 0,
               "credit_id": "5747c34c9251415f41000903",
               "name": "Liu Yuxin",
               "profile_path": null,
               "id": 109811,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Hua Hu",
               "gender": 0,
               "credit_id": "5747c38e92514135c9000f73",
               "name": "Yu Rong-Guang",
               "profile_path": "/9LxWXXXJM8R0O9LGnec3ajURVfa.jpg",
               "id": 120725,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Young Hua Mulan",
               "gender": 1,
               "credit_id": "5747c39792514135c9000f75",
               "name": "Xu Jiao",
               "profile_path": "/hjaXb1kFkEKeqmN0vAS867CbFMk.jpg",
               "id": 109813,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Gude",
               "gender": 0,
               "credit_id": "5747c3a0c3a3686bba000fcc",
               "name": "Vitas",
               "profile_path": "/eD3D8KT5MhF4TqDRNgxUEzVM97i.jpg",
               "id": 109812,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Wei Emperor",
               "gender": 0,
               "credit_id": "5747c3a9925141609500086e",
               "name": "Sun Zhou",
               "profile_path": "/uCGTIJ8JYj4RC3xr3y9B4QBHZT3.jpg",
               "id": 65278,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44ef9251416c91021e59",
               "name": "Guangcheng Song",
               "profile_path": null,
               "id": 109814,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ef9251416c91021e5f",
               "name": "Zhang Ting",
               "profile_path": null,
               "id": 109817,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ef9251416c91021e65",
               "name": "Dun Tan",
               "profile_path": "/73tjDKqG8qsKyGYN9PKLpugML6o.jpg",
               "id": 1360,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e6b",
               "name": "Jingle Ma",
               "profile_path": "/suWVRyPWT1elhIMI0wrRjIy7KHz.jpg",
               "id": 46325,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e71",
               "name": "Jingle Ma",
               "profile_path": "/suWVRyPWT1elhIMI0wrRjIy7KHz.jpg",
               "id": 46325,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e77",
               "name": "Jingle Ma",
               "profile_path": "/suWVRyPWT1elhIMI0wrRjIy7KHz.jpg",
               "id": 46325,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e7d",
               "name": "Jingle Ma",
               "profile_path": "/suWVRyPWT1elhIMI0wrRjIy7KHz.jpg",
               "id": 46325,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ef9251416c91021e8b",
               "name": "Eric Kwong",
               "profile_path": null,
               "id": 64490,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 7.750504,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 32909,
      "vote_count": 56,
      "budget": 12000000,
      "overview": "When barbarian hordes threaten her homeland, the brave and cunning Mulan disguises herself as a male soldier to swell the ranks in her aging father's stead. The warrior's remarkable courage drives her through powerful battle scenes and brutal wartime startegy. Mulan loses dear friends to the enemy's blade as she rises to become one of her country's most valuable leaders - but can she win the war before her secret is exposed?",
      "similar": [
         11728,
         11735
      ],
      "original_title": "花木兰 / Huā Mùlán ou Mulan: Rise of a Warrior",
      "runtime": 115,
      "poster_path": "/p4VSim6zbkHb9LxpSdcssIGYadY.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Starlight International Media",
         "id": 5233,
         "origin_country": ""
      }],
      "release_date": "2009-11-26",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Jingle Ma",
         "Wei Dong"
      ],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Ting Zhang"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt1308138/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NzYzMDMxMl5BMl5BanBnXkFtZTcwOTgxODk0Mw@@._V1_SY317_CR32,0,214,317_AL_.jpg",
      "actors": ["Stars: Wei Zhao, Kun Chen, Rongguang Yu | See full cast and crew »"],
      "reviews": [
         "Having just caught it not too long ago, the memories of it is still fresh in my mind. I remembered as the lights to the cinemas brightened as the credits start to roll, it felt breathtaking to had partake in this film as an audience of it. Do NOT, and i repeat, do NOT, go into this film wanting it to be one of those battle-like army type of films one generally associates with the genre of epic at its core. For if you do, you will be disappointed for this is NOT one of those films that had been over-populated due to other greats like Braveheart, Gladiator etc. Those are epic genre all to their own merits... ...and so is this depiction of the legend of Hua Mulan. I would still classify it as an Epic to some degree, but leaning it more towards the genre of Drama and Romance, more akin to the likes of Tau Ming Chong (aka. Warlords that was released in 2007 starring Jet Li, Andy Lau and Takeshi Kaneshiro). There are battlefield scenes, Yes...but they are of minimal depiction based on the context of this film, that are used to carry the characterization of Hua Mulan that was perfectly casted with Vicki Zhao at the helm. There is a plot, and that plot is to drive the main theme of this film that is to showcase to us about how she grew into the character in legends. Whereas the subplot to it is that of her feelings. These feelings are then broken down into different categories, showcasing the main obvious emotional parts of her for the affection that she has for another. While concepts based on being a filial daughter to her father, and loyalty to the fellow troops that she commands and finally patriotism that drives her to do what she does for twelve years are all being explored, minimally but it is enough to drive her overall characterization in just under 2 hours (even though it may seemed longer than that). Having said this, there is no need for me to summarize the film for you readers as that is one of the beauties of storytelling, where it is for the viewers to partake for themselves to let the story be told to you by the story's presentation. And definitely not by me. Overall, if one is into a movie that is emotional (depending on individual's views upon what is regarded as emotional), and does not showcase violence for violence's sake, then i guess one can do themselves the favor of partaking on this trip of 2 hours into another era. Again i must stress, do NOT go into this film hoping to see the likes of battlefield scenes. For me, i would classify this film like the other greats of Crouching Tiger, Hidden Dragon; The House of Flying Daggers; Warlords; Musa, and the very recent Red Cliff saga. Jingle Ma's depiction of Mulan has merits all to its own to make it stand among these others.",
         "I was moved by this movie. It was a real good watch. Words escape me at the moment, but this review can say it all for me: http://yingweitan.wordpress.com/2009/11/25/movie-review-mulan-2009/ Also, the comment at the bottom of the article is very insightful. Differing from the usual route of Chinese epic movies, which usually portrays huge battle scenes, extravagant costumes, and such, this movie concentrated more on the character's development and emotions. As such, it is a movie that deserves a closer scrutiny than the passive habit we have of watching movies. I will not give it the 2 points for the 10/10 vote because my overly romantic self was denied something (you'll see). But then that's just me. :) I do not regret that I spent 113 minutes of my time on this. In fact, it made me all the more ready to face my own battle: life.",
         "We all know how the story of Hua Mulan follows that of other legendary folk heroes in China's rich history, and to date there's only a reference poem which accounted her exploits which stem out of filial piety, at a time in the Northern Wei state centuries ago when the Emperor decreed that all families must contribute to the war effort. Being a military family, the Huas have no male heir to represent their family, which automatically meant the aging father has got to volunteer himself. Rather than send her father to instant death in the battlefield, Mulan disguises herself as a male, and takes her father's place. That's basically the gist of the story, where she spends 12 long years at the war-front to the amazement that she was never found out, before returning to the gratitude of family and country. This also means that storytellers have almost a full reign at what could have transpired during her tour of duty, and suffice to say this will always mean that there will be elements of hardship during training, attempts or situations at putting her true identity at risk, and given the soft hearted nature of an adolescent female, affairs of the heart will come knocking. The same goes for this film, written by Zhang Ting, which adopted the romantic angle rather heavily, exploring the relationship between Mulan, and General Wentai (Chen Kun), in a love that's quite forbidden since firstly a female cannot be serving in the army, and secondly, face it, two male soldiers, and later on, of general rank, can't be seen behaving lovey-dovey in front of their men. Besides, being romantically involved also served to be a roadblock to Mulan's innate war ability, or so Wentai believes that needs some way to be severed so that she can unleash that beast within. As Wei soldiers, they're tasked to defend their country from the nomadic invading forces which seek to conquer Wei for their iron, in which to make weapons, and then to plunder some more. There's some gigantic contrast between the troops on both sides, one sans heavy armour, while the other gets more beautifully decked out, and in some ways, better equipped. But what the film is rather all about, is its take on leadership. One can have strength in superior numbers, or to have technology on its side, but without an effective, charismatic leader, it's as good as not being able to harness the multiplier effect that comes with the territory. Imagine having morale, trust and belief so high, that troops will rally behind you, trust your vision, and literally to lay their lives down for the cause. I suppose with any effective leader who walks the reasonable talk, should be able to attest to the respect that they command over their followers. Then there are the battle scenes, because what's a Mulan film without one. Unfortunately though, most of the scenes were featured in some way in the trailer, so they do not come as a surprise. There's no big-bang action sequence as well, choosing instead to opt for a rather more personal, intimate battle rather than one involving the masses, and also wrapping things up a tad too conveniently, although it tried to redeem itself with a pathos filled finale revisiting the romantic angle once again. The war front scenes were like a quick summary of 12 years of iconic battles that Mulan had led, so those looking for fantastically choreographed battles in the mould of Red Cliff, will be sorely disappointed. Then there are some rather questionable scenes which comes out of the blue, and somehow marred the enjoyment of the film a little because of their convenience, with that little bit of vampirism which I felt was not quite necessary, and a natural phenomenon which just appears and seem to take sides, again for reasons I am not able to fathom, and speculate only for the showcasing of special effects. Disaster movie, this is not. But thankfully the performances all round provided that lift to the film, and made it bearable. Zhao Wei is no rookie to period war dramas, since she has Red Cliff to thank for in modifying her role there to become a warring princess. There are too many parallels to be drawn between her characters in Shangxiang and Mulan, such as going forth to the forefront of war to the disapproval of family, her desire to defend her country, her disguises and so on, one can still feel her Mulan here to be distinct and if I may say, quite definitive. Chen Kun also held his own against the veteran actress, although one can feel that since this is a Mulan film then he's playing second fiddle. Supporting roles range from Jaycee Chan to Hu Jun, who seem rather functional than to add any emotional depth to the film. Mulan is just one version from a folklore open to vast interpretations, and you can bet your last dollar that this isn't going to be the last of Mulan related stories that we'll hear of. While it isn't an instant classic, this version can probably still shout out to be the definitive version for now.",
         "I got quite excited when I heard of this re-adaption of the Chinese folk tale Mulan, having always loved Disney's version for unexplainable reasons. (Not being a Disney fan in any sense). I'm very much left at a crossroads after watching the piece. Well worth giving it a go to draw your own opinions because the film is brilliant yet at the same time flawed throughout. Having the feel of many recent Romance of the Three Kingdoms historical epics that have been popping up regularly from the fantastic new generation of Chinese cinema, Hua Mulan is fast paced, uplifting and in a narrative sense very well strung together. Unlike many of its' counterparts we don't have the long and often drawn out political segments we found throughout the Red Cliff films (Absolute wonders in their own right). The evident flaws popping up in the casting of Hua Mulan herself and the balance between the story of a solider and that of romance wasn't really able to find a true sense of equilibrium, I felt slightly discontented by the conclusion but Hua Mulan is not a film to disregard from the above remarks. A film well worth watching, putting a blunt and more practical spin on the story of Mulan; placing the tale within an Era of Chinese antiquity that easily rivals that of King Arthur or Julius Ceaser.",
         "I wasn't really sure what to expect, when watching the movie. The only thing about the story of Mulan that i knew, was what i learned from the Disney version. But i'm pretty sure, people who watch this movie wouldn't actually (and rightfully) expect there to be much similarity between the two. One thing that i think is important about this movie is, do not see it expecting to see things you've seen in \"similar\" movies. You might be disappointed. Because if you expect this to be anything like the classic martial arts movies, that it is most certainly not. Even Warlords, which at least to me felt quite authentic, was more exaggerated in its fighting scenes. And yes, this is also a love story, but just like the fighting and everything else, to me it seems that the people who made this movie gave a lot of thought to how much romance would be possible under the circumstances. Of course there were things that bothered me, too, but i think they were pretty much neglectible. For example i don't know how the character of Wude (played by Vitas) actually fits into the story, he feels slightly out of place. There was one scene that also seemed strange because it was really out of nothing, i don't see this as a spoiler because its not really of any importance to the story, but there was a sandstorm and they called it something like poison dragon. I did some research and it seems there is a legend about the region of Sanweishan that mentions sandstorms as the breath of a dragon, that seems to be a good explanation but someone who isn't familiar with Chinese mythology as i am (and probably most westerners) wouldn't know that and it might be confusing. Also it didn't seem like miss Zhao didn't put in much effort when Mulan pretended to be a man. But personally i don't really mind, actually appreciate it in a way. I think it would have seems a little ridiculous, and this movie is by no means meant to be comedic. The viewer knows she's pretending to be a man and that nobody notices it, there would be no point in having the actress try to talk with a deep voice or even choosing a different actress who is more masculine. That's simply not what the movie is about. If you like, you might see this movie as biographical, maybe even historical as far as that's possible for a legend. All in all i think this movie is absolutely worth watching if you're not too focused on any aspect of Chinese cinema, but even then it might well be worth your time!",
         "excerpt, full review at my location - Not to be confused with Disney's 1998 animated blockbuster Mulan, director Jingle Ma's 2009 epic offers a more sophisticated and nuanced retelling of the story based on a sixth century Chinese poem. Mulan: Legendary Warrior charts the early life and rise to power of Hua Mulan, a fearless heroine who disguises herself as a man and goes to war in place of her ailing father. Mulan: Legendary Warrior isn't exactly innovative, and it doesn't really add anything new to a story that has been told many times, but it's an expertly crafted film that fuses war and romance genres in a highly absorbing way.",
         "I first saw the Disney Mulan and thought that it would be something like that. But I met something completely different in a very positive way. There was also no gi jane trying to show the world something, mulan was just a person who grew with the duty and just did what she had to do. The film left out all the gender conflicts beside and truly presented us a pure touching story. Hua Mulan being a great general and warrior is after 12 years again a woman of her time at the end. The end of the love story is also sad but otherwise it wouldn't be such a good film. Hollywood would surely add a kiss at the end, it was much better that there were just the right words...",
         "Having Just watched this film, and whilst it is still fresh in my mind I found the movie to be a refreshing change to traditional epics offered by Asian Cinema. House of flying daggers it is not, but as an interpretation of Chinese folklore that was based on a poem, it is a piece of cinematic creativity in it's own right. The casting of Wei Zhao was a smart move. Vicki is a potentially under rated actress who displays a versatility that is often never matched by over paid Western A - listers. For the tone and content of a film that has no provable substance in fact, Vicki does an outstanding job of expressing the bland emotion and lack of compassion that would be synonymous with the era and situation with which the film is set. At it's heart is a love story that is put aside by the burdens of war. This is so effectively displayed by the acting skill of the lead that it could be mistaken for lacking any substance at all, but with such interpretive subject matter the leads pull you in and make you share in the joy and the hurt that their lives are taking. This is essentially an amazing piece of cinema, with a talented cast and a talented director. There are many ways to while away an afternoon. Getting lost in the majesty this provides is well worth the time",
         "No, there are no epic war scenes or battle scenes in this film, but nonetheless it is an epic film. I read in one of the review that the story wasn't going anyway and was dragging along. Well, yes, that is the purpose of this film, the absurdity of war and heroism, of true sacrifice and no happy ending in the Hollywood way. Mulan becomes a tactically sound commander of some Chinese army, learns the realities of politics the hard way, learns the Chinese way of sacrificing your own happiness for the greater good of the nation. It is not merely a sacrifice of your life, but a sacrifice of everything you might think will or would define yourself. There is no true glory in war, and Mulans father says so in the very beginning of the movie. Who wins? The nation, the people, not the individual. So the story doesn't really go anyway - and still it goes everywhere, touches upon the absurdities of our quaint notions of self and of glory and of victory. When Mulan finally puts the welfare of the nation above herself and even above her family and her brothers-in-arms for the sake of the greater good, she ends up where she finally understands what her father meant, despite her fears or even because of her fears. It is a brilliant movie. I will Watch it Again, and not because of the battle scenes - they are mostly not there - but for the story that doesn't lead you anywhere, drags you along against your will and you end up the same way of Mulan, with only a fling of hope: there is a greater good, and it is not you!",
         "I just recently found out that the story of Mulan did not originate from the 1998 Disney animation. That being my favourite Disney film, I went in search of other Mulan movies, and found this. While the length of the film made me hesitate, I found it quite enjoyable. The film did not have the Disney/Hollywood touch to it, and as much as I still spend time watching Hollywod movies, it gives a fresh new take on Mulan (or new to me anyway). Quite a lot of the film diverts from the Disney Mulan, but the foundation of the story is still there. Note: The legend of Hua Mulan is actually based on a poem. The film starts off with Mulan caring for her father, and progresses to the familiar calling for soldiers from every family and Mulan running off in her father's place. In this film Mulan already knows how to fight before going to war, so I guess that makes it more believable that she will be able to keep up with the others. However, her voice and appearance are still noticeable that of a woman which annoyed me a little (this isn't an animation after all), but after awhile I got used to it. I still think they could have made her character try more to fit in with the characteristics and the like, even if they couldn't manipulate her voice or appearance much. The fighting scenes, though very elaborate was a bit too bloody for me. It wasn't excessive but I could have done without some of them. The war lasted a long time and I guess this is reminiscent of wars in those times. I wasn't really fond of the character of Modu (Jun Hu), who like the enemy in the Disney film, is very exaggerated in his evilness. The way he acts too is pretty stereotypic. Wei Zhao and Kun Chen as Mulan and Wentai (character of Shang in Disney's Mulan) had pretty good acting, but at times I felt the chemistry between them was too forced, and some parts were also a little cheesy. Jaycee Chan (son of Jackie Chan) did a great job as Mulan's friend and his acting is actually not bad. In addition, I found it very awkward and random that they had to have a white person in the film for no apparent reason. OK he is actually Russian (Vitas who plays the character of Wude), but still he didn't do much and he actually doesn't speak except for one sentence I think. Makes me wonder. The ending I liked, but I also disliked. If you watched it, you probably know what I'm talking about. Read more movie reviews at: championangels.wordpress.com"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Starlight International Media Group",
         "Hunan TV & Broadcast Intermediary",
         "PKU Starlight Group"
      ],
      "summaries": ["The epic story of the Chinese girl-warrior, Mulan, who fights to defend her father."],
      "budget": 12000000
   },
   "movielensId": 90620,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2009-11-26",
      "dvdReleaseDate": null,
      "directors": ["Jingle Ma"],
      "runtime": 115,
      "movieId": 90620,
      "title": "Mulan: Rise of a Warrior",
      "mpaa": null,
      "actors": [
         "Zhao Wei",
         "Chen Kun",
         "Hu Jun",
         "Jaycee Chan",
         "Li Jiuzhe",
         "Liu Yuxin",
         "Yu Rong-Guang",
         "Xu Jiao",
         "Vitas",
         "Sun Zhou"
      ],
      "imdbMovieId": "1308138",
      "originalTitle": "花木兰 / Huā Mùlán ou Mulan: Rise of a Warrior",
      "genres": [
         "Adventure",
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": ["M4OSxjVARC0"],
      "plotSummary": "When barbarian hordes threaten her homeland, the brave and cunning Mulan disguises herself as a male soldier to swell the ranks in her aging father's stead. The warrior's remarkable courage drives her through powerful battle scenes and brutal wartime startegy. Mulan loses dear friends to the enemy's blade as she rises to become one of her country's most valuable leaders - but can she win the war before her secret is exposed?",
      "tmdbMovieId": 32909,
      "avgRating": 3.38462,
      "releaseYear": "2009",
      "numRatings": 117,
      "posterPath": "/p4VSim6zbkHb9LxpSdcssIGYadY.jpg"
   }
}