{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cairo",
            "id": 487
         },
         {
            "name": "belly dancing",
            "id": 7570
         },
         {
            "name": "cultural difference",
            "id": 10428
         },
         {
            "name": "belly dancer",
            "id": 208038
         }
      ],
      "imdb_id": "tt0758799",
      "video": false,
      "title": "Whatever Lola wants",
      "recommendations": [17376],
      "backdrop_path": "/l8ZFHLNhGNTDMBRoaNEccstdZq5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Lola",
               "gender": 1,
               "credit_id": "52fe472b9251416c7508ff4f",
               "name": "Laura Ramsey",
               "profile_path": "/4dRnDQ7FZu54ZtLXzWARGWvtStR.jpg",
               "id": 51975,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Yussef",
               "gender": 0,
               "credit_id": "52fe472b9251416c7508ff3d",
               "name": "Achmed Akkabi",
               "profile_path": "/lYLKqVViegtCfeCFv0sdgsB2wf2.jpg",
               "id": 93259,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Yasmine",
               "gender": 0,
               "credit_id": "52fe472b9251416c7508ff41",
               "name": "Milia Ayache",
               "profile_path": null,
               "id": 124512,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Zack",
               "gender": 2,
               "credit_id": "52fe472b9251416c7508ff45",
               "name": "Assaad Bouab",
               "profile_path": "/c1sgUDqy1qo12pvS5UdJj9SAfd3.jpg",
               "id": 20671,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5886618ec3a3681eb7000d78",
               "name": "Jake Eberts",
               "profile_path": null,
               "id": 2359,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "588661f49251411362001f10",
               "name": "Krishna Levy",
               "profile_path": null,
               "id": 565140,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5886620dc3a3681762001465",
               "name": "Vincent Mathias",
               "profile_path": null,
               "id": 1018986,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "58866248c3a3684480004668",
               "name": "Sanaa Bezzaz",
               "profile_path": null,
               "id": 1744162,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5886625192514113ea001ee7",
               "name": "Sanaa Bezzaz",
               "profile_path": null,
               "id": 1744163,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58866265c3a3684480004683",
               "name": "Hamed Hemdan",
               "profile_path": null,
               "id": 1744165,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "588661cec3a3684480004611",
               "name": "Pierre Grunstein",
               "profile_path": "/bcwjFDlHZZMZZGIS6UsNirmQ9Sx.jpg",
               "id": 11204,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5886628c925141125e002130",
               "name": "Pascale Bouquière",
               "profile_path": null,
               "id": 1469568,
               "department": "Costume & Make-Up",
               "job": "Key Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "588662cdc3a36818e90014f3",
               "name": "Fabián García",
               "profile_path": null,
               "id": 1208880,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "588662e892514111580022ee",
               "name": "Amina El Halhouli",
               "profile_path": null,
               "id": 559186,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "58ba3b1ac3a368666b01353f",
               "name": "Nabil Ayouch",
               "profile_path": "/n7t19GtMJVErQ4SaSKaptVRhPnH.jpg",
               "id": 285104,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.528538,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 17495,
      "vote_count": 12,
      "budget": 0,
      "overview": "A Brooklyn postal worker follows her Egyptian boyfriend to Cairo where she takes belly-dancing lessons from a legendary but disgraced Egyptian dancer.",
      "similar": [
         409,
         564,
         85,
         691,
         1966,
         947,
         6844,
         9837,
         3989,
         416477,
         9334,
         1734,
         18,
         205584,
         15849,
         2899,
         26428,
         4192,
         60216,
         82703
      ],
      "original_title": "Whatever Lola wants",
      "runtime": 115,
      "poster_path": "/8Kv1eEOYagly8QGI7FyjQYCR65P.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Pathé!",
         "id": 35461,
         "origin_country": ""
      }],
      "release_date": "2007-12-11",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nabil Ayouch"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Nabil Ayouch",
         "Jane Hawksley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0758799/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjY2OTM1ODMyN15BMl5BanBnXkFtZTgwNzQwMTA2MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Assaad Bouab, Carmen Lebbos, Hichem Rostom | See full cast and crew »"],
      "reviews": [
         "Thank you Mr Nabil for such a delicious moment: you have offered us a movie I will agree fully to re-pay the entry when leaving the theater. This is not only a very good film on Dancing,and thanks again for the wonderful teaching, it is a movie about changing, taking risks of failure to learn something new and letting others change your life: I am talking of course about Ismahan mainly, a deep character with excellent interpretation by a woman I had never seen in films... It is also a movie on tolerance, on linking between cultures and countries. The art of dancing is a powerful tool for this purpose,as arts in general have been showing it in many movies and for a very long time (Les uns et les autres, by Claude Lelouch was one of them)I have kept the images within me for the last 3 days, with a smile in my mind. It is a shame that your movie can be seen only in so few theaters in Paris. I am sure people will enjoy seeing it on TV someday, and that your work will find its real reward then. Thank you again.",
         "Watched this on DVD recently and found a delightful and lovely story. An impulsive struggling dancer from NYC goes to Cairo to chase after a boyfriend and ends up learning belly dancing. Laura Ramsey is pretty and winning. It's a feel good story and provides subtle insights into the cultural and moral differences found in Egyptian society. It's not preachy but quite touching in the way it shows the attitudes of men towards women, divorce etc. It's not a tourist view of Egypt but an insightful looks into the society there. The human relationships are in the forefront in the movie. The actress who plays the former belly dancer star Ismahan is quite lovely. Definitely worth a watch.",
         "Although i am partly Arab i rarely watch Arabic films. At the start, Whatever Lola Wants depicts its an Arabic film production and so i got back to my laptop. As it played in my DVD and my daughter watched, and to my utter surprise, in the 10 minutes back and forth between my laptop and the TV screen, i decided TV would win this time. I was so happy to see an exceptionally well made film that had Arab team and crew on board. A great production of the highest standards. A very good cast, colorful characters, several angels of the Arab society shown very tastefully. Really this movie is packed with cultural data, where there are common grounds between west and middle east and where there are divides in peoples minds. It kept my attention all through until the end. And what a beautiful ending. I would watch this movie twice. Thank you to all those involved in making this movie. I will surely recommend to my friends.",
         "It was an average dance film, complete with romance issues, challenges that must be overcome and applauding happy end, but I couldn't help feel that somewhere in all that clueless blonde smiling permanent intrusion in other people's affairs there was something offensive. I don't know how Egyptians are, but I doubt that they are closeted Americans waiting to get out and express themselves to the detriment of all around. The plot is that an aspiring New York dancer is pushed by circumstances to come to Egypt. She becomes the apprentice of a very good belly dancer and reaches tarab before the end of the movie. Bottom line: there are some interesting items of fact about the Arab culture, especially when involving women, but the point of view is so extremely American that it felt fake. The dancer was cute, but she didn't strike me as very good, nor was she a good actress. While the film could inspire some people that are passionate about dancing, it has very few other good parts.",
         "I watched this film because it is mostly set and partly shot in Egypt, an interesting country. Dancing of any kind does not interest me, I might have fast-forwarded the dancing sequences if it had been a video instead of a TV broadcast. The depiction of Egyptian social norms and customs kept my interest. The film is mildly sympathetic if a bit slow, a bit predictable and much too cute - every problem the idiot heroine creates for herself is solved too easily. There is a disturbing contrast between the realistic backgrounds and absurd plot. The leading actress is just right as the gorgeous American airhead and all the actors are credible as their characters - the problem is that what the characters do is constantly unbelievable. The ending is extremely lame. The most annoying thing in the film is the heroine's gay friend. He is such a cliché, we have seen him do the same things in countless films and TV series. Why couldn't this person be an Egyptian woman instead of a gay man? That would have been much more believable and logical.",
         "I saw the movie twice, in Arabic although being french, born in Egypt I do not speak the language. But the movie so perfectly done, so well played that I had the feeling I could understand all that was said. There is charm, humor, a kind of romantic atmosphere all along the movie. This is a movie in the line of The band's visit,The Yacoubian Building, Caramel, all of them realized between 2006 and 2007 and a must see for any open minded viewer who wishes to understand the middle east culture. And of course from my personal view point I could recognize some of the places I went through as a child. A great movie, a must to see.",
         "I first watched this movie when it came out in Morocco, and I just loved it ! I've watched it a couple of times since, in English, and each time it just gets better. Nabil really managed to wrap up a great quality movie that goes beyond its center topic : Belly Dance, he pictured the shock between occidental and oriental cultures in a soft implicit way. Not to mention that he made a belly dancing movie for a general public in a way that the audience gets to know all this fabulous world through Lola, who's American and obviously an outsider like the target audience of the movie. I also loved it because It's just bold, I mean it's basically one of the first Arabic films ever made about belly dancing, giving the fact that it's a pretty controversial matter in oriental/Muslim countries, not to mention Youssef, who's probably the first openly gay character ever portrayed in an Arabic made movie. I couldn't help but notice a lot of similarities between Egypt and Morocco in the movie, some of them were pretty obvious (especially the clothing) so I guess a lot of scenes were shot down here. Anyways, to sum things up, this definitely is a must-watch movie, it's fun, entertaining and well made, but I fell like it has been really underrated for what it really is, I'm afraid not enough people have seen it, and that is truly a shame, so please, go watch it, you will not be disappointed, I promise !",
         "a young woman in Cairo. her unique experience. discover of vocation. and the grace of a special art conquest. the story and the acting are far to represent a surprise. virtues - the form of dream who becomes reality, the beauty of dance, Carmen Lebbos and Nadim Sawa in clothes of nuanced roles. than, the clash between civilization and the ambition to give not exactly roots but frame to story. Laura Ramsey explores each detail of her character and this fact gives necessary freshness to a pure American dream who is seed for self discover. a film of colors, music and emotions. nothing serious, nothing complicated. but surely nice.",
         "Whatever Lola wants is one of those happily ever after movies that you can find every now and then but what will make you follow the story is the beautiful Egyptian dance and music. I'm not going to take this movie very seriously since it was just very fun , casual and easy going Cinderella story and you surely will love if you are in your sweet sixteen , or even teenage years ,specially if you are a girl but older than that you may only enjoy the music more than the corny story which by the way was not even close to reality ! How on earth ONLY the talent can be enough for a blond girl to become a star in the world of SHOWBIZ in a country like Egypt where all the producers are men and crave for white blonds??? I rest my case !"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "7th Floor, The",
         "Ali'n Productions",
         "B.C. Films"
      ],
      "summaries": ["A New York postal worker travels to Egypt to take belly dancing lessons from a legendary instructor."],
      "budget": 8000000
   },
   "movielensId": 90953,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-12-11",
      "dvdReleaseDate": null,
      "directors": ["Nabil Ayouch"],
      "runtime": 115,
      "movieId": 90953,
      "title": "Whatever Lola wants",
      "mpaa": null,
      "actors": [
         "Achmed Akkabi",
         "Milia Ayache",
         "Assaad Bouab",
         "Laura Ramsey"
      ],
      "imdbMovieId": "0758799",
      "originalTitle": "Whatever Lola wants",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A Brooklyn postal worker follows her Egyptian boyfriend to Cairo where she takes belly-dancing lessons from a legendary but disgraced Egyptian dancer.",
      "tmdbMovieId": 17495,
      "avgRating": 3.5,
      "releaseYear": "2007",
      "numRatings": 5,
      "posterPath": "/37nv9oRZ7WpTVlfpfrjJgipWk5l.jpg"
   }
}