{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1315350",
      "video": false,
      "title": "Cherry",
      "recommendations": [
         20224,
         165598,
         96314,
         230428,
         71394,
         331161,
         138907,
         19572,
         93091,
         61168,
         135595,
         31896,
         73846,
         386623,
         37144,
         101198,
         39773,
         14758,
         44750,
         18815
      ],
      "backdrop_path": "/rXN1GDBiYnHVSFg8ngaQalC2lIV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Aaron",
               "gender": 0,
               "credit_id": "52fe472cc3a36847f81273f5",
               "name": "Kyle Gallner",
               "profile_path": "/itzNqPkp0LIyRLyLHEZFx8up0PQ.jpg",
               "id": 59219,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe472cc3a36847f81273f9",
               "name": "Laura Allen",
               "profile_path": "/bBShXEkhvoG4zOV4ZcNv5AccqEz.jpg",
               "id": 79792,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Beth",
               "gender": 1,
               "credit_id": "52fe472cc3a36847f81273fd",
               "name": "Britt Robertson",
               "profile_path": "/xUBcDuKqUy7e86DeIdsMLDMUvJP.jpg",
               "id": 52018,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Wes",
               "gender": 2,
               "credit_id": "52fe472cc3a36847f8127401",
               "name": "Esai Morales",
               "profile_path": "/qeOm5PAxV0vDg5l9l0oqZsZg7PR.jpg",
               "id": 65344,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Prof. Krause",
               "gender": 2,
               "credit_id": "573f260a92514127cc002717",
               "name": "John Judd",
               "profile_path": "/wID4XglEpyoJYDvcceVYBVW06tT.jpg",
               "id": 1226707,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Darcy",
               "gender": 1,
               "credit_id": "5a649db40e0a2619f20248f0",
               "name": "Zosia Mamet",
               "profile_path": "/fakl1UDuLfX14pWLIkcyv3OnG2U.jpg",
               "id": 206966,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe472cc3a36847f81273eb",
               "name": "Jeffrey Fine",
               "profile_path": null,
               "id": 138501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe472cc3a36847f81273f1",
               "name": "Jeffrey Fine",
               "profile_path": null,
               "id": 138502,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.66692,
      "production_countries": [],
      "id": 47320,
      "vote_count": 40,
      "budget": 0,
      "overview": "Ivy League Freshman, Aaron Milton (17) gets a different kind of education when he falls for Linda (34) a vivacious former wild-child who has returned to college to straighten out her life. The curriculum gets more challenging when Aaron meets Linda's sarcastic 14 year-old daughter, Beth - who quickly develops a crush on him. The math doesn't work in either direction but the dysfunctional triangle becomes a learning experience for all involved.",
      "similar": [],
      "original_title": "Cherry",
      "runtime": 99,
      "poster_path": "/qeMIDY6pwulAi9yZJeXVhK6ZJH9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-10-08",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Too young? Too old? You do the math.",
      "adult": false,
      "homepage": "http://cherrythemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeffrey Fine"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Jeffrey Fine"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1315350/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0NjU0NzgzOF5BMl5BanBnXkFtZTcwNDYxNDEzMw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kyle Gallner, Laura Allen, Britt Robertson | See full cast and crew »"],
      "reviews": [
         "I had the pleasure of seeing this movie at SXSW this year, and even briefly go to meet the filmmaker - all and all, I really like this movie. There's something personal to this coming of age story that we can all relate to - our first time. Our first year at college, the first time we thought we were in love, got our heartbroken, failed, followed our dreams, stuck up for ourselves, etc. The story is simple - our hero, Aaron, starts his first year at an Ivy League school. It's his first chance to get away from his controlling mother, who has planned most of his life, and he can now follow more of his own dreams. He struggles a little bit with making friends and making the grades, but doesn't start finding himself until he meets single mother, Linda, and her daughter, Beth. They all struggle with acceptance for who they are and who they want to be - waiting for life to happen to them instead of making life happen for them. This movie is fun, humorous, and enjoyable. Every performance in this movie is worth seeing, from the acting to the film making. If you have the chance to see it, I recommend it.",
         "You know those great little indie films from the states like 'Junebug', 'Thumbsucker' and 'World's Greatest Dad' to name but a few, well now you can add to that list 'Cherry' a charming coming of age human nature piece that each and every one can in some way relate to. It's a simple enough story, Aaron leaves home to embark on his freshman year and falls for an older student Linda, Linda a recovering alcoholic has a wise cracking, old before her years, daughter called Beth, Beth falls for Aaron and a bizarre unrequited love triangle opens up learning curves, home truths and life experience for all three. The great thing about this movie is the quality of the script, the acting and the use of music, no CGI or special effects are needed to convey the very real story contained. It has ups and downs, laughs and gasps and at an hour and a half is perfectly paced. Without sounding twee or patronising if something like Transformers is a beer then this is a nice cup of tea and a sit down, which is no bad thing, some blockbusters feel like being repeated hit in the face with laptop but sometimes you just need to be told a good solid entertaining story, Cherry is just that. I just hope lots of people get to see this film because it deserves it.",
         "I just came from a screening of this movie at Western Michigan University where they filmed parts of the movie. I was so surprised and entertained by the movie. As a native Michigan resident, I loved that it had a homey feel based on how much of the landscape and buildings I recognized. The scenery is beautiful; Michigan in the fall, but maybe I'm biased. The movie is relatable on many levels and can be enjoyed by by anyone. It centers around a young man's experience his first year at college. But anyone can relate to themes of breaking away from the norm, standing up to one's parents and having crazy fun times. I really recommend it.",
         "This movie truly is beautiful. I just finished watching it and am still in awe of it. It is stirring and provocative while remaining humble. You can feel it, simple as it may be. It was well casted and well placed, and I don't think they could have done a much better job of it. I think everybody can appreciate this movie, or at least relate to it. Love, stress, panic, guilt, resolve. This film was brilliant in highlighting all of these emotions, and it had me glued to the screen. Definitely one of my favorite movies of recent years. Solid 9/10. I highly recommend watching this if you get the chance to.",
         "I love this movie. I really do. And maybe that's because of my earlier personal experiences in life, but I find this film so relatable. The acting is great, the story is brilliant and I am proud to say it's my new favorite movie (and my previous one was American Beauty). It's a gem and unfortunately it will never win an Oscar even if it deserves one. It brings out so many emotions in me. I've cried both times I've seen and that's not usual for me. Now that I've raised the expectations through the roof you might not find it as awesome as I did, but I can assure you it's worth the watch. My words however aren't sufficient enough, my words don't make this movie any justice, you have to see it to understand why it's so great.",
         "Saw this on Netflix streaming movies, it was one of the recommendations based on my rating of other movies. The title has at least a couple of different references but one is the young student's virginal status. At 20-something Kyle Gallner plays 17-year-old college freshman Aaron. It is an Ivy League school but was actually filmed in the Kalamazoo, Michigan area. He has been admitted to an advanced program with scholarship and starts out as a very serious student. But that changes quickly when in art class he meets a very friendly student, 30-something Laura Allen as 30-something Linda who, it turns out has a 14-yr-old daughter. Britt Robertson, about 20, is that daughter Beth. Aaron quickly gets attracted to Linda, who it seems is just enjoying his company, while Beth soon falls in love with Aaron. That sparks most of what happens the rest of the way. Including Esai Morales as Wes , the cop that wants to marry Linda who isn't being a very good mother for Beth. The movie is not a comedy but there are many funny parts, as reflective of real life. Aaron gets very distracted from his school work, falls behind, gets some bad grades, and after an auto accident his parents show up. He is in danger of losing everything he has worked for. Different, somewhat quirky story, I enjoyed it.",
         "Cherry has everything that an indie teen rom-com should have, yet the first half of the movie lacks a real attention grabber. It took me a good 45 minutes before I found myself truly engaged with the film. Other than that, the movie successfully affected me in a way any indie rom-com should. Personally, i believe this is due to the stellar cast and supporting cast. Not to mention, the writing was brilliant as well. Britt Robertson stole the spotlight no matter what scene she was in with her complex, yet intriguing and lovable character. Robertson truly proves herself as an actress in this movie and Laura (Linda) plays the messed-up mother character impressively. It's a movie that every teenager can relate to and doesn't exclude any vital part of growing up and going to college. Nevertheless, Cherry is a heart-warming and interesting film thanks to the writing and exceptional performances. I would recommend this movie to anyone who has a few hours to kill and wants to shed a few tears!",
         "This film was full of surprises. It is nothing like you expect, and I hail it as the religious textbook, or should I say \"video\" book of our future generation. Well, maybe, not that exactly. However, I frequently look at Hollywood films (frequently reminded), and I tell myself, \"why did they get Oscars? I hate this trash!\" So now, recently I have been looking at independent films, such as \"Cherry.\" After watching Cherry, I can honestly say that ALL Hollywood filmmakers MUST and should be required to take acting/filmmaking lessons from the filmmakers of this movie, Cherry. I say this, because this movie is done on a level of power that will only be available in the future. Enough said, I \"Cherrish\" this movie! oooooooh!",
         "I really enjoyed this film. I was a Tuesday at 3a.m looking for something to watch and i encountered this film (it was half film past) and I saw beautiful scenes, and a great ending. Other day i watched it complete. It was a masterpiece in it's own way, a common topic but with a different approach. I hope anyone who see this review feel the same i did with this film. I was nearly tearing at the end, amazing movie! This is a goodbye for now, hope you find this review interesting and Sorry for the language since this isn't my native one. PS: I feel for the actress that plays Beth (Britt Robertson). She's really pretty"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Cherry Movie"],
      "summaries": [
         "Ivy League Freshman, Aaron Milton (17) gets a different kind of education when he falls for Linda (34) a vivacious former wild-child who has returned to college to straighten out her life. The curriculum gets more challenging when Aaron meets Linda's sarcastic 14 year-old daughter, Beth - who quickly develops a crush on him. The math doesn't work in either direction but the dysfunctional triangle becomes a learning experience for all involved.",
         "An Ivy League freshman gets an unexpected education when he falls for an older woman and her 14 year-old daughter develops a crush on him."
      ],
      "budget": 0
   },
   "movielensId": 91048,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-10-08",
      "dvdReleaseDate": "2011-09-26",
      "directors": ["Jeffrey Fine"],
      "runtime": 99,
      "movieId": 91048,
      "title": "Cherry",
      "mpaa": "R",
      "actors": [
         "Kyle Gallner",
         "Laura Allen",
         "Britt Robertson",
         "Esai Morales",
         "John Judd",
         "Zosia Mamet"
      ],
      "imdbMovieId": "1315350",
      "originalTitle": "Cherry",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["y-eUQW8OKhs"],
      "plotSummary": "Ivy League Freshman, Aaron Milton (17) gets a different kind of education when he falls for Linda (34) a vivacious former wild-child who has returned to college to straighten out her life. The curriculum gets more challenging when Aaron meets Linda's sarcastic 14 year-old daughter, Beth - who quickly develops a crush on him. The math doesn't work in either direction but the dysfunctional triangle becomes a learning experience for all involved.",
      "tmdbMovieId": 47320,
      "avgRating": 3.16667,
      "releaseYear": "2010",
      "numRatings": 30,
      "posterPath": "/qeMIDY6pwulAi9yZJeXVhK6ZJH9.jpg"
   }
}