{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1268224",
      "video": false,
      "title": "An Inconvenient Tax",
      "recommendations": [],
      "backdrop_path": "/jIeSFCMOElbhs7AlvJFWsypWyx1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4cbec3a368484e1c4ec7",
            "name": "Christopher Marshall",
            "profile_path": null,
            "id": 1184272,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.09287,
      "production_countries": [],
      "id": 202152,
      "vote_count": 1,
      "budget": 0,
      "overview": "An Inconvenient Tax is a 2010 documentary film produced by Life Is My Movie Entertainment. The film explores the history of the income tax in the United States and the causes of its many complexities.",
      "similar": [],
      "original_title": "An Inconvenient Tax",
      "runtime": 78,
      "poster_path": "/lTWJxlc6Q24NN3an1o9PUCssUZ3.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-04-15",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Marshall"],
      "runtime": 78,
      "synopsis": "An Inconvenient Tax sheds light on one of Americas messiest problems a fundamentally broken tax code that affects every part of people's lives. With the U.S. Congress making over 16,000 changes to the tax code in the last two decades alone, many Americans want something better, but few know where to start. This feature-length documentary film reveals the many ways Congress uses the tax code to achieve political goals that have nothing to do with raising revenue. It also tackles the controversial issue of tax reform through a non-partisan presentation of U.S. tax history and current proposals to fix the code. In a time when America faces fiscal crisis, An Inconvenient Tax brings a crucial exploration of the tax code to the big screen. - Written by Life Is My Movie Entertainment",
      "writers": ["Vincent Vittorio"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1268224/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDM5MDAxMzc3OV5BMl5BanBnXkFtZTcwNTMxMzQ5MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Joseph Thorndike, Charles Rossotti, Mike Huckabee | See full cast and crew »"],
      "reviews": [
         "I have to wonder that the three (counting mine) reviews currently on IMDb are all excellent, while the ratings are so low. Did the people giving rankings actually view the movie? Did they automatically assume that because a (fill-in the blank)-wing person was one of the commentators that the film was automatically to be dismissed. The beauty of this film - apart from the fact that it is well-done, filled with crucial information, creative and funny at times - is that it presents a common theme among people of different political persuasions; something we can all get behind: the grotesquely complex tax code is due to thousands of special tax breaks. The tax code is unfair, intimidating and out-of-date. Personally, I'm glad there is an issue which so many people can get behind. Now, if we just tried to learn more about it - and this film helps - we could, as one commentator said, \"Force the hand of the lawmakers\". As another commentator said - if we don't pay attention, then the wrong people will, and they'll (they are) make out like \"bandits\". There really are a few basic principles one can learn that will greatly raise one's level of awareness. A good companion book is one written by one of the commentators, John O. Fox - If Americans Really Understood the Income Tax: Our Most Expensive Ignorance. Very readable, even for someone like me with no background in the area. I learned a great deal and feel much more capable of entering the conversation about tax reform now.",
         "This movie did a wonderful job of helping me get a better understanding of the US Tax Code. I loved the way all of the sides were included to paint a vivid picture of how evil the Tax Code is. The interviews were the people I would want to talk to about the topic and the way in which they answered questions had me agreeing with all sides. My only real critique was the amount of old footage used and the lack of story. While the footage was enjoyed at times in the movie I just would have liked to have seen a little less of it. What a great educational piece that made taxes interesting and less complicated to understand.I recommend it to all sides of the aisle.",
         "The very real problem that faces our nation in more ways than one does happen to be our taxes and how we as a nation tax ourselves. We are very closed to the idea that we as a country have any power at all to effect change in a real way that is significant in regards to our nations tax policy or code. This is a long and boring subject and unfortunately this is also a bit of a boring movie as well but still an important one. with the lack of public knowledge of such a subject it is important to really educate ourselves and each other on not only what the tax code is but why it is and how it works. I will admit that the movie is actually a little hard to grasp but it really taught me what the tax code is and where it actually comes form.",
         "I had the chance to see this documentary and came away very impressed. The topic of tax reform is covered with skill and doesn't lean to one side or other of the debate, but rather lets experts propose solutions to what it considered a unanimously messy problem. For the most part, the film takes a heady subject and explains in a way that is informative, and at times even amusing. There is an allegorical usage of B-movie monster film (albeit a little tongue-in-cheek) to push forward the idea that we have created the thing (tax code) that will ultimately destroy us! The information is presented in a linear and understandable fashion that both tells how the country found itself in its current predicament and how it can potentially solve the problem. On the negative side, the film spends a bit too much time showing cutesy animations and found footage, but given the wordy nature of the subject matter, I can understand the choice to use this filler to break up the headiness of the film. The interviewees include Noam Chomsky, Steve Forbes, Mike Huckabee and Ron Paul as well as a slew of others, each with an opinion on the the issue. If you are a fan of smart films that push agenda to the side in favor of raising awareness, the An Inconvenient Tax may be just the ticket!",
         "Albert Einstein once wrote, \"The hardest thing in the world to understand is the income tax.\" The product of 95 years worth of additions, subtractions, deductions, and exclusions, it has become such a headache that many are calling for it to be drastically simplified or even removed altogether. The first interesting thing this documentary claimed was that the Boston Tea Party was not a revolt against taxes but actually tax loopholes. I had never heard that, and if true, changes the way I look at this piece of history. What is great about tax reform is that you have people on the left (Noam Chomsky) and the right (Ron Paul, Herman Cain) who agree it should be done. Of course, few people agree how it should be done, but we know it is too complicated, their are too many loopholes. The details are the problem. I like how it showed that people in the early days of taxes (after 1913) saw paying taxes as a sign of success and patriotism. If this was accurate, that is interesting."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Life Is My Movie Entertainment Company",
         "Observer Productions"
      ],
      "summaries": ["Albert Einstein once wrote, \"The hardest thing in the world to understand is the income tax.\" The product of 95 years worth of additions, subtractions, deductions, and exclusions, it has become such a headache that many are calling for it to be drastically simplified or even removed all together. With a looming fiscal crisis on the horizon, April 15th seems more like a scene from a B-Horror horror movie than a day to contribute to the common good of the nation. Political favoritism, ineffective social programs, and economic manipulations all reveal the need for tax reform. But how can Americans decide the best way to change the income tax when few people even understand the code or the vast extent to which it truly affects the country? An Inconvenient Tax explores the history of the income tax and brings to light the causes of its many complexities. The film follows the tax through wars, economic booms, and some of the most significant presidencies in U.S. history. To help crack the code, the film employs the country's top economic experts, commentators, and political voices. Noam Chomsky, Steve Forbes, Joseph Thorndike, Mike Huckabee, Charles Rossotti, Dave M. Walker, Neal Boortz, Michael Graetz, Daniel Shaviro, Leonard Burman, and others discuss not only the problems America faces in the tax code, but also give valuable insights on how to move forward. Finally, the film gives a voice to the creators of several tax reform solutions who claim to have found a better way. In a time when many Americans are concerned about the future of the economy, rising deficits, and unfair tax treatment, \"An Inconvenient Tax\" provides a crucial, honest look at the income tax. For the first time ever, Americans can engage in the tax debate with confidence and perhaps discover a new way to tax."],
      "budget": 0
   },
   "movielensId": 91167,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-04-15",
      "dvdReleaseDate": null,
      "directors": ["Christopher Marshall"],
      "runtime": 78,
      "movieId": 91167,
      "title": "An Inconvenient Tax",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1268224",
      "originalTitle": "An Inconvenient Tax",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["T5YzMH0ySPc"],
      "plotSummary": "An Inconvenient Tax is a 2010 documentary film produced by Life Is My Movie Entertainment. The film explores the history of the income tax in the United States and the causes of its many complexities.",
      "tmdbMovieId": 202152,
      "avgRating": 3.33333,
      "releaseYear": "2011",
      "numRatings": 3,
      "posterPath": "/lTWJxlc6Q24NN3an1o9PUCssUZ3.jpg"
   }
}