{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0016029",
      "video": false,
      "title": "The Little Colonel",
      "recommendations": [
         43268,
         38716,
         57840,
         31621,
         43869,
         43895,
         29877,
         29887,
         28345,
         27597,
         43150
      ],
      "backdrop_path": "/k60yLCdjAYPkhhXzfa7ZvExAsCi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lloyd Sherman",
               "gender": 0,
               "credit_id": "52fe4600c3a368484e07b22d",
               "name": "Shirley Temple",
               "profile_path": "/wWwwQ4Xjb0HHgnPgAnOh2Nx6xZG.jpg",
               "id": 95624,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Colonel Lloyd",
               "gender": 2,
               "credit_id": "52fe4600c3a368484e07b231",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Elizabeth Lloyd Sherman",
               "gender": 1,
               "credit_id": "52fe4600c3a368484e07b235",
               "name": "Evelyn Venable",
               "profile_path": "/bDAA7zSkxWuzD5tylRVEHXKwIBV.jpg",
               "id": 117073,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Walker",
               "gender": 2,
               "credit_id": "590f8eb4c3a368646b027747",
               "name": "Bill Robinson",
               "profile_path": "/1U0BX3WjJ2jyEcFvm2RafG8VN47.jpg",
               "id": 240072,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Becky \"Mom Beck\" Porter",
               "gender": 1,
               "credit_id": "590f8ece9251414ead024090",
               "name": "Hattie McDaniel",
               "profile_path": "/y3QtJ1qZD7Ms0IAzRbgOunMp97h.jpg",
               "id": 11498,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jack Sherman",
               "gender": 0,
               "credit_id": "590f8ee2c3a368646b02776d",
               "name": "John Lodge",
               "profile_path": "/dKLUrgJSkcq7iPGliG81xL8Fdrw.jpg",
               "id": 133470,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Swazey",
               "gender": 2,
               "credit_id": "590f8ef4c3a368650a02433f",
               "name": "Sidney Blackmer",
               "profile_path": "/ijI8tIlurlyyVTZYgZvoiifrMi3.jpg",
               "id": 12022,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Hull",
               "gender": 0,
               "credit_id": "590f8f0bc3a36864fc025233",
               "name": "Alden 'Stephen' Chase",
               "profile_path": "/pZL7PMCiBDZ6LJqep6TgARTfyjd.jpg",
               "id": 56140,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Scott",
               "gender": 0,
               "credit_id": "590f8f1f9251414e8902601d",
               "name": "William Burress",
               "profile_path": null,
               "id": 128354,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Maria",
               "gender": 0,
               "credit_id": "590f8f359251414e92025a91",
               "name": "Geneva Williams",
               "profile_path": null,
               "id": 1812517,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4600c3a368484e07b23b",
            "name": "David Butler",
            "profile_path": "/2MivycBAyVLbLJfZAOtqyFjUCAR.jpg",
            "id": 76381,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.743144,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29879,
      "vote_count": 9,
      "budget": 0,
      "overview": "After Southern belle Elizabeth Lloyd runs off to marry Yankee Jack Sherman, her father, a former Confederate colonel during the Civil War, vows to never speak to her again. Several years pass and Elizabeth returns to her home town with her husband and young daughter. The little girl charms her crusty grandfather and tries to patch things up between him and her mother.",
      "similar": [],
      "original_title": "The Little Colonel",
      "runtime": 80,
      "poster_path": "/l28YwVQJ8at0urkl6qet8uzc7j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1935-02-22",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["David Butler"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "William M. Conselman",
         "William M. Conselman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016029/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjU3NjYyODk1N15BMl5BanBnXkFtZTgwNDI5Njc0MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shirley Temple, Lionel Barrymore, Evelyn Venable | See full cast and crew »"],
      "reviews": [
         "Crusty old Colonel Lloyd (Lionel Barrymore) is used to having his ornery way so when he finds out his daughter Elizabeth (Evelyn Venable) is determined to run off with Yankee Jack Shermon (John Lodge) to be married, he confronts her in a heated exchange and vows never to see her again if she does, and then she leaves. Several years later Elizabeth, with her husband and their young daughter Miss Lloyd (Shirley Temple), decides to return to a small house that belonged to her mother and which happens to be next door to her stubborn father's home. Obviously there are soon accidental meetings between all concerned, and a few clashes of granddaughter and the elderly Colonel just to see who is the most stubborn! Troubles descend on the Sherman family through some persuasive dishonest men who are out to rob them of their legal rights, and things start to get serious but grandpa comes to the rescue. Becky (Hattie McDaniel) and Walker (Bill Robinson) certainly add some amusing dialog during their stroll, as in spelling out \"pohos\"; and Robinson's tap dancing is superb. Not surprisingly, little Shirley is right in there keeping pace with him as they both tap dance up the stairs. A great moment in film. Nice family entertainment.",
         "It's odd that Shirley Temple made two similar movies in the same year, both involving Civil War-type story lines and her character being very similar. \"The Littlest Rebel\" took place during the Civil War and \"The Little Colonel\" took place right after the war. For some reason, I get an extra feeling being choked up seeing Shirley melting a crabby old man's heart as she did in some of her films, this being one of them. Here, it's Lionel Barrymore who was fun to watch in any film. The lead female role was played by Evelyn Venable and she really wasn't up to the standards, beauty-wise, set by previous Temple adult feminine leads such s Gloria Stuart, Karen Moreley, Rochelle Hudson, etc. But, that's not important. The story was more important and in case - surprise - I found this to run a distant second to the aforementioned \"The Littlest Rebel.\" This movie was, frankly, boring in comparison. I am not one of the crying Liberals who boycott Temple''s films because blacks in these movies were denigrated. Unfortunately, that's what you saw in 1930s films....and what's done is done. However, the black characters in here are just plain treated embarrassingly bad. Everyone's Mr. Nice Guy (mine, too) Bill Robinson, didn't come on the scene and dance with Shirley until later in the film when I had lost interest. Temple, meanwhile, is so cute that she's even likable when she's a brat, as she acts several times with the old man (but apologizes later for her behavior). It's still a good film but I prefer the \"Rebel\" over the \"Colonel\" in the battle of these 1935 Civil War-themed stories.",
         "Having earned her nickname due to her stubborn temper, THE LITTLE COLONEL courageously tries to reunite her splintered family. Shirley Temple smiles, pouts, tosses her curly locks and completely runs away with the movie. One of her early family classics, this is an excellent showcase for her tremendous charm & abundant talents. As box-office queen, the mighty moppet would dominate Hollywood during the second half of the 1930's. Never was a despot so welcomed or a tyrant so loved. As one of the industry's finest character actors, crusty Lionel Barrymore gives the little lady a run for her money. Always entertaining, he knows when to purr or when to roar to maximum effect, even if he doesn't quite eclipse Little Miss Personality. Hattie McDaniel adds her own unique gifts to the role of Shirley's faithful servant, never allowing her dignity to be demeaned. As always, she is a joy. The legendary Bill Robinson is also on hand, mostly, one suspects, so as to partner Shirley in a couple of dances and they are wonderful, especially in Robinson's signature Staircase Dance. They are perfectly matched - one ramrod straight & ebony, the other tiny & blonde - and their minutes together on the screen is the stuff of which movie magic is made. Evelyn Venable & John Lodge, as Shirley's parents (it's rare for her to have both all the way through a film) do nicely with the romantic angle, but it's kept to a minimum, as is usual in a Temple film, where the spotlight is kept firmly focused on her. Sidney Blackmer appears as a smooth swindler who makes the serious mistake of angering THE LITTLE COLONEL. Although the film is given good production values by 20th Century Fox, it is the interaction between little Shirley and the other performers which far and away is the most important aspect of the picture. It should be noted that there are elements of racism in the story line, a not uncommon occurrence in Hollywood films of the 1930's. The final scene segues into early Technicolor - a pleasant way to end the story.",
         "Personally, I think this is Shirley's best movie. It's got a good story (rare in children's movies), my favorite actor (Lionel Barrymore), great acting from a 5-yr-old child (Shirley), great dance numbers with Bojangles, lots of servant put-downs of their masters (as when Bojangles calls his master a fool) and also lots of humor, as when Shirley throws the chess set onto the floor, strikes an angry pose, and tells her Grandpa, \"You're a bad man!\". I smile every time I see that. The little 5-yr-old girl put the 70-something old guy in his place. If you've not yet seen the Little Colonel, I recommend you buy or rent it now. It's a great introduction to the actress Shirley Temple, and you can see why she was the number one star in 1936, 37, and 38.",
         "There will never be a child star to match Shirley Temple. A born actress, dancer, and entertainer. In this movie she has an amazing support cast of Lionel Barrymore who plays the part of a crusty grandfather but Shirley with her cute and charming ways soon melts the heart of the old grandfather. Hattie Mac Daniel plays the faithful servant and once again it made you realize just how much these beloved negroes sometimes knew more than \" The white folks\". The dancing down the steps with \"Bojangles Bill Robinson\" is something that can make you appreciate the talent of a young and not so young. The story line can be weak in places and the acting might be a bit corny to todays standards but if you need a feel good movie then drag out a Shirley Temple movie . You won't be disappointed.",
         "When watching this Shirley Temple film, it is easy to see why The Little Colonel was such a crowd-pleaser. This film has a long Old South story to tell, that is both sentimental and predictable. The story has young Shirley Temple up against gruff old Lionel Barrymore, as her stubborn grandfather. For her sidekick, she has favourite Bill \"Bojangles\" Robinson, and the two of them are sheer magic together. One of their best scenes is the famous staircase dance. But the film was in danger of losing Lionel Barymore. At the time this movie was being filmed, Mr.Barrymore was suffering with severe arthritis, in extreme pain he had difficulty walking. A large blackboard was wheeled on-stage with all of Barrymore's lines chalked up. During filming he was stumbling on his lines and innocent Shirley Temple told him what his line was-- 'Mr. Barrymore, you're supposed to say so-and-so here.'The humiliated veteran actor exploded, yelling \"I'm thirty years in this business!\" Being warned not to swear in front of the child, Mr. Barrymore tried his best to storm of the set to his dressing room. Director David Butler went after him and came back with the bad news, he felt Shirley had made him look ridiculous, and to get somebody else to do the picture. It was now up to Shirley Temple to go alone and make up with him. She did, by telling him he was the best actor in the world, and asking for his autograph. As always, little Shirley Temple saves the day. It should also be noted that Shirley was known as \"One Take Temple\" because of her amazing ability to memorize her lines as well as all of the other players, before she could even read or write. The sheer magnetism of Shirley Temple always makes The Little Colonel a very enjoyable film to watch.",
         "THE LITTLE COLONEL (Fox, 1935), directed by David Butler, stars Shirley Temple in one of her more famous movie roles during her early years as a young performer. Aside from her initial teaming with legendary dancer Bill \"Bojangles\" Robinson (4th billed during opening credits, bottom billed in the closing), with whom she does a memorable \"stair\" dance, it places her against odds with the crusty Lionel Barrymore, on loan out assignment from MGM, sporting white hair, bushy eyebrows and droopy mustache in the old Southerner/ or Claude Gillingwater Sr. tradition, and what a pair they make. Based on a story by Annie Fellows Johnston, the plot opens with a prologue set in 1870s Kentucky on a Southern plantation where Colonel Lloyd (Lionel Barrymore) disowns his beloved daughter, Elizabeth (Evelyn Venable) for eloping with a \"Yankee\", Jack Sherman (John Lodge). During their six years in Philadelphia, Jack and Elizabeth have been blessed with a child, Lloyd (Shirley Temple), whom they witness being commissioned as a \"little colonel\" by soldiers on a western outpost. With John remaining at the post, Elizabeth returns to Kentucky where she and Lloyd settle in an old cottage left to her by her late mother that happens to be next door to her father. After meeting his granddaughter with an introduction of getting mud thrown on him, he finds her to be just as stubborn and quick tempered as he. In spite of their rugged start and similar personality traits, Grandpa eventually warms up to Lloyd, though his stubbornness keeps him from having anything to do with his daughter, even when learning of swindlers Swazey (Sidney Blackmer) and Hull (Aden Chase) in their home threatening the ailing Jack and Elizabeth to turn over the deed to worthless property they sold him that has been proved valuable. THE LITTLE COLONEL, a leisurely paced story with familiar theme, relies mostly on the strength of its leading players, Temple and Barrymore. It's also one of the better films in which Temple does not typically play an orphan. Evelyn Venable, whose career failed to take off after a promising start opposite Fredric March in DEATH TAKES A HOLIDAY (Paramount, 1934), provides the opening playing the harp and singing \"Love's Young Dream\" to her guests. The song is later reprized by Temple serenading to her grandfather as he envisions his daughter at the harp. John Lodge, virtually forgotten but better known for his performance as Count Alexi in THE SCARLET EMPRESS (Paramount, 1934) starring Marlene Dietrich, has little to do until the final half of the story. Hattie McDaniel, four years away her Academy Award winning performance in GONE WITH THE WIND (1939), supports as the Sherman maid, Mom Beck. Dressed in \"Aunt Jemima\" attire, she shares amusing moments with Colonel Lloyd's butler (Robinson), sharing time together with the \"little colonel\" at a spiritual gathering witnessing a woman getting dunked in the river where she's having her sins washed away as Negroes sing \"The Sun Shines Brighter.\" Aside from the aforementioned \"stair dance,\" Temple and Robinson do an encore tap dancing to Stephen Foster's \"Oh, Susannah\" in the stable to harmonica playing by May Lily (Avonne Johnson). Johnson, along with Nyamza Potts as her little brother, Henry Clay, support as Temple's playmates. As in many Temple films, there's a pet dog, this time a pooch named Fritzi. Others in the cast include William Burress (Doctor Scott); Geneva Williams (Maria); and Robert Warwick (Colonel Gray). Priot to 1985, THE LITTLE COLONEL played frequently on commercial television with the closing segment, filmed in Technicolor, usually absent, with story coming to an abrupt conclusion either after Barrymore's closing line or next scene of McDaniel successfully breaking down the door after being locked in by one of Sherman's \"guests.\" When distributed on video in 1988, the closing Technicolor segment was restored, and shown intact at 82 minutes on cable TV broadcasts on the Disney Channel (early 1990s), American Movie Classics (1996-2001) and finally the Fox Movie Channel. THE LITTLE COLONEL is currently available on DVD in black and white or colorized versions. The success of THE LITTLE COLONEL brought forth a similar theme and title of THE LITTLEST REBEL (1935), reuniting Temple with Bill Robinson once again, with plot set during the Civll War instead of after-wards. Both classic films with Temple (and Robinson) at the peak of their careers. (***1/2)",
         "With all of her usual show-stealing spark, Shirley Temple delivers another fun family classic as Lloyd Sherman in \"The Little Colonel.\" Proving yet again that there's no problem she can't solve, Shirley reconciles an old grudge between her young mother (played by Evelyn Venable) and her crusty southern grandfather (played by Lionel Barrymore), who disowned his daughter for marrying a Yankee. Shirley's classic tap dance up the staircase with Bojangles Robinson will remind all of her fans of what a true dancing prodigy she really was. And a few scenes later, her song \"Love's Young Dream\" will show you why her singing is not as well remembered as her dancing. Don't get me wrong: Shirley shines in fast, snappy songs, but her voice was not made for slow numbers like this one. \"The Little Colonel\" is a nice family film, but except for the iconic staircase dance, there is little to distinguish it from most of Shirley's childhood flicks. The claim that this film smashed through racial barriers by placing Shirley Temple opposite African-American screen legends Bojangles Robinson and Hattie McDaniel is almost laughable. Rather, Robinson and McDaniel play complete racial stereotypes: Robinson is the clichéd childish, comical servant (\"The stereotyped picture of gay song-singing cotton pickers,\" to quote Maya Angelou). Watch him stand idly by while Barrymore fusses and fumes at him, because he knows \"the old colonel don't mean no harm.\" Meanwhile McDaniel is a Mammy figure, loyal, caring, and always glad to serve the white folks (McDaniel later won an Oscar for playing the same Mammy figure in \"Gone With the Wind\"). In her famous novel, \"The Bluest Eye,\" Toni Morrison writes, \"I hated Shirley. Not because she was cute, but because she danced with Bojangles, who was my friend, my uncle, my daddy, and who ought to have been soft-shoeing it and chuckling with me. Instead he was enjoying, sharing, giving a lovely dance thing with one of those little white girls whose socks never slid down under their heels.\" But one cannot really expect better from a film made in 1935, when America was, unfortunately, still in the Dark Ages as far as African-Americans and their rights were concerned. Such clichéd roles were the only acting jobs available for African-Americans at the time, and so Robinson's and McDaniel's talents are largely untapped as their characters completely lack the depth given to white actors. For example, Lionel Barrymore's Colonel Lloyd has both positive and negative characteristics: He is a temperamental hothead who remains bitter over the Civil War, but he is also a southern gentleman who immediately brings his new neighbors a bouquet of flowers to welcome them.",
         "This movie was made in 1935. It's amazing how progressive its messages are. Lionel Barrymore is wooden in his role as Temple's grandfather, and the plot is beyond lame; but Shirley Temple still is fully convincing as Lloyd Sherman--a precocious, color-blind, and happiness-inducing five- year-old child of the 1870s. Hattie McDaniel, Bill Robinson, and Avonne Jackson are amazing in their rapport with Temple. There are some pretty clever lines that are really, really funny--many of them about ignorance, stubbornness, and prejudice. This movie is crying out loud for the attention of a rhetorician or a cultural studies theorist!",
         "America's favorite moppet Shirley Temple may have met her match in scene stealing with Lionel Barrymore playing her grandfather. Just watching Barrymore taking back his scenes from Temple makes The Little Colonel an enjoyable film to watch. Barrymore complete with white suit, Panatella, and goatee with long white hair looks like the spitting image of Colonel Sanders. He's one reconstructed old rebel and what Lee and Grant signed at Appomattox has no bearing on him. All he has to hear is that his daughter Evelyn Venable has taken unto herself a Yankee for a husband and he disowns her. So she and John Davis Lodge go first north and west and have themselves a daughter. When Lodge goes into the west with a couple of shifty partners in a prospecting deal, he sends Venable and the little girl they have now back south to live with grandfather. Well kind of, as they take a gate cottage to live in. But as these Shirley Temple movies go, you know it's Shirley who brings all the warring parties together. Who could resist. The Little Colonel is known for that famous dance that Bill Robinson does with Shirley Temple on the staircase. It's still as entertaining as it ever was. The last couple of minutes are in color in which all the principal players appeared in that for the first time. The scenes with Barrymore and Temple are absolutely precious. Just who was the best capturer of the audience's attention. Judge for yourself."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Fox Film Corporation"],
      "summaries": ["After Southern belle Elizabeth Lloyd runs off to marry Yankee Jack Sherman, her father, a former Confederate colonel during the Civil War, vows to never speak to her again. Several years pass and Elizabeth returns to her home town with her husband and young daughter. The little girl charms her crusty grandfather and tries to patch things up between him and her mother."],
      "budget": 0
   },
   "movielensId": 91286,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1935-02-22",
      "dvdReleaseDate": null,
      "directors": ["David Butler"],
      "runtime": 80,
      "movieId": 91286,
      "title": "The Little Colonel",
      "mpaa": "PG",
      "actors": [
         "Shirley Temple",
         "Lionel Barrymore",
         "Evelyn Venable",
         "Bill Robinson",
         "Hattie McDaniel",
         "John Lodge",
         "Sidney Blackmer",
         "Alden 'Stephen' Chase",
         "William Burress",
         "Geneva Williams"
      ],
      "imdbMovieId": "0016029",
      "originalTitle": "The Little Colonel",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After Southern belle Elizabeth Lloyd runs off to marry Yankee Jack Sherman, her father, a former Confederate colonel during the Civil War, vows to never speak to her again. Several years pass and Elizabeth returns to her home town with her husband and young daughter. The little girl charms her crusty grandfather and tries to patch things up between him and her mother.",
      "tmdbMovieId": 29879,
      "avgRating": 3.625,
      "releaseYear": "1935",
      "numRatings": 16,
      "posterPath": "/l28YwVQJ8at0urkl6qet8uzc7j.jpg"
   }
}