{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0195256",
      "video": false,
      "title": "The Goddess",
      "recommendations": [
         8353,
         217411,
         141906,
         148050,
         190081,
         144674,
         129394,
         146987,
         90909,
         227289,
         89688,
         110760,
         94513,
         87193,
         88269,
         129971,
         144425,
         31404,
         144694,
         19013
      ],
      "backdrop_path": "/tOzuI9HXpPvs6kf0tHxqtT3DPSF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "The 'Goddess' / Ruan Ling-Yu",
               "gender": 1,
               "credit_id": "52fe4b1ec3a36847f81f34c1",
               "name": "Ruan Lingyu",
               "profile_path": "/lzLhFdjoz0Ki23NHa5TA0Us2E35.jpg",
               "id": 1021587,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "56e8c1dc9251417bb70012d9",
               "name": "Tian Jian",
               "profile_path": null,
               "id": 1591588,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "The 'Boss' (as Zhang Zhizhi)",
               "gender": 2,
               "credit_id": "56e8c1eb9251413738000d27",
               "name": "Zhang Zhi-Zhi",
               "profile_path": null,
               "id": 1381289,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Son (as Li Keng)",
               "gender": 0,
               "credit_id": "56e8c1f5c3a3682d6c00149e",
               "name": "Keng Li",
               "profile_path": null,
               "id": 1420477,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "(uncredited)",
               "gender": 0,
               "credit_id": "56e8c1fe92514154d7000a92",
               "name": "Junpan Li",
               "profile_path": null,
               "id": 1591589,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "(uncredited)",
               "gender": 0,
               "credit_id": "56e8c2099251417a86000146",
               "name": "Huaiqiu Tang",
               "profile_path": null,
               "id": 1532218,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b1ec3a36847f81f34bd",
               "name": "Yonggang Wu",
               "profile_path": null,
               "id": 1073182,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56e8c18c92514154d7000a6a",
               "name": "Yonggang Wu",
               "profile_path": null,
               "id": 1073182,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56e8c19ec3a3682d65001399",
               "name": "Yonggang Wu",
               "profile_path": null,
               "id": 1073182,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "56e8c2159251417bcc001334",
               "name": "Minwei Tian",
               "profile_path": null,
               "id": 1591590,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56e8c1959251417bc00012ea",
               "name": "Hong Weilie",
               "profile_path": null,
               "id": 1591587,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.63801,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 112698,
      "vote_count": 15,
      "budget": 0,
      "overview": "The story of a young prostitute who is trying to give her infant son a good start in life, fighting against the prejudices of others and the attentions of a pimp.",
      "similar": [],
      "original_title": "神女",
      "runtime": 73,
      "poster_path": "/eoUdheiZ1bhyX2lRRPh3IKddzez.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lianhua Film Company",
         "id": 37230,
         "origin_country": ""
      }],
      "release_date": "1934-01-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Yonggang Wu"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Yonggang Wu"],
      "originalLanguage": "Chinese",
      "imdbLink": "http://www.imdb.com/title/tt0195256/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NTI5MDgwOV5BMl5BanBnXkFtZTcwOTk1MDE0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Lingyu Ruan, Tian Jian, Zhizhi Zhang | See full cast and crew »"],
      "reviews": [
         "One of the most important productions of the golden age of Chinese films because of its symbolism was director Wu Yonggang's first endeavor,\"The Goddess\" (Shennu). The title of the film was the Shanghai way of describing a woman who sells her body. Ruan plays a prostitute who uses her earnings to support and educate her son. The heroine is forced to enter the oldest of professions, as it is the only way for her and her child to survive and to provide for his education. More than any other film, \"The Goddess\" captures the misery and hopelessness of China at the time. Ruan is the symbol of China's suffering. Only as a prostitute could she support her child and give him an education. \"The Goddess\" was a breakthrough for the director Wu in his sympathetic depiction of a prostitute. He used montage to portray Shanghai at night. He also shows that she was moral, but evil forces were the cause of her plight. A new DVD with English inter-titles and a beautiful piano score by Kevin Purrone is available from The San Francisco Silent Film Festival (www.silentfilm.org). My new book \"Ruan Ling-yu: The Goddess of Shanghai\" published by Hong Kong University Press tells the tragic story of Ruan Ling-yu.",
         "This silent film comes from the \"social conscious\" school of Chinese filmmakers of the mid-thirties and deals with the problems facing a single mother who has slipped into a life of prostitution, partly from a desire to maintain her child. It's very much of a \"studio\" film, with few exteriors and rather limited sets. Despite some melodramatic aspects of the story, the acting is quite well-done. In fact the primary interest of the film is due to the sensitive and luminescent performance of the star, Ruan Lingyu. Since the story concerns the plight of a woman (and her child) who suffers from scornful remarks made by those around her, there is an extra element of interest associated with the fact that Ruan Lingyu committed suicide shortly after making this film, apparently because of malicious gossip made about her private life. Technically, the film features some inventive camera work, considering the mundane sets. The editing, however, is not first-rate, with numerous jump cuts and camera-axis crossings. Another surprising element is the text length of some of the titles. Many of the titles seem unnecessarily long. In any case, the film is carried along by the emotive performance of Ruan Lingyu. This film is well worth seeing.",
         "As an ancient Chinese poet has mentioned before, \"it is even mesmerizing to be silent rather than with sound\"... this is what i would like to quote here to describe the feeling when i was watching \" Shennv\". A quite simple plot, but truly a heartbreak story...Even though it is not a talkie, no background music( the VCD version i watched), no color, but her splendid acting already captured my heart, the way she express the sorrow and the ambivalent being a wonderful mother and a depressed prostitute is simply captivating...I am wandering how a young actress (she should be 24 at that time), without any formal education of performing art, will able to achieve such a superb and impressive acting skills...no doubt she has become one of the screen legend in cinema history... it is no doubt a genuine classics in Chinese silent cinema, worth watching...",
         "This film stars the beautiful and tragic actress Ruan Ling Yu as a prostitute in Shanghai, whose life is devoted to having her son excel in life. She is a prostitute so she can make money for him. Along the way, a man rescues her from the police and becomes her pimp, not exactly of her own choosing. The story is her struggle. In a lesser actress this could have been too sentimental and unrealistic. Ruan Ling Yu is amazing in this role. Keeping in mind this is a silent film, her expressions and mannerisms have to be on target and they always are. The concept of a prostitute with a heart of gold has been fairly overdone, but Ruan Ling Yu is so great, it makes the film great. A tragedy that she took her life at 24, it is a loss to anyone who watches films. Just a terrific film.",
         "I've just watched \"The Goddess\" and was enormously impressed. Ruan Ling-Yu plays the part of a prostitute who sells her body to support her child and give him an education. Her magnificent performance dominates the film. With a wonderful dignity which completely avoids melodrama, she conveys a complexity of emotional dimensions through her facial expressions. Thus, we see her tenderness as she cradles her baby, the terror when the \"Boss\" threatens to take the child if she doesn't follow his orders, the joyful delight when her son gets the chance to escape the filth of the society which victimizes her by going to school. At other times Ruan conveys anger, bitterness, frustration, and sorrow. A particularly moving scene is the moment she pleads with the old principal to keep her child at school despite the objections of the more \"respectable\" parents. This scene also focuses the themes of vulnerability and victimization which permeate the film's societal vision. In an excellent commentary to the film, Richard J. Meyer points up Ruan's emphasis on such themes as Poverty, Sufferng and Class Division through the persona of the Strong woman and mother. All these ideas are clearly and memorably crystalised in \"The Goddess\". Two contrasting figures are the Boss, the prostitute's Pimp, who victimizes and uses her for his own greed and the gentle, socially aware principal who realizes her inner dignity and heroic worth as she struggles against the restrictions of a \"toxic environment\". The conclusion dramatizes the heroically sacrificial personality of the mother. Sentenced to 12 years in prison for killing the Boss, she accepts the offer of the old principal to adopt and educate her son. She resigns herself stoically to the joy of knowing he will escape the societal trap of poverty and degradation which has destroyed her life. There are wonderful moments in this film. At one point she cuddles her child. She rocks him almost in time with the inexorable swings of the pendulum of the clock which will send her out on to the streets. When the Boss threatens to sell her child, the camera frames through the triangle formed by the aggressively spread legs of the Boss as she huddles on the floor protectively clasping her baby. It's a scene one will never forget. The film has an absolutely wonderful piano accompaniment both composed and played by Kevin Purrone. He skillfully blends various motifs to create atmosphere and convey character details superbly. Tony Raynes put it well when he said: \" . . .this is the kind of film that demands a rewriting of the film history books. . . Free of moralism and melodrama, expressively composed and lit and very naturalistically acted, this is a film of startling modernity.\"",
         "Although I am a big fan of silent movies, I have to admit that The Goddess is the first Asian silent movie I have ever watched. Well acted, The Goddess tells the story of a mother who is a prostitute selling herself to make ends meet for her and her young son. Scorned and ridiculed by the neighbors, the community and (in the case of her son) local children, The Goddess is an intriguing and engrossing silent. Although ashamed of her way of life, the mother has nothing but love for her son, and she is determined to provide him with a good education so he has a better chance at life than what she had. However, local parents complain to the school about this child being a bad influence on the other children and the morality of the school due to his mothers disgraceful way of making a living; resulting in the child being expelled from the school. There are a few twists and turns in this movie that provides a well-balanced and intriguing storyline. Wonderfully filmed, The Goddess captures the desperation of a struggling single mother quite well. Overall, I thought The Goddess was an excellent silent, and one I would highly recommend to others who are also fans of the silent age of movies as well.",
         "The Goddess (Lingyu Ruan) works the Shanghai street as a prostitute to raise her beloved son. She falls under the control of The Boss. She tries to escape the life but she is pushed back in. He's an illiterate sadistic brute who even pretends to sell her son to put her in fear. Her son is ostracized by the other kids and she uses her hard earned money to pay for an education. The other parents find out and try to get him expelled. The elderly principal struggles to let him stay but he is unsuccessful. The boss steals the money she had hidden away. This is a throughly modern movie. It's a silent movie from China. The lead actress is terrific. It is such a downtrodden portrayal. It's also amazing to see Shanghai during its 30s Golden Age. This is a treasure of a time gone by.",
         "The Goddess (1934) *** 1/2 (out of 4) Extremely good silent drama from China about a devoted and loving mother (Lingyu Ruan) who wants the best for her young child so by night she works as a prostitute. This leads her to take all sorts of abuse by the other women in her area but worse of all is the abuse she takes from a man (Zhizhi Zhang) who pretty much takes possession of her. THE GODDESS is without question a true gem and certainly one of the best Chinese pictures I've seen from this era. It's easy to see why this film was such a hit in China when it was originally released and especially when one learns that many women in that era were working as prostitutes to support themselves. Making a silent film in 1934 certainly wasn't the norm at the time but I honestly don't think this movie would have worked had there been sound. Director Yonggang Wu does a masterful job at making everything flow so well that the added words would have just taken away from its poetic beauty. The film flows from one bad situation to the next and after a while you begin to realize that whenever something nice happens for the young mother then sure enough something bad will follow. What really makes this film work so well is the amazing performance by Ruan who apparently felt many of the same emotions as this character. From what I've read, before this film she had several suicide attempts and she eventually did kill herself about a year after this picture was released. Her performance is simply one of the best from this era in any film because of the emotion and love she shows for her kid. Even better is when the pain of her situation and \"job\" begin to haunt her. Zhang, who plays the abusive jerk, is certainly a major snake that people will have no trouble in hating. The only negative thing is that the film never really bothers to tell us how the mother got into this situation and there's really no explanation as to why she doesn't try doing something else. Still, THE GODDESS is without question a real gem with one of the best performances that you're going to see.",
         "A silent film in 1934 in China, when the rest of the world had moved to talkies in 1930, that's surprising. But this film is probably a masterpiece. And yet the subject is simple. A prostitute wants to provide her son with an education. The film is about the difficulties she meets on the way to this objective. First of all her pimp is stealing her money all the time. Then the slandering rumors and then protest letters of other parents in the name of the reputation of their children. The headmaster of the school is ready to concentrate on his mission, which is to educate the child and not consider the mother. But he has to resign and the others get rid of the kid. Then the mother wants to leave the city where they are known but she finds out her pimp has stolen her money one more time. She confronts him and finally attacks him with a bottle. The court of justice to which she is brought will not look for extenuating circumstances and will send her to prison for twelve years and the child to some special education school. But then the headmaster who had resigned for the child decides to visit her and get her authorization to take care of the child and provide him with the education he deserves. She agrees and the end is an angelic dream of the mother about the happy future of her son. This scenario is very typical of its period but it has little in common with what the west was doing at the time or even before. There is no excessive expressiveness, no images overloaded with symbolic meaning. The actors play as if they were able to speak, in the most natural way. This acting gives to the argument a believable power that makes it just plain real. It is pure and true truth and nothing else. The second argument is that the situation and the discourse is possible, believable and serious. No artificial body language, no excessive posturing and contortions, no overdone facial expressiveness. That increases the power of the story and we just accept it as being what may happen everyday around us, if we opened our eyes enough to see it. The film then becomes extremely significant. But the divine, angelic or idyllic end is surprising in 1934 when the whole world is sinking in the worst crisis ever and when military aggressiveness is growing in all countries or nearly. But the great advantage is that it makes it possible to avoid any kind of easy ideological discourse, like the republican reformism of the Kuomintang or that of the Communist Party of Mao Zedong. And that enables the film to become universal. Dr Jacques COULARDEAU",
         "The Goddess was released in 1934, which is directed by Wu Yonggang. This movie is regarded as one of the best movie of China's film history. The actress, Ruan Ling-yu, became an icon of Chinese silent film for her performance in this film. The Goddess portrayed the miserable life of a prostitute in Shanghai during the 1930s. The prostitute is shaped as one representativeness of the social marginalized group. She suffered physical as well as psychological abuse from her surrounding environment. The more she made efforts to escape from her poor life; the more cruel things happened to her. This film has not only social significance but also cultural implication; which exhibits how weak a humanitarian morality is while facing the social reality(Meyer, 2005). The Goddess was regarded as one outstanding realism film of China's cinematic golden age (Meyer, 2005). During the period of between 1930s and 1940s, the thematic concerns of social conflict always focus on economic exploitation and political oppression in the realism film. As compared with the film with similar theme, the director of The Goddess did not place too much in revealing social exploitation and oppression. The director exhibited the social harsh through the relationship between the prostitute with other people, including her neighbours, the master of her son's school, the gangsters and other children's parents. The prostitute gained sympathy and helps from some kind people; but mostly she had to suffer the mistreatment from the evil people as well as the discrimination from the middle-class in her society. The implicit expression help director enhanced the social tragedy meaning for the disadvantaged group. The role of prostitute was performed by Ruan Lingyu who successfully shaped a woman living a dual life. As a prostitute, she abandoned her self-respect as a woman while standing at the night street to make a deal with clients. In the other hand, she had never forgotten to take her responsibilities as a mother. For example, when she returned home with a tired face every morning, the first thing what she did was to see her son. However, his son was isolated by school peers and was required to drop out because his mother was prostitute. The prostitute became the obstacle to her son; and her basic rights as mother was deprived. The image of prostitute has double tragedy meanings. This is a silent movie. The actress, Ruan lingyu, used different body language to express duel personalities of that woman, for example, seeing through the legs of that gangster, her panic face and desperate eyes. The inner world of that character has been performed by implicit facial expression and dull body movement. Yun's body language is natural but restricted, which creates a sense of elegant and classical aesthetics. The director has been influenced by symbolism and European pioneer films (Meyer, 2005). The approach to narration in this film does not follow the routines of traditional Chinese drama. The dramatic conflicts have not been enhanced by strong external actions and emotion tensions. The director more focuses on the character's psychological descriptions in the climax of the plot. For example, the prostitute was raped by that gangster; the prostitute killed that gangster; and the prostitute was in the court. There are a lot of lens that express psychological change of the characters through eyes and facial expression. In addition, aligning with Chinese aesthetic approach, this film enhance the visual effects by the means of light and the picture composition. This film also emphasizes the details design. For example, the environment landscape has been repeated through leans; and the feet of prostitutes while walking in the street to meet clients. The subtle and plain cinematographic technique create a flowing but deep style. Chinese aesthetic artistic conception has gone through the film. This film is about a story of prostitute. The title of this film � The Goddess � is actually borrowed from Chinese classical literature works, which is a euphemistic saying of women who are keeping immoral sexual relationship with men. The occupation of the character in the film is a prostitute. The tile has conveyed a implicit meaning for audiences about the content of story. The character's psychological desperation and performance form have not any erotic meanings; it is very clean instead. This is in consisting with Chinese traditional euphemism expression and subtle art style. Because of realistic social meanings, implicit narrative approach, subtle cinematographic and the outstanding performance of actress, The Goddess is one of the most important movies in the history of Chinese cinema. References Meyer, R.J. (2005). Ruan Ling-Yu: The goddess of Shanghai. Hong Kong University Press. The Goddess (Chinese: Shen nu) (1934) Wu Yonggang"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Lianhua Film Company"],
      "summaries": [
         "An unnamed devoted mother sells herself by night on the streets of Shanghai in order to support herself and her infant son. When a gambler who calls himself \"the Boss\" strong-arms his way into becoming her pimp, she flees with her son and attempts to earn an honest living, but the Boss tracks her down and forces her back into prostitution. When her son reaches school age, she begins hiding away enough money to pay his tuition. Although her son is ostracized by other kids due to her profession, she takes great joy in providing an education and a potential better future for him. When the other parents want the boy expelled, a kindly principal fights to keep him in school. Meanwhile, the Boss finds her hidden cash, adding financial woes to the problems of social injustice.",
         "Street walker by night, devoted mother by day, a woman fights to get her young son an education amid criminal and social injustice in China."
      ],
      "budget": 0
   },
   "movielensId": 91511,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1934-01-01",
      "dvdReleaseDate": null,
      "directors": ["Yonggang Wu"],
      "runtime": 73,
      "movieId": 91511,
      "title": "The Goddess",
      "mpaa": null,
      "actors": [
         "Ruan Lingyu",
         "Tian Jian",
         "Zhang Zhi-Zhi",
         "Keng Li",
         "Junpan Li",
         "Huaiqiu Tang"
      ],
      "imdbMovieId": "0195256",
      "originalTitle": "神女",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a young prostitute who is trying to give her infant son a good start in life, fighting against the prejudices of others and the attentions of a pimp.",
      "tmdbMovieId": 112698,
      "avgRating": 3.625,
      "releaseYear": "1934",
      "numRatings": 4,
      "posterPath": "/eoUdheiZ1bhyX2lRRPh3IKddzez.jpg"
   }
}