{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "short",
         "id": 214549
      }],
      "imdb_id": "tt1702433",
      "video": false,
      "title": "Kung Fu Panda Holiday",
      "recommendations": [
         81003,
         15854,
         25472,
         381693,
         36859,
         47626,
         230896,
         79379,
         91417,
         126830,
         216285,
         479488,
         25523,
         48466,
         51256,
         36934,
         29901,
         64170,
         24884,
         83201
      ],
      "backdrop_path": "/a14RyRGC3kz7YeQtvphuYMtou9v.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Monkey (voice)",
               "gender": 2,
               "credit_id": "597a64fe9251412398000010",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Po",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f81478fd",
               "name": "Jack Black",
               "profile_path": "/vMXgtzMdt2jSAjOECFQ5F53blbr.jpg",
               "id": 70851,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Shifu",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147901",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Tigress",
               "gender": 1,
               "credit_id": "52fe47c6c3a36847f8147905",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Wo Hop",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147909",
               "name": "Jack McBrayer",
               "profile_path": "/nTvIqj2pRhQPaaxB1CUj7QipY8j.jpg",
               "id": 58737,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "540ec1e9c3a36871c70011eb",
               "name": "Seth Rogen",
               "profile_path": "/aQc8O52P4vWDRfuxCLsz9rvnwf3.jpg",
               "id": 19274,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f814790f",
               "name": "Tim Johnson",
               "profile_path": null,
               "id": 52870,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55469db59251414c37004b89",
               "name": "Josh LaBrot",
               "profile_path": null,
               "id": 1462666,
               "department": "Directing",
               "job": "Layout"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.709005,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50393,
      "vote_count": 73,
      "budget": 0,
      "overview": "The Winter Feast is Po's favorite holiday. Every year he and his father hang decorations, cook together, and serve noodle soup to the villagers. But this year Shifu informs Po that as Dragon Warrior, it is his duty to host the formal Winter Feast at the Jade Palace. Po is caught between his obligations as the Dragon Warrior and his family traditions: between Shifu and Mr. Ping.",
      "similar": [
         21385,
         11544,
         10693,
         3933,
         10882,
         10895,
         10555,
         12092,
         62211,
         41513,
         10144,
         10193,
         10198,
         10527,
         9016,
         14160,
         11886,
         10530,
         12230,
         11970
      ],
      "original_title": "Kung Fu Panda Holiday",
      "runtime": 21,
      "poster_path": "/gp18R42TbSUlw9VnXFqyecm52lq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/kP7t6RwGz2AvvTkvnI1uteEwHet.png",
         "name": "DreamWorks Animation",
         "id": 521,
         "origin_country": "US"
      }],
      "release_date": "2010-11-26",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.kungfupanda.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tim Johnson"],
      "runtime": 21,
      "synopsis": null,
      "writers": [
         "Jonathan Groff",
         "Jon Pollack"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1702433/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwODUxODI3MV5BMl5BanBnXkFtZTcwNjIwODk3OA@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Black, Dustin Hoffman, Angelina Jolie | See full cast and crew »"],
      "reviews": [
         "I thoroughly enjoyed the first Kung Fu Panda films, and while not as good it still had much to like about it. The story while having some nice heart-warming moments is rather predictable and isn't very surprising, and while the dialogue and jokes certainly aren't bad I personally found most of them only amusing in alternative to laugh-out-loud hilarious(like Merry Madagascar, Shrek the Halls and especially Madagascar Penguins in a Christmas Caper). However the animation is simply spectacular with the colours so rich and the characters moving easily. The music is rousing, the characters are endearing especially Shifu though you do empathise with Po and the voice work from Jack Black, Dustin Hoffmann and Angelina Jolie is great. Overall, good holiday special, predictable and not always very funny but beautiful to watch. 7/10 Bethany Cox",
         "After Po was chosen to become the Dragon Warrior and defeated Tai Lung in the original KFP, he becomes appointed to host the Winter Feast at the Jade Palace for all 29 kung fu masters despite his needs to help his father Mr. Ping to prepare for the holidays. When he needed the Furious Five to help him prepare the annual at this time of year, he learns that spending time with a father is much more important than the annual feast and goes to his father which results in doing the right thing and the kung fu masters along with the Furious Five arrive for the holiday. Shifu goes there and is persuaded by Po to join him since he has a family. Although, not as great as the original's plot, the plot in this holiday special wasn't that bad. The computer animation was beautiful with the same lovely visuals. The characters are once again likable and the voice acting was as perfect as the original's. Even the music from Hans Zimmer and John Powell (accompanied by Henry Jackman) was pretty good. Kung Fu Panda Holiday Special would always be recommended to fans of the franchise as one of Dreamworks' wonderful holiday specials. Rating: 9/10",
         "Winters coming and for the Winter festival, Po along with his father wants to celebrate it by cooking for together. But Master Shifu comes n reminds Po of his duties. As a Dragon Warrior he has to take care of the meeting of counsel for Masters. He asks his father to be the chef for the event but when he refuses Po is forced to take help of Furious Five n the chef whom he \"rejects\" to rise to the occasion. Then at the meeting Po leaves them saying that he wants to spend time with his father like every time. Furious Five, Shifu n few others visit Po's place. Even though its not as good as the first movie, the plot isn't bad. But it doesn't have any funny or good moments like in the movie. Good thing is that Dreamworks did not try to make a movie out of this, else it would've been bit boring. Anyway if you did love the movie, you can watch this one",
         "\"Kung Fu Panda Holiday\" was released back in 2010 as the second short film to the Panda franchise between the first and second feature film. It's very similar to the original movie, so if you liked that one, chance is good you'll enjoy this one too. The main characters are mostly included and the action is similar too in the grand picture. Here and there some fighting, occasionally some wisdom from Dustin Hoffman and of course quality animation from start to finish. Story-wise I was not really impressed though. The Christmas reference was basically limited to Panda asking himself whether to spend Christmas night with his fellow Kung Fu masters as he's obliged to or with his dear ones. The problem wasn't really that the outcome couldn't be more obvious (that's usually the case with holiday short films), but that the Christmas message got a bit lost in the action sequences and goofy fun parts. Although the ending was executed very nicely, it couldn't really make up for everything before. Maybe they should have limited it to 15 minutes max. It's an okay watch for the holidays and a fine way to reduce the waiting time till the third Kung Fu panda movie in 2015, but that's pretty much it.",
         "Holiday specials are very much hit or miss. Merry Madagascar is remarkably good, the Ice Age special is OK. But this is horrible, but no redeeming features. The story is precisely the sort of crap you expect in the worst such specials --- Po learns a valuable lesson about the importance of family, blah blah --- with absolutely none of the surprise, subversion, or humor that one finds in the better such specials. The animation is likewise derivative, generic, with none of the originality of the movie. Saddest of all was the attempt to pretend that what we are watching is Christmas (as understood by East Coast America --- no snow in LA!) without ever actually saying the word; instead we get vague references to the \"Winter Feast\".",
         "I love, love, love this. The Kung Fu Panda holiday special is the only really good holiday special I've ever seen. I thought that it was extremely funny and extremely heart-warming. As always, great plot, great moral, great characters. Another perk was the rabbit chef who kept trying to fight Po to the death in order to reclaim his honor. I can't help but feel that without that rabbit the story would have sagged a bit. It's a truly beautiful short about how Po needs to choose between spending the Winter holiday with his Dad, and whether or not to fulfill his duties as the Dragon Warrior. Really touching. It may not be perfect, but it is nonetheless spectacular."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["DreamWorks Animation"],
      "summaries": [
         "The Winter Festival is coming and Po is asked to host the great exclusive formal banquet for all the Masters of Kung Fu. However, the occasion is on the same night as his father's restaurant's own party and Mr. Ping, upset at his son's absence, will not cancel it to cook for the masters at Po's request. Burdened by his father's imposed guilt about his conflicting responsibilities, Po finds all the preparations a dispiriting struggle. However, the solution comes from where he least expects it even as the panda must decide who truly needs him more on the big night.",
         "Po is to host the annual winter holiday feast and he struggles to meet his friends' expectations."
      ],
      "budget": 0
   },
   "movielensId": 91823,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-11-26",
      "dvdReleaseDate": null,
      "directors": ["Tim Johnson"],
      "runtime": 21,
      "movieId": 91823,
      "title": "Kung Fu Panda Holiday",
      "mpaa": "G",
      "actors": [
         "Jackie Chan",
         "Jack Black",
         "Dustin Hoffman",
         "Angelina Jolie",
         "Jack McBrayer",
         "Seth Rogen"
      ],
      "imdbMovieId": "1702433",
      "originalTitle": "Kung Fu Panda Holiday",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["S2JQJVdV8HQ"],
      "plotSummary": "The Winter Feast is Po's favorite holiday. Every year he and his father hang decorations, cook together, and serve noodle soup to the villagers. But this year Shifu informs Po that as Dragon Warrior, it is his duty to host the formal Winter Feast at the Jade Palace. Po is caught between his obligations as the Dragon Warrior and his family traditions: between Shifu and Mr. Ping.",
      "tmdbMovieId": 50393,
      "avgRating": 3.03731,
      "releaseYear": "2010",
      "numRatings": 67,
      "posterPath": "/gp18R42TbSUlw9VnXFqyecm52lq.jpg"
   }
}