{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0290591",
      "video": false,
      "title": "Work in Progress",
      "recommendations": [
         125150,
         142194,
         4443,
         120856,
         225038,
         24588,
         114145,
         166199,
         45943,
         180010,
         114745,
         51929,
         403838,
         131344,
         84003,
         121942,
         151441,
         69328,
         147986,
         100052
      ],
      "backdrop_path": "/yUyiRq54XDXh2YxMbHdBbD9j37r.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4bc99251416c7510ded7",
            "name": "José Luis Guerin",
            "profile_path": null,
            "id": 133090,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.781116,
      "production_countries": [],
      "id": 148353,
      "vote_count": 8,
      "budget": 0,
      "overview": "\"En construcción\" its that kind of documentaries that change your perspective of things. It's not a documentary to learn how a building is lift up, but how humans and there souls are made up. So, don't think about BBC or michael moore stuff when you are about to see it. I must say this is not a documentary for everyone. And not a documentary for every day. You will need to be in the mood to be opened and receptive to this subjective message that \"en construccion\" tries (and gives) to pass.",
      "similar": [],
      "original_title": "En construcción",
      "runtime": 125,
      "poster_path": "/lB22Xyu5C3ggVUjbiZpsVO8k1xJ.jpg",
      "spoken_languages": [
         {
            "name": "Català",
            "iso_639_1": "ca"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2001-10-19",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["José Luis Guerín"],
      "runtime": 125,
      "synopsis": null,
      "writers": ["José Luis Guerín"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0290591/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNzUwNjAxM15BMl5BanBnXkFtZTcwMDQ1MDY5MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Juana Rodríguez Molina, Iván Guzmán Jiménez, Juan López López | See full cast and crew »"],
      "reviews": [
         "From a very specific premise (a documentary on the construction of a new building in Barcelona's \"barrio chino\") Guerin has produced a film that is surprisingly comprehensive and universal. A huge range of subjects and characters are present in the film (children, teenagers, homeless, the old, immigrants, drug addicts,prostitutes, etc) giving them an extraordinary metaphorical significance without departing from the documentary approach. Shot in static shots (except for the marvellous and hopeful final tracking shot) and edited from 120 hours of footage with Guerin's characteristic precision, rhythm and visual poetry.",
         "\"En construcción\" its that kind of documentaries that change your perspective of things. It's not a documentary to learn how a building is lift up, but how humans and there souls are made up. So, don't think about BBC or michael moore stuff when you are about to see it. I must say this is not a documentary for everyone. And not a documentary for every day. You will need to be in the mood to be opened and receptive to this subjective message that \"en construccion\" tries (and gives) to pass. The dialogues are simply brilliant!! The documentary manages to catch such good conversations with all the natural pauses and breaths of any conversation that we have in our day by day life. Editing is great as it is the quality of the image (surpriselyng good!!). And in many sequences I couldn't understood how this documentary was recorded (image and sound) for the complex and different plans used with out losing accord! I just think it could be a little bit shorter of time, since that in some sequences it could be cut off 1minute or 2",
         "I know many people think documentaries are not to be seen on the cinema but on TV. I do not agree at all. In my opinion documentaries are rather underestimated by most of the people. I think there are really wonderful movies within this genre (i.e. When we were kings) and \"En construcción\" is one of them. José Luis Guerín manage to show us bits of real life, he gives us the chance to feel the heartbeats of a city, he spread bitterness, love, worries all over the film and he does it just by placing the camera where it should be, with an incredible sense of rhythm that keeps you staring at the images shown in front of you. It has been a huge success here in Spain even, when that's a tough task for this kind of film.",
         "First of all, i would like to say that i like slowly movies, but this is not what i thought. My favorite director is Ingmar Bergman, so you can understand what i mean. But slowness must be necessary. If it is not, a movie could be terribly boring. This movie is about life in a marginal barcelonas suburb and it shows how a building constructure can change the human life of the neighbourhood. The problem, in my point of view, is that this movie doesn´t tell any story at all. It only shows how do the workers work and what conversations do they have during them works. This dialogues are not interesting at all because are the dialogues you can hear waiting for the bus.Nonsenses dialogues. i mean. Otherwise, the movie doesn´t tell any story, no fear, no love, no friendship... It hasn´t got a beginning and it hasn´t got an end. Its during is about 2 hours and 5 minutes but i think that if you just do not see the first hour an a half, nothing serious would happen with the final comprehension. So if you want to know how some workers work... do not waste your money... just go to any square of your town where a building is being built and enjoy the situaion. I would like to say that the movie has got nice images ; the problen is that non dialogues and any action at all complete them. And most of the sequences are very , very long , so it is difilcut to pay attention with interest. It is not even a movie. It´s just a kind of documentary. A 2 hours documentary that would be exactly the same if it was 25 minutes long. In my humble opinion National Geography documentarys are much, much better than this one. And what about the actors? They are non professional actors and they do it quite well. But they pronounce very bad and it´s dificult to understand what they say. If you can, watch it with subtitles. So this is what i think... I would like to say that my english is not very fluently and that this has been a very big problem for me to say what i wanted to say. Thank you very much."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Ovídeo TV S.A."],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 91921,
   "movielens": {
      "languages": [
         "Català",
         "Español"
      ],
      "releaseDate": "2001-10-19",
      "dvdReleaseDate": null,
      "directors": ["José Luis Guerin"],
      "runtime": 125,
      "movieId": 91921,
      "title": "Work in Progress",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0290591",
      "originalTitle": "En construcción",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "\"En construcción\" its that kind of documentaries that change your perspective of things. It's not a documentary to learn how a building is lift up, but how humans and there souls are made up. So, don't think about BBC or michael moore stuff when you are about to see it. I must say this is not a documentary for everyone. And not a documentary for every day. You will need to be in the mood to be opened and receptive to this subjective message that \"en construccion\" tries (and gives) to pass.",
      "tmdbMovieId": 148353,
      "avgRating": 4,
      "releaseYear": "2001",
      "numRatings": 4,
      "posterPath": "/lB22Xyu5C3ggVUjbiZpsVO8k1xJ.jpg"
   }
}