{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1567130",
      "video": false,
      "title": "Morgen",
      "recommendations": [],
      "backdrop_path": "/AmNOfstjjF6JclRTSqlx2SQ3FG0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Nelu",
               "gender": 0,
               "credit_id": "52fe47ecc3a368484e0e0aa3",
               "name": "András Hatházi",
               "profile_path": null,
               "id": 558003,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Behran",
               "gender": 0,
               "credit_id": "52fe47ecc3a368484e0e0aa7",
               "name": "Yilmaz Yalcin",
               "profile_path": null,
               "id": 558004,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Florica",
               "gender": 0,
               "credit_id": "52fe47ecc3a368484e0e0aab",
               "name": "Elvira Rimbu",
               "profile_path": null,
               "id": 558005,
               "order": 2
            },
            {
               "cast_id": 1015,
               "character": "Daniel",
               "gender": 0,
               "credit_id": "59480e319251417e4c022be9",
               "name": "Dorin C. Zachei",
               "profile_path": null,
               "id": 1835970,
               "order": 3
            },
            {
               "cast_id": 1016,
               "character": "Mircea - Border Police",
               "gender": 0,
               "credit_id": "59480e3b9251413fb6042e8e",
               "name": "Razvan Vicoveanu",
               "profile_path": null,
               "id": 1835971,
               "order": 4
            },
            {
               "cast_id": 1017,
               "character": "Ovidiu - Border Police (as 'Kecske' Molnár Levente)",
               "gender": 2,
               "credit_id": "59480e45c3a368171b03f1c9",
               "name": "Levente Molnár",
               "profile_path": "/96u9q1cFbgbPxC8XqxnnN2ZnJpA.jpg",
               "id": 1454944,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47ecc3a368484e0e0a9f",
               "name": "Marian Crișan",
               "profile_path": null,
               "id": 558002,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47ecc3a368484e0e0ab1",
               "name": "Marian Crișan",
               "profile_path": null,
               "id": 558002,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59480dd9c3a36816e404245c",
               "name": "Tudor Mircea",
               "profile_path": null,
               "id": 1326660,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59480de0c3a36816f6044f96",
               "name": "Tudor Pojoni",
               "profile_path": null,
               "id": 1326659,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59480dea9251413ff4043780",
               "name": "Levente Molnár",
               "profile_path": "/96u9q1cFbgbPxC8XqxnnN2ZnJpA.jpg",
               "id": 1454944,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59480e02c3a368170f0456ba",
               "name": "Iván Angelusz",
               "profile_path": null,
               "id": 1414215,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59480e0a9251417e4c022bb0",
               "name": "Dániel Erdélyi",
               "profile_path": null,
               "id": 1282029,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "59480e129251413fc20411fe",
               "name": "András Poós",
               "profile_path": null,
               "id": 1640051,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "59480e199251417e4c022bc5",
               "name": "Anca Puiu",
               "profile_path": null,
               "id": 1326662,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59480e229251413fb1046172",
               "name": "Marianne Slot",
               "profile_path": null,
               "id": 6151,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.111891,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "HU",
            "name": "Hungary"
         },
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         }
      ],
      "id": 70149,
      "vote_count": 3,
      "budget": 0,
      "overview": "NELU, a man in his forties, works as a security guard in the local supermarket in Salonta, a small town on the Romanian-Hungarian border. This is the place where many illegal emigrants try to cross, by any means posible, to Hungary and then further to Western Europe. One morning, NELU will “fish” something different out of the river: a Turkish man trying to cross the border. Not able to communicate verballly, the two men will somehow understand each other. NELU takes the stranger to the farmhouse, gives him some dry clothes, food and shelter. He doesn’t really know how to help this stranger. The Turkish man gives NELU all the money he has on him so he will help him cross the border. Eventually, NELU takes the money and promises he will help him cross the border tomorrow, MORGEN…",
      "similar": [],
      "original_title": "Morgen",
      "runtime": 100,
      "poster_path": "/ll3sVqTvJc3TiemT4L9xXspCZMC.jpg",
      "spoken_languages": [
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Română",
            "iso_639_1": "ro"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Romanian National Center for Cinematography",
            "id": 35018,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mandragora",
            "id": 13407,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Slot Machine",
            "id": 7777,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Katapult Film",
            "id": 19117,
            "origin_country": ""
         }
      ],
      "release_date": "2010-10-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.morgen.ro/",
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Marian Crisan"],
      "runtime": 100,
      "synopsis": "NELU, a man in his forties, works as a security guard at a supermarket in Salonta, a small town on the Romanian-Hungarian border. This is the place where many illegal emigrants try to cross, by any means possible, to Hungary and then further to Western Europe. For NELU, days go by the same. Fishing at dawn, then work, and finally home with his wife-FLORICA. They live alone at an isolated farmhouse on the fields outside Salonta. Their problem these days is repairing the old roof of the farmhouse. One morning, NELU will fish something different out of the river: a Turkish man trying to cross the border. Not able to communicate verbally, the two men will somehow understand each other. NELU takes the stranger to the farmhouse, gives him some dry clothes, food and shelter. He doesnt really know how to help this stranger. The Turkish man gives NELU all the money he has on him so he will help him cross the border. Eventually, NELU takes the money and promises he will help him cross the border tomorrow, MORGEN",
      "writers": ["Marian Crisan"],
      "originalLanguage": "Romanian",
      "imdbLink": "http://www.imdb.com/title/tt1567130/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjgzNDAxMTM1OF5BMl5BanBnXkFtZTcwMzM1MDg5Ng@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: András Hatházi, Yilmaz Yalcin, Elvira Rimbu | See full cast and crew »"],
      "reviews": [
         "This film is about a poor farmer called Nelu, who lives near the border with his wife Florica in a broken-down house. Nelu works as a mall security-guard, well-known and liked by the people in the town. But Nelu is bored with his life, and is very annoyed at the arrogant border-guards, who harass him whenever he has been across the border to catch fish. One day when Nelu is fishing, a strange looking foreigner (presumably an immigrant from the area around Turkey or Afghanistan) comes running along the road, and hides under a bridge until the border-guards have passed. Nelu doesn't tell them where he is, even though he's standing right in front of him, and because of this, the illegal immigrant Behran feels an automatic bond with Nelu, even though they cannot understand each other, and persuades him to help him escape. Nelu thus takes Behran to his home, and has him living in the cellar for a while. His wife Florica doesn't like this one bit, but Nelu convinces her that it is for the best, as Behran can help him do chores around the house, like fixing the roof, peeling potatoes, etc. But as time goes along, it becomes apparent that having an illegal immigrant living in your house is not a long-term solution, and Nelu tries to get rid of Behran, helping him to escape to Northern Europe. But maybe Behran doesn't want to escape anymore, as he has found a true friend in Nelu... and this is where Nelu's troubles really begin! Overall, I'll give this film a 7/10, as it was very heart-warming and funny, but really didn't have much progress throughout, and you quickly knew where the plot was going. The actors were great and had good chemistry, and the quirky humor worked excellent in this film.. now you definitely know what to do, and what NOT to do, if you ever stumble upon a runaway fugitive.",
         "This film is very interesting for someone is not familiar with old and current immigration laws' fluctuations and amendments in Eastern Europe. The film describes so well how a naive immigrant apparently from Turkey or Bulgaria (in the movie he's referred as \"gypsy\" later on his name is presumably known) eagerly wants or just needs to head to Germany. He even keeps Deutsche marks rather than Euros in a plastic bag plus local phone numbers there in Germany. This German wish, need or dream seems to keep him alive during his eventual trip without visa across Romania, Hungary, etc.. This guy finds a Romanian man (Nelu) who reacts as actually human being rather than such an immigrant-hunter when he sees the \"gypsy\" asking for something. Nelu then tries to understand the foreign language of this strange guy he finds by the river while fishing. Overall, the posture of some of the Romanian border patrol agents are also randomly tolerant towards the people crossing their border... either there're still not strong regulations or, in that Romania it is just about the start of a strict migratory law or, the town where this \"gypsy\" guy is found is just too small that no one really cares about being so strict. Something strikes me about this movie is how naive and actually very fine the people mostly are. Although Nelu uses the money the gypsy gave him, Nelu using it for his own benefit doesn't seem to exploit or to be rude with this new man in Nelu's farm. The gypsy guy happens to be hard-working man, keeping that German wish he's got as a hope, the reason to be diligent and helpful with those are being supportive with them. He follows instructions even though he doesn't understand the language. He only needs to go to Germany somehow; I'm not sure he knows there're borders between his start point to his dreamy final destination, that you may need visas and stuff to touch the country he dreams of... did he know? didn't he know? was he by chance one of those truly naive guys needed to do something without the intention of breaking the law on purpose?",
         "This could be a story about any border. One of those instances when human decency is maintained underground, DESPITE the law, and the law becomes absurd. Nice line: \"Da' ce v-o făcut omu' ăsta vouă?\" (\"What has this man done to you?\") The frontier police (and customs) officers are at times apathetic about the whole business, yet clearly eager to exert their \"power\" to avoid endangering their position or whatever they want to believe their role is (the opening scene with the fish at the customs is beautiful). This film also tries to keep the local dialect/communicative style authentic, and the lead actor does a great job at it - a nice touch.",
         "It is a film about nothing, (but not in the Seinfeld way). You don't care about any of the characters, the plot is weak, the acting is amateurish. Characters: they are uninteresting, unrealistic, and quite dumb. No connection to the viewer or the story whatsoever. This is also made worse by the acting, or lack thereof. One wonders 'who are these people, and why should I care about them?' Plot: illogical, confusing, without any structure, levels or rhythm. A continuous stream of mundane actions. The very promise of the plot does not hold water. This is also made worse by the slow and clumsy storytelling. Acting: amateurish, bland, looks like a badly staged 'reality' show and about as interesting. Tha actors' delivery is monotonous and devoid of emotion and timing. Only the guy playing Nelu seems a cut above the rest, but this is not saying much. This is also made worse by the script. Other 'features': No music, no build-up, no tension, no emotion, no humour, badly edited - awkwardly long scenes, many totally useless frames - prop mistakes (did they have a one take limit?), almost every scene looks like a bad rehearsal. This is also made worse by the fact that it's too long. In a nutshell: It's like an amateur documentary where the filmmaker captures uninteresting people doing uninteresting things."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Mandragora",
         "Slot Machine",
         "Katapult Film"
      ],
      "summaries": [],
      "budget": 790000
   },
   "movielensId": 92180,
   "movielens": {
      "languages": [
         "Magyar",
         "Română"
      ],
      "releaseDate": "2010-10-01",
      "dvdReleaseDate": null,
      "directors": ["Marian Crișan"],
      "runtime": 100,
      "movieId": 92180,
      "title": "Morgen",
      "mpaa": null,
      "actors": [
         "András Hatházi",
         "Yilmaz Yalcin",
         "Elvira Rimbu",
         "Dorin C. Zachei",
         "Razvan Vicoveanu",
         "Levente Molnár"
      ],
      "imdbMovieId": "1567130",
      "originalTitle": "Morgen",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "NELU, a man in his forties, works as a security guard in the local supermarket in Salonta, a small town on the Romanian-Hungarian border. This is the place where many illegal emigrants try to cross, by any means posible, to Hungary and then further to Western Europe. One morning, NELU will “fish” something different out of the river: a Turkish man trying to cross the border. Not able to communicate verballly, the two men will somehow understand each other. NELU takes the stranger to the farmhouse, gives him some dry clothes, food and shelter. He doesn’t really know how to help this stranger. The Turkish man gives NELU all the money he has on him so he will help him cross the border. Eventually, NELU takes the money and promises he will help him cross the border tomorrow, MORGEN…",
      "tmdbMovieId": 70149,
      "avgRating": 2.875,
      "releaseYear": "2010",
      "numRatings": 4,
      "posterPath": "/ll3sVqTvJc3TiemT4L9xXspCZMC.jpg"
   }
}