{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "troubled relationship",
            "id": 197050
         }
      ],
      "imdb_id": "tt0048499",
      "video": false,
      "title": "La Pointe-Courte",
      "recommendations": [6636],
      "backdrop_path": "/adTmRG34XPlcmHv95wqQQz5n1QI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Elle",
               "gender": 0,
               "credit_id": "52fe489bc3a36847f81707b9",
               "name": "Silvia Monfort",
               "profile_path": "/hBuen2r7JiajZ2pDgAc9EepnKLu.jpg",
               "id": 37133,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lui",
               "gender": 2,
               "credit_id": "52fe489bc3a36847f81707bd",
               "name": "Philippe Noiret",
               "profile_path": "/13vb0RuOI0t8I1y04pnz81vLptl.jpg",
               "id": 24366,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe489bc3a36847f81707af",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe489bc3a36847f81707b5",
               "name": "Agnès Varda",
               "profile_path": "/zfStaPgZo9aAHUH4sntmnpRcldd.jpg",
               "id": 6817,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489bc3a36847f81707c3",
               "name": "Alain Resnais",
               "profile_path": "/3gSyKBQHgpkYVVgkC149sW4RDRc.jpg",
               "id": 11983,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.610277,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 54436,
      "vote_count": 7,
      "budget": 0,
      "overview": "The troubled relationship of a married couple on vacation brushes beside the ongoing conflict between fishing families and the authorities in La Pointe-Courte, Séte.",
      "similar": [
         258480,
         370663,
         401898,
         244772,
         12793,
         27586,
         858,
         112160,
         141,
         634,
         376867,
         242224,
         10818,
         11421,
         43923,
         340485,
         342878,
         250124,
         513,
         11634
      ],
      "original_title": "La Pointe-Courte",
      "runtime": 80,
      "poster_path": "/gHH3DMebHzFhvavfmgtBdZKwM2v.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ciné Tamaris",
         "id": 14683,
         "origin_country": ""
      }],
      "release_date": "1955-05-13",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Agnès Varda"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Agnès Varda"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0048499/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwODM0NDQ3Ml5BMl5BanBnXkFtZTcwMTEyMTU1MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Philippe Noiret, Silvia Monfort | See full cast and crew »"],
      "reviews": [
         "This film, Varda's directorial debut, is as impressive and accomplished as any of the other New Wavers' debuts. It's definitely on the same level as Jean-Luc Godard's Breathless, Francois Truffaut's The 400 Blows, or Alain Resnais's Hiroshima, Mon Amour (Resnais actually worked as the editor for this film). I actually think I prefer it to all three of those (as well as the other three films of Varda's that I've seen). Historically, it's one of the most fascinating films I've ever witnessed. It, in one of its two sections, sprouts from a mixture of both French Poetic Realism of the 1930s and Italian Neorealism in the 1940s. It contains the social drama of such Neorealism classics as Visconti's La Terra Trema, as this plotline deals with a group of poor fishermen and their families. However, Varda doesn't play this hand melodramatically at all. Even when a character dies, we only witness his mourning in a precisely documentarian way. We aren't asked to feel any real emotion for him, which, for some reason, makes it all the more profound. In this way, the film resembles the French poetic realism classics. L'Atalante is clearly echoed, as stray cats occupy many empty spaces in the composition; they appear in nearly every scene in some capacity. Also, the village festival that takes up most of its tail end resembles very much the folksy rural wedding at the beginning of L'Atalante. The film also contains the good humor of Vigo's masterpiece. The second half of the film alternates with the first, switching over exactly every ten minutes, a technique which Varda kind of pilfered from William Faulkner's Wild Palms (aka If I Forget Thee, Jerusalem), a novel which Godard brings up in two of his films, Breathless and Two or Three Things I Know About Her. This second half points toward the future. The French New Wave, just getting underway in 1956 (although the program notes that I received insisted that it was made in 1954), comes to full bloom here. This half, which deals with a husband and wife who have started to grow tired of each other, consists of beautifully choreographed and composed shots of the two lovers strolling along the beaches of the fishing town. The style here is instantly recognizable as one which Resnais would adopt in Hiroshima Mon Amour and Last Year at Marienbad, and even has that semi-resigned feeling to it, as if, in a way, it's half-joking. What's really shocking is that this section does not just predict some of the techniques of the French New Wave, but also the style of Ingmar Bergman's films. I would doubt that Bergman was influenced at all by this film, as it's doubtful he ever saw it. Besides, he was well on his way to hitting his peaks by 1954, as we can see from such early masterpieces as Sawdust and Tinsel. But there are some shots in this film that, once again, will instantly call to mind nearly identical ones from films such as The Seventh Seal and, even more so, Persona. While it's a lot of fun to identify these old and new (and future) trends in La Pointe Courte, the film more than stands up on its own. Besides, according to the program notes, Agnès Varda was no great cinephile, unlike the other French New Wavers. The two storylines, and their differing styles, complement each other perfectly. It helps that Varda's direction is impeccable. Before she came to the cinema, she was a photojournalist, and it's extremely obvious. Her composition is absolutely stunning, with a lot of concentration on surface textures. The film opens with a tight close-up of a handcrafted wooden chair. You can't tell what it is initially, but as the camera follows the grooves and backs up, the object is revealed for what it is. When one character goes to the train station to pick up his wife, the shot is absolutely award-worthy with its multiple diagonals in the train tracks and the power lines in the distance. The use of sound in the film is also amazing. It's interesting when sound effects are included and when they're occluded. When the married couple walks through a field, there are carts squeaking down rusty tracks (it's a very odd event, but quite remarkable to see and hear). But later, when a large train passes by them only a dozen feet away, we don't hear it at all. Godard would play with sound more thoroughly, but never as subtly. It's a rather great tragedy that La Pointe Courte has gone almost entirely unavailable. It barely got a release when it was first made, and, even after Varda gained prominence in the French cinema, it seems to have effectively dropped off the face of the planet. I hope that someday there will be a full retrospective of her work on DVD. This film deserves to impress others as much as it impressed me. 10/10.",
         "I am not a film historian or a fan of Nouvelle Vague. I wanted to see this film because it gave me the opportunity to see my hero, Philippe Noiret, when he was just 26. Thankfully we began by watching the interview w/ Varda, which really gives you a solid understanding of why this film was/is so important, mostly having to do with it being so innovative for its time, and its place as an influence on filmmakers that followed. The 2 story lines did not engage or interest me really.But the visuals were often terrific. And oddly enough, we had just the night before, watched Clash by Night, an American film of the same time which was shot on location in the fishing community of Monterey CA. While visuals were often excellent there as well,in Clash by Night the film really was the STORY, and a very passionate one at that. La Pointe-Courte was also really important as an example of one of the few important \"First Films' of a director,especially a woman director in 1955 , and really especially, one who had no previous experience in film making and no knowledge of film history.",
         "Agnès Varda began her career in 1954 as a feature film director with this movie that tells two separate stories in reciprocal counterpoint: daily life at a fishing village near Sète in France with its joys and dramatic moments and the relationship between husband and wife when she who is a Parisian returns to him after he had chosen to return to his birthplace where he feels now very happy but that doesn't seem to please her very much at first and puts their marriage in danger. This situation is given in a series of soft dialogues between them which don't reveal themselves deep and meaningful enough to make us feel the sentiments behind them. Varda has done much better later with such very good movies like \"Le Bonheur\" or \"Cléo de 5 à 7\". However this movie is also classified as a landmark in the New Wave of French cinema that began about that time with names like Truffaut, Godard and Chabrol. It's this historical value that mainly makes this movie worth to be seen.",
         "Agnès Varda's career began by the seaside in a small fisher port near Sète and temporarily ended in 2009 with \"Les Plages D'Agnès\" (Agnès' Beaches). Her debut was a commercial fiasco, only one theater in Paris showed it when it was released (Jean Louis Chéret, Studio-Parnasse). The part of the man was first intended for George Wilson but he became ill and Philippe Noiret replaced him. This actor didn't like his performance, he thought he was too young (26) and the choice of Wilson was relevant (34). He said he was absent and the character eluded him. The critics thrashed him. Hailed as the first movie of the Nouvelle Vague, the movie owes at least as much to Italian Neo-realism (Rossellini's \"Viaggio In Italia\" which depicted a couple's trip whose marriage was on the rocks and Visconti's \"La Terra Trema\" which dealt with the plight of the fishermen in a small village). What is definitely \"Nouvelle Vague\" is the shoestring budget (four times less than \"Breathless\") and the literary, intellectual, \"overwritten\" dialogs which seem today almost unbearable; this bourgeois couple complaining about their heartaches, contemplating their navels, walks through the crowd as if the inhabitants of the village didn't exist. They don't relate to them: the only move the man makes is to give an ice-cream to a child. That's not much for someone who spent his whole childhood in the place. Filming on location wasn't the Nouvelle Vague's invention as too many naive people still believe today; for the record \"l'Hirondelle Et La Mésange\" was filmed entirely on location in...1928. The depiction of the village wanders drastically from the precepts of the Nouvelle Vague busy being born but recalls the two Italian works mentioned above. We feel that Varda cares for them even if her two principals don't. She cares for their problems with the food hygiene people or with the coastguards'. She feels for Raphaël the young man to be jailed for five days as the gendarmes do for him. We learn he is an Inscrit Maritime (that was the name of the conscripts who lived on the seaside) and he is to do his military service: even if Varda doesn't mention it, we do know he'll have to fight in a dirty war (the Algeria war), like Antoine in \"Cleo De 5 à 7\". I don't think like the precedent user that Varda's debut was her best. Actually \"Cléo...\" is much better. There are similarities between the two works: both Cléo and the couple move in a world they can't relate to. But the key to the 1961 effort is the fact that Cléo opens up and thanks to a soldier soon returning to fight becomes aware that people exist outside her petty world. When she takes her glasses off, what a symbol! But for the man and the woman of \"La Pointe Courte\" (The Short Headland) -they are only referred through this, bearing no names- they will stay with their inflated egos, their selfishness. \"They are always talking, they mustn't be happy\" says a fisher's wife. The short headland was a blind alley.",
         "Agnes Varda's first film is the story of life in a small fishing village-relationships, sickness, death, day to day life, told from a couple of different perspectives. This is the fourth of Agnes Varda's films that I have seen, and though it is not my favorite, it still has the beauty and stunning visuals of her others. Both the mundane and the dramatic events of life are brought to life through the wonderful cinematography, and Varda manages to pull the viewer in to the film to empathize and sympathize with the characters. The scenes of the relationship between the couple are wonderful. Dance. Poetry. Perfectly framed, perfectly paced and perfectly scripted, the interplay between the couple is fascinating. Simply beautiful.",
         "La Pointe Courte is a small jut of land on the east side of Le Canal de Sète, which connects L'Étang de Thau to the Mediterranean Sea. In the mid-1950s, it harbored a small fishing village (perhaps it still does, for all I know) which provides the setting for this film. Written and directed by 26-year old Agnès (née Arlette) Varda, this, her first and perhaps her best film, is credited by some film critics and historians as the first in the French New Wave. A young (24) Philippe Noiret plays a native of the village who returns from Paris after many years for a short vacation. Heretofore, I was familiar with Noiret only with some of his much later films. Silvia Monfort, with whom I was previously unfamiliar, and who had one of the most unusual faces I've seen on film, plays the disillusioned Parisian wife who joins him five days later to discuss their marriage. What's interesting about this film are its two intertwining parts. One part, shot in a familiar narrative style, concerns the everyday life and concerns of the villagers. The other part depicts the conversations of the couple in an artistic style full of fascinating images and interesting camera angles, a style which takes full advantage of Varda's photographer's eye. (Varda used three different cinematographers on this shoot, but I don't know which of them photographed which scenes.) Varda chose the location for the film after a visit there for an assignment as a still photographer. What I liked best about the part involving just the couple were the slow pans of the environments, almost as if Varda were trying to capture the characters' surroundings in a series of stills. On the other hand, I found somewhat disturbing the obtrusive soundtrack of a clarinet, which went counter to the notion that a soundtrack is supposed to enhance the mood of the scene, not play against it as I found this to do. Perhaps that is part of what accounts for this being credited as a New Wave film.",
         "I noticed that all the reviews currently on IMDb for \"La Pointe-Courte\" are very positive--and some are simply glowing. Well, let me be a voice of dissent, as I disliked the film intensely. While I could see their point that some of the camera-work was nice, I found the film to be pretentious and boring. The film looks much like a French version of an Italian Neo-Realist film. The actors appear to be non-actors--local people from some French fishing community and the story, like a Neo-Realist film, is about ordinary people and ordinary things. Because of that, I found the first 33 minutes rather dull. Seeing folks in this fishing village only seemed interesting for a short time--then I failed to see any sort of point to the film. And, just when I thought it couldn't get much worse, it did! A newly wed couple you saw early in the film is now arguing--but arguing with absolutely no energy or intensity at all. And, oddly, apparently four years has passed since their last scene--though there is no sense of time passing at all in the film. And, instead of showing any emotion during this strange sequence, they TALK, TALK, TALK--while the camera plays annoying games with their profiles. Then, you see a closeup of a dead cat (who the @^## wants to see that?!) and then some eels. It's incredibly artsy-fartsy--that's for sure. This simply is a film that normal folks would hate intensely. While I have a high tolerance for art films and have probably reviewed more than anyone on IMDb, this film was just too intensely boring and pretentious and made me wonder WHO the audience was for it. If you think I am wrong, try showing the film to a few friends and family members--I would venture that most would feel pretty much like me about the film."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Ciné Tamaris"],
      "summaries": ["There are two parts to this film: sequences of life in the fishing village of La Pointe Courte (a government inspector's visit, the death of a child) alternate with others following a couple - He is from La Pointe Courte, she is Parisian - coming to terms with their changing relationship."],
      "budget": 0
   },
   "movielensId": 92204,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1955-05-13",
      "dvdReleaseDate": null,
      "directors": ["Agnès Varda"],
      "runtime": 80,
      "movieId": 92204,
      "title": "La Pointe-Courte",
      "mpaa": null,
      "actors": [
         "Silvia Monfort",
         "Philippe Noiret"
      ],
      "imdbMovieId": "0048499",
      "originalTitle": "La Pointe-Courte",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The troubled relationship of a married couple on vacation brushes beside the ongoing conflict between fishing families and the authorities in La Pointe-Courte, Séte.",
      "tmdbMovieId": 54436,
      "avgRating": 3.39286,
      "releaseYear": "1955",
      "numRatings": 14,
      "posterPath": "/gHH3DMebHzFhvavfmgtBdZKwM2v.jpg"
   }
}