{
   "tmdb": {
      "original_language": "bn",
      "keywords": [
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "fisherman",
            "id": 5420
         }
      ],
      "imdb_id": "tt0070809",
      "video": false,
      "title": "A River Called Titas",
      "recommendations": [],
      "backdrop_path": "/m2P2jHvuc1b68G0opyTPh1sfg7O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Nibaran",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be125",
               "name": "Fakrul Hasan Bairagi ",
               "profile_path": null,
               "id": 997526,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Moral",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be129",
               "name": "Narain Chakraborty ",
               "profile_path": null,
               "id": 997527,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Rajar Jhi",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be12d",
               "name": "Kabari Choudhury ",
               "profile_path": null,
               "id": 997528,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be131",
               "name": "Roushan Jamil",
               "profile_path": null,
               "id": 994342,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Magan Sardar",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be135",
               "name": "Sirajul Islam",
               "profile_path": null,
               "id": 219690,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Ananta",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be139",
               "name": "Shafikul Islam",
               "profile_path": null,
               "id": 997529,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Tilakchand",
               "gender": 2,
               "credit_id": "52fe491e9251416c750be13d",
               "name": "Ritwik Ghatak",
               "profile_path": "/nSMHoWBbqWaztUpYRXm7ysKd4Y4.jpg",
               "id": 543652,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Basanti's father",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be141",
               "name": "M.A. Khair",
               "profile_path": null,
               "id": 997530,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Kishore (as Probir Mitra)",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be145",
               "name": "Prabir Mitra",
               "profile_path": null,
               "id": 997531,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ramprasad and Kader Mian",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be149",
               "name": "Golam Mustafa",
               "profile_path": null,
               "id": 997532,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Udaytara",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be14d",
               "name": "Sufia Rustam",
               "profile_path": null,
               "id": 997533,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Basanti",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be151",
               "name": "Rosy Samad",
               "profile_path": null,
               "id": 997519,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Mungli",
               "gender": 0,
               "credit_id": "52fe491e9251416c750be155",
               "name": "Rani Sarkar",
               "profile_path": null,
               "id": 997534,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe491e9251416c750be115",
               "name": "Ritwik Ghatak",
               "profile_path": "/nSMHoWBbqWaztUpYRXm7ysKd4Y4.jpg",
               "id": 543652,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe491e9251416c750be11b",
               "name": "Ritwik Ghatak",
               "profile_path": "/nSMHoWBbqWaztUpYRXm7ysKd4Y4.jpg",
               "id": 543652,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe491e9251416c750be121",
               "name": "Advaita Malla Burman ",
               "profile_path": null,
               "id": 997525,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "565487b592514170250041c7",
               "name": "Habibur Rahman Khan",
               "profile_path": null,
               "id": 1540378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "565487bd92514170250041ce",
               "name": "Ustad Bahadur Khan",
               "profile_path": null,
               "id": 1540379,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "565487c592514170250041d8",
               "name": "Baby Islam",
               "profile_path": null,
               "id": 1211322,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "565487d292514170210045a4",
               "name": "Bashir Hossain",
               "profile_path": null,
               "id": 1540380,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.209581,
      "production_countries": [
         {
            "iso_3166_1": "BD",
            "name": "Bangladesh"
         },
         {
            "iso_3166_1": "IN",
            "name": "India"
         }
      ],
      "id": 93164,
      "vote_count": 4,
      "budget": 0,
      "overview": "An in-depth look at the lives and struggles of the community of fishermen living by the river Titash.",
      "similar": [
         10669,
         8987,
         829,
         11036,
         109424,
         826,
         28,
         314095,
         2062,
         390062,
         1372,
         7555,
         120,
         3597,
         3600,
         225235,
         11897,
         6950,
         962,
         14462
      ],
      "original_title": "তিতাস একটি নদীর নাম",
      "runtime": 159,
      "poster_path": "/hB7DdigTp94RBYjJOLC244lRoc9.jpg",
      "spoken_languages": [{
         "name": "বাংলা",
         "iso_639_1": "bn"
      }],
      "production_companies": [],
      "release_date": "1973-04-26",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Martin Scorsese’s World Cinema Project, Vol. 1",
         "id": 303969,
         "poster_path": "/nbR7Hniq5qzkF2ma0VkDXQCUTd5.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ritwik Ghatak"],
      "runtime": 159,
      "synopsis": null,
      "writers": [
         "Advaita Malla Burman",
         "Ritwik Ghatak"
      ],
      "originalLanguage": "Bengali",
      "imdbLink": "http://www.imdb.com/title/tt0070809/",
      "coverLink": null,
      "actors": ["Stars: Rosy Samad, Farid Ali, Fakrul Hasan Boiragi | See full cast and crew »"],
      "reviews": [
         "This film by somewhat neglected Indian director Ritwik Ghatak is one of the most unusual I have ever seen. The stories are set among the harsh life around the banks of Bangladesh's rivers (one of the poorest regions of the world). It tells several gruesome tales: abductions, escapes, living among strangers, death, though the characters go through this with the resignation of someone who knows that life is hard and always have been. Now, having seen this film more than a decade ago, I cannot recall all the details. But the unusual part is the way this story is told. It puts a character at the center of the story for, say, twenty minutes, and then it moves to another character, who was playing a minor role in the first story. And then to another character, and so on. It is a collection of stories, but loosely (or not so loosely interconnected). Overall, a fine tapestry of life in one of the poorest parts of the world.",
         "A River Called Titas (also known as Time And The River) is a somewhat more sprawling later melodrama of Bengal poverty, compared to director Ritwik Ghatak's more famous earlier The Cloud-Capped Star, but just as interesting. The stories it weaves together are set in the Malo fishing community of East Bengal, now Bangladesh, the area where the director grew up. Kishore, a young fisherman who we saw as a boy in the opening, is hastily married to a young woman from a neighborhood he is visiting, so the two communities can seal a friendship. He hardly comes to know his new bride or get a good look at her when, in a scene reminiscent of the melodramatic character separations in Mizoguchi, bandits capture her at night while they are still on the water, and sleeping apart.When she gets away and floats to shore this kidnapped girl, who never even knew her husband's name, gives birth to a son, Ananta, and goes to work in the home of a more well off woman, where they process hemp to be used by the fishermen.That lady is Mungli, one of the two little girls we had seen with the young Kishore in the beginning. Ironically Kishore is in the same village but has gone crazy and keeps to himself. The wife feels a strange bond with this man, as she is somewhat estranged from the community herself. She offers to bathe him in the river. Basanti, the other girl who had befriended the wife and had lost her own husband in a fishing accident, takes care of the boy after the parents, briefly reunited, are set upon by ruffians and killed (another scene reminiscent of Mizoguchi)The boy imagines he sees his mother, brilliantly attired in the forest, as the goddess of motherhood. The son is then thrown out of Basanti's home and goes to live with others. The film climaxes with the struggle between rich creditors and the fishermen who owe them money. At one point in an inspiring Marxist moment two women hurl one of the creditors into the water. Another debtor talks back to a creditor, who then kills himself. But the rich conspire to break up the fishermen and even use theater to distract them-ironic as Ghatak's background was in left wing drama. The feisty Basanti fights with a rich man, and they then set fire to the poor people's huts. Toward the end of the film, in anticipation of a later era's environmentalism, we see the river drying up, as the women of the village gather by its banks like a Greek chorus.Basanti walks across what has become a desert,she is wrapped in a blanket and carries an empty bowl as she begs for food. She sees a little boy running through the grass (probably a rice field, the rich had bought their land to convert from fishing to farming)The boy has a toy whistle made of leaf and reminds her of the child she never had herself, but wished for. Despite all the suffering we have seen in this incredibly melodramatic series of events, this ending seems to show hope for the future. Ghatak's style here shows his previous richly textured images,with characters often looming in closeup in the foreground; creative use of sound and music; and feeling for local customs and details, though there are also some more modern touches like zooms. The way he shows the changes over time for a poor community and its kind of life makes an interesting comparison with Welles' The Magnificent Ambersons, which did the same for a well off bourgeois family The movie also reminds one, in its sometimes strident class struggle of the fisherfolk, of Visconti's La Terra Trema. Last, the lyrical images of the river delta/swamp terrain bring to mind Flaherty's documentary The Louisiana Story.Yet Ghatak, despite all these references, is in a realm by himself as an Indian auteur.",
         "I am just trying to justify my rating of the film (9 out of 10) which demands a perusal of its technical excellence. This film is an adaptation of Adwita Malla Burman's Bengali literary classic under the same title. It is tale of those marginal people belonging to a poorer fishing community who live from hand to mouth. Exploring different sectors of life is one of the most amazing aspects of both the film and the novel. The film sequences are maintained in parallel to the novel. The film has brilliant editing and that makes it very dynamic and fluent. Fade-ins and fade-outs for transition are used in many cases. The film seems to be gradually acquiring technical sophistry. Fixed frame is used in many cases and the camera movement is kept at a minimal level at the beginning of the film. Panning, tilt-ups and tilt-downs are countable. But this 'apparently' mediocre camera usage could not amputate Ghatak's craftsmanship. Some continuity cuts during the long duration shot of 'Dourer Naw' (Boat for Running Races) certainly deserve positive appraisal. The film has some stunning close ups. They really deserve applause. The close ups are symbolic and very well-articulated. Negative aspects are minimum but they cannot be overlooked as they have an effect on the film. Sometimes the characters deliver speeches in a word or two in urban Bengali which betray the realism their acting. The film has got only two framing errors. It is the disadvantage of using fixed frame. Moreover the spectators are captured who came to watch the shooting for once (while Basanti was engaged in a fight with her mother) in the film. In another case, probably the prompter is captured or the person may be another spectator while Kader Mian was arguing with his daughter-in-law. The sequences sometimes seem to be incredulously positioned. Moreover, they seem to be hastily pushed towards their respective ends. But Ritwik's crave for stark realism is praiseworthy. Other than these, this film is technically perfect. The film is a must watch for having a better exposure of the lives of marginal people of a third world country. Technical excellence is another reason to watch this film.",
         "Typically for Indian movies this has it all, evil capitalists that destroy the property of the poor peasants, a man struck insane by the abduction of his newly-wed wife from arranged marriage, compassionate families that end up turning against the one they help and a lot of smoking from water pipes and chewing of betel nut. The film starts by announcing that not many people know about and much less care about the people living in this region which is one of the world's poorest places. And by the end of it most things look very unfortunate for them still. It is realistically made, shot on location so that doesn't feel contrived. That being said, some of the acting looks funny and artificial by our standards. As we move focal points also it can be a little difficult to follow the numerous plots. Antropologically interesting too."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [],
      "summaries": [
         "A fisherman, Kishore, marries Basanti when he visits a nearby village. After their wedding night (during which the couple is almost too shy to speak), she is kidnapped on the river. When she is found, she has amnesia; although Basanti does not remember her new husband's name or what he looks like, she remembers the name of his village. Ten years pass before she attempts to find him with their son, who sees his mother as a goddess. Some residents of Kishore's village refuse to share food with Basanti and her son because of the ever-present threat of starvation.",
         "A 1973 Bangladeshi film it describes the life of the fishermen on the bank of the Titas River in Brahmanbaria, Bangladesh."
      ],
      "budget": 0
   },
   "movielensId": 92224,
   "movielens": {
      "languages": ["বাংলা"],
      "releaseDate": "1973-04-26",
      "dvdReleaseDate": null,
      "directors": ["Ritwik Ghatak"],
      "runtime": 159,
      "movieId": 92224,
      "title": "A River Called Titas",
      "mpaa": null,
      "actors": [
         "Fakrul Hasan Bairagi ",
         "Narain Chakraborty ",
         "Kabari Choudhury ",
         "Roushan Jamil",
         "Sirajul Islam",
         "Shafikul Islam",
         "Ritwik Ghatak",
         "M.A. Khair",
         "Prabir Mitra",
         "Golam Mustafa",
         "Sufia Rustam",
         "Rosy Samad",
         "Rani Sarkar"
      ],
      "imdbMovieId": "0070809",
      "originalTitle": "তিতাস একটি নদীর নাম",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An in-depth look at the lives and struggles of the community of fishermen living by the river Titash.",
      "tmdbMovieId": 93164,
      "avgRating": 2.83333,
      "releaseYear": "1973",
      "numRatings": 3,
      "posterPath": "/hB7DdigTp94RBYjJOLC244lRoc9.jpg"
   }
}