{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "small town thieves",
            "id": 221945
         }
      ],
      "imdb_id": "tt0076107",
      "video": false,
      "title": "The Great Bank Hoax",
      "recommendations": [],
      "backdrop_path": "/dsjHuJPEyxiZQ1myVB2FmR8gVle.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Manny Benchly",
               "gender": 2,
               "credit_id": "52fe4a7ec3a368484e1567ef",
               "name": "Richard Basehart",
               "profile_path": "/EwbxGHlgK2nojHYGu5A3mpxFd2.jpg",
               "id": 5403,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Julius Taggart",
               "gender": 2,
               "credit_id": "52fe4a7ec3a368484e1567f3",
               "name": "Ned Beatty",
               "profile_path": "/aO5MtnqcZHpsVYz1nINdjqgEJUl.jpg",
               "id": 13726,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cathy Bonano",
               "gender": 1,
               "credit_id": "52fe4a7ec3a368484e1567f7",
               "name": "Charlene Dallas",
               "profile_path": null,
               "id": 165377,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jack Stutz",
               "gender": 2,
               "credit_id": "52fe4a7ec3a368484e1567fb",
               "name": "Burgess Meredith",
               "profile_path": "/lm98oKloU33Q7QDIIMSyc4Pr2jA.jpg",
               "id": 16523,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Reverend Everett Manigma",
               "gender": 2,
               "credit_id": "52fe4a7ec3a368484e1567ff",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Richard Smedley",
               "gender": 0,
               "credit_id": "568f99869251411895001d49",
               "name": "Paul Sand",
               "profile_path": "/7rZqavfFZUbr6MgQEBxA2xVf7jF.jpg",
               "id": 78416,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Patricia Potter",
               "gender": 1,
               "credit_id": "568f99949251411892001d7b",
               "name": "Constance Forslund",
               "profile_path": "/tfs7wBaGdiXU2H6m5SLCt3b1hTa.jpg",
               "id": 61149,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Maj. Bryer (Ret.)",
               "gender": 2,
               "credit_id": "568f99a2c3a3683241002008",
               "name": "Arthur Godfrey",
               "profile_path": "/mR9UMl7U5XVm6sj7dIzZr4lKb0i.jpg",
               "id": 111191,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1567eb",
               "name": "Joseph Jacoby",
               "profile_path": null,
               "id": 1076432,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "568f9975c3a3683256001f53",
               "name": "Joseph Jacoby",
               "profile_path": null,
               "id": 1076432,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.036516,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 122515,
      "vote_count": 0,
      "budget": 0,
      "overview": "When the prominent citizens of a small town discover that the officers of the local bank have been embezzling money from it, they decide to rob the bank themselves.",
      "similar": [
         949,
         97434,
         9654,
         623,
         11966,
         193893,
         9277,
         59108,
         291805,
         399170,
         10536,
         9471,
         9679,
         388,
         1701,
         59,
         88,
         298,
         1572,
         4771
      ],
      "original_title": "The Great Bank Hoax",
      "runtime": 87,
      "poster_path": "/xinCxH87VI2fe9GDqobJB8nqSw0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1978-11-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "God Bless America. But grab what you can, just in case.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph Jacoby"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Joseph Jacoby"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MTA5ODc2N15BMl5BanBnXkFtZTcwMTE4NDYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Basehart, Ned Beatty, Charlene Dallas | See full cast and crew »"],
      "reviews": [
         "LOVE Ned Beatty! He plays one of the bigshots at a small town bank where a chunk of money is missing, and the auditors are on the way, kind of an updated \"Bank Dick\", but W.C. Fields is long gone. Most viewers will recognize Beatty from Deliverance, or Hopscotch. The other bank big wigs are Richard Basehart and a seventy year old Burgess Meredith (The Penguin!) In our story, the Great Bank Hoax, the bank's chief clerk (Richard) meets up with a sultry, young Patricia at bingo night, and they head off to her place, but they aren't after the same thing... she just wants a loan from the bank, and he's after something else. Meanwhile, the bank directors are coming up with a plan to keep the auditors from knowing just how much is SUPPOSED to be in the vault.... One of the bank employees has a guilty conscience, and must get advice from the town priest. The pace is quite \"relaxed\", and there are a couple of slapstick gags and surprises, but it all works, as long you keep your expectations in check. Directed by indie writer/director Joseph Jacoby, who only worked on five projects.",
         "This is by no means a comedy on the level of \"The Ladykillers,\" \"Young Frankenstein,\" or \"The Odd Couple,\" but it definitely has its charms. It is true that, as other viewers have said, it unwinds at a pace that could kindly be called \"relaxed\" but I find that one of its charms. It is enjoyable to see how, ever so gradually, the characters start digging their holes deeper and deeper. Interest is also maintained by the continual revelation of new interrelationships between the characters, until one is never quite sure who is hoodwinking who. Another plus is the fine cast, of which Burgess Meredith is the standout. His portrayal of the crustily beguiling Stutz almost carries the movie. Basehart plays against type as a highly nervous milquetoast type, and Ned Beatty is good as the befuddled controller. Arthur Godfrey's minimal contribution was purely for the marquee. The movie is also blessed with the presence of two highly delectable female leads whose pulchritude is generously displayed. Finally, the production values are excellent, especially regarding color (they don't use techniques like this anymore because of the expense), and the movie is a joy to watch.",
         "\"The Great Bank Hoax\" is an engaging comedy meant to be a Watergate-inspired \"fable\". It even has one of its characters utter the phrase \"I'm not a crook!\" more than once! The big wigs at a small town bank discover an embezzlement, which is poorly timed to say the least, as there are auditors on the way to the bank. So these gentlemen cover their tracks with a staged robbery, which only leads to other complications, especially as the embezzler, who never intended to keep the money anyway, still suffers from a guilty conscience. In fact, as has been pointed out, he's actually the most conscientious person in the story! The story does make the salient point that any person, even one of reasonable moral fibre, can yield to temptation or corruption - even the local reverend (Michael Murphy) lets his greed get the better of him! Writer / director Joseph Jacoby's movie is quite likable, and has some endearingly silly moments; it's really rather light hearted, never ever getting too serious. It starts off well, capturing the feel of small town America and getting down to business pretty quickly. The main draw of the movie is seeing a top notch cast, including old pros Richard Basehart and Burgess Meredith, at work. They, along with Ned Beatty as the controller, have a fine chemistry, with Meredith coming off the best, in a typically fun performance. Paul Sand is appealing as the guilt ridden chief clerk / embezzler, and TV and radio host Arthur Godfrey is good in a rather small role; the female co-stars, Charlene Dallas and Constance Forslund, are incredibly sexy, especially Ms. Dallas, and as we can see, their characters are absolutely no innocents, either. The pacing is relaxed, but things do still nicely lead up to a delicious resolution, and it's all enhanced by Arthur B. Rubinstein's funny comedy score. An enjoyable diversion. Seven out of 10.",
         "Nebbishy bank clerk Richard Smedley (a solid and likable performance by Paul Sands) decides to test the system by embezzling over $100,000 thousand dollars from the small town Pewter Bank & Trust. A trio of corrupt bank officials -- nervous president Manny Benchley (a sturdy portrayal by Richard Basehart), reluctant book keeper Julius Taggert (a fine Ned Beatty), and cagey old coot Jack Stutz (a marvelously sly turn by Burgess Meredith) -- discover what Richard has done, but decide to cover it up by staging a fake robbery and taking an additional one hundred grand for themselves while they're at it. Writer/director Joseph Jacoby relates the amusing story at a laid-back, but steady pace, ably mines a satisfying line in pleasant low-key humor, nicely captures the sleepy nature of homey heartland America, and delivers a good deal of spot-on social commentary on how the allure of easily available money can lead even the most respectable law-biding citizens and pillars of the community astray. The sound acting from the tip-top cast helps a lot: Basehart, Beatty, and especially Meredith all excel in their roles, Sands makes for an engaging lead, plus there are praiseworthy contributions from Charlene Dallas as shrewd and sexy blackmailer Cathy Bonano, Michael Murphy as the shrewd Reverend Everett Manigma, and yummy blonde Constance Forshund as brash and on the make opportunist Patricia Allison Potter. A delightfully playful sense of cynicism and irony gives this picture an extra boost; the embezzler winds up being the only truly honest character in the whole movie and even the local priest wants a piece of the action. Walter Lassally's bright cinematography gives the film a pleasing bright look. Arthur B. Rubinstein's sprightly score likewise does the trick. An enjoyable romp.",
         "I recorded this about four years ago and finally got round to watching it tonight. It's a simplistic and boring tale of bungling and embezzlement in a sleepy bank in a non-descript town. A struggle to watch till the end. 2/10"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": ["When the prominent citizens of a small town discover that the officers of the local bank have been embezzling money from it, they decide to rob the bank themselves."],
      "budget": 0
   },
   "movielensId": 92343,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-11-01",
      "dvdReleaseDate": null,
      "directors": ["Joseph Jacoby"],
      "runtime": 87,
      "movieId": 92343,
      "title": "The Great Bank Hoax",
      "mpaa": "",
      "actors": [
         "Richard Basehart",
         "Ned Beatty",
         "Charlene Dallas",
         "Burgess Meredith",
         "Michael Murphy",
         "Paul Sand",
         "Constance Forslund",
         "Arthur Godfrey"
      ],
      "imdbMovieId": "0076107",
      "originalTitle": "The Great Bank Hoax",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "When the prominent citizens of a small town discover that the officers of the local bank have been embezzling money from it, they decide to rob the bank themselves.",
      "tmdbMovieId": 122515,
      "avgRating": 1.5,
      "releaseYear": "1978",
      "numRatings": 1,
      "posterPath": "/xinCxH87VI2fe9GDqobJB8nqSw0.jpg"
   }
}