{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0068640",
      "video": false,
      "title": "Hot Summer Week",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe4a959251416c750e7241",
               "name": "Dianne Hull",
               "profile_path": "/migPenfBRdgTiSSPHq6uoI67o0O.jpg",
               "id": 97947,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Will",
               "gender": 2,
               "credit_id": "52fe4a959251416c750e7245",
               "name": "Michael Ontkean",
               "profile_path": "/6IEe5QuVb1FKjPZahGtSDD3TcLQ.jpg",
               "id": 6678,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe4a959251416c750e7249",
               "name": "Kathleen Cody",
               "profile_path": null,
               "id": 137111,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe4a959251416c750e724d",
               "name": "Ralph Waite",
               "profile_path": "/fvLzvzgEhznLngnM628rXTt53AX.jpg",
               "id": 8853,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a959251416c750e721f",
               "name": "Thomas J. Schmidt",
               "profile_path": null,
               "id": 1112972,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a959251416c750e7225",
               "name": "Gloria Goldsmith",
               "profile_path": null,
               "id": 161427,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a959251416c750e722b",
               "name": "Gloria Goldsmith",
               "profile_path": null,
               "id": 161427,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a959251416c750e7231",
               "name": "Larry Bischof",
               "profile_path": null,
               "id": 198405,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a959251416c750e7237",
               "name": "David M. Kaufman",
               "profile_path": null,
               "id": 223840,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a959251416c750e723d",
               "name": "Michel Levesque",
               "profile_path": null,
               "id": 41702,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.5E-5,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 140632,
      "vote_count": 0,
      "budget": 0,
      "overview": "Via Amazon: \"Two wild teenage girls, Debbie (Kathleen Cody) and Karen (Dianne Hull, FIFTH FLOOR, ALOHA BOBBY AND ROSE) hit the road for some freedom, boys, and unexpected danger in this 1973 drive-in classic! The girls pick up a handsome Vietnam veteran (Michael Ontkean, TWIN PEAKS, SLAP SHOT, MAID TO ORDER) who is still troubled from his time at war, but is trying his best to fit in. They all end up at a hippie encounter session run by John (Ralph Waite, THE WALTONS, THE BODYGUARD) in a peaceful village by the ocean. It's all fun and games until the girls discover that a serial killer is murdering girls.\"",
      "similar": [],
      "original_title": "Hot Summer Week",
      "runtime": 79,
      "poster_path": "/at79SxuyGJJc2yccU9CAyMjUlgr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1972-06-21",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thomas J. Schmidt"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Larry Bischof",
         "Gloria Goldsmith"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNTU1ODgxNV5BMl5BanBnXkFtZTcwODk0MDYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dianne Hull, Michael Ontkean, Kathleen Cody | See full cast and crew »"],
      "reviews": [
         "I'm not sure why, but I kind of liked this. It's very tame--aside from some brief nudity it could have been a TV movie. (The presence of sexploitation star Uschi Digardt might suggest a much racier movie, but she is literally only in a single brief shot in the opening credits). The plot is randomly weird, and the ending is infuriatingly ambiguous. Then there is the title song which. . . well, let me put it this way: if you went up to anybody on the street and asked them to make up a 70's-style song on the spot and sing it a capella, it would probably sound better than the one in this movie. Two girls who have just graduated from high school take a trip out to the California beach. After causing an accident by flashing a passing motorist and getting rousted by the police, they pick up a hitch-hiker (Michael Ontkean) who is suffering from traumatic flashbacks caused by his time in Vietnam. The hitchhiker brings them to a commune headed by a guru (played by the guy who went on to become TV's \"Papa Walton\")and a drug-addled crazy who calls himself \"the Creator\". Meanwhile, someone is going around strangling young women. . . This movie manages to capture some of the strange ambiance of this era, but not in the annoyingly self-reflexive way most later movies would (the music may be terrible, but at least it's not the usual overused cues for collective Baby-Boomer nostalgia). The two girls are pretty and appealing, and surprisingly innocent--this may be the first movie where young protagonists vow to lose their virginity and then completely fail to do so. (The brunette ALMOST gets it on with Papa Walton, which in itself is worth the price of admission). This is not very good, but it's an interesting time-capsule piece from the era kind of like \"Last Summer\", \"Runaway, Runaway\", \"The Todd Killings\", or \"Welcome to Arrow Beach\"",
         "Saw this one late one night on television in Sweden, and went on watching, mostly because of Michael Ontkean. It's supposedly a thriller about two hitch-hiking girls. But this movie is just hilarious, with bizarre flashbacks, a freaky hippie community, and an ending that makes you wonder whether they had a script writer at all. A must-see for lover of bad films. You'll get at lot of laughs.",
         "Girls On the Road has absolutely no socially redeeming value, but it is incredibly entertaining. Dianne Hull and Kathleen Cody star as Karen and Debbie, a pair of just out of high school waifs who drive off in their station wagon for a life of adventure on the road. First order of business: taking their bras off and wiggling their breasts around! Ah, freedom at last! But things take a turn for the wacky when the youngsters pick up hitchhiking veteran Will (Michael Ontkean), who's on his way back to a Big Sur commune run by future congressional candidate Ralph Waite. Activities at the commune revolve around spouting the most egregious psycho babble whilst sitting in a circle holding hands, and this soon attracts the interest of rejected ugly duckling Debbie. Meanwhile, Karen and Will are in the early stages of a budding romance, but their beachside strolls are disturbed by the local serial killer, who enjoys strangling young women. There are plenty of red herrings, flashbacks galore (complete with distorted camera angles), some truly awful clothing and hair cuts, and one of the worst folk-pop songs of the era--and that's saying a lot! Top quality garbage that will have your jaw repeatedly hanging open.",
         "Seeing Ralph waite, the father on The Waltons, play a hippie who runs a commune and hits on 17-year-olds is worth the price of this baby! Plus, you gotta see his sideburns! The plot is no worse than any other road movie, and this is one of many, many female road movies that came before Thelma and Louise and gets no credit."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Fanfare Corporation, The",
         "Fanfare"
      ],
      "summaries": ["Two girls on their way to a hippie encounter session pick up a crazed Vietnam veteran, who might just be the serial killer who is murdering hippies in the area."],
      "budget": 0
   },
   "movielensId": 92906,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-06-21",
      "dvdReleaseDate": "2010-08-31",
      "directors": ["Thomas J. Schmidt"],
      "runtime": 79,
      "movieId": 92906,
      "title": "Hot Summer Week",
      "mpaa": "",
      "actors": [
         "Dianne Hull",
         "Michael Ontkean",
         "Kathleen Cody",
         "Ralph Waite"
      ],
      "imdbMovieId": "0068640",
      "originalTitle": "Hot Summer Week",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["6UrPCJ9B_yo"],
      "plotSummary": "Via Amazon: \"Two wild teenage girls, Debbie (Kathleen Cody) and Karen (Dianne Hull, FIFTH FLOOR, ALOHA BOBBY AND ROSE) hit the road for some freedom, boys, and unexpected danger in this 1973 drive-in classic! The girls pick up a handsome Vietnam veteran (Michael Ontkean, TWIN PEAKS, SLAP SHOT, MAID TO ORDER) who is still troubled from his time at war, but is trying his best to fit in. They all end up at a hippie encounter session run by John (Ralph Waite, THE WALTONS, THE BODYGUARD) in a peaceful village by the ocean. It's all fun and games until the girls discover that a serial killer is murdering girls.\"",
      "tmdbMovieId": 140632,
      "avgRating": 1,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/at79SxuyGJJc2yccU9CAyMjUlgr.jpg"
   }
}