{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "taxi driver",
            "id": 1749
         },
         {
            "name": "hat",
            "id": 2656
         },
         {
            "name": "key",
            "id": 2849
         },
         {
            "name": "bed",
            "id": 3501
         },
         {
            "name": "stuffed animal",
            "id": 10668
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "top hat",
            "id": 33681
         },
         {
            "name": "goldfish bowl",
            "id": 161037
         },
         {
            "name": "alcoholic drink",
            "id": 164044
         }
      ],
      "imdb_id": "tt0007145",
      "video": false,
      "title": "One A.M.",
      "recommendations": [
         2077,
         2078,
         53419,
         47650,
         53420,
         53416,
         13707,
         31819,
         148118,
         147312,
         195073,
         195074,
         93980,
         53417,
         77133,
         128014,
         196396,
         98914,
         147159,
         148050
      ],
      "backdrop_path": "/ucd1hvxoszoMYdSiqerHzDClNTF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Drunk",
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650e5",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Taxi Driver",
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650e9",
               "name": "Albert Austin",
               "profile_path": null,
               "id": 21306,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650cf",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650d5",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4865c3a36847f81650db",
               "name": "Vincent Bryan",
               "profile_path": null,
               "id": 21308,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4865c3a36847f81650e1",
               "name": "Maverick Terrell",
               "profile_path": null,
               "id": 21309,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650ef",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4865c3a36847f81650f5",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4865c3a36847f81650fb",
               "name": "Henry P. Caulfield",
               "profile_path": null,
               "id": 21300,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "569bd45b9251415e73000311",
               "name": "Roland Totheroh",
               "profile_path": null,
               "id": 14020,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "569bd4769251415e6700031b",
               "name": "George Cleethorpe",
               "profile_path": null,
               "id": 74965,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "569bd449c3a36858dc000335",
               "name": "William C. Foster",
               "profile_path": null,
               "id": 74963,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "569bd4b1c3a36858c8000354",
               "name": "Toraichi Kono",
               "profile_path": null,
               "id": 1195066,
               "department": "Crew",
               "job": "Driver"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.331419,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53418,
      "vote_count": 25,
      "budget": 0,
      "overview": "A drunken homeowner has a difficult time getting about in his home after arriving home late at night.",
      "similar": [
         35056,
         2330,
         1538,
         48138,
         339,
         320006,
         11228,
         1845,
         308084,
         17221,
         114738,
         31993,
         341,
         82260,
         283718,
         412369,
         77084,
         32092,
         345032,
         380681
      ],
      "original_title": "One A.M.",
      "runtime": 22,
      "poster_path": "/fMTBPmziiGerQyQtwgNSTOakZ2t.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lone Star Corporation",
         "id": 930,
         "origin_country": ""
      }],
      "release_date": "1916-08-07",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "An inspiring and fantastic one-man show!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Chaplin"],
      "runtime": 24,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0007145/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0OTgxNzYyOF5BMl5BanBnXkFtZTgwNjc0NzkwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charles Chaplin, Albert Austin | See full cast and crew »"],
      "reviews": [
         "One of Charlie Chaplin's many short comedies, \"One A.M.\" is essentially a one-man show, and while it is purely slapstick-oriented without any of the depth of Chaplin's later films, it's pretty good. Except for a brief appearance by a cab driver at the beginning, Charlie is on-screen alone for the entire film, as a man returning home after a night of carousing. All he wants to do is go to bed, but before he can go to bed, he has to get up the stairs, and before he can get up the stairs, he has to get inside the house - but in Charlie's condition, each step is fraught with peril. The film starts somewhat slowly, but gets funnier as it goes along. Chaplin shows off not just his comic timing, but his acrobatic skills as well - some of the stunts are pretty impressive. While this is certainly not one of his best, it's worth watching.",
         "At Mutual, Chaplin had more freedom, and the result was the funniest and most entertaining short films he ever made. 'One A.M.' is one of his most experimental Mutual shorts: how many laughs can he get from a 20-some-minutes drunken solo, where, for the most part, he only interacts with inanimate objects (although the Murphy bed seems very alive). He got many from me. Chaplin did a hilarious drunk act--that's evident in many of his other films, as well: 'The Rounders' (1914), a Keystone short costarring an equally funny 'Fatty' Arbuckle, comes to mind, as does another of his Mutual shorts, 'The Cure' (1917). Moreover, Chaplin's tendency to portray a dandy as a drunk, rather than a tramp, which could cause the humour to lose out to melancholic social commentary, was prudent. Making fun of the tacky and ridiculous possessions of an overly dressed bachelor is more of sure thing. Chaplin's dandy--even his tramp personae--owes plenty to Max Linder, too, as Chaplin himself often cited. Another influence worth mentioning here is his background in Fred Karno's Fun Factory troupe. The only filmmakers other than Chaplin who are provided with much to do in 'One A.M.' it seems are those in care of the props and setting. 'One A.M.' could have as easily have been a music hall act as a short film. Nevertheless, all of this does make for a unique film in Chaplin's canon. By now, it's clear that Chaplin had matured from the rapid-paced, knockabout style of Keystone for a more graceful pantomime. That's not to say there aren't pratfalls and other tried-and-true gags here, but the temperament is radically different.",
         "Chaplin plays a drunk who spends the entire film trying to get into his house and go to bed. In a comedic experiment, Chaplin appears alone in this film, aside from Albert Austin, who briefly appears at the beginning as a cab driver. Chaplin draws the humor from his interaction with various objects around the house, most humorously with a hostile Murphy bed. Is this comic experiment successful? Yes, for the most part. It is a funny short, but, in my opinion, nowhere near his funniest. Still, one must admire Chaplin's boldness. When one watches this film, one sees a talented film maker testing the limits of skills. Bravo.",
         "In 1916 the Mutual Films company released eight Chaplin pictures, highlighting a marked decrease in his output but also a marked increase in the quality. This was a theme that was to continue throughout the rest of his career, as the following year he would release half as many again, though with increased results. Come the mid 20s and Chaplin's down to just one feature every three to five years, though most of them classics. As for the Mutual output in 1916, then despite the increased artistry, many of them are still a couple of steps away from \"Chaplin as genius\". Indeed, while well staged, shorts like \"The Floorwalker\" and \"The Fireman\" are really just an extended series of people being kicked repeatedly up the backside. One A.M breaks that mould, an upturn in quality that would continue into the equally brilliant \"The Pawnbroker\" and \"The Rink\" two more shorts that would showcase Chaplin as a tremendously gifted acrobat. \"Behind The Screen\" was another upturn in quality from this run, a film that combined a witty deconstruction of the slapstick genre along with a daring gay gag, quite shocking for 1916. But it was the stunts that were most notable for the year - if not quite death-defying, then certainly serious injury defying. One A.M. is another foray into Chaplin doing a non-Tramp character, this time a drunken aristocrat. While Charlie's immense physical gifts can be seen in most of the films of the age, many of them are of a type, in particular him falling backwards onto his shoulder blades. By marked contrast, then many of the stunts seen in One A.M. are truly extraordinary, combining both substantial physical danger along with witty innovation. A virtual solo piece, it's basically one joke extended for twenty minutes, yet it's a very good joke given enormous invention and considerable charm. A stand out of the year that culminated in the classic \"The Rink\".",
         "This short film numbers among Chaplin's best, and is a stunning example of his skill as a silent physical comedic actor. However, one has to enjoy silent, completely non-verbal, comedy in the first place. While I laughed almost non-stop through this entire film, close friends of mine, who were not entertained by Chaplin's physical gaffes, quickly lost interest.",
         "This is wonderful early Chaplin stuff. His use of props and gimmickry are definitive. How do you suppose he could fall down the stairs that many times and still get up unhurt? The man was a genius!!.",
         "1914 was Chaplin's first year in films and he starred in 25 movies in just this first year alone. However, many of these films were pretty bad--with practically no plot and just a lot of improvisation that sometimes worked and often didn't. Despite the quality of these films, by 1915 he was probably the #1 star in the world and was lured away from Keystone Studios--with promises of more money and even greater autonomy. Instead of just doing the same old comedies, Chaplin improved upon his \"Little Tramp\" character and begin carefully scripting his films, and so naturally the quality improved greatly. ONE A.M. is a great example of his newer and more thought-out scripts for Mutual Studios. While Chaplin is the only person who appears in the film (other than a very brief scene with a cabbie at the beginning), the film is not simply improv or mugging for the camera, but well-choreographed and using complicated props made specially for this film. Several examples would include the spinning taxi meter, the clock with the dangerous swinging pendulum and the amazing and almost intelligent bed. At first, I thought this whole drunk act theme would become tiresome. After all, at almost 17 minutes, that's a long time to do a drunk \"schtick\". However, when I thought perhaps Chaplin was milking a scene too much for comedy, he switched to another prop and kept my interest. Funny, well-made and memorable--this is one of Chaplin's best comedy shorts and translates well to viewing in the 21st century.",
         "This short film must have inspired many comedians. It´s about when Charlie comes home VERY early in the morning and is drunk.A funny one-man show that really shows that the man was a genius.If I should rate this I would give it a 4/5.",
         "A short movie directed and written (predominantly) by Charlie Chaplin, One A.M. strikes a chord of familiarity today just as it would have almost a century ago when it was first released. The reason why a lot of people can still identify with this skit is because it's all about a drunken man trying to get himself indoors and away to bed without losing too much dignity. Now I don't want to cast aspersions on a whole planet full of movie viewers but I'm sure that most of us have been in that situation at least once in our lives. Things start off slowly and gently enough but soon pick up pace as Chaplin gets himself caught up on a revolving table, struggles to get up stairs and is confounded by a troublesome bed that just won't go into the right position at the right time (reminiscent, for me, of Chaplin's battle with technology in Modern Times). Fans will love this and newcomers could do a lot worse than giving it a try. It's brief, entertaining and a decent enough introduction to the comedy stylings of a man who would go on to become a towering figure in the land of mirth.",
         "Chaplin's fourth film for the Mutual Film Corporation has him playing a drunk arriving home at 1:00 AM trying to find his bed. The film is primarily a solo act for Chaplin with the exception of the cabdriver at the beginning. The film is equally experimental as it is bold in that Chaplin took a huge risk appearing on screen so long by himself. The result is the film is a resounding success. Chaplin once again plays a drunkard, which he had done so often previously. This time though the drunk act is not the whole show as it was in earlier films. Chaplin does battle with a number of inanimate objects including the following: The cab door, the cab's meter, a fish bowl, a doormat that moves like a magic carpet, some stuffed floor animals, a revolving table, a double staircase, a coat or hat rack, an over-sized pendulum swinging injudiciously from a wall clock, a Murphy bed, and a modern shower circa 1916. The film is purely slapstick and sight gags like many of his earlier Keystone comedies with an important difference. Here the gags are carefully choreographed, scripted, and timed to perfection employing Chaplin's perfected pantomime from his music hall days with Fred Karno's troupe in England. The gags are equally inventive and hilarious, showcasing Chaplin's athleticism and acrobatic talents. The highlight of the film is his encounter with the Murphy bed, which seems to have a mind of its own. This is probably the first film one could identify as a Chaplin classic; it's a comic ballet. *** of 4 stars."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Short"
      ],
      "productionCompanies": ["Lone Star Corporation"],
      "summaries": [
         "After a night on the town, Charlie comes home to the house where he is staying, drunk and unable to find his key. For the next twenty minutes he staggers into, out of, and through the house in an inebriated confrontation with the house itself.",
         "A one-man mime show. Charlie comes home drunk. Forgetting his key, he climbs in through the window, climbs back out with the key, and goes through the door. The rest are equilibrium gags, the central one being with his collapsible wall-bed.",
         "A drunken homeowner has a difficult time getting about in his home after arriving home late at night."
      ],
      "budget": 0
   },
   "movielensId": 93328,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1916-08-07",
      "dvdReleaseDate": null,
      "directors": ["Charlie Chaplin"],
      "runtime": 22,
      "movieId": 93328,
      "title": "One A.M.",
      "mpaa": "",
      "actors": [
         "Charlie Chaplin",
         "Albert Austin"
      ],
      "imdbMovieId": "0007145",
      "originalTitle": "One A.M.",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["lgxddK2Un7I"],
      "plotSummary": "A drunken homeowner has a difficult time getting about in his home after arriving home late at night.",
      "tmdbMovieId": 53418,
      "avgRating": 2.93333,
      "releaseYear": "1916",
      "numRatings": 15,
      "posterPath": "/fMTBPmziiGerQyQtwgNSTOakZ2t.jpg"
   }
}