{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0023956",
      "video": false,
      "title": "Don Quixote",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Don Quixote",
               "gender": 0,
               "credit_id": "52fe470dc3a36847f8120eed",
               "name": "Feodor Chaliapin Sr.",
               "profile_path": null,
               "id": 934254,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sancho Panza",
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120ef1",
               "name": "George Robey",
               "profile_path": "/od4TQckGWikH4E7JtyHpZYhxNoG.jpg",
               "id": 934255,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Captain of Police",
               "gender": 2,
               "credit_id": "59f093289251416acb015f9a",
               "name": "Oscar Asche",
               "profile_path": null,
               "id": 125511,
               "order": 2
            },
            {
               "cast_id": 20,
               "character": "Carrasco",
               "gender": 0,
               "credit_id": "59f093419251416ac1015ec7",
               "name": "René Donnio",
               "profile_path": null,
               "id": 992685,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Priest",
               "gender": 0,
               "credit_id": "59f0935d9251416acb016000",
               "name": "Frank Stanmore",
               "profile_path": null,
               "id": 1307038,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "The Duke of Fallanga",
               "gender": 2,
               "credit_id": "59f09373c3a368064e0167ad",
               "name": "Miles Mander",
               "profile_path": "/bdpwtvVZjOgkaOXXA38tfYuiBT5.jpg",
               "id": 19329,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Gypsy King",
               "gender": 2,
               "credit_id": "59f0938a9251416ac1015f34",
               "name": "Wally Patch",
               "profile_path": "/fAD7tIoaRPPk46SrcQjB4cTgvjB.jpg",
               "id": 554381,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Maria, the niece",
               "gender": 1,
               "credit_id": "59f093a2c3a3680673015a7a",
               "name": "Sidney Fox",
               "profile_path": "/2Pl6GPyFXa7XZjNCwHJwZhIXviO.jpg",
               "id": 100789,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Sancho Panza's wife",
               "gender": 1,
               "credit_id": "59f093b892514148be00b4ce",
               "name": "Emily Fitzroy",
               "profile_path": "/Fro2FTln4zQ7v9cjYtpsOcY8Di.jpg",
               "id": 97988,
               "order": 8
            },
            {
               "cast_id": 26,
               "character": "Dulcinea",
               "gender": 0,
               "credit_id": "59f093dcc3a36806ae015a54",
               "name": "Renée Valliers",
               "profile_path": null,
               "id": 1911930,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "Servant (uncredited)",
               "gender": 2,
               "credit_id": "59f093fdc3a3682db500f66e",
               "name": "Vladimir Sokoloff",
               "profile_path": "/pbgNdX1vgSLIbB2phKiuOQlTGAi.jpg",
               "id": 14533,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470dc3a36847f8120ee9",
               "name": "Georg Wilhelm Pabst",
               "profile_path": "/bClbSJ23RmnZuELDzLG2a9WiLjx.jpg",
               "id": 13899,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59f091169251416a9e01601d",
               "name": "Georg Wilhelm Pabst",
               "profile_path": "/bClbSJ23RmnZuELDzLG2a9WiLjx.jpg",
               "id": 13899,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59f0912e9251416a9e016041",
               "name": "Paul Morand",
               "profile_path": null,
               "id": 997570,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "59f091449251416aaf0158c5",
               "name": "Alexandre Arnoux",
               "profile_path": null,
               "id": 31993,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "59f09167c3a36806e00134a6",
               "name": "Miguel de Cervantes y Saavedra",
               "profile_path": "/9jM4JtEgzPnH7r0LChqmeARs2gO.jpg",
               "id": 1095589,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "59f091b0c3a3680665015973",
               "name": "Georg Wilhelm Pabst",
               "profile_path": "/bClbSJ23RmnZuELDzLG2a9WiLjx.jpg",
               "id": 13899,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59f091c3c3a3682db500f39c",
               "name": "Jacques Ibert",
               "profile_path": null,
               "id": 1027533,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59f091f1c3a36806820156a6",
               "name": "Nicolas Farkas",
               "profile_path": null,
               "id": 1121837,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59f092119251416acb015e09",
               "name": "Paul Portier",
               "profile_path": null,
               "id": 1342225,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59f0923b9251416a9e016198",
               "name": "Jean Oser",
               "profile_path": null,
               "id": 31997,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59f092569251416ad0016449",
               "name": "Andrej Andrejew",
               "profile_path": null,
               "id": 13903,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59f09269c3a36806e00135e0",
               "name": "Max Pretzfelder",
               "profile_path": null,
               "id": 32001,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59f09284c3a3680665015a8d",
               "name": "Constantin Geftman",
               "profile_path": null,
               "id": 1310527,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "59f0929ac3a3680665015ab3",
               "name": "Jean de Limur",
               "profile_path": null,
               "id": 1009360,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "59f092de9251416aa3015ae7",
               "name": "John Farrow",
               "profile_path": "/amtDvJFbgk2ea4Mdtc7ZxXibZMf.jpg",
               "id": 50300,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "59f093039251416aaf015b4d",
               "name": "J. Dell",
               "profile_path": null,
               "id": 1911927,
               "department": "Sound",
               "job": "Sound Engineer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.411599,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 46813,
      "vote_count": 3,
      "budget": 0,
      "overview": "In sixteenth century Spain, an elderly gentleman named Don Quixote has gone mad from reading too many books on chivalry...",
      "similar": [],
      "original_title": "Don Quixote",
      "runtime": 73,
      "poster_path": "/paGBPnnFpFWqAAZRNG9BCJRn7L7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Vandor Film",
            "id": 96577,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nelson Film",
            "id": 96576,
            "origin_country": ""
         }
      ],
      "release_date": "1933-01-01",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Georg Wilhelm Pabst"],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Miguel de Cervantes y Saavedra",
         "Alexandre Arnoux"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023956/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NzQ2NDY2OF5BMl5BanBnXkFtZTcwMjIyOTIzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Feodor Chaliapin Sr., George Robey, Oscar Asche | See full cast and crew »"],
      "reviews": [
         "Having only once attempted unsuccessfully to slog my way through the Peter O'Toole version of \"Man of la Mancha,\" I was unfamiliar the plot of Don Quixote. I discovered this film at movieflix.com, a nice resource of free films. Even with the poor visual and sound quality of that site, this movie shines. Chaliapin and Robey are wonderful. (BTW, when another commenter refers to \"Sancho caressing his ass in tears,\" he means his donkey.) Chaliapin's beautifully rich voice is matched by his acting, and he brings the full range of emotion to his role. It's a shame that this is the only film he sings in. There is much comedy and pathos here and it's beautifully directed. Highly recommended!",
         "(This is a review of the VHS version) G.W.Pabst's film version of \"Don Quixote\", originally filmed in three languages, but with the same leading actor, may not please all lovers of the great Cervantes novel, but it makes a fascinating document for music lovers and opera buffs. Although not based at all on the Jules Massenet opera in which he sang the title role, this is the only chance to see and hear the great Russian basso Fyodor Chaliapin in one of his greatest roles. Chaliapin revolutionized the art of opera acting, and if he had wanted to, could have been an equally effective non-singing actor, although his English is heavily accented and he tends to declaim rather than just speak. His singing voice in this film is probably not what it once was, but he is so charismatic that he holds the audience riveted.(You may squirm through some of the songs, though - this isn't Massenet's opera, or \"Man of La Mancha\", for that matter.) The supporting cast is quite good in both English and French versions (I haven't seen the German one), and Chaliapin himself speaks and sings better French than English. The photography is beautiful, although this really isn't Spain,and the windmill sequence is a flabbergasting accomplishment for 1933. You may like a little more emotional involvement in your movies, though. Be warned - the French version (on the videocassette, not the DVD) has no subtitles - they assume you've already seen it in English since they both come in the same package.",
         "The French version of this film is available on DVD along with the English version, which is 6 minutes shorter and missing just a few brief scenes and cut differently, with a longer written introduction and conclusion. Chaliapine's French is marginally better than his English and this film gives an astounding impression of his peculiarities as a singing actor: his tendency to interpolate subliminal sighs and groans between notes and his sometimes approximate pitch, which was probably another actor's trick. Besides, he was a \"Don Quixote\" expert, having created the title role of Massenet's 1910 opera of the same name. These films (the French, English and German versions) were an attempt to capture his legendary stage performance of this character even though the songs are by Jacques Ibert. Ravel had also been asked to compose the songs for the film but he missed the deadline and his songs survive on their own with texts that are different from those found here. The interplay between the French and English versions is fascinating. Some scenes are done exactly the same for better or worse, some use the same footage, re-cut to edit out performance problems, while others have slight variants in staging and dialog. (The English version was doctored by Australian-born scriptwriter and director John Farrow, Mia's father, by the way.) Even though the films are short and they transform, reduce and simplify considerably the original novel, they still manage to carry the themes and the feeling that would make \"Man of La Mancha\" a hit several decades later and to be evocative of Cervantes' Spain. The ending (which has a jolting special effect I will not reveal) is particularly effective and touching. Both the French and English prints are marred by a few jumps caused by missing frames which unfortunately make those films useless as a perfect recording medium for most of the songs but they are still very watchable and enjoyable. Chaliapine did record his four songs in 1933 for 78 RPM records and they and Sancho's song have been issued on a Marco Polo album (Jacques Ibert Film Music, 8.22387) sung by Henry Kiichli, which uses the published lyrics, which are a little different from the film's lyrics. All performances, except the death scene, appear to have been recorded live. Donnio does his role of Carrasco in both languages and the French Panza Dorville is as spectacular as his English counterpart George Robey is relaxed. All the supporting roles are well played in both versions. I found the English translation of the lyrics intelligent, poetic and perceptive. All in all, a very interesting bilingual package for the discerning opera and film amateur, edited by a video company that specializes in legendary musical performances.",
         "Miguel de Cervantes's great novel, \"Don Quixote,\" (Part One, 1605, Part Two, 1615)has been treated in opera, musical comedy, Spanish zarzuela, ballet, film and the fine arts, though it is best played out in the theater of the imagination. To this film can come closest and G. W. Pabst's sensitive treatment in black and white does well indeed. The great Russian bass Feodor Chaliapin, who sang the title role in Jules Massenet's gorgeous 1910 opera, \"Don Quichotte,\" plays Don Quixote, and sings too, with nice music credited to Jacques Ibert. George Robey makes a splendid Sancho Panza. The adaptation is intelligent, with many of the best known episodes treated,if not in the same order as in the book. The film handles well the Duke and Duchess, who humor Don Quixote and Sancho Panza for their amusement, but are somewhat humbled. Having the windmills (Part One, chapter 8) and burning of romances of chivalry at the end (Part One, chapter 6), with the death of Quixote, works surprisingly well. It is worth cleaning up and re-releasing, if possible.",
         "I saw the New York Museum of Modern Art's print (the English language version). Only Chaliapin does much singing, but the music and lyrics are not much and I suggest you listen to his recordings to judge his singing. His acting seems very much staged. George Robey is very good as Sancho Panza (Don Quixote's servant), playing him as a Music Hall character. The scene with the traveling players at an inn is also interesting and fun.",
         "Any excuse to hear Chaliapin sing is worth the listen and the watch. Also, it was great pleasure to see Pabst take on such a task in English. His camera never missed a beat and the scenery was magnificent. There are the things to object about as brought up by sever reviewers. It's true that Chaliapin's English was not good. He probably learned his lines phonetically. I've coached several singers in my time and it does sound like that. The music, by Jacques Ibert. was really quite good throughout and the players around Quixote himself were truly fine. This is a film for the history books - Pabst meets Chaliapin meets Ibert meet Cervantes meet the English language. They all win, but we do have to listen very carefully to the English. It is on the border of comprehension at times.",
         "For me, this film is defined by the printed paper and his metamorphosis. The bustle, the delicate ash, the music are principal words of Cervantes masterpiece definition. So, the film must be a success at least for impressive presence of Chaliapin. In fact, it is not a film but a huge monument, the Baroque interpretation of Chaliapin has the talent to create a fantastic world.The pathetism of opera is part of gorgeous sophisticated fine expression Only values for a verdict in this case are subjectives. A legend of Russian Opera is Don Quixote. Every feature of character is slice of a subtle science of chimera's revelation. Every gesture is a form to describe sweet secret of fragile world. And Chaliapin is Chaliapin. But, more important, it is statute of testimony. The trip between symbols and facts, between refuges and truth. \"Don Quixote\" is not a ordinary picturization, it is a propaganda instrument. The three versions, \"Man and Mask\", the recordings , Mefistofele, the shows in Europe and the fame are elements of a special artist portrait who gives to his character not only a special soul but a subtle vision about life and illusion. I believe that this movie was for Chaliapin an adventure. His art is same, his acting is interesting and correct. For he, the hero from La Mancha is an alter-ego not ordinary character. So, the force of interpretation is charming, strong and pure.",
         "It is unusual to see scrappy direction from Pabst, but I was disappointed with this film. What is interesting about this film is Shalyapin. In opera, and folksong, Shalyapin took the art of acting seriously. He would jump into the skin of the character he was playing or of the narrator of a song. He was almost like Lon Chaney, when it came to costume. Here the great man sings in English, and seems to be ideal as the pathetic character who sells all he has, to buy books of knightly romances; then, with his servant, Sancho Panza, sets out to do good deeds. Shalyapin's English is excellent, and he speaks and sings with a heavy accent that is Russian, tinged with the accent of the country in which he lived in exile - France. George Robey, with his music hall accent, who was beginning to shake off his \"coward\" image (He was a conscientious objector during the first world war) plays Sancho Panza. Shalyapin does sing some songs in this scrappy production; but, unlike, Pabst, he does not leave us disappointed.",
         "As somebody who admires the Russian bass Feodor Chaliapin, I was very impressed by Adventures of Don Quixote. I have seen all three versions, all three excellent, but my favourite is the french one. The English version is very effective, though I think the lyrics in the French version are a little more poetic, and Chaliapin is better at French than he is at English, which is not bad as such, just that there is a somewhat heavy accent that I didn't find noticeable in the French version. On a more positive note, it does look great, with beautiful photography and convincing settings. The music is a delight, the lyrics here is not quite as poetic as the French version but they are perhaps more intelligent and the melodies stayed in his head a long while after. I equally love the humour and pathos in the script, and the story is succinctly told with three scenes in particular standing out; the scene at the inn with the travelling players which is a lot of fun, the windmill scene which for the time was an accomplishment and still impresses and the very moving final scene. The acting is very good, George Robey is a splendid and relaxed Sancho Panza, the Duke and Duchess are amusing and humble, and Renee Donnio again plays Carrasco and is excellent. The film's best asset is Feodor Chaliapin's performance in the title role, he is brilliant. Vocally, he is not him at his very best, with a heavier tone than in his early days and some moments where his pitch is approximate. However he brings to his performance here his rich voice, robust vocal expression, vivid acting- I have often seen cited that Chaliapin was one of the first, or even the first, singer to take acting in opera seriously and I can see why- and towering physique(of any bass I think only Martti Talvela was taller) that was perfect for his best roles Boris Godunov and Mephistopheles. This is especially true in the final scene. Overall, well worth seeing, with my only real criticism being a few missing frames occasionally making the film jumpy. It is a very impressive film though, and for any anybody who loves or admires Chaliapin this is something to treasure forever and seeing how influential this legendary bass was in opera important as well. 9/10 Bethany Cox",
         "There are two reasons why I chose to watch this film. First, it was in the public domain, so it was free to watch (a definite plus) and second it was directed by the famous German director, G. W. Pabst. Well, despite this, I just did not enjoy the film. One of the main problems was the casting of the main character. Feodor Chaliapin Sr. was an excellent operatic type of singer from Russia. And, while I'll freely admit that he had a lovely voice, the guy was all wrong as Quixote. His accent was VERY strong and it sounded as if he really didn't know English but was doing his lines phonetically. It just seemed weird to have have this sort of accent coming out of a guy who was supposed to be Spanish. Second, instead of the normal version of the Cervantes book, this a musical where again and again Chaliapin would break into song for absolutely no reason--and the songs just didn't fit the film. It was as if his performance was important but the plot wasn't--why else would they put this guy in the lead? So what's the rest of the English language version like? Well, the acting was pretty good--even if the actors were often very English. The sets looked nice and the acting was good. But because of the musical nature of the film, I just can't recommend it to anyone--as who would like this sort of film? It certainly hasn't aged well and I can see why it's a rather obscure public domain film."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama",
         "Music",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Nelson Film",
         "Vandor Film"
      ],
      "summaries": ["In Spain, in the sixteenth century, an elderly gentleman named Don Quixote has gone mad from reading too many books on chivalry. Proclaiming himself a knight, he sets out with his squire, Sancho Panza, to reform the world and revive the age of chivalry, choosing a slut to be his noble lady Dulcinea. He mistakes inns for castles, a play about chivalry for the real thing, flocks of sheep for armies, convicts for wronged prisoners, and windmills for giants. While he and Sancho are off on their adventures, his niece, her fiancee, and the local priest think up a strategy to get him back home."],
      "budget": 0
   },
   "movielensId": 93322,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-01-01",
      "dvdReleaseDate": null,
      "directors": ["Georg Wilhelm Pabst"],
      "runtime": 73,
      "movieId": 93322,
      "title": "Don Quixote",
      "mpaa": "",
      "actors": [
         "Feodor Chaliapin Sr.",
         "George Robey",
         "Oscar Asche",
         "René Donnio",
         "Frank Stanmore",
         "Miles Mander",
         "Wally Patch",
         "Sidney Fox",
         "Emily Fitzroy",
         "Renée Valliers",
         "Vladimir Sokoloff"
      ],
      "imdbMovieId": "0023956",
      "originalTitle": "Don Quixote",
      "genres": [
         "Romance",
         "Adventure",
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In sixteenth century Spain, an elderly gentleman named Don Quixote has gone mad from reading too many books on chivalry...",
      "tmdbMovieId": 46813,
      "avgRating": 3.92857,
      "releaseYear": "1933",
      "numRatings": 7,
      "posterPath": "/paGBPnnFpFWqAAZRNG9BCJRn7L7.jpg"
   }
}