{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "orchestra",
            "id": 3537
         },
         {
            "name": "girlfriend",
            "id": 5490
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "orchestra conductor",
            "id": 192471
         }
      ],
      "imdb_id": "tt1772250",
      "video": false,
      "title": "The Hidden Face",
      "recommendations": [
         111083,
         77495,
         52274,
         48594,
         85438,
         33273,
         195276,
         75931,
         114994,
         284305,
         55825,
         132957,
         15372,
         39959,
         59421,
         354296,
         145198,
         48393,
         26040,
         37656
      ],
      "backdrop_path": "/1yu8Tsy8UNKoisIlQLIozoA8vl8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Adrián",
               "gender": 0,
               "credit_id": "52fe47ac9251416c91071e1b",
               "name": "Quim Gutiérrez",
               "profile_path": "/bZuPsaQASxuS1vMcxz80kbfCvVw.jpg",
               "id": 34018,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Fabiana",
               "gender": 1,
               "credit_id": "52fe47ac9251416c91071e17",
               "name": "Martina García",
               "profile_path": "/szjXDbwDTo5y7MUJ1E1mB2TmVMG.jpg",
               "id": 233278,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Belén",
               "gender": 1,
               "credit_id": "52fe47ac9251416c91071e1f",
               "name": "Clara Lago",
               "profile_path": "/osnPmIyOkwoKDmKm2pE0tb0qep9.jpg",
               "id": 224731,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Emma",
               "gender": 1,
               "credit_id": "52fe47ac9251416c91071e35",
               "name": "Alexandra Stewart",
               "profile_path": "/2hiKef95taRinlseKp6uFhVDTIR.jpg",
               "id": 18765,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mesera",
               "gender": 0,
               "credit_id": "535504e50e0a265614005fbe",
               "name": "María Soledad Rodríguez",
               "profile_path": null,
               "id": 1311766,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "5355051c0e0a265614005fc4",
               "name": "Marcela Mar",
               "profile_path": "/2rlhrrn75n4Ed8SFRzZgu3A76Qi.jpg",
               "id": 51006,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tito",
               "gender": 0,
               "credit_id": "535505240e0a2655fe006124",
               "name": "Humberto Dorado",
               "profile_path": null,
               "id": 61712,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Buitrago",
               "gender": 0,
               "credit_id": "5355052c0e0a265606005eee",
               "name": "Julio Pachón",
               "profile_path": null,
               "id": 1311768,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Ramírez",
               "gender": 0,
               "credit_id": "535505340e0a2656110060e5",
               "name": "Juan Alfonso Baptista",
               "profile_path": null,
               "id": 1311769,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Forense",
               "gender": 0,
               "credit_id": "5355053d0e0a26561d0060f8",
               "name": "Marcela Benjumea",
               "profile_path": null,
               "id": 1251529,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Perro 'Hans'",
               "gender": 0,
               "credit_id": "535505460e0a2655fe006127",
               "name": "Mozad",
               "profile_path": null,
               "id": 1311770,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47ac9251416c91071e13",
               "name": "Andrés Baiz",
               "profile_path": "/qoURBKjgGDfpd5WB5YCPzYxwi6r.jpg",
               "id": 444720,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47ac9251416c91071e2b",
               "name": "Hatem Khraiche",
               "profile_path": "/chyl2Z8yxIogjUk8q5SD8UuXMSU.jpg",
               "id": 1052836,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47ac9251416c91071e31",
               "name": "Arturo Infante",
               "profile_path": null,
               "id": 964293,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "535505580e0a265606005ef2",
               "name": "Cristian Conti",
               "profile_path": null,
               "id": 969241,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "535505610e0a265614005fcd",
               "name": "Andrés Calderón",
               "profile_path": null,
               "id": 969242,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5355056b0e0a26561d0060fb",
               "name": "Rodrigo Guerrero",
               "profile_path": null,
               "id": 5878,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "535505730e0a265606005ef6",
               "name": "Stefan Schmitz",
               "profile_path": null,
               "id": 1311771,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5355057c0e0a2656110060eb",
               "name": "Guadalupe Balaguer Trelles",
               "profile_path": null,
               "id": 1311772,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "535505840e0a2655fe00612d",
               "name": "María Zamora",
               "profile_path": null,
               "id": 984027,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5355058c0e0a265606005efb",
               "name": "Juliana Florez",
               "profile_path": null,
               "id": 1311773,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "535505950e0a2655fe006130",
               "name": "Federico Jusid",
               "profile_path": null,
               "id": 45546,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5355059d0e0a26560a0061dc",
               "name": "Josep M. Civit",
               "profile_path": null,
               "id": 90267,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "535505a50e0a2655fe006133",
               "name": "Roberto Otero",
               "profile_path": null,
               "id": 1311774,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "535505ad0e0a26561d006100",
               "name": "Bernardo Trujillo",
               "profile_path": null,
               "id": 16404,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "535505b90e0a265606005f01",
               "name": "Diana Trujillo",
               "profile_path": null,
               "id": 1132888,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 8.996951,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "CO",
            "name": "Colombia"
         }
      ],
      "id": 80184,
      "vote_count": 276,
      "budget": 0,
      "overview": "A Spanish orchestra conductor deals with the mysterious disappearance of his girlfriend.",
      "similar": [
         979,
         708,
         65754,
         567,
         210577,
         419430,
         8065,
         1429,
         2654,
         756,
         8844,
         10795,
         13523,
         261470,
         49950,
         6973,
         310593,
         276,
         1807,
         49948
      ],
      "original_title": "La cara oculta",
      "runtime": 92,
      "poster_path": "/lDcEdMaNSrm03NFdTkaLLNDLIVp.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Avalon Studios",
            "id": 293,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dynamo",
            "id": 7062,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox International Productions (FIP)",
            "id": 20492,
            "origin_country": ""
         }
      ],
      "release_date": "2011-09-16",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "There are doors that should never be opened.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Colombia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrés Baiz"],
      "runtime": 97,
      "synopsis": "The film opens with Adrián (Quim Gutierrez), a young orchestra conductor, viewing a video of his girlfriend, Belén (Clara Lago) telling him she is leaving him. Adrián becomes distraught. While drinking away his sorrows at a bar, he meets Fabiana (Martina Garcia) and they have a relationship where Fabiana moves into the house that Adrián was sharing with Belén. Adrián becomes a suspect in the disappearance of Belén; however, the investigators can find no evidence of Adrian's involvement in Belén's dissappearance. It is revealed that the house is owned by a German lady who shows Belén a secret room built to hide her husband just in case someone came to look for him because he was a former Nazi SS officer. The room is self contained and sealed off from sound. It is also shown that Belén, jealous of Adrián's relationship with one of his violinists, decided to pretend she is leaving him. She creates the video saying she is leaving as she hides in the secret room. The room has some one-way mirrors where she can observe Adrián's reactions. When she decides he has had enough she looks for the key and realizes she lost the key and is now trapped in the room with no way to contact Adrián. Fabiana finds the key to the secret room, but she doesn't know what it is used for. Fabiana eventually figures out that Belén is trapped in the house because Belén is able to communicate through tapping on the pipes in the secret room. As Fabiana is ready to open the door, she pauses and decides not to rescue Belén because she might lose Adrián. Fabiana struggles with her decision, but decides to open the door and check on Belén because she can't get a response from her. Also, one of the investigators gave Fabiana pictures of Adrián and the violinist and she herself feels the pangs of jealously. As Fabiana is checking on Belén laying in a bed in the secret room, Belén surprises Fabiana and knocks her out and leaves Fabiana locked in the room. Belén decides to leave the house. She leaves the key to the secret room on a bed for Adrián to find and leaves a picture of the two of them taped to the mirror that acts as the door to the secret room. The final scene shows Belén sitting on the beach alone.",
      "writers": [
         "Andrés Baiz",
         "Arturo Infante"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1772250/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzIzMDk2NTY2MF5BMl5BanBnXkFtZTcwMDczMjE2Nw@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Quim Gutiérrez, Martina García, María Soledad Rodríguez | See full cast and crew »"],
      "reviews": [
         "A Spanish orchestra conductor named Adrián (Quim Gutiérrez) receives a video message from his sweetheart Belén (Clara Lago), in which she breaks up with him , after that , she is suddenly disappeared . Then the orchestra conductor has to deal with the mysterious disappearance of his girlfriend and he is main suspect . Her sudden disappearance leaves Adrián dejected , confused but keen to move on, as he swiftly becomes romantically involved with barmaid Fabiana (Martina García). The pair fall madly in love as Fabiana moves in with her new lover. However her opening few days at her new residence are tainted by a paranoia that she is being haunted , following a string of mystifying incidents taking place in the bathroom and bedroom . Fabiana, begins to spend time in the house alone she starts hearing noises and experiencing odd events. Could Belén be reaching out from beyond the grave for vengeance? Or is there something even more sinister at play ? It does have mysterious happenings in a big , spooky house along with pain, suffering of one or two scorned women. This is an intriguing and suspenseful Colombian/Spanish co-production full of thrills , chills and twists and turns . ¨La Cara Oculta¨or ¨The Hidden Face¨ is a compelling tale of intersecting narratives, in a feature that could quite easily be released as two separate film . Despite being somewhat of a cinematic cliché, rarely has a feature been so aptly deserving of its description as a film of two halves . Acceptable performance by protagonist trio as Quim Gutierrez as wealthy , voguish orchestra conductor engaged to a Spanish girlfriend well acted by Clara Lago , whose sudden disappearance leaves Adrián stressed , saddened , leaving him the number one suspect in the eyes of the police , but he takes up with another woman shortly thereafter, , as he spontaneously becomes passionately involved with barmaid Fabiana finely played by the gorgeous Colombian actress Martina García . Furthermore , a special appearance of veteran and experienced actress Alexandra Stewart as a landlady . Thrilling and mysterious musical score by Federico Jusid . Glamorous and luxurious cinematography by Josep M. Civit . The motion picture was compellingly directed by Andrez Baiz in his second film , the first was ¨Satanas¨in which also worked Martina Garcia . Rating : Notable , above average , worthwhile watching .",
         "Ah, yes, perfect thriller for a rainy afternoon. Events begin in rather predictable, ordinary, mundane fashion: in the very first scene boyfriend receives a Dear John video from girlfriend, she disappears, her whereabouts is a mystery, boyfriend meets new girl, new girl's ex boyfriend - a cop - suspects foul play. What's going on here? At first, go ahead with the snack trips to the refrigerator -- you won't miss much. But, watch out! Have you ever watched a blurry, out of focus scene for some time, when suddenly the camera zooms in on a hitherto unnoticed object, the focus becomes razor sharp, and from that moment on everything is changed? Something like this happens here. Once it does, the remainder of the film remains locked on this brand spanking new story and nothing more. Things snap into focus that you hadn't even realized were out of focus. Through the use of unexpected, ironic, playful plot twists and flashback, we suddenly see everything in a new light. So much for trips to the refrigerator. The use of flashback is particularly fascinating: the viewer witnesses a rerun of the same events, but on second viewing they take on a completely new significance from a different point of view. This is clever stuff. Sure, it's a gimmick, but it works. I suspect Hitchcock would be impressed, and maybe even a little envious. My point: don't give up on this film, stick it out. If you enjoy thrillers, especially of the mind-variety as opposed to blood and guts, you will not be disappointed. I was literally on the edge of my chair shouting at the TV! We're not talking about a great classic film here, but it is pretty good guilty-pleasure that should keep you riveted through the end. I have one minor gripe, important to me but probably not to most people: Since classical music has always been a big part of my life, what drew me to the film initially was that the main character is an orchestra conductor. I was disappointed in the music. Familiar themes are bastardized all the time in commercials and other venues that are designed for the general public or for special effects. But this is a story about a conductor, who is working with a real orchestra (Bogotá, Columbia) that is actually playing the music, not \"lip synching\". Excerpts from a movement of a Beethoven symphony begin true enough, but very soon, alas, the music dissolves into corny clichés that I'm sure would send poor Ludwig spinning in his grave. Unfortunately this same pattern is repeated each time we see and hear the orchestra, with Rachmaninoff, Tchaikovsky, Brahms. Can they not let Beethoven be Beethoven, must he be improved upon? On the other hand, almost making up for this regrettable sin: in the credits, every single member of the Bogotá Orchestra is listed, instrument by instrument. I don't recall seeing this in a film before. Bravo. I'm sure the musicians are appreciative.",
         "A Spanish orchestra conductor (Quim Gutierrez) deals with the mysterious disappearance of his girlfriend (Clara Lago). I wish that IMDb had half stars, because I was torn between a 7 and an 8. I usually reserve the 8 for the top notch films, but this film was just so close to that mark I feel bad giving it a 7. Definitely one of the most suspenseful films in recent memory. The imagery is solid, the terror real and plausible. There is nothing in this film that could not happen in real life, and if you dread isolation, starvation or claustrophobia... this may bother you. It is a very strong film with no perfect characters -- the emotions here are also real and very mixed, just like real life. I was a little torn on the nudity and sexuality. At first, I felt it was a bit much. But as the film went on, I realized that the nudity was not there for an exploitative reason and actually plays an important role as the film goes on. (I cannot really explain further, but I will say it adds to the emotional trauma.) I am grateful to Fox World Cinema for picking this one up -- a real gem.",
         "I love watching films in general, but thrillers are my thing. I love the intense situations and the way my hands sweat while I'm watching it. But, I'm very sorry to say that I haven't watched a good thriller film in quite a while. But La Cara Oculta was a splendid dish of what I like. What would people do for love? How crazy can they become? How thin is the line between love and craziness? This is a film when the roles of good and bad change really quickly, and when you start making your own conclusions on the topic, suddenly something happens and you instantly change the course of your thoughts, seeing someone else as \"the bad guy\". I really, really loved this film! I think it's a great thriller and it sure kept me interested till the very end. Don't you dare miss it!",
         "When the film began, I was quite sure I was about to watch another conventional horror story, about a haunted house and all the rest...I could not imagine it would evolve to such an interesting plot. Indisputably, one of the most interesting thrillers I have watched, as it was so difficult to guess what would finally happen. Also, the film is so thrilling that it keeps you watching very carefully! Additionally, it makes your mind work and try to imagine who is finally responsible... Indeed, I recommend this movie without any hesitation and I give it 10 out of 10! I believe it is a top movie for the last 5 years at least- must watch!",
         "LA CARA OCULTA starts out mediocre, with dialogue that seems cranked out by a ten year old without much imagination -- \"Hi, how are you? Good and you? Good, thank you. Would you like something to drink? Yes...\" And so on. TV soaps have better dialogue. Quim Gutierrez' performance is at best lacking. He has two facial expressions that actually look very similar. And Martina Garcia reminds me of Jessica Alba in terms of her looks and her bare minimum acting skills. I thought the movie might be a bust until, half way through the film, Clara Lagos shows up and the movie becomes a heart-pounding thriller with top notch acting and a series of fascinating and very creepy twists. My advice: stay through the first so-so hour and you won't be able to turn it off. And yes, Quim Gutierrez should have rehearsed the role of an orchestra conductor better and... DO NOT WATCH THE TRAILER!",
         "A very good movie with minimal star cast and outstanding plot line. An orchestra conductor living a wealthy life with his beautiful girlfriend and abruptly her Girl Friend vanishes leaving him inexplicably, caused by his infidelity. The plot revolves around the hunt for his girlfriend. A very good thriller, described by the fantastic storytelling telling about the present and the past, acting is very good and plot twists are enthralling. Recommended to the suspense and mystery lovers. 7.5/10",
         "Don't see the trailer if you are just to see the movie because it will give you all the clues you need to to figure out what is going on! La Cara Oculta is a typical mystery Spanish movie,where you see what is going on in present time at the first half and on the second, the back and forth scenario takes place in order the mystery to be solved. It is not the best Spanish movie out there but it is the right one if you want to enjoy yourself for a night,alone in your house! The house in this movie is the leading role!so watch out! I don't wanna say any more 'cause I will ruin the story.So do not read reviews and do not see the trailer,just put it on your DVD and enjoy yourself!",
         "A lot of people are comparing this little gem to Hitchcock, but it reminds me of the Brian DePalma films of the 80s that were homages to Hitchcock. He has returned to that genre a couple times during the last twenty years, but with no success at all. This just really felt like the erotically charged DePalma films like \"Dressed to Kill\". Like the other reviewers, I agree the film started off slowly and it is by no means a classic, but really nice modern film noir and with some wonderful Colombian beauties. Strong cast and stylish direction raise this above the norm. I have been watching a lot of Spanish language thrillers of late. This would be a good double feature with \"The Body\". But I enjoyed this slightly more. I would like to see Mr. Baiz's other two full length features. Highly recommended.",
         "Andrés Baiz is a young, up and coming film writer and director from Colombia and his early works show a definite talent for unveiling mysterious stories in a very unique way. THE HIDDEN FACE (La Cara Occulta) can be mind-boggling until the second part of the film begins. As a story, written by Arturo Infante and Hatem Khraiche and adapted for the screen by Baiz and Khraiche. The story deals with a young and successful Spanish orchestral conductor Adrián (Quim Gutiérrez) who is offered the position as chief conductor of the Bogota Philharmonic Orchestra, an enviable assignment he accepts and his beautiful designer girlfriend Belén (Clara Lago) agrees to move with him. They are welcomed to Bogota, given a spacious mansion in which to live, and Adrián begins his assignment as conductor of the symphony. As luck would have it at a party of the supporters of the orchestra Adrián is noted by Belén to be flirting with one of the violinists. Belén shares her discovery with a friend who suggests that Belen leave a note for Adrián that she will not tolerate infidelity and that she is leaving him to teach him a lesson. Finding Belén gone and the taped note on his cellphone, Adrián goes to the local bar to get drunk and there meets cocktail waitress Fabiana (Martina García) who consoles him over his girlfriend's leaving him, and drives the drunken conductor home and spends the night. This leads to a passionate romance and Fabiana moves in, only to be gradually frightened by strange sounds that make her believe the house is haunted. Adrián continues his conducting and tries to placate Fabiana's fears until Fabiana begins to question whether Adrián had something to do with Belén's disappearance (one of the police who questions Adrián is an old boyfriend of Fabiana...). Now, Spoiler's Alert: if you watch the preview you already know this, but if you didn't watch the preview you may want to not read further! The second portion of the film can be summarized in the following way: In retrospect...Belén had decided she would leave Adrián a message that she's leaving, and instead move into a secret bunker originally built by the house landlord to see his reaction. The bunker is soundproof, bullet proof, and is hidden right next to the master bedroom and bath, with a secret entrance through one of the mirrors which one can see through from the inside, but is just a plain mirror when viewed from outside. After recording her message she moves all her belongings into the bunker to give the impression that she'd indeed moved away and shuts herself in. The only problem is it could be opened only through a key to get out, the key which she'd forgetfully left on top of the bed before locking herself in. She realizes her mistake only when she decides to end the act and come out to console Adrián who finds it hard to cope with her leaving. But one day Adrián meets and brings home waitress Fabiana, only to be watched helplessly by Belén from inside the bunker. The rest of the film is of her bearing witness to goings on in the bedroom while desperately trying to let herself out to freedom. The style with which Baiz tells his story is unique and his small cast carries it off very well. Quim Gutiérrez is a fine Spanish actor but needed considerably more training to pass as an orchestral conductor! Both of the lead actresses are not only beautiful to look at but are also very fine in their challenging roles. Otherwise the musical score is basically excerpts from Rachmaninov and Tchaikovsky with considerable filler thrown in. The film is just not sure how it wants to be read and if it is supposed to be a suspense thriller then the trailer and the previews should be discarded. Yet it is difficult to imagine that all audiences will not be entertained by this film as it is very well made and has many levels of meaning. Grady Harp, April 12"
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Avalon",
         "Cactus Flower",
         "Dynamo"
      ],
      "summaries": ["A Spanish orchestra conductor deals with the mysterious disappearance of his girlfriend."],
      "budget": 2600000
   },
   "movielensId": 93457,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2011-09-16",
      "dvdReleaseDate": null,
      "directors": ["Andrés Baiz"],
      "runtime": 92,
      "movieId": 93457,
      "title": "The Hidden Face",
      "mpaa": null,
      "actors": [
         "Quim Gutiérrez",
         "Martina García",
         "Clara Lago",
         "Alexandra Stewart",
         "María Soledad Rodríguez",
         "Marcela Mar",
         "Humberto Dorado",
         "Julio Pachón",
         "Juan Alfonso Baptista",
         "Marcela Benjumea",
         "Mozad"
      ],
      "imdbMovieId": "1772250",
      "originalTitle": "La cara oculta",
      "genres": [
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "FbdV5n-Ull0",
         "hWq_1Pj0QDM"
      ],
      "plotSummary": "A Spanish orchestra conductor deals with the mysterious disappearance of his girlfriend.",
      "tmdbMovieId": 80184,
      "avgRating": 3.8323,
      "releaseYear": "2011",
      "numRatings": 161,
      "posterPath": "/lDcEdMaNSrm03NFdTkaLLNDLIVp.jpg"
   }
}