{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt1274296",
      "video": false,
      "title": "Listen to Your Heart",
      "recommendations": [
         288129,
         27933,
         140814,
         212812,
         319080,
         308181,
         334670,
         24068,
         127061,
         342925,
         96534,
         300785,
         297621,
         19976,
         27152,
         289520,
         26423,
         229703,
         397242,
         239318
      ],
      "backdrop_path": "/n9wJSA6JLdPiOQ4ldRJ0oNy7rfW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ariana",
               "gender": 1,
               "credit_id": "52fe4762c3a36847f8132b8b",
               "name": "Alexia Rasmussen",
               "profile_path": "/onJX8J56Gtnt9BwniEGKcILk9G9.jpg",
               "id": 140369,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Victoria",
               "gender": 1,
               "credit_id": "52fe4762c3a36847f8132b93",
               "name": "Cybill Shepherd",
               "profile_path": "/nBm4ciBF2s3ynzxHMkcFpmiODgc.jpg",
               "id": 1036,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Grandma Sam",
               "gender": 1,
               "credit_id": "52fe4762c3a36847f8132b97",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tony",
               "gender": 2,
               "credit_id": "58a9bffe92514173ea00a499",
               "name": "Ernie Sabella",
               "profile_path": "/nwdAp8FacfZ1eRU7gNkOwWvDqnc.jpg",
               "id": 69415,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tyler",
               "gender": 2,
               "credit_id": "58a9c02b92514173f200999d",
               "name": "Matthew Albrecht",
               "profile_path": "/gOAdihAtnD1SpJb1SnQU4TCUDMe.jpg",
               "id": 562583,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4762c3a36847f8132b8f",
               "name": "Kent Moran",
               "profile_path": null,
               "id": 140370,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Roger",
               "gender": 0,
               "credit_id": "58a9bfe9c3a3680bed0095e0",
               "name": "Frank Watson",
               "profile_path": null,
               "id": 1761311,
               "order": 6
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.33336,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48373,
      "vote_count": 48,
      "budget": 0,
      "overview": "Danny Foster doesn't have much: an apartment as small as his paychecks, no family, and a struggling music career. Yet for him, \"every day is a great day to be alive,\" an attitude he gained from his mother's unwavering optimism during her losing battle with cancer. It's love at first sight when Danny meets Ariana, a wealthy girl from Greenwich, CT who tragically cannot hear the music she inspires him to write. Ariana, hearing impaired since childhood, is torn between hanging onto the shelter her controlling mother provides and fighting for a love that, if given the chance, might just change her life",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         339692,
         241
      ],
      "original_title": "Listen to Your Heart",
      "runtime": 102,
      "poster_path": "/1RobeVRCZQuWMntEKTkxi62Xkct.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "rebel one pictures",
            "id": 86758,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "wishing well pictures",
            "id": 86759,
            "origin_country": ""
         }
      ],
      "release_date": "2010-08-14",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "One song can change your life.",
      "adult": false,
      "homepage": "http://www.listentoyourheartfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matt Thompson"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Kent Moran"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1274296/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NjY4NjcxNl5BMl5BanBnXkFtZTgwNzI2OTc2NjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alexia Rasmussen, Kent Moran, Cybill Shepherd | See full cast and crew »"],
      "reviews": [
         "I rented this movie this past weekend and was a little skeptical about it. Here we go another love story..... Surprisingly, I found myself really enjoying the story and the characters. This was a movie that really makes you stop and think about life, love and the choices we make in our lives. It makes you stop and reevaluate the choices you are making and think about what really makes you happy instead of typically doing everything that you are supposed to do or doing everything that makes everyone else happy. The characters are very easy to like and relate to. Danny, the lead male character....well, you can't help but fall in love with. He is sweet, caring and let's face it...not hard to look at!! I think the actor did a great job portraying this character. He made me want to be a better person. I thought the actress who played Arianna did a great job as well. i am sure playing a deaf person has its challenges, but she did a fantastic job at it. The supporting cast was very good as well. Roger and Tony were very enjoyable and added some good laughs throughout. Overall, I would recommend this movie. It's a perfect date night movie or feel good movie to watch over the weekend!",
         "I was looking for movies to watch and somehow stumbled upon this movie and I am glad that I did!! What an excellent movie...I experienced all emotions when watching it. It made me feel like nothing is impossible, that you have to fight for what you want and believe in and don't let anyone or anything get in your way!! It is a movie that I will definitely watch again and highly recommend!! I hope he produces another movie as incredible as this one was!! I was very sad with some of the parts of the movie but the way the writer wrote it, you were able to feel happiness right after your tears. The actors did an excellent job as well, its really hard to say anymore without there being spoilers so I guess all I can say is watch the movie, grab a box of Kleenex and live each and every day to the fullest!!!",
         "I know this movie may be stereotypical or cliché'... But it's a movie isn't it? Movies can be a variety of things from fantasy to real life portrayal. And I feel sad for those who did not think fondly of this movie because it's not about what or how the movie is done but the message and moral it is trying to demonstrate. In regards to the deaf culture (someone else mentioned about ASL and the interpreter)... I am deaf, completely. The movie is not meant to share with the world about the deaf community, but rather the effort that the hearing world should try to understand. It's a matter of being objective than subjective to the world around us. With regards to the movie and sign language... Keep in mind that Sign Language changes almost constantly depending on the location. An example is the sign for \"restroom\" which could mean \"toilet\" in one area while it means another in another area. As for the interpreter - keep in mind that interpreters are meant to match the signing level of their clients, you don't want an advance interpreter signing for someone who just learned the language... It's like saying the word \"Educational Institution\" to a kindergarten rather than saying \"school\" ... you get the idea... If only you can understand the meaning of the movie and try to put yourself into their emotions and feelings... you'll enjoy the movie.",
         "I really wanted to like this movie - I rented it with high hopes while I was sick. The leads are appealing, and the plot seemed interesting to me. Unfortunately, the more I watched, the less I liked. My main issue is the clichés. They are everywhere, and they are huge. You've got your controlling mother with the evil smile who wants her daughter to date her social equal. You've got the snobbish, supposedly charming chosen boyfriend who is not at all what he seems; in fact he attempts to rape her at their very first meeting. There's the best friend, the source of a constant stream of advice, some good, some bad. There's the dead mother who provides strength and inspiration to her son. And the not-so-secretly drunk boss who has a kind heart but a failing business. Then there are your leads, Danny and Ariana/Sam. Danny has a heart of gold; he buys the newspaper every day from a street person but never reads it. He's saving up to buy recording equipment so he can record a demo, because all waiters in NYC are aspiring musicians. Sam is deaf, which in itself I don't consider a cliché, but her sheltered life because of it is. Danny and Sam meet, fall in love, and conduct an innocent yet clandestine relationship until Mommy Dearest finds out. Said mother then contrives to keep them apart while her own assistant sabotages those efforts. Somehow, Danny and Sam find their way back to each other, just in time for...SPOILER ALERT! ...Danny to be diagnosed with end-stage brain cancer. Great. I realize from reading this site that Kent Moran wrote this screenplay in tribute to his young cousin who did die of cancer, and I don't mean to take anything away from that, but that should have been a different movie. In this one, it felt like it was just thrown in near the end because he didn't feel like the movie could stand on its own without someone tragically dying young. The cancer angle makes this seem like two movies in one, and that's not necessarily a good thing. As if that wasn't enough clichés, Sam gets cochlear implants (another thing her mother tried to prevent in order to maintain control of her daughter) and the first thing of consequence she hears are wails of grief at Danny's bedside. And the music. Ay-yi-yi. The lyrics are what I might expect to hear from a seventh-grade poetry class. I'm sorry to say this movie was manipulative, trite, and predictable; the only thing I didn't predict was that it would be this disappointing. The acting is unfortunately sub par as well. I am not usually this harsh when discussing a movie because I feel bad for those responsible for bringing it to the screen. I know it would make ME feel awful to read a review ripping MY work to shreds. But I honestly can't summon much positive to say about this one. It had a few good moments, but they are few and far between. I realize that there are a lot of people who will love this movie, and that's fine. To each his own. This is just my opinion.",
         "What a wonderful story! Very touching story about true love and true friendship. The fact that the main characters are primarily unknown makes the story feel more real and you feel so connected to the characters. The music is also perfect! Very moving! He made the music for this movie and incorporated the songs into the story. My wife is deaf and I am hearing and this movie hits so many moments that I can relate to. This movie will always hold a special place for me. Don't want to give too much away. So watch this movie. It's a tear jerker. Actually watching it again right now which inspired me to write this review. Enjoy........",
         "I saw this movie just last night and I absolutely loved it. :) I was really surprised how taken back by it I was. Before I began to watch it, I saw it had a decent 6.8/10 rating on IMDb, and anything 6 or higher I'll watch. I really grew to love the characters. The relationship between Danny and Ariana is just beautiful. I'm a guy, so I'm not going to comment on the male lead actor's looks. Now the actress who plays the female lead, is so cute and beautiful and gorgeous, but not just that...throughout the movie, she just does such a beautiful job at connecting and developing her relationship with the male lead. I basically just loved how they were both really nice people, very sweet individuals, they weren't criminals or anything, it was such a sweet story. It's like a really smaller scale of The Notebook in my opinion, that's the quality of the film in my opinion. Not only did I grow to love their relationship with each other and how they treated each other, but I just really loved the actress and how she portrayed her character. She was so cute throughout the film that I cried a little. That's how much I enjoyed it. I would love to see her do more romance films, or even bigger films too, I see a lot of great potential for the both of them. :)",
         "In this movie Listen to your Heart, I really enjoyed it for the most part as far as the romance between Danny and Ariana. However, I really hated how the mother interfered with their relationship. That was downright heartless. Plus, I also could not believe she defended that so-called charming gentleman over her daughter. That heifer got mad at her when it wasn't her fault. What kind of mother is that? Victoria guess what? That charming gentleman isn't so charming. It's a good thing that Ariana kicked that bastard in the you know what. He better be glad that she didn't have pepper spray on her. Overall as far as the heartless bitch of a mother, I felt like someone needed to stick a harpoon in her ass. I was super glad when she got slapped in front of everybody. She deserved that big time. Plus, when Ariana and her interpretor took a stand, that was awesome. Victoria guess what? They are done with you. You treat people the way you want to be treated. She treated her interpretor and her daughter like complete trash. Good thing to stand up for what you believe in. No one should have to take this mess. Plus, Ariana hardly talked with her voice throughout the movie. I thought I would never hear her voice. Anyways, when she and Danny finally got a chance to see each other again, he ends up with brain cancer. It really sucked when he died from it later on. And that's when I felt worse for Ariana. When she got a chance to see Danny again, it was over just like that. Basically, that shows that everything happens so fast. I think that they needed more time. That experience reminded me of my grandmother. She died of ovarian cancer. Her death occurred 5 days after I turned 18. I remembered the fact that sometimes my mother and her mother didn't always get along and sometimes I wouldn't get along with my grandmother either, especially when I was little. And when me and my mother finally let her back in our lives, it was over. I already had a feeling that after she was rushed to the hospital she wasn't going to make it because she had difficulties breathing. Like I told my mother it hurt me a lot more than it hurt her. I love you grandma Georgia. Anyways, I love the scene when Ariana put a flower next to Danny's grave and so did her mother because I believe that the mother realized that she made a mistake and that she had been selfish with her. After she gave her daughter her necklace back and hugged her, I think it was a sign that she has her own life to live now. I cried for 2 days based on that scene since I had flashbacks regarding my grandmother. After she died, we moved on with our lives as well.",
         "The film makes you look to the life and the value and how you can live every moment in which,,,, and makes you try to restore your accounts in this life and thanks God everything and you enjoy the things denied to many, however they live their lives like you and they can be, enjoying it more you This movie really made ​​me look at my life,,, Do I really listened to my heart???? Do you enjoy every moment where ??????? And many, many of the questions that came in my mind .. There is actually a film could change your life and this film of this type Without that I feel and I'm watching a movie and have found tears filled my face, especially when in the hospital Sam said to Danny I love you,,,,, Without a doubt I think this film is the greater.",
         "As I watched this film it brings you closer to the characters and you go on a roller- coaster ride of emotions even as a man I cried,esp since my wife is going through cancer to so I can relate to some of the storyline.to the director actors and producer it was a very nice film.I esp liked the touch and affection that was showed toward Nicole who was deaf but how also how love can conquer all,if only people are linked together for the right reasons.another thing that touched me was the act of kindness shown to the guy on the street selling papers to make a living as that is what life is like in the real world I guess with the $500 he was given he bought himself a new suit.if only the girl had of got her man she over come obstacles for would it have been nice to see. But I guess that was not the object of the film overall as said previously a good watchful film.",
         "Listen to your heart is now one of my all-time favorite movies. I have never written one of these reviews before, but this one seems to demand it. I appreciate movies that are more than they appear on the surface and deeper than the acting or action. This movie doesn't seem that unusual until you work through the last 30 minutes and begin to realize what the true message is. Remarkable. This is a movie you must WATCH, not just let it play on as you are doing something else. The amazing acting, the wonderful story that at first seems so predictable, and the underlying progression of thought work together to create a very special experience. If you truly \"get it\", this movie will change how YOU live your life."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Wishing Well Pictures",
         "Rebel One Pictures",
         "Oasis Motion Pictures"
      ],
      "summaries": [
         "Danny (Kent Moran) has an apartment as small as his paychecks, no family, and a struggling music career. But with unwaivering optimism, for Danny, \"every day is a great day to be alive.\" It's love at first sight when Danny meets Ariana (Alexia Rasmussen), a wealthy hearing-impaired girl from Greenwich, CT who tragically cannot hear the music she inspires him to write. Ariana is torn between hanging onto the shelter her controlling mother (Cybill Shepherd) provides and fighting for a love that, if just given the chance, might just change her life. When tragedy strikes, determined that nothing can keep them apart, they must trust in the power of their love, and together discover just how important it is to \"listen to your heart.\"",
         "A singer/songwriter falls in love with a girl who can't hear the music she inspires him to write."
      ],
      "budget": 0
   },
   "movielensId": 93467,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-08-14",
      "dvdReleaseDate": "2011-03-29",
      "directors": [""],
      "runtime": 102,
      "movieId": 93467,
      "title": "Listen to Your Heart",
      "mpaa": "",
      "actors": [
         "Alexia Rasmussen",
         "Cybill Shepherd",
         "Shirley Knight",
         "Ernie Sabella",
         "Matthew Albrecht",
         "Kent Moran",
         "Frank Watson"
      ],
      "imdbMovieId": "1274296",
      "originalTitle": "Listen to Your Heart",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Danny Foster doesn't have much: an apartment as small as his paychecks, no family, and a struggling music career. Yet for him, \"every day is a great day to be alive,\" an attitude he gained from his mother's unwavering optimism during her losing battle with cancer. It's love at first sight when Danny meets Ariana, a wealthy girl from Greenwich, CT who tragically cannot hear the music she inspires him to write. Ariana, hearing impaired since childhood, is torn between hanging onto the shelter her controlling mother provides and fighting for a love that, if given the chance, might just change her life",
      "tmdbMovieId": 48373,
      "avgRating": 3.41667,
      "releaseYear": "2010",
      "numRatings": 24,
      "posterPath": "/1RobeVRCZQuWMntEKTkxi62Xkct.jpg"
   }
}