{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1366409",
      "video": false,
      "title": "Miral",
      "recommendations": [
         291405,
         68174,
         84312,
         212756,
         265347,
         302104,
         190950,
         97609,
         82520,
         181756,
         91930,
         39806,
         339079,
         298031,
         241071,
         285844,
         8749,
         241432,
         272602,
         355890
      ],
      "backdrop_path": "/pjUiwLJeTnKBEBZxNtOdYYo8UX9.jpg",
      "revenue": 852336,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Miral",
               "gender": 1,
               "credit_id": "52fe46cac3a36847f8112559",
               "name": "Freida Pinto",
               "profile_path": "/hz12Lob7MclGLzMIX5rTUFhmDCW.jpg",
               "id": 76792,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Hidi Husseini",
               "gender": 1,
               "credit_id": "52fe46cac3a36847f811255d",
               "name": "Hiam Abbass",
               "profile_path": "/rWjvzkNGt9Itt9B8MxAcNEXeaOY.jpg",
               "id": 765,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe46cac3a36847f8112561",
               "name": "Willem Dafoe",
               "profile_path": "/xM5lhOR5tWWdIlFpBDeZJx9opIP.jpg",
               "id": 5293,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Bertha Spafford",
               "gender": 1,
               "credit_id": "52fe46cac3a36847f8112565",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Interrogating Officer",
               "gender": 2,
               "credit_id": "5a79df0bc3a368227b02b541",
               "name": "Uri Gavriel",
               "profile_path": "/dfQQUOj5kbboElu6676OXLqAeju.jpg",
               "id": 145313,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cac3a36847f8112555",
               "name": "Julian Schnabel",
               "profile_path": "/uTAq7otu6P5ogsJqWAKCzcNTIn9.jpg",
               "id": 7482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe46cac3a36847f811256b",
               "name": "Rula Jebreal",
               "profile_path": "/pkl0qddMmC8g3IJc7LCXVRi2o10.jpg",
               "id": 133258,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.222875,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IL",
            "name": "Israel"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "IN",
            "name": "India"
         }
      ],
      "id": 45595,
      "vote_count": 17,
      "budget": 0,
      "overview": "A drama centered on an orphaned Palestinian girl growing up in the wake of the first Arab-Israeli war who finds herself drawn into the conflict.",
      "similar": [],
      "original_title": "Miral",
      "runtime": 112,
      "poster_path": "/tzqXPGbqwvQYibkJVt6bOP1bRzD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Eran Riklis Productions Ltd.",
            "id": 2167,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pathe",
            "id": 7396,
            "origin_country": ""
         }
      ],
      "release_date": "2010-10-01",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Is this the face of a terrorist?",
      "adult": false,
      "homepage": "http://www.miralmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julian Schnabel"],
      "runtime": 112,
      "synopsis": "Jerusalem, 1948. On her way to work, Hind Husseini comes across 55 orphaned children in the street. She takes them home to give them food and shelter. Within six months, 55 have grown to almost 2000, and the Dar Al-Tifel Institute is born. At the age of 7, Miral is sent to the Institute by her father following her mother's death. Brought up safely inside the Institute's walls, she is naïve to the troubles that surround her. Then, at the age of 17, she is assigned to teach at a refugee camp where she is awakened to the reality of her people's struggle. When she falls for political activist, Hani, she finds herself torn between the fight for the future of her people and Mama Hind's belief that education is the road to peace.",
      "writers": [
         "Rula Jebreal",
         "Rula Jebreal"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1366409/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODE3MTE4MDI5NF5BMl5BanBnXkFtZTcwODM0ODU2NA@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Freida Pinto, Hiam Abbass, Willem Dafoe | See full cast and crew »"],
      "reviews": [
         "I was amazed at how non-political this movie was. There was a great deal of controversy around it, so I was expecting a polemic. It was nothing of the kind. It portrays the childhood and adolescence of a Palestinian girl, along with stories of her mother and her school headmistress. These stories illustrate, to some degree, the Palestinian history from 1947 to 1993. But the focus is on the women's stories. I think this is a movie that will be appreciated far more by women than by men. It is poignant and respectful. Most women will find something with which to identify in this film. The cinematography is beautiful and the lead actors are compelling in their roles. The movie has been criticized as disjointed, but that's because real life does not have a formulaic dramatic arc. And sadly, there is no \"conclusion\" to the movie because the conflict is ongoing.",
         "Run, don't walk, to see this movie. If you miss it while it is in the theaters, put it in your Netflix queue. My wife and I see a lot of movies, independent and mainstream and this is one of the best. Yesterday we saw a mainstream movie, Hanna, which was a major disappointment, except for the excellent acting of Saoirse Ronan. I gave it a 5 because the story was so terrible and I didn't have any emotional involvement concerning what happened to Hanna. We generally don't go to two movies, two days in a row, but I was so disappointed in Hanna and have been interested in possibly seeing Miral since I heard Rula Jebreal on NPR's Tell Me More. She wrote the novel and the screenplay the movie was based on. I was surprised that she received such a chilly reception on the show, so I remembered to check out the movie online. On METACRITIC, which contains reviews by major critics, there were 17 reviews; 3 positive, 12 mixed and 2 negative. Overall it was given a 45 out of 100 which means generally mixed reviews and near the low end of that scale. Keep in mind that Hanna got a 64 which means generally favorable reviews. I read a number of the critic's reviews of Miral as I often do before seeing a movie I also read all of the six reviews available at that time on IMDb. There were only five usable as one was written by a person who, in my opinion, had an agenda and, based on his review, had not seen the movie. Having consulted METACRITIC and IMDb, I was convinced that my wife and I might like this movie, but would probably not rate it above a 6 or 7 out of ten after we saw it. I always keep in mind that there are movies with overwhelming favorable reviews that I have hated, including The Diving Bell and The Butterfly which had the same director, Julian Schnabel, as this movie. Lost in Translation is also in that category. My wife and I came to this movie without prejudice for one side or the other. We were just looking for a well made movie that would entertain us. We were so pleasantly surprised. The acting was excellent, the story involving, and we were quite tense in the last third of the movie. Unlike Hanna, we really cared what happen to Miral. I agree with Spencergo, this movie should be seen by a wider audience, but I know it won't. The reason that this review is so important to me is most people will skip this movie because of the mixed reviews, and they shouldn't. Unfortunately, many independent films, like Rabbit Hole last year, get missed. I sincerely hope you give this movie a try if you can find it at your local independent theater.",
         "First I must say that before seeing this film I had not read the book it was based on so I have to assume that the film follows the book. As the writer of the book also participated in the scripting of the film, one would think that this film is a collaboration between the author of the book and the director Julian Schnabel. This being said, I have tried to review this film without prejudice. When the film ended my first thoughts were that this film would cause a stir as it is directed by a Jew and yet the subject matter of the film shows the Jewish State of Israel in a negative light. My concerns were not as much for the film itself, as it is a well made film, but for the attitude that the Jewish population would have towards the film. In my own experience, as someone who has been directly involved with distribution of film, whenever there is a group that has a negative response the distribution can go one of two ways; the first being limited distribution as some will not support showing the film in their theaters, and the second being a tremendous response to good cinema where theaters will take the risk and book the film at a national level. \"Miral\" a film that should have widespread distribution, because of what the Jewish population will do in response to the anti Israel theme, this film will be reduced to Art House distribution. \"Miral\" deals with a Palestinian community in turmoil due to change. That change was the effect that the new Statehood of Israel caused. As with any new regimes change is mandatory and an often misunderstood process and the story of \"Miral\" reflects that process. The film boasts a well woven story, competent acting, and a visceral message. This is a relevant film and well worth seeing. It is multiple-layered and a multiple-leveled film. It would be a shame if the Jewish Community misreads the intention of the film. Films like this do not come around often and avoiding it out of ignorance would be a mistake. .",
         "This is a film by Julian Schnabel who directed the diving bell and the butterfly and for anyone who's saw that,you know how good it is so i had big expectations.It has small parts from Vanessa Redgrave(a Palestinian freedom activist in reality),William Dafoe(his roster of films that he's involved in is incredible,big respect for him)and then the only other face you'll know is Alexander Siddig as Miral's father if you ever watched star trek voyager.Hiam Abbass who plays Hind Hussaini i recognize from a great Israeli film i saw called lemon tree about the conflict as well. The film is based on a true story from a autobiographical book by Rula Jubreal and centered around the Palestine/Israel conflict between 1948 when Israel is created,the six day war period in 1967 and then the agreement between Israel and PLO in 1994. A big part of the story is focused on the girls school for Palestinian orphans(which still exists today)which was opened by Hind Hussain in the 40s after taking in orphaned kids after a bombing raid by Israeli's,and it is where Miral(played by Frieda Pinto),the main focus of the story ends up after a troubled childhood that leads her father to bring her there.It then takes us through into her teens when she starts to have indecisive thoughts on whether to take to violent route or peaceful route after being introduced to this by a PLO fighter and falling in love with him.She then gets introduced to Israelis when she moves in with her auntie who's son is going out with a Israeli and begins to realize that they are not all out to wipe out Palestinians. Throughout this film you are given good insight into both sides of the coin and what the director has achieved,for me,is a very balanced view and does not try to make it all roses in his method of showing cross community (the scene where her cousin introduces his Israeli girlfriend to his mother is not comfortable,likewise when Miral is introduced to the Israeli girls father).It's a very mature take on the conflict and gets the message across that dialog and a two state solution is the only answer at this time.Tie in with this,great camera-work,great settings,informative historical snapshots from the past,great acting all round and expertly crafted filming that show harrowing scenes but still keeping it a 12a,you have a really important film. This is great to see from a US director and i hope it reaches a big audience(a lot of it is in English)for as much coverage this conflict gets,it's often biased in one manner or another.Another great achievement for Julian Schnabel.",
         "A drama centered on an orphaned Palestinian girl (Freida Pinto) growing up in the wake of Arab-Israeli war who finds herself drawn into the conflict. You might wonder: Freida Pinto is Indian, so why was she cast as Palestinian? -- Some critics took exception to this, or the idea that she is too beautiful to play an ordinary girl. Are ordinary girls not allowed to be beautiful? And while her Indian heritage may seem out of place, I think this should be overlooked in light of the fact she is a tremendous actress and sold the character well. What is so great about this film is that the politics are not the issue. The life of a young girl is. This is a film that shows the humanity of the Palestinians -- the DVD cover asks if Miral has the \"face of a terrorist\". After seeing the film, you have to say no. While the story covers a wide swath of history, from 1947 to the 1993 Oslo agreement, the politics are not the problem. Schnabel tells me many of the critics were negative, and I do see some complaints that the editing was choppy, or the bizarre remark that Schnabel does not know how to direct women. Presumably many critics took exception to the positive portrayal of the Palestinians and the negative portrayal of the Israelis. In fact, though, this is how one might view the film if looking for a certain angle. The Israelis are presented negatively, yes, but not inaccurately. But the Palestinians are not really presented positively -- just as human beings. There is still a father telling her daughter not to get mixed up with the PLO, and one scene has a stepfather raping his wife's daughter. That can hardly be seen as being positive (though the real point here is that people should be judged as individuals, not as members of a group). The cast is all excellent, with plenty of Arab flavor. We have Willem Dafoe (a native of my city, Appleton) and Vanessa Redgrave for the \"white\" aspect. And then Alexander Siddig, probably best known as Bashir from \"Star Trek\", somewhere in-between (Siddig was born in Sudan, but was educated in London). The film is PG-13, making it less raw but more accessible to audiences. This may have toned down the realism a bit, but it in no way compromised the emotional outreach that was a steady undercurrent. Geoffrey Macnab calls the film \"courageous and groundbreaking\", while Mike Goodridge calls it \"sincere and thought-provoking\". Both are correct. The more unusual comment comes from Claudia Puig, who says, \"Schnabel puts his unmistakable dreamlike stamp on the film.\" Now, Schnabel is first and foremost a painter, so his goal is art. But to call this film \"dreamlike\" just seems off. This struck me as pure realism all the way. But who am I to judge? Anyway, great film, and one that will be sure to spark discussion regardless of which side (if any) you stand on in the ongoing Middle East debate.",
         "It is refreshing to visit the Israeli/Palestinian conflict form a vantage too seldom shared in cinema. Director Julian Schnabel once again proves that he understands human responses in the face of political conflict. Rula Jebreal has adapted her own novel which in turn is a biography of her involvement in the history of the Palestinian conflict. It is a touching recounting of the events that took place form 1947 to the present and it leaves the window open for much conversation. The film opens with a party held by Bertha Spafford (Vanessa Redgrave) in 1947 when she asks her guest to forget the conflict outside for a celebration of Christmas: the party is attended by both her Jewish and Arabic friends, the centerpiece being the Christmas tree brought yearly by the Husseini family and then replanted to restore the earth. Hind Husseini (Hiam Abbass) is there and meets Eddie (Willem Dafoe), an American friend of Bertha. A year latter in 1948 there is an Arab-Israeli War, the Deir Yassin Massacre, and the establishment of the state of Israel. The wealthy Hind Husseini encounters 55 starving children, victims of the war, and take s them home to establish what will become the Dar Al-Tifel Institute, a school for Arab orphans that within months grew to a population of 2000. The film then jumps forward and we meet Nadia (Yasmine Al Massri), an abused alcoholic who is imprisoned and there meets devout Muslim Jamal (Alexander Siddig) who later becomes her husband: Nadia, unable to change her life, drowns herself when their child is only 7 years old. It is now 1978 and Jamal brings his daughter Miral (Yolanda El Karam) to the keeping of Hind, reassuring her that he will see her on weekends. Time passes to 1988 and the older Miral (Freida Pinto) is victim to the intifada (uprising), is sent to a refugee camp where she falls in love with the PLO leader Hani (Omar Metwally) and commits to the Palestinian movement to secure a land of peace called Palestine that will be free of the Israeli governance and jurisdiction. Hind encourages Miral to follow her heart and convictions: it is the development of change represented by Hind, Nada, and Miral that personalizes this compelling epic. Though the conflict between Palestine and Israel continues to this day, this film allows us to appreciate the Palestinian response to the loss of their land and home by a international ruling to create the state of Israel. Cinematographer Eric Gautier mixes the hot sun washed Palestine footage of the real intifada and the result is mesmerizing. The real star of this film is Hiam Abbass who as the gradually aging Hind Husseini brings the story to life. The large cast is excellent with special kudos to Alexander Siddig, Omar Metwally, and Freida Pinto: the presence of Vanessa Redgrave and Willem Dafoe add credibility tot he proceedings but their roles are minimal. Julian Schnabel is to be congratulated for bringing to light the 'other side' of the Arab/Israeli conflict. He gives us excellent food for thought. Grady Harp",
         "Director Julian Schnabel tackles yet another biographical tale after his Diving Bell and the Butterfly, with a focus shifted to the Middle East conflict, but unlike the typical Hollywood production ranging from all out action like The Kingdom to heavier dramatic fare like Syriana, this film, an Indian-Italian-French-Israeli co-production stops short at passing judgement, opting to tread the middle ground in portraying as objective a viewpoint as possible, and does so through the eyes of the titular character Miral (Freida Pinto) being caught up in the scheme of her environment. Curiously, this film is based on the novel by Rula Jebreal, a Palestinian journalist, whose book is an almost biographical account of her growing up and formative years, where she got brought up in an orphanage in Jerusalem established by Hind Husseini (Hiam Abbass), whose notable exploits after the 1948 Arab-Israeli War include rescuing orphaned survivors from the Deir Yassin massacre and turning her home into an orphanage. So in essence we get to observe the story of two women caught up in extraordinary circumstances spanning a vast timeline right up to the establishment of the state of Israel and right through to various peace accords that are still trying to bear fruit, and one The narrative is split into two halves, with the first centered on the tale of Hind Husseini, her sacrifice and achieving of her objective, before having the narrative shift toward that of Miral, clearly the poster girl since Freida Pinto's shot to fame in Danny Boyle's Slumdog Millionaire might mean a lot more people giving this film a chance. Brought to Husseini's orphanage to be raised, we see the teenager getting awakened to the state of affairs of the land claimed by opposing sides, and getting caught between a rock and a hard place, where Husseini's counsel gets weighed against that of the brush of romance with the militant Hani (Omar Metwally), but of course don't come to expect flitting romantic scenes as the more powerful and thought provoking ones far outweigh affairs of the heart. While the film offered two stories of two independently strong women, somehow it is the lack of a primary central figure that did it in, where it's most unfortunate to have the story quite scattered in its ambitious timeline in trying to condense an extremely complex political situation, no doubt adopting a micro view through the two different perspectives and principles in its leading characters. It sought to contrast viewpoints of those who deem education is the key out of their current plight, against those who wish to stand up and be counted, violence notwithstanding as a means to achieve an end. Perhaps I was anticipating more, but with an ending quite abrupt, it leaves more questions than those answered and addressed, and perhaps so because it's still an open environment with no clear solutions in sight. Like how the characters have seen milestones set in their lifetime, I wonder if we in ours can eventually see something significantly charted out. The end title was a chilling reminder that it will take quite a while.",
         "Political films based on actual events are usually angry sentiments and have a strong point to make. This biographical drama is no different. Based on Rula Jebreal's novel, the emotionally charged production gives us an insight on the political unrest and instability happening on the other side of the world. Regard it educational if you will, this Julian Schnabel directed film will leave you wondering what it takes to live a life surrounded by the horrors of war. The film chronicles Hind Husseini's effort to build an orphanage in Jerusalem after the 1948 Arab Israeli War. This began with her crossing paths with 55 orphaned children while on her way to work one day. She took them home and before she knew it, she had almost 2000 orphans under her care. The Dar Al-Tifel Institute was born, and thousands of orphaned children came under Husseini's care. Some 30 years later, Miral, a motherless child was sent to the orphanage by her father. Upon turning 17, she is sent to a refugee camp where she experiences the tension between Israel and Palestine, and the possible destructions it can bring to her own life. Director Schnabel is known for his award winning works The Diving Bell and the Butterfly (2007) and Before Night Falls (2000), and it comes as no surprise that the New York born filmmaker's latest project deals with such politically charged themes, despite the foreign lands the story takes place in. Through gritty cinematography (read: shaky camera work) and choppy editing (read: abrupt cuts and transitions), Schnabel shows us a world which we have only read about but never had the chance to experience. Sure, there may be no beautifully decorated sets with perfectly synchronized action sequences, but this is the slices of reality which the locals have to live with day after day. It is also clear that the film presents a Palestinian perspective of things, and may appear one sided to viewers who are expecting this to be objective. Do note, however, that this is based on a memoir by Jebreal, and it is only natural that the war is seen through her eyes. Amidst the violence and assaults, there is tenderness and compassion in the 112 minute film as Schnabel tells a story of remarkably strong women surviving in times of turmoil. Their intertwined tales may be unevenly told, but you'd feel a sense of passion and zeal as they go through life fighting for their beliefs and causes. Playing the central character Husseini is Hiam Abbass (The Visitor, Munich), a Palestinian actress who injects the much needed fervour into her character. Frieda Pinto (Slumdog Millionaire) plays the titular character, and viewers get to see how a girl who is initially brought up safely inside the orphanage's walls gradually grows into a young woman who is awakened by the reality around her and has to fight for her convictions. Appearing in supporting roles are familiar faces like Willem Dafoe (Daybreakers) and Vanessa Redgrave (Letters to Juliet) in the first few minutes of the film. The film ends without any closure or resolution, which reflects the harsh realities happening on the other side of the planet we live in. And that, in our opinion, is the best way to leave us reflecting on the unnecessary pain and tragedies brought about by war. - www.moviexclusive.com",
         "I did not know what the movie was about so when it started my first reaction was: \"Oh no! not another movie on Jewish suffering!\" I was pleasantly surprised to discover that this time the movie was about the Palestinian plight. Kudos to that I say, nevertheless I found the story confusing. I am a fan of Julian Schnabel's work as director, but I expected more after The Bell-jar and the Butterfly which in my book was a masterpiece. Miral (not an apt title for the subject matter) takes its time before getting to the main story and protagonist, telling first the tale of 3 other women: Her mother Nadia; Fatima the terrorist; and Hind the school master and surrogate mother to all orphans. Miral's arrival on the scene is almost an afterthought, hinted at by Nadia's vomit attack upon arriving in jail -if she is sickened by fear or by baby is not clear until much later on. I wished the director let the people speak in Arabic and add subtitles -which were used only in the beginning- it would have made for a less Anglo-centric flavored film and the written text would have allowed the audience to catch important dialog that was otherwise drowned by the soundtrack. What Fatima says to the man who later becomes Nadia's husband, for example, would have explained later events. Same for what was exchanged between Miral and the Intifada member at the funeral, important words muffled in music. Because of this and the confusing ways of past and present scenes mixing without a clear way to distinguish between them, the storyline of the movie was unclear, and so was its perception similar to walking in the dark, intuiting the outline of things but not getting the full picture. All actors were good but Hiam Abass who played Hind stood out. Freida Pinto does not look authentic, I read she is of Indian heritage, but her beauty made the distressing story more bearable, if distracting. Aside from this, it was refreshing to see a movie on this subject matter, produced and directed by major names in the movie industry. To see the Israeli seen as \"bad guys\" was almost shocking, what with the Jewish propaganda we get out of Hollywood all the time. The world needs to see Palestinian heroes, if nothing else to balance the way Arabs in general are portrayed in the movies. A movie worth seeing if NOT the ultimate picture on the subject.",
         "On a recent visit to New York about two weeks ago, I happened upon the opportunity to watch the movie \"Miral\", followed by a Q&A session with director Julian Schnabel (\"Diving Bell and the Butterfly\", one of my top 10 movies of the last decade), and with the writer of the screenplay and the memoir upon which the movie was based, Israeli Palestinian Rula Jebreal. Jebreal's book is also named \"Miral\"; the movie and the book are the story of her youthful experiences growing up a Palestinian in Jerusalem, as well as stories about her mother and about a remarkable woman--named Hind Hussein--who started an orphanage and school there in the aftermath of the chaos around the creation of the Israeli state in 1947. Rula Jebreal was \"Miral\", a character named after a flower that grows by the side of the road in that region, and she grew up in the orphanage, attending the school, after the suicide of her mother (I believe it was the early '70's). Filmed in a variety of great locations in Israel and the West Bank, the movie shows the misery and strife of military occupation from the point of view of Palestinians. Rula/Miral has the status of being an Israeli citizen, as her ancestors never left, and finds her identity as a Palestinian as a teenager. Miss Hind, the towering figure of the orphanage/school for some 40 years from the time she founded it, provides hope for the young girls there and does her best to protect them from the dangers of the intifada (uprising). At the story's end, she arranges for Miral to go to Italy to attend university, then dies, a local hero. Rula's experiences include an infatuation with a young intifada leader who first supports the Al Fatah (PLO) position, then runs afoul of them and is killed as an accused traitor; she is taken by the Israeli authorities, interrogated, then blindfolded, bound, and beaten; her Israeli citizenship saved her from more prolonged imprisonment. Still, her experiences are not nearly as harsh as those the film recounts of her mother, who was abused and degraded, falsely imprisoned by the Israelis, and afterwards could not live with herself. Miral's \"father\" (the parentage was shown not to be biological) is one of the few positive male characters, a complicated character who was a devout Muslim, loyal to Miral's mother despite her infidelity, and a loving father, yet one who gives up custody of his daughter to the orphanage. Beyond the range of the movie's story, Rula Jebreal became a journalist in Italy (as she said, \"the first 'black' TV presenter there\"). She spoke passionately at the Q&A session of her desire to raise awareness in the world of the plight of the Palestinians, though affirming her love of the area and acknowledging that she loves Israel as well. One thing she does not accept, and of which her life is testimony, is the Zionist notion that Israel is a Jewish state; though she came to have Jewish friends and appreciate their culture (some of which is shown in the movie), she wants a unitary state for all who live there. The film is deeply affecting, though perhaps not as much as Schnabel's \"Diving Bell\". Frieda Pinto, the (South Asian) female lead of the smash hit 2008 movie \"Slumdog Millionaire\", is a bit of a controversial choice for the difficult role of Miral, but I will say that she brings to it something like the beauty which I witnessed that evening from Rula herself. Her father was played by an actor, Alexander Siddig, who seemed very familiar but I could not place: turns out he was a regular, Dr. Bashir, on \"Star Trek: Deep Space Nine\" (not a great recommendation, I know, but his performance here was sympathetic and dignified). The other two key roles, both very challenging to portray, were those of Hind Hussein and of Miral's mother Nadia, played by Palestinian actresses, Hiam Abbass and Yasmine El Masri, respectively. Willem Dafoe and Vanessa Redgrave both lent their presence to the movie, though their roles are relatively small and peripheral to the story. Schnabel spoke of the difficulty in getting official permissions to film in many locations, but also of the cooperation and passionate support for his effort that he sometimes found, and of the beauty of the region. He is known primarily as a painter, and is the son of prominent Jewish leaders, but has taken a courageous, independent political stance with this effort. He has run into some resistance from the Hollywood community, not too surprising considering the subject matter; he didn't need their help to make the film, but he will need it (and will not get it) to get broad enough distribution for him and Rula to accomplish their aim of raising political awareness. They may have to settle for the satisfaction of telling a compelling story beautifully, as both their political aims and commercial success will no doubt lie beyond their capability."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Pathé",
         "Eran Riklis Productions",
         "Eagle Pictures"
      ],
      "summaries": ["A drama centered on an orphaned Palestinian girl growing up in the wake of Arab-Israeli war who finds herself drawn into the conflict."],
      "budget": 0
   },
   "movielensId": 93481,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-10-01",
      "dvdReleaseDate": null,
      "directors": ["Julian Schnabel"],
      "runtime": 112,
      "movieId": 93481,
      "title": "Miral",
      "mpaa": "R",
      "actors": [
         "Freida Pinto",
         "Hiam Abbass",
         "Willem Dafoe",
         "Vanessa Redgrave",
         "Uri Gavriel"
      ],
      "imdbMovieId": "1366409",
      "originalTitle": "Miral",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A drama centered on an orphaned Palestinian girl growing up in the wake of the first Arab-Israeli war who finds herself drawn into the conflict.",
      "tmdbMovieId": 45595,
      "avgRating": 3.10714,
      "releaseYear": "2010",
      "numRatings": 14,
      "posterPath": "/tzqXPGbqwvQYibkJVt6bOP1bRzD.jpg"
   }
}