{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0098023",
      "video": false,
      "title": "Ollie Hopnoodle's Haven of Bliss",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Young Ralphie",
               "gender": 2,
               "credit_id": "52fe48efc3a368484e112a43",
               "name": "Jerry O'Connell",
               "profile_path": "/hkEBKk79L0ptmxGTng0v6X7Lzws.jpg",
               "id": 3035,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "The Old Man",
               "gender": 0,
               "credit_id": "538662830e0a26144a002160",
               "name": "James Sikking",
               "profile_path": "/iNUO38duu0gW91PIOQk3ffxaqXz.jpg",
               "id": 65568,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mom",
               "gender": 0,
               "credit_id": "52fe48efc3a368484e112a4b",
               "name": "Dorothy Lyman",
               "profile_path": "/n0j5eqvgOK93mZstoRRlnOzY4Hg.jpg",
               "id": 19488,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Narrator/Mr. Scott",
               "gender": 2,
               "credit_id": "52fe48efc3a368484e112a4f",
               "name": "Jean Shepherd",
               "profile_path": null,
               "id": 12699,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48efc3a368484e112a55",
               "name": "Dick Bartlett",
               "profile_path": null,
               "id": 318309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a3930c60e0a264cc11f8aeb",
               "name": "Jean Shepherd",
               "profile_path": null,
               "id": 12699,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 1.085003,
      "production_countries": [],
      "id": 75132,
      "vote_count": 1,
      "budget": 0,
      "overview": "From Jean Shepherd (A Christmas Story) comes the story of 14 year old Ralphie's first job, and the family vacation the family is planning to a rustic fishing cabin on Lake Michigan. Originally made for the Disney Channel, this film is a delightful family comedy.",
      "similar": [],
      "original_title": "Ollie Hopnoodle's Haven of Bliss",
      "runtime": 89,
      "poster_path": "/7jbwUWrlQLdzbsWSLyEytICghPc.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1988-08-05",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Dick Bartlett"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Jean Shepherd"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098023/",
      "coverLink": null,
      "actors": ["Stars: Jean Shepherd, James Sikking, Dorothy Lyman | See full cast and crew »"],
      "reviews": [
         "My family and I have been watching this movie at least once every summer since 1988 (we taped it). It's one of those movies you can watch a thousand times, have every line memorized, and still laugh at all the same jokes. One thing I noticed about this one is that they switched the characters of Schwartz and Flick. In \"A Christmas Story\", Schwartz is the cool, cocky one and Flick is the pathetic loser. In this installment, Flick is the cool one and Schwartz is the loser. Is this intended? Oh well, no matter what it's a great movie. The people who play the parents are excellent. Especially James Sikking, he is absolutely hilarious. I want to see this on DVD sometime soon. Everyone should see this movie. Family Channel should run it again.",
         "OK, if you loved \"A Christmas Story\"....then there's no way you won't LOVE this movie!!! It's Ralphie as a teenager! The family takes a summer vacation and it is HILARIOUS!!!!!! We even get to see Flick and Schwartz again! Will Flick stick his tongue to the flag pole again?? HMMM...could be!!! You'll have to watch it to find out! I think what makes this movie SO funny is how realistic it is...exaggerated a tad, of course. The trip they take is exactly how all my family vacations went as a kid. If you watch \"A Christmas Story\" every Christmas, then you need to start watching \"Ollie Hopnoodle's Haven of Bliss\" every 4th of July!",
         "This is a great movie. I am surprised, given how popular the Christmas Story is, that they have not released this to DVD as a sequel. I wish I could get a copy to show my kids, but have never been able to find it. Many favorite lines that we can relate to, e.g. when the family kinds a junky gift shop, \"somehow, things that you would never buy at home, when you are on vacation, they make sense!\" The movie has the same slow-paced, Garrison-Keillor-type wry humor that the Christmas Story has. It has the same nostalgic sense that times of blue-collar kitsch were silly, but also there was something noble about the attempt of the working man to create beauty.",
         "Believe it or not, I actually saw this movie before I saw \"A Christmas Story\"! This was the movie that made me fall in love with Jean Sheperd, Ralphie and all of his lovable family and friends ...including, \"Fuzzhead, Fuzzhead, Fuzzhead!\" The cast has changed, but it doesn't seem to matter, as I always think of it as being the same. The characters are captured beautifully as established in the original film by Darrin McGavin, etal. The film is wonderfully nostalgic as it follows Ralphie's family on their annual family vacation. Lots of good, clean, family fun and humor. It is unfortunate that it has never been released on video as this is a family favorite and an absolute must see!",
         "The late Jean Shepherd who wrote \"In God We Trust, All Others Pay Cash\", which \"A Christmas Story\" was based on wrote and narrated this funny little movie based on his short story of the same name. It deals with the same family from \"A Christmas Story\" though with different actors and their family vacation when Ralph(ie) is 14 and all the crazy things that happen before and during their long drive to their favorite vacation spot. If you like \"A Christmas Story\" you'll probably like this movie too. It's quite funny in a low key sort of way.",
         "This, I believe, is a superb installment of the Jean Sheppard Christmas Story trilogy. Jerry O'Connell does a, though very different from the \"A Christmas Story\", wonderful job in his portrayal of Ralphie. I believe it offers many humorous parts (ie. the mother's voice, \"We're not buying any junk today!\", etc.) There may be some slow parts, but if you pay attention to dialogue and such there really aren't any excessively dull moments. The Randy character, though not as major a character as in \"Christmas\", takes the scenes he is in he makes absolutely and annoyingly funny. The unique stylized format and period obvious clothes put you directly into the movie. My family and I enjoy this movie very much and I think if you took the time to sit and watch the movie you will, too.",
         "Continuing adventures of Ralphie and family from \"A Christmas Story\" and \"A Summer Story\"...aka \"It Runs in the Family.\" Jean Shepard is back as narrator and writer but as in all films, an original cast (they do such a good job capturing the spirit of the actors in \"A Christmas Story\" that you won't notice the cast change). Great nostalgic fun from the Walt Disney Channel. Note: Though this film was made second, it actually falls third according to the period of the film.",
         "Ollie Hopnoodle's Haven of Bliss is one of two sequels to 'A Christmas Story,' a timeless holiday cult classic. Jerry O'Connel plays a slightly older, much different looking Ralphie Parker and his failed attempt to rush into \"manhood,\" by getting himself a respectable job which might jeopardize his attendance at the annual family vacation to Ollie Hopnoodle's Haven of Bliss, which is basically a campground. Ralphie, and his loyal friends, Schwartz and Flick, don't exactly go for the ideal job, moving heavy furniture around for a crummy boss that takes pride in yelling at his eager, idealistic new employees. The even less interesting subplot involves Ralphie's parents, who go looking for their family dog. The story is not nearly as exciting as the first movie, probably because Ralphie Parker, fourteen-years old in this movie, has moved beyond the crisp imagination that he possessed as a grade school student in the first movie, which produced a film mostly from his childish perspective, and one that many could enjoy. Ralphie Parker in this story is just too old to entertain things from that childish, but imaginative perspective. If they wanted to entertain children, they should've used a younger character. Someone might've recognized this, as the sequel that follows it is about a second-grade Ralphie Parker in \"My Summer Story.\" The movie is not very interesting and is hardly funny. It is, as one viewer previously wrote, like something so real it's not even entertaining. And that's the problem with this movie. There is nothing in the story particularly catching, and the characters themselves are not as likeable as those of \"A Christmas Story.\" Especially, Randy Parker, who is exceptionally whiny in this movie. Of the two sequels, \"My Summer Story\" was much better, though neither could ever be better than the first. \"A Christmas Story\" is a great classic.",
         "I kind of like the beginning, but after 20 minutes or so, I could barely tolerate it. It is so normal, every day. It is like watching your next door neighbor's life. There is no adventure, no excitement and little humor, however, for the sake of originality, I must say that it is a couple points above average."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "American Playhouse",
         "WGBH"
      ],
      "summaries": ["It's summertime in Hohman, Indiana, and 14-year-old Ralph Parker can't wait to get his first job. His friends Schwartz and Flick are less enthusiastic, and the job turns into a nightmare presided over by the story's author, Jean Shepherd, in hilariously unconvincing movie makeup. Ralph's dad hardly can wait for the family's upcoming fishing vacation in Michigan at the movie title's resort but will have to drive their old car through a sea of troubles to get there. Fuzzhead the dog runs away and joins a wealthy family, to the consternation of Mom, who patiently handles über-whiner little-brother Randy and buys a whirligig as consolation."],
      "budget": 0
   },
   "movielensId": 93950,
   "movielens": {
      "languages": [""],
      "releaseDate": "1988-08-05",
      "dvdReleaseDate": "1988-01-01",
      "directors": ["Dick Bartlett"],
      "runtime": 89,
      "movieId": 93950,
      "title": "Ollie Hopnoodle's Haven of Bliss",
      "mpaa": "",
      "actors": [
         "Jerry O'Connell",
         "James Sikking",
         "Dorothy Lyman",
         "Jean Shepherd"
      ],
      "imdbMovieId": "0098023",
      "originalTitle": "Ollie Hopnoodle's Haven of Bliss",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "From Jean Shepherd (A Christmas Story) comes the story of 14 year old Ralphie's first job, and the family vacation the family is planning to a rustic fishing cabin on Lake Michigan. Originally made for the Disney Channel, this film is a delightful family comedy.",
      "tmdbMovieId": 75132,
      "avgRating": 3.625,
      "releaseYear": "1988",
      "numRatings": 4,
      "posterPath": "/7jbwUWrlQLdzbsWSLyEytICghPc.jpg"
   }
}