{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "globalization",
            "id": 593
         },
         {
            "name": "family history",
            "id": 3371
         },
         {
            "name": "global economy",
            "id": 6123
         },
         {
            "name": "indonesia",
            "id": 7348
         }
      ],
      "imdb_id": "tt1742178",
      "video": false,
      "title": "Position Among the Stars",
      "recommendations": [],
      "backdrop_path": "/ryA87gl7AyF8qOKI1Ow8IZiBWsA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f819639f",
               "name": "Leonard Retel Helmrich",
               "profile_path": "/ka5b3qKunXKHijGHFqEvWPxUSWa.jpg",
               "id": 227647,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963a5",
               "name": "Hetty Naaijkens–Retel Helmrich",
               "profile_path": null,
               "id": 227648,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963ab",
               "name": "Ismail Fahmi Lubis",
               "profile_path": null,
               "id": 227649,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963b1",
               "name": "Leonard Retel Helmrich",
               "profile_path": "/ka5b3qKunXKHijGHFqEvWPxUSWa.jpg",
               "id": 227647,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963b7",
               "name": "Jasper Naaijkens",
               "profile_path": null,
               "id": 227651,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963bd",
               "name": "Jos Driessen",
               "profile_path": null,
               "id": 227654,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963c3",
               "name": "Paul van Leeuwen",
               "profile_path": null,
               "id": 227655,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963c9",
               "name": "Danang Faturahman",
               "profile_path": null,
               "id": 227656,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe495dc3a36847f81963cf",
               "name": "Fahmy Al-Attas",
               "profile_path": null,
               "id": 227657,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "574428f692514157e9001b3d",
               "name": "Ranko Paukovic",
               "profile_path": null,
               "id": 569911,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.125165,
      "production_countries": [
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "ID",
            "name": "Indonesia"
         }
      ],
      "id": 58287,
      "vote_count": 3,
      "budget": 0,
      "overview": "Through the eyes of grandmother Rumidjah, a poor old Christian woman living in the slums of Jakarta, we see the economical changing society of Indonesia and the influence of globalization reflected in the life of her juvenile granddaughter Tari and her sons Bakti and Dwi.",
      "similar": [
         44639,
         38167,
         818,
         6637,
         18487,
         668,
         927,
         231,
         22074,
         334524,
         59861,
         31869,
         50839,
         303858,
         22816,
         13020,
         11541,
         123678,
         332749,
         198287
      ],
      "original_title": "Stand van de sterren",
      "runtime": 109,
      "poster_path": "/aP2sc3fw6wyJub7cdkc91J82JiQ.jpg",
      "spoken_languages": [{
         "name": "Bahasa indonesia",
         "iso_639_1": "id"
      }],
      "production_companies": [],
      "release_date": "2011-03-03",
      "vote_average": 9,
      "belongs_to_collection": null,
      "tagline": "One family, three generations, facing globalisation in Indonesia",
      "adult": false,
      "homepage": "http://www.positionamongthestars.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leonard Retel Helmrich"],
      "runtime": 115,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Indonesian",
      "imdbLink": "http://www.imdb.com/title/tt1742178/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0NzkxNjY2Ml5BMl5BanBnXkFtZTcwOTc5MTYzNA@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "I'm not going to debate whether or not this is a \"documentary.\" Because there must obviously be some scripting, in some ways it probably more closely resembles (shudder) so-called reality TV. But I don't mean to denigrate it in any way by that observation. Essentially, this film is the third in a trilogy that follows a three-generation family over the course of many years, documenting their little and big squabbles and the events that unfold in their lives. Without getting too much into the plot, this third film's focus seems to be on Tari, the granddaughter who is graduating from high school. It's true that some of the characters aren't 100% likable, but really, who is always likable? Having watched all three films, I found it interesting how most of the characters didn't change at all - the exception being Tari. van de Sterren has the eye of a photographer coupled with the soul of a storyteller. There's definitely a very composed look to each shot and often it is very breathtaking and vivid. He also seamlessly weaves together related stories/vignettes with beautiful visual transitions so that the whole film feels like a coherent whole despite there not really being a traditional plot. I really loved how there would often be a visual comparison between the human behavior & then cut to a similar insect or animal behaviors. I found this to be not only very tongue-in-cheek but also a nice way to provide a very subtle commentary without talking down to the audience. His humor provided a nice contrast to some of the grim, depressing realities of life in Indonesia. I lived in Jakarta many years ago and the film is very true-to-life. In fact, it brought back not only memories, but the cadence, smells and ethos of the country. Impressive.",
         "The camera work was superlative. It felt like a genuine and intimate portrayal of life in Jakarta. Although it really made me question the line between being a mere fly-on-the-wall observer (and thus providing a more authentic picture), and being an active participant. Most (perhaps all) the scenes involved incredibly tragic abuse and ignorance, including abusive psychological pressure to obey a religion (either the grandmother's Christianity, or the father's Islam), a hell-like hair-raising male circumcision scene, physical assault against an innocent girl for being too close to a boy (I'm not sure how the camera-man didn't intervene), rampant political corruption, and general disregard for education (they prefer watching fighting fish on TV, rather than learning to use a gas stove or other more prudent studies). But such lifestyles are still the norm throughout the world, not just in Indonesia, so the film serves as important documentary evidence of the present state of our species.",
         "\"Stand van de Sterren\" means \"Position of the Stars\" not \"Position among the Stars\". I would not call this a documentary. I mean the scenes are obviously set up and acted. For example: A boy takes some shirts and runs through the alleyways followed by the camera. But as he turns into a street, the camera rises up above the rooftops to follow him running into the distance. Maybe my own expectations that a documentary should portray true events is too narrow, I don't know. I found the selfishness displayed by some of the characters depressing. The inability of others to recognize this behavior for what it was could only be explained by stupidity. This is not my idea of entertainment but, of course, this is a documentary. I read that this film has won the IDA-Humanitas Award so it must be a good representation of life in the slums of Jakarta. Or maybe it was the final touching scene, which makes you think about what is really important, that earned the prize."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": [
         "CoBo Fonds",
         "Harvard University",
         "Humanist Broadcasting Foundation"
      ],
      "summaries": ["Position among the Stars, the final part of a trilogy, follows the award- winning documentaries Eye of the Day and Shape of the Moon (Joris Ivens Award IDFA 2004 - World Cinema Documentary Grand Jury Prize Sundance 2005). Through the eyes of grandmother Rumidjah, a poor old Christian woman living in the slums of Jakarta, we see the economical changing society of Indonesia and the influence of globalization reflected in the life of her juvenile granddaughter Tari and her sons Bakti and Dwi. Director and DOP Leonard Retel Helmrich follows this family in a unique way with his breathtaking Single Shot Cinema-technique. Without interviews and voice-overs, Leonard will bring you closer to Indonesia than you will ever get."],
      "budget": 0
   },
   "movielensId": 94076,
   "movielens": {
      "languages": ["Bahasa indonesia"],
      "releaseDate": "2011-03-03",
      "dvdReleaseDate": null,
      "directors": ["Leonard Retel Helmrich"],
      "runtime": 109,
      "movieId": 94076,
      "title": "Position Among the Stars",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "1742178",
      "originalTitle": "Stand van de sterren",
      "genres": [
         "Documentary",
         "History"
      ],
      "youtubeTrailerIds": [
         "mIuPiIJOTs8",
         "bMQ__wVW3vw",
         "ml5ZU93g1FE"
      ],
      "plotSummary": "Through the eyes of grandmother Rumidjah, a poor old Christian woman living in the slums of Jakarta, we see the economical changing society of Indonesia and the influence of globalization reflected in the life of her juvenile granddaughter Tari and her sons Bakti and Dwi.",
      "tmdbMovieId": 58287,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/aP2sc3fw6wyJub7cdkc91J82JiQ.jpg"
   }
}