{
   "imdb": {
      "country": "Finland",
      "color": "Color",
      "budgetCurrency": "FIM ",
      "directors": ["Mikko Niskanen"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Lempi Linna",
         "Mikko Niskanen"
      ],
      "originalLanguage": "Finnish",
      "imdbLink": "http://www.imdb.com/title/tt0121817/",
      "coverLink": null,
      "actors": ["Stars: Mikko Niskanen, Erkki Ruokokoski, Aapo Vilhunen | See full cast and crew »"],
      "reviews": ["Mikko Niskanen's ambitious study of the notorious 1931-32 events in Nivala, Ostrobothnia, is quickly derailed by its too heavy side-taking. As expected, Niskanen is on the side of the poor common farmers who are oppressed by the banks, the police and other authorities just because they like to be nasty. The characters of the oppressors are far too caricatured, and those of the oppressed too saintly. Of course, Niskanen himself plays the most saintly of them all. Niskanen, a native of Central Finland, did not know Ostrobothnia very well and it shows. The dialect is mostly absent, and occasional attempts to remind us of Ostrobothnian pride come off as theater. The visual look of the place and period is carefully crafted, and location shooting saves a lot, but looking right does not help if the film sounds wrong - notably the musical score, which apart from the Christian hymns is far too modern. The political aspects of the story are curiously muted. There are several references to the Speaker of the Parliament who does nothing to help the farmers, but his name is never mentioned, neither is the crucial fact that he himself was a farmer from Nivala - Kyösti Kallio, who later became President of Finland. When the former rebels set up a new political party, it is not mentioned that they got 30 to 50 % support in the region and two MPs. Also, it barely hinted at that their votes primarily came from former supporters of Kallio's Agrarian League. I get the feeling that to ensure the local support for the project Niskanen had to submit his script to the supervision of local Center Party (continuation of the Agrarian League) politicians. Like several films by Niskanen, this one deserves credit for tackling a daring theme completely ignored by other Finnish film-makers, but the execution is much too flawed."],
      "genres": ["Drama"],
      "productionCompanies": ["Käpy-Filmi"],
      "summaries": [],
      "budget": 1030000
   },
   "movielensId": 94080,
   "movielens": {
      "languages": ["Finnish"],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": ["Mikko Niskanen"],
      "runtime": 0,
      "movieId": 94080,
      "title": "Horse Rebellion, The (Pulakapina) (1977)",
      "mpaa": null,
      "actors": [
         "Mikko Niskanen",
         " Erkki Ruokokoski",
         " Aapo Vilhunen",
         " Eeva-Maija Haukinen",
         " Jaakko Häkkilä",
         " Göran Schauman"
      ],
      "imdbMovieId": "0121817",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 3.5,
      "releaseYear": "",
      "numRatings": 1,
      "posterPath": null
   }
}