{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0913413",
      "video": false,
      "title": "The Marc Pease Experience",
      "recommendations": [
         55336,
         273610,
         57289,
         109466,
         61107,
         76297,
         34601,
         61418,
         25451,
         347064,
         128124,
         23726,
         219674,
         306307,
         35908,
         14963,
         12183,
         48464,
         13903,
         31281
      ],
      "backdrop_path": "/roiOwNw4dKKUIkiVcI1GjnkHTSJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jon Gribble",
               "gender": 2,
               "credit_id": "52fe44bac3a368484e0339db",
               "name": "Ben Stiller",
               "profile_path": "/o9M2PyoF7QDSMq1OwW0D892fIkV.jpg",
               "id": 7399,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Meg Brickman",
               "gender": 1,
               "credit_id": "52fe44bac3a368484e0339df",
               "name": "Anna Kendrick",
               "profile_path": "/sylfU9EOLAF6R7BdOXGqyA4jYKv.jpg",
               "id": 84223,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marc Pease",
               "gender": 2,
               "credit_id": "52fe44bac3a368484e0339e3",
               "name": "Jason Schwartzman",
               "profile_path": "/3WDQYEqcqZDp5mOhDN8XSo0NVUK.jpg",
               "id": 17881,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Gerry",
               "gender": 2,
               "credit_id": "52fe44bac3a368484e0339f3",
               "name": "Jay Paulson",
               "profile_path": "/z3g4eWlY0EQG3IFn729lIHPjBQf.jpg",
               "id": 88597,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "55872533c3a36827350060c5",
               "name": "Cullen Moss",
               "profile_path": "/zjVvER4Bg4mz38u2JQfLgypYrSP.jpg",
               "id": 1215021,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bac3a368484e0339d7",
               "name": "Todd Louiso",
               "profile_path": "/e4PTxmKUB0qGBusuNjqMvhjGELK.jpg",
               "id": 3230,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bac3a368484e0339e9",
               "name": "Jacob Koskoff",
               "profile_path": null,
               "id": 967276,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bac3a368484e0339ef",
               "name": "Todd Louiso",
               "profile_path": "/e4PTxmKUB0qGBusuNjqMvhjGELK.jpg",
               "id": 3230,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.306979,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25154,
      "vote_count": 18,
      "budget": 0,
      "overview": "Former high school musical star, Marc Pease, finds himself still living in the past, eight years after graduating.",
      "similar": [],
      "original_title": "The Marc Pease Experience",
      "runtime": 84,
      "poster_path": "/vYd4DjVsVXlSTVjlWh9PTyxRkJS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/tcW3UqV46Mdq6GyaS1ydEDocEDF.png",
         "name": "Paramount Vantage",
         "id": 838,
         "origin_country": "US"
      }],
      "release_date": "2009-08-21",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "Hold your applause.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Todd Louiso"],
      "runtime": 84,
      "synopsis": "This comedy tells the story of Marc Pease, a grown man living life vicariously through recollections of youthful glory. Ten years out of high school, he's a man still living in the past, when he starred in his high school's musicals. Over the course of one day, events come to a head. While watching from the sidelines as his former teacher/mentor Mr. Gribble oversees the opening night of another show, Pease has an epiphany. Through a cathartic, hilarious process, he finally exorcises his demons and realizes there's more to life than the roar of the greasepaint and smell of the crowd that is Broadway. Over the course of the film, a young high school senior girl becomes romantically involved with both of the men. This only serves to complicate matters.",
      "writers": [
         "Jacob Koskoff",
         "Todd Louiso"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0913413/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NzA0MzE1OV5BMl5BanBnXkFtZTcwNzg2OTI4Mg@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Schwartzman, Ben Stiller, Anna Kendrick | See full cast and crew »"],
      "reviews": [
         "You might be expecting a brainless romp to divert your mind for a few hours. And based on some of the IMDb reviews, you might be expecting a particularly bad one. However, there's a lot going on in this film which may not be obvious at first, and if you key in on it I think you'll have a great time. This is not a standard plot-based comedy. The plot is pretty basic: a 26-year-old high school has-been (Schwartzman) wants to redeem himself for his colossal bomb in a school musical 8 years earlier. So what's the big deal? The big deal is that the character is a lot more complex than your standard brainless-romp protagonist. He's a hopeless dork with a somewhat annoying Pollyanna way of bouncing back from tragedy--not to mention the most preposterous Dutch boy haircut you've ever seen--and for that you might think he's unconvincing as a human being. But actually he is a great embodiment of the stage motto \"the show must go on\". If you remind yourself of this, not only is he believable but he's really entertaining to watch. Late in the film we learn things about him that add tremendous depth and humanity to his character, and even though he's a hopeless dork he ultimately becomes one of the most memorable & endearing dorks I've ever seen. I was never a fan of Schwartzman before this, but I'll be checking out his other films for sure. On the other end of the balance is his musical director (Stiller) who is the opposite of a dork: a total douchebag. Yet they share a common quality that you will learn at the end of the movie, and you see that the two of them are two sides of the same coin. Once it all comes into focus, you realize how clever this story is. Stiller is great, by the way. He's one of the most convincing douchebags I've ever seen. In addition, those of you who are familiar with the Broadway show \"The Wiz\" will get a kick out of how the music goes along with the story. Or even if you've never seen \"The Wiz\", you can follow along with the backstory of The Wizard of Oz. Schwartzman basically plays a naïve Tin Man type of character while Stiller is an overbearing yet impotent Wizard. I thought that was a very nice artistic touch to weave the stories together like that. As for laughs, though this isn't a madcap comedy like \"Police Academy 19\" there were some really good zingers that I had to rewind & play again because they were so unexpected (like Meg's poetic reading LOL). But overall, I thought this was far more than a brainless comedy. Even the goofy scene of a bunch of grown men bitch-kicking each other (LOL again) carried some great drama as well as a poignant, thematic message. This is the sort of movie I foresee having a respectable cult following in 10 or 20 years, so get in early on the fun.",
         "As a fan of Jason Schwartzman, I check his profile from time to time. Reading the brief synopses of his upcoming films. On reading this one for The Marc Pease Experience, I was quite excited to see it. But I needn't of, for it was quite a disappointment. The overall tone of the film stunk of second hand rip offs of, funnily enough other Jason Schwartzman films. His high school obsessed character rings true of Max Fischer in Rushmore and even Ben Stillers character comes off as the Herman Blume type. Someone who encourages Schwartzman's character before turning into his rival, not in the same entire quantity but with subtle similarities. With it's often offbeat approach to supporting characters and subplots, it rings off a bit like I Heart Huckabees. Again with subtle similarities in its attempted quirky style. But with these similarities the film falters, it lacks it's own coherent style. It has a Hollywood plot and structure in its three acts. And it's more predictable then it is funny. Schwartzman tries his best and it pays off in the smallest of bits in the film, but Ben Stiller is entirely wasted. The film was not appalling, but it was certainly not very good.",
         "To balance the comment from Dec 10, I watched the film on its own merits. I must say I found 'The Marc Pease Experience' enjoyable. Jason Schwartzman did well in portraying the boy-man stuck in fear and in life, but who finally finds voice and his way. I liked Ben Stiller's schlocky affectations as the 'virtuoso' high school music director. Jason Schwartzman did fine with his role. The characters were slightly formulaic, perhaps, but the acting worked and you were pulled into the plot and movie. Predictable is not always a bad thing. The film was light-hearted but still had some human dilemmas you could emphasize with. All in all this was a pleasant and heartwarming film.",
         "Please, I implore you don't rent or buy this movie. I am upset that there isn't a committee to screen movies like this. It was so so so boring and NEVER went anywhere, no jokes, no smirks, no love, I'm amazed this movie even got produced. I love Ben Stiller, Zoolander is one of the best shows of all time but this show is a HUGE WASTE of time. This show may have been made in an attempt to please a specific audience. My guess is those who enjoy shows like \"High School Musical\", of which I am not a big fan, but I can still respect because of the talents that it exploits. This show, The Marc Pease Experience, however lacked any redeeming factors that High School Musical had or any other movie ever made...ever."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Paramount Vantage",
         "Groundswell Productions",
         "Firefly Pictures"
      ],
      "summaries": ["Former high school musical star, Marc Pease, finds himself still living in the past, eight years after graduating."],
      "budget": 0
   },
   "movielensId": 94301,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-08-21",
      "dvdReleaseDate": null,
      "directors": ["Todd Louiso"],
      "runtime": 84,
      "movieId": 94301,
      "title": "The Marc Pease Experience",
      "mpaa": "PG-13",
      "actors": [
         "Ben Stiller",
         "Anna Kendrick",
         "Jason Schwartzman",
         "Jay Paulson",
         "Cullen Moss"
      ],
      "imdbMovieId": "0913413",
      "originalTitle": "The Marc Pease Experience",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["EH5sZezYhs0"],
      "plotSummary": "Former high school musical star, Marc Pease, finds himself still living in the past, eight years after graduating.",
      "tmdbMovieId": 25154,
      "avgRating": 2.61538,
      "releaseYear": "2009",
      "numRatings": 13,
      "posterPath": "/vYd4DjVsVXlSTVjlWh9PTyxRkJS.jpg"
   }
}