{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1303829",
      "video": false,
      "title": "Diverted",
      "recommendations": [],
      "backdrop_path": "/nZZcTfVylUBhoRBP5xE1Kvcix8o.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mike Stiven",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f527",
               "name": "Shawn Ashmore",
               "profile_path": "/n4XaAblagtaawSVArpGZ4BzrmKt.jpg",
               "id": 11023,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Samuel Stearn",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f52b",
               "name": "David Suchet",
               "profile_path": "/4X4TT8Uf8mAmRIYgYh4EeR4mWva.jpg",
               "id": 20277,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marion Price",
               "gender": 1,
               "credit_id": "52fe4752c3a36847f812f52f",
               "name": "Joanne Whalley",
               "profile_path": "/fvufjTvUcY6ctqryO5sks0XDav2.jpg",
               "id": 12656,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Andrew Tyler",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f533",
               "name": "Colin Buchanan",
               "profile_path": "/5KlB7vgYF2mTC4fxHhFVGnpQzLy.jpg",
               "id": 139808,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Alia Ramaswami",
               "gender": 0,
               "credit_id": "52fe4752c3a36847f812f537",
               "name": "Anita Majumdar",
               "profile_path": null,
               "id": 139809,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Eileen Northbrook",
               "gender": 1,
               "credit_id": "52fe4752c3a36847f812f53b",
               "name": "Liisa Repo-Martell",
               "profile_path": "/lwjWInRTj9ZkDuMziQNywhbOKzw.jpg",
               "id": 5481,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jamal Hassani",
               "gender": 0,
               "credit_id": "52fe4752c3a36847f812f53f",
               "name": "Anousha Alamian",
               "profile_path": null,
               "id": 139810,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Nadine",
               "gender": 1,
               "credit_id": "52fe4752c3a36847f812f543",
               "name": "Karen LeBlanc",
               "profile_path": "/qVGrWhv2E1Guw4XhSeWiIEwFHxi.jpg",
               "id": 77440,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Captain Montgomery Crawford",
               "gender": 0,
               "credit_id": "52fe4753c3a36847f812f547",
               "name": "Mark Caven",
               "profile_path": null,
               "id": 139811,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "First Officer Paul Denman",
               "gender": 2,
               "credit_id": "52fe4753c3a36847f812f54b",
               "name": "David Christo",
               "profile_path": "/kuHWqHDiYMDozZ9guP6IcGzmDLV.jpg",
               "id": 139812,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Stewardess",
               "gender": 1,
               "credit_id": "52fe4753c3a36847f812f54f",
               "name": "Amy Rutherford",
               "profile_path": "/4V7bywmyvzlVuEkAYE48dreXIFh.jpg",
               "id": 139813,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Major Reg Bowers",
               "gender": 0,
               "credit_id": "52fe4753c3a36847f812f553",
               "name": "Rick Boland",
               "profile_path": null,
               "id": 139814,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Nick",
               "gender": 0,
               "credit_id": "52fe4753c3a36847f812f557",
               "name": "Phil Churchill",
               "profile_path": null,
               "id": 139816,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Dori",
               "gender": 0,
               "credit_id": "52fe4753c3a36847f812f55b",
               "name": "Susan Kent",
               "profile_path": null,
               "id": 139817,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Joe Vernon",
               "gender": 0,
               "credit_id": "52fe4753c3a36847f812f56b",
               "name": "Greg Malone",
               "profile_path": "/pejEeGuZZFLNHBsRjHKac7IPk0U.jpg",
               "id": 1278477,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4753c3a36847f812f561",
               "name": "Alex Chapple",
               "profile_path": "/gWrigSyBqdYQoZ3LnYgRL4qWDrE.jpg",
               "id": 164266,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4753c3a36847f812f567",
               "name": "Tony Marchant",
               "profile_path": null,
               "id": 166268,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.098448,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 48008,
      "vote_count": 1,
      "budget": 0,
      "overview": "On September 11th, 2001, 38 planes headed to New York City were diverted to Gander, Newfoundland, Canada. A town of 9,000 took in 7,000 passengers for 4 days until American airspace reopened.",
      "similar": [],
      "original_title": "Diverted",
      "runtime": 89,
      "poster_path": "/nwhQuOSIxPM5luWH0fHglA8tPDF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pope Productions",
            "id": 2974,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shaftesbury Films",
            "id": 6252,
            "origin_country": ""
         }
      ],
      "release_date": "2009-03-08",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alex Chapple"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Tony Marchant"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1303829/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxMzI2NTM5Ml5BMl5BanBnXkFtZTcwNTUyMTE0Mg@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Shawn Ashmore, David Suchet, Joanne Whalley | See full cast and crew »"],
      "reviews": [
         "So what took so long? Right after 9/11, I said the story of Canada accepting hundreds of diverted flights would make a great movie. Finally after eight years, it's happened. This is well done, not \"great\", but well done. A couple of plausible love stories are effectively worked in. The film seems true to the facts and it captures the wonderful realities of Newfoundland right down to some great \"down east\" music, the awesome scenery, the legendary hospitality of \"Newfies\" and even the touristy rite of \"kissin' the cod.\" I hope this film gets some offshore exposure. It was a tragic time but also one in which Canada played a proud role.",
         "I don't believe this movie deserves the criticism several others have posted. I think they did a great job telling the basic story and the low-budget several have complained about makes no difference to me because the tale was told well and the movie looked great in High Definition. The credits say it was shot in St. John's Newfoundland, Hamilton, Ontario and London, England. All the locations were beautifully photographed. I think what came through most clearly was the kindness and generosity of the population of Gander, Newfoundland. That such a thing could still happen in this modern world will come as a shock to most people, but clearly the people of Newfoundland couldn't imagine it happening any other way. I'm glad this story was told and I appreciate the mention of the book by another poster. I do recall that the government of the United States was generally ungrateful and that's a shame. However, the people of Gander didn't do what they did to get gratitude. Their charity is appreciated and was fantastic. That came through in the movie. They probably did even more kind deeds and you couldn't make a movie long enough to include them all. The negative comments I'm reading here about the movie are just too petty to take seriously. It was a good movie and kept my attention completely. Worth watching for sure.",
         "Having lived virtually my entire life in the big city of Toronto, I then had the chance to live for three years in the mid 90's in a small outport in Central Newfoundland, about a 2 hour drive west of Gander. Everything I had heard about Newfoundlanders I found to be true. They were welcoming, hospitable, friendly, funny - a truly unique and wonderful culture. That Gander was able to rise to the challenge of feeding and housing almost 7,000 stranded airline passengers whose flights had been diverted to the city after the closure of US airspace on that terrible day of September 11, 2001 was no surprise to me. This movie attempts to tell that story by offering a fictionalized account focusing largely on the experiences of the people of a particular flight who found themselves in Gander on that day. For the most part, I enjoyed the movie. It had a real \"Newfoundland feel\" to it, some spectacular scenery shots and tried valiantly (and successfully to a large extent) to portray both the bewilderment and sometimes anger of the passengers who found themselves trapped in this insanity, as well as the struggle of the city and its officials to come to terms with the role they had been given. The performances weren't great, but they were decent enough, and it was nice to see a Canadian- made movie that was unapologetically Canadian. The movie did have two major flaws, though. First was the decision to introduce two potential romances to the mix (one between passengers, and one between a passenger and a resident.) Frankly, that just didn't fit. I can't think of a better way to put it. The other mistake was to focus so heavily on the passengers, when the real story was the absolute logistical miracle as this small city came together to meet a herculean challenge. There was little sense of what the city was up against, and of how incredible their efforts were. The people of Gander came across here as nice, but not valiant. That was a real weakness. If you're truly interested in what happened on and after 9/11 in Gander, you really should read the book \"The Day The World Came To Town.\" Author Jim DeFede did a brilliant job of weaving the passengers' stories into those of the folks of Gander, and gave a real feel for the effort that went into pulling this off. As to the movie? As entertainment it was OK, but not great. I was never tempted to change the channel. As to history? It could have been a lot better. The people of Gander deserved a better tribute. Still, I'd give it a 6/10",
         "A well done and well deserved film, celebrating our fine Newfoundlanders. David Suchet portrays the role of Samuel Stern with such conviction that you have no choice but to go through his emotional journey with him. Joanne Whalley played her role with a lot passion and understanding. Lisa Repo-Martell gave one of the most memorable performances during the film with lots of control and presence. One of the most interesting subplots was the story of Jamal Hassani, played by Anousha Alamian and his struggle as a minority, which felt real and honest and gave the film such humanity, that it was thrilling to watch. Well worth watching again and again.",
         "I loved this movie. Perhaps because I'm a proud Newfoundlander from that part of the island, perhaps because I heard first-hand what was happening as it was happening, or simply because it was a great tale; probably a mixture of all. Yes, the budget was typically Canadian - no doubt. And, it was a little annoying to hear some of the leading actors sport fake Irish accents and to watch the movie pass off parts of St. John's as Gander. However, I couldn't have been prouder to see the town rally to support the emergency. It's like they'd done it every day of their lives. I was moved to tears several times, especially in the beginning. I think they did a great job trying to capture the various tales people had to go through at that time - the personal stories. In general, it was moving to see the town spotlighted in such a positive way, and to see the typical Newfoundland and Labrador kindness displayed on screen.",
         "As a witness to the 9/11 diversion to Gander back in 2001 I was extremely eager to watch this film. I was more then thrilled when I heard there would be a movie based on the kindness and generosity fellow Newfoundlanders showed over 6000 strangers from all over the world. But when I finally watched the movie I was more then disappointed! The storyline was half-decent and had some great scenes portraying how Newfoundlanders respond to a crisis with their acts of Kindness as well as focusing on some of the local traditions (screeched in). But it would have been nice for the writer to put some research into the town of Gander in which the movie was depicting. For example: People in Gander do not have strong Irish accents, the school is called Gander Academy and not Gander Elementry, the neighbouring town which also went to great lenghts to house and provide necessities to those stranded is in fact called Glenwood and not Glendale (I think this deserved some recognition and the name should have at least been correct) The highway the man took to go to Port Aux Basques to catch the ferry to NS is in fact the Trans Canada Highway which is not by any means a single lane road with no lines and bush overgrowth reaching the side of the road. There are no Dairy Queens or 'Gateway' hotels. (Catchy name though) and the Ocean is not a simple hike from Gander. A lake, yes, Ocean definitely not. The nearest Ocean to Gander is at least an hour drive, if not a little more. For a low-budget film the actors did a good job considering what they were given to work with! Kodos to them... But as for the rest of it... I expected more. I give this movie a 4 out of 10.... Next time if your writing a movie based on actual events and places, a little research would be appreciated!",
         "I enjoyed this made-for-TV movie. Its along the lines of something from Lifetime but is actually a CBC (Canadian) production. There's nothing fancy here but it's still a heartwarming story as the viewer follows various story lines about the passengers and friendships developed over a 4 day period (starting on September 11th, 2001) when 38 planes headed to New York were diverted to Gander Newfoundland, Canada. A town of 9,000 which took in 7,000 passengers until American airspace reopened. The plot itself is compelling and there's some decent acting which makes up for the slow pace. I enjoyed (Shawn Ashmore) as the Air Traffic Controller; meeting and falling in love with British passenger Alia. (David Suchet) was a big surprise here, playing an obnoxious American, desperate for news of his son who worked in the World Trade Center. Another sweet romance develops between a middle aged pair of lonely travellers, and a Muslim American man immediately sees his world changed forever as he is racially profiled, raising suspicions based on his skin colour alone. We also follow several Gander locals; a hotel manager, the Mayor as they try to accommodate anxious and scared passengers who aren't even sure where they are. Friendships remain to this day between the Canadian hosts and stranded British, European and American travellers. 4/12/15",
         "I had not seen this movie until tonight September 8, 2012 and when I saw it advertised I was super excited. Upon watching it I was unfortunately super disappointed. I thought the movie was actually going to be more about the residents of Gander and surrounding communities and how they came together with such short notice to support the passengers that had been diverted. This movie did not meet my expectations at all and to listen to some of the actors who were portraying Newfoundlanders but were from elsewhere speak the way they did was difficult to listen too. Overall I don't think this movie achieved what it should have.",
         "Like another reviewer I looked forward to the debut showing on CBC with much anticipation -- only to be horribly let down. For it to have been any more low-budget they'd have to have shot it in a Wal-Mart parking lot. (The producers apparently couldn't even afford to have the shoulder-patches properly sewn onto immigration agents' uniforms, for heaven's sake.) The mostly unknown actors all seem to be doing their best but it's nowhere near adequate to overcome the unseemly directing that focuses too much of the action on all the wrong things. There are many huge gaps in the storyline, and candidly I am mortified to think that there could have been as little communication between Canadian officials and airline flight crews, and between our federal government and people in Gander, as this movie appears to suggest. The sequencing makes local officials look like complete boobs (e.g., the mayor and his minions rushing around madly to local fast-food outlets, ordering massive quantities of burgers and fried chicken to feed the throngs of passengers -- many hours before they were even permitted to begin disembarking from their planes.) I certainly hope our national broadcaster didn't waste too much money on this bomb, because it does no service to Canadians who should expect a potentially very interesting story to be properly told.",
         "As a resident of Gander for 41 years, and was a volunteer during the 9/11 events..this is the worst movie I have ever seen...from the ATC at a rocky shore..and has to work in 1 hour....he wasn't near Gander!! The man who was driving on what was suppose to be the TCH..looked like a cow path..and people wonder why they think Newfoundland is backwards....it's because of idiots like the people who made this film..other than a couple shots of the airport..nothing was in Gander...and nobody was lined up outside peoples houses waiting to get a shower..this film stated it was fiction...but you did a crappy job of trying to make the lovely people of Gander look good !! Residents of the area would have done a much better job. I could go on for pages about what was wrong with this film..in short..waste of the 2 hours it was on!!"
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Big Tree Productions",
         "Pope Productions",
         "Shaftesbury Films"
      ],
      "summaries": ["On September 11th, 2001, 38 planes headed to New York City were diverted to Gander, Newfoundland, Canada. A town of 9,000 took in 7,000 passengers for 4 days until American airspace reopened."],
      "budget": 0
   },
   "movielensId": 94327,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-03-08",
      "dvdReleaseDate": "2009-03-08",
      "directors": ["Alex Chapple"],
      "runtime": 89,
      "movieId": 94327,
      "title": "Diverted",
      "mpaa": null,
      "actors": [
         "Shawn Ashmore",
         "David Suchet",
         "Joanne Whalley",
         "Colin Buchanan",
         "Anita Majumdar",
         "Liisa Repo-Martell",
         "Anousha Alamian",
         "Karen LeBlanc",
         "Mark Caven",
         "David Christo",
         "Amy Rutherford",
         "Rick Boland",
         "Phil Churchill",
         "Susan Kent",
         "Greg Malone"
      ],
      "imdbMovieId": "1303829",
      "originalTitle": "Diverted",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "On September 11th, 2001, 38 planes headed to New York City were diverted to Gander, Newfoundland, Canada. A town of 9,000 took in 7,000 passengers for 4 days until American airspace reopened.",
      "tmdbMovieId": 48008,
      "avgRating": 0.5,
      "releaseYear": "2009",
      "numRatings": 1,
      "posterPath": "/nwhQuOSIxPM5luWH0fHglA8tPDF.jpg"
   }
}