{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "biography",
         "id": 5565
      }],
      "imdb_id": "tt1295085",
      "video": false,
      "title": "Gifted Hands: The Ben Carson Story",
      "recommendations": [
         37208,
         21534,
         42590,
         84900,
         50769,
         268159,
         91282,
         26232,
         236630,
         136405,
         206284,
         15155,
         121822,
         84106,
         70174,
         48210,
         290969,
         243794,
         29697,
         392655
      ],
      "backdrop_path": "/r3DBNgDompUYus7smS6pRNSNORc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ben Carson",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ad6b",
               "name": "Cuba Gooding Jr.",
               "profile_path": "/yu8Q3ImFu3RJne585jjgeQO2Boo.jpg",
               "id": 9777,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sonya Carson",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ad6f",
               "name": "Kimberly Elise",
               "profile_path": "/315K0qi3aFmcgGweUiLwhdrvcfU.jpg",
               "id": 55314,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Candy Carson",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ad73",
               "name": "Aunjanue Ellis",
               "profile_path": "/xo8wv5fhpxAPnNA7HS7WH8psguQ.jpg",
               "id": 53923,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Long",
               "gender": 2,
               "credit_id": "5396a71fc3a36864340056a4",
               "name": "Ele Bardha",
               "profile_path": "/AaLb7j05vcN86vbldQeBErNJFMb.jpg",
               "id": 76674,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Yale Professor",
               "gender": 2,
               "credit_id": "5396a72cc3a36864340056a8",
               "name": "Loren Bass",
               "profile_path": "/cdj4ffK5ft00Arb4OnsnIPNIz2F.jpg",
               "id": 1329297,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Jose Gonzalez",
               "gender": 2,
               "credit_id": "56d9f0c7c3a3681e3c026992",
               "name": "Ithamar Enriquez",
               "profile_path": "/jGFypNsFjtZSQsWh8ZwqinxrASc.jpg",
               "id": 1039796,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Teen Carl",
               "gender": 2,
               "credit_id": "56d9f113c3a3681e500213ed",
               "name": "Harron Atkins",
               "profile_path": "/biTUGH35ygCbJRbft2plGVlqo7d.jpg",
               "id": 1586411,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Dr. Freeman",
               "gender": 2,
               "credit_id": "56d9f2c4925141429100b271",
               "name": "Geoffrey Beauchamp",
               "profile_path": null,
               "id": 1000796,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Professor Burket",
               "gender": 2,
               "credit_id": "56d9f3aa925141391f00f91e",
               "name": "Danny Goldring",
               "profile_path": "/nufdKuciAuJ1vzwXnVQcUDeAsoA.jpg",
               "id": 16477,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ad79",
               "name": "Thomas Carter",
               "profile_path": "/j51pRbB8nCYrziSnjmB2PS9SIVh.jpg",
               "id": 52038,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ad7f",
               "name": "John Pielmeier",
               "profile_path": "/7XfFVc17YT4SsDeYzHqYjYpCy5U.jpg",
               "id": 25736,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5829dcfdc3a368360603be40",
               "name": "Claire Simon",
               "profile_path": null,
               "id": 1486960,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "558accc2c3a368053e005e26",
               "name": "David A. Rosemont",
               "profile_path": null,
               "id": 1243079,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "558accd4c3a36869f200200a",
               "name": "Martin Davich",
               "profile_path": null,
               "id": 71191,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "558accebc3a36869f200200f",
               "name": "John B. Aronson",
               "profile_path": null,
               "id": 1308306,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "558acd069251415358000976",
               "name": "Peter E. Berger",
               "profile_path": null,
               "id": 2033,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "558acd18c3a368290f001a23",
               "name": "Denise Chamian",
               "profile_path": "/mEn7U8Dt5zqnNMO0Y1YtXO7evS.jpg",
               "id": 2215,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "558acd2d9251411472001356",
               "name": "Angela Demo",
               "profile_path": null,
               "id": 1021206,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "558acd579251417b520003ca",
               "name": "Warren Alan Young",
               "profile_path": null,
               "id": 60478,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "558acd7092514177880000f9",
               "name": "Hilary Momberger",
               "profile_path": null,
               "id": 124660,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.688672,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22683,
      "vote_count": 112,
      "budget": 0,
      "overview": "Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.",
      "similar": [
         45317,
         323677,
         319888,
         11202,
         1578,
         10637,
         227306,
         462,
         640,
         769,
         5915,
         318846,
         389015,
         407445,
         363676,
         371638,
         396371,
         324786,
         369192,
         43959
      ],
      "original_title": "Gifted Hands: The Ben Carson Story",
      "runtime": 86,
      "poster_path": "/zeHQSqzYintF4AmFHe5BTG9gCAG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Thomas Carter Company",
            "id": 56365,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Hatchery",
            "id": 7613,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Magna Global Entertainment",
            "id": 29646,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Johnson & Johnson Spotlight Presentations",
            "id": 29647,
            "origin_country": ""
         },
         {
            "logo_path": "/wHs44fktdoj6c378ZbSWfzKsM2Z.png",
            "name": "Sony Pictures Television",
            "id": 11073,
            "origin_country": "US"
         }
      ],
      "release_date": "2009-02-07",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.tnt.tv/movies/giftedhands/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thomas Carter"],
      "runtime": 86,
      "synopsis": "From Amazon.com: Oscar winner Cuba Gooding Jr. (Actor in a Supporting Role, Jerry Maguire, 1996) stars in this true story about a renowned brain surgeon who overcame obstacles to change the course of medicine forever. Young Ben Carson didn't have much of a chance. Growing up in a broken home amongst poverty and prejudice, his grades suffered and his temper flared. And yet, his mother never lost her faith in him. Insisting he follow the opportunities she never had, she helped to grow his imagination, intelligence and, most importantly, his belief in himself. That faith would be his gift - the thing that would drive him to follow his dream of becoming one of the world's leading neurosurgeons.",
      "writers": ["John Pielmeier"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1295085/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NDI0NDkyOV5BMl5BanBnXkFtZTcwMTk1NzMzMg@@._V1_SY317_CR133,0,214,317_AL_.jpg",
      "actors": ["Stars: Cuba Gooding Jr., Kimberly Elise, Aunjanue Ellis | See full cast and crew »"],
      "reviews": [
         "To summarize this story in a nutshell, it's about an amazing neurologist named Ben Carson, who started off with nothing. He was dumb and unimaginative with a very low self esteem. As he goes through the years some things get worse with relationships and such, as others get better, like knowledge, but he grows up to be this neurologist, the best in the world and his jobs range from checking over babies to stopping daily seizures. The movie goes through all his good times and his bad times from start to finish. I know it doesn't sound that interesting, but it really is. It seems slow at some parts, but all the characters put out wonderful dramatic performances. I almost cried there at the end. The writers put a lot of time into this with some excellent dialog here and there. The director did a good job too. It's not superb quality, but everything about this movie was great. Something else to keep in mind is that this is based on a true story and it's a book. I haven't read the book, but I've heard it's wonderful. If you've read it and you're scared the movie will suck, don't worry, it doesn't. I guess that's about all there is to say about this movie. Once again, good job TNT. But if I were you, I would've sent it to the cinemas first.",
         "We just finished watching Gifted Hands and can't believe this was a made-for-TV movie and not for theatrical release. It is one of the better biographical movies we have ever seen. Inspiring storyline - beautifully acted. What a wonderful message for young people that they can do anything they set their mind and heart to. This is better than many of the movies you will pay to see. Just sent out and email to friends and family to make sure they don't miss it. Watch with Kleenex handy. Kudo's TNT...",
         "The Ben Carson Story never set out to a major film: this is obviously a film that appealed to Oscar winner Cuba Gooding Jr and he plays it very straight, and underacts, without underplaying. As I am deeply fascinated by all things neurological this was a really easy film for me to get into - but even if you have no real interest, the human side of this will really sideswipe you. It is incredibly and really frustratingly slow in places, but bear with me - the surgeries are amazing and very moving. Overall I'm giving this a 9, not for the production writing filming or direction which are at best 6 or 7 at most, but because films like this deserve to be made, should be made, and should be what we want to be made... Good, Moving, and Inspirational...",
         "Tremendous movie of taking what's thought impossible and showing how to try and then do it. Of how Ben Carson went from believing he was stupid to understanding we can do miracles. How that belief put him on a path few get to have as he impacts lives. I'm watching it the second time around on it's TNT premiere tonight and give it 10 stars for transformative potential, excitement, drama, character development, subject and actors. Thank you for this movie! I called my friends & told them to watch. Cuba Gooding is so good as lead character that I forget he is acting:-) The mother character keeps people on their toes as she hides her secrets. Others are also excellent. I laughed, cried, was awed and at times sat on the edge of my seat not knowing what came next. Am touched throughout this movie as I wonder if spirit trumps all. Everyone should watch this!",
         "Now this is what i call a true drama, a masterpiece performed by Thomas Carter and Cuba Gooding Jr. The story begins with biography of Ben Carson which was made quit interesting and fascinating. Young boy (Ben Carson) was between two chooses to admit a false fact that he is dumber than other kids in school or to be encouraged by his mother and start new saga in his personal life. When he begun reading books and understood that the new things he read can be used in life he was like in paradise and on the toped place on podium. Mom (Kimberly Elise) really supported her sons in all ways and dramatically wanted them to be more the she was in her life, when husband died she was prostrated but life for her and little Carsons was still going on. Ben Carson had to face another big problem in his life - a flush of anger which was eliminated from his life by the help of church and God. Ben Carson in his youth had a potential of choosing lots of different professions from the musician to the tops of physics or chemistry, but amazed by the fact that human mind can do so amazing thinks he chose a neurology . The movie was made quite dramatic and in high quality of acting, i've just missed one detail , when Candy Carson lost their Babbie twins i've missed some more drama from Ben Carson, it was like a non - matter fact in his life,despite the fact this movie was one of the best drama's i've seen in 2009. Applause goes to John Pielmeier, Thomas Carter, Cuba Gooding Jr.. 10/10. P.S sorry Sorry for some grammatical mistakes in this comment but it was wrote from heart :).",
         "A movie about life, about the decisions you have to make from childhood to became something in your life. I recommend this movie to all, one of the best movies ever. It's not boring at all and Cuba Gooding Jr. make the character so real even if he doesn't look like an neurosurgeon or even a doctor. His mother and her education made a explosive turning in Ben life and like he said \" I pray everyday \" helped to reach his goal to became an doctor and not any doctor an devoted and respected neurosurgeon. Dr. Ben Carson was and is one of the best neurosurgeons alive. Because he is black teach us that God see no color when he think about us and with His help we can achieve everything we want in life.",
         "I am so pleased that we randomly chose to watch Gifted Hands on Sat. Feb. 7. This is a well done movie, a beautiful story about an amazing man. After sharing about the movie with our dear friends, whose child had sustained a brain injury as an unborn, we were amazed to discover that this is the Dr who performed surgery on their child shortly after the twins from Germany. Thank you for the opportunity to get to know about this wonderful man. This was our first choice for afternoon viewing because of Cuba Gooding, Jr portraying the doctor. He usually does an excellent job in wholesome movies and this was not a disappointment in any way.",
         "I grew up hearing about some of Ben Carson's amazing surgeries and remember reading about him when I was a teenager, probably, so I was excited when I heard about this movie. I just watched it for the first time, and it's one of the best movies I've ever seen. I can't believe it was a made-for-TV movie! This movie tells the story of how Ben Carson went from being a kid who was a failure in school and had a very low self-esteem to a famous, gifted surgeon. It tells some about his family life and about two of his famous surgeries. This movie kept me glued to it all the way through--it was like a good book you can't put down!",
         "As usual, Cuba Gooding was fantastic in this drama! He's as good in comedies also! No one else comes to mind for playing Dr Ben Carson with the passion he projects throughout the movie. This is a man's man. Torn between his loyalty to his skills as a surgeon and a lack of faith in himself made this film all the more realistic! Cuba and Elise give performances that are amazing to watch! Comments to another forum express their objections to the way the race relations play in the movie while at the school...\"but\" it can't get any realer than that. I've seen it with my own eyes while attending colleges & this film really puts it down. Very emotional & inspiring film. Thanks to everyone involved for bringing us this fantastic true story!",
         "A good friend of mine advised me to watch this movie, so I did after he pushed me a lot. It's a fascinating story to watch and while watching the tension increased and it kept me sitting at the edge of my seat till the end. And the fact that this movie is based on a true story, makes it even more fascinating. The acting in this movie has been done wonderfully, as expected from Cuba Gooding Jr. Normally I don't watch these kind of movies, but I'm glad I watched this movie. As for anyone else who doubts about this movie, don't. Just watch it, it will be worth it!"
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Hatchery, The",
         "Johnson & Johnson Spotlight Presentations",
         "Magna Global Entertainment"
      ],
      "summaries": ["Biography of Ben Carson who grew up to be Dr. Ben Carson, a world famous neurosurgeon at Johns Hopkins."],
      "budget": 0
   },
   "movielensId": 94752,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-02-07",
      "dvdReleaseDate": null,
      "directors": ["Thomas Carter"],
      "runtime": 86,
      "movieId": 94752,
      "title": "Gifted Hands: The Ben Carson Story",
      "mpaa": "",
      "actors": [
         "Cuba Gooding Jr.",
         "Kimberly Elise",
         "Aunjanue Ellis",
         "Ele Bardha",
         "Loren Bass",
         "Ithamar Enriquez",
         "Harron Atkins",
         "Geoffrey Beauchamp",
         "Danny Goldring"
      ],
      "imdbMovieId": "1295085",
      "originalTitle": "Gifted Hands: The Ben Carson Story",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.",
      "tmdbMovieId": 22683,
      "avgRating": 3.87079,
      "releaseYear": "2009",
      "numRatings": 89,
      "posterPath": "/zeHQSqzYintF4AmFHe5BTG9gCAG.jpg"
   }
}