{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "hand clapping game",
            "id": 158672
         },
         {
            "name": "cult leader",
            "id": 159028
         }
      ],
      "imdb_id": "tt1748207",
      "video": false,
      "title": "Sound of My Voice",
      "recommendations": [
         87499,
         55420,
         174678,
         50837,
         92398,
         27374,
         58428,
         116811,
         241855,
         25983,
         67748,
         117978,
         207769,
         13198,
         211067,
         84194,
         41827,
         16077,
         64320,
         1483
      ],
      "backdrop_path": "/85IzH4IPHgLErixU3bCPTGI868W.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Jaba",
         "id": "5773ec06c3a36870b8000800",
         "content": "Excellent movie. It's very interesting. Doesn't have any dull moments. Creates something unique atmosphere. After watching it, I had a desire to watch it again. All Actors are playing well their roles, characters aren't boring. Ending is surprisingly interesting. I think it became one of my favorite movies of all time & I admit, I love well-made indie movies like this. And definitely I'm recommending this movie for the people who seek movies about cults, people's life & mystery, instead of special effects & etc.",
         "url": "https://www.themoviedb.org/review/5773ec06c3a36870b8000800"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1004,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe499f9251416c910b374f",
               "name": "Brit Marling",
               "profile_path": "/5dTB4aazUJUgCywI51ZlN3djP8I.jpg",
               "id": 222330,
               "order": 0
            },
            {
               "cast_id": 1005,
               "character": "Peter Aitken",
               "gender": 0,
               "credit_id": "52fe499f9251416c910b3753",
               "name": "Christopher Denham",
               "profile_path": "/oPnHnLW51n9qFtCxh4phejRm6xe.jpg",
               "id": 61510,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "Lorna Michaelson",
               "gender": 1,
               "credit_id": "52fe49a09251416c910b3757",
               "name": "Nicole Vicius",
               "profile_path": "/2OKvTQ88GM4O6FhERXnq3benmk4.jpg",
               "id": 18516,
               "order": 2
            },
            {
               "cast_id": 1008,
               "character": "Carol Briggs",
               "gender": 1,
               "credit_id": "52fe49a09251416c910b3761",
               "name": "Davenia McFadden",
               "profile_path": "/uX5egRwfOly93uuJeSahVIxfLFV.jpg",
               "id": 75620,
               "order": 3
            },
            {
               "cast_id": 1009,
               "character": "Joanne",
               "gender": 0,
               "credit_id": "52fe49a09251416c910b3765",
               "name": "Kandice Stroh",
               "profile_path": null,
               "id": 1039922,
               "order": 4
            },
            {
               "cast_id": 1011,
               "character": "Klaus",
               "gender": 2,
               "credit_id": "59055bff9251416a140159ad",
               "name": "Richard Wharton",
               "profile_path": "/hklENMg9f6pAbTHafbbOZpUbZUN.jpg",
               "id": 87115,
               "order": 5
            },
            {
               "cast_id": 1012,
               "character": "Mel",
               "gender": 0,
               "credit_id": "59055c08c3a3684af0013d18",
               "name": "Christy Meyers",
               "profile_path": null,
               "id": 1807141,
               "order": 6
            },
            {
               "cast_id": 1013,
               "character": "Lam",
               "gender": 0,
               "credit_id": "59055c12c3a3684a68015476",
               "name": "Alvin Lam",
               "profile_path": null,
               "id": 118737,
               "order": 7
            },
            {
               "cast_id": 1014,
               "character": "Christine",
               "gender": 1,
               "credit_id": "59055c1d92514169fb015bfd",
               "name": "Constance Wu",
               "profile_path": "/1ODwPGq6EpAJXfUG38jDBOAOL7a.jpg",
               "id": 206444,
               "order": 8
            },
            {
               "cast_id": 1015,
               "character": "Lyle",
               "gender": 2,
               "credit_id": "59055c2692514169d0014f73",
               "name": "Matthew Carey",
               "profile_path": "/6lQqbn9VGcTvJXqPB9eyFxLwIaD.jpg",
               "id": 17040,
               "order": 9
            },
            {
               "cast_id": 1016,
               "character": "PJ",
               "gender": 0,
               "credit_id": "59055c30c3a3684ad7015707",
               "name": "Jacob Price",
               "profile_path": null,
               "id": 1807142,
               "order": 10
            },
            {
               "cast_id": 1017,
               "character": "O'Shea",
               "gender": 2,
               "credit_id": "59055c41c3a3684a4e015cd7",
               "name": "David Haley",
               "profile_path": null,
               "id": 1455899,
               "order": 11
            },
            {
               "cast_id": 1018,
               "character": "Mr. Pritchett",
               "gender": 2,
               "credit_id": "59055c4dc3a3684a8e0144d4",
               "name": "James Urbaniak",
               "profile_path": "/13cOcBh08yfhJQGvrnZ6ZteWfzw.jpg",
               "id": 58528,
               "order": 12
            },
            {
               "cast_id": 1019,
               "character": "Mrs. Dewitt",
               "gender": 1,
               "credit_id": "59055c5f92514169d8015400",
               "name": "Annie O'Donnell",
               "profile_path": "/A5Xg5Z9kKYHamBAFHhOZepUru18.jpg",
               "id": 61079,
               "order": 13
            },
            {
               "cast_id": 1020,
               "character": "Principal Garner",
               "gender": 1,
               "credit_id": "59055c6bc3a3684af0013d6d",
               "name": "Laura Leyva",
               "profile_path": "/q8wJb0a3dWuYUirzKaCXjhnPko2.jpg",
               "id": 1807143,
               "order": 14
            },
            {
               "cast_id": 1021,
               "character": "Timothy",
               "gender": 2,
               "credit_id": "59055c75c3a3684b07013a31",
               "name": "Travis Johns",
               "profile_path": null,
               "id": 1455901,
               "order": 15
            },
            {
               "cast_id": 1022,
               "character": "Heidi",
               "gender": 1,
               "credit_id": "59055c8292514169fb015c61",
               "name": "Piper Mackenzie Harris",
               "profile_path": "/iTiubeqPER1X8x7Q76DjtL5tQ83.jpg",
               "id": 84849,
               "order": 16
            },
            {
               "cast_id": 1023,
               "character": "Lumala",
               "gender": 0,
               "credit_id": "59055c8bc3a3684a8e014515",
               "name": "Tonita Castro",
               "profile_path": "/w6vkqFmRMsxGCiYnnPWZDQ4nxdW.jpg",
               "id": 200163,
               "order": 17
            },
            {
               "cast_id": 1024,
               "character": "Young Peter",
               "gender": 2,
               "credit_id": "59055c9ac3a3684a8e01451e",
               "name": "Jack Griffo",
               "profile_path": "/sS8nINm8wgZGubQ4lqY5fpOtlLg.jpg",
               "id": 1277364,
               "order": 18
            },
            {
               "cast_id": 1025,
               "character": "Lucas",
               "gender": 0,
               "credit_id": "59055ca29251416a14015a4e",
               "name": "Kyle Hacker",
               "profile_path": null,
               "id": 1807144,
               "order": 19
            },
            {
               "cast_id": 1026,
               "character": "Abigail Pritchett",
               "gender": 0,
               "credit_id": "59055cb49251416a14015a64",
               "name": "Avery Kristen Pohl",
               "profile_path": "/kDWZbAfJBCa3naxp87tRQIJ3dLX.jpg",
               "id": 1392457,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499f9251416c910b3745",
               "name": "Zal Batmanglij",
               "profile_path": "/kkDU7v5eDZTWbRIoPsRYT3AdcoG.jpg",
               "id": 933739,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe499f9251416c910b374b",
               "name": "Brit Marling",
               "profile_path": "/5dTB4aazUJUgCywI51ZlN3djP8I.jpg",
               "id": 222330,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a09251416c910b375d",
               "name": "Zal Batmanglij",
               "profile_path": "/kkDU7v5eDZTWbRIoPsRYT3AdcoG.jpg",
               "id": 933739,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5868a225c3a3680f4e007d12",
               "name": "Brit Marling",
               "profile_path": "/5dTB4aazUJUgCywI51ZlN3djP8I.jpg",
               "id": 222330,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5a68ff910e0a260d74006656",
               "name": "Rachel Morrison",
               "profile_path": "/wVK8IvtUYPH2TginlIurPT5WH5W.jpg",
               "id": 984113,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 4.785886,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 86812,
      "vote_count": 138,
      "budget": 0,
      "overview": "A journalist and his girlfriend get pulled in while they investigate a cult whose leader claims to be from the future.",
      "similar": [
         3134,
         11564,
         8810,
         241,
         281,
         10017,
         133805,
         2142,
         22323,
         948,
         562,
         298312,
         14433,
         1359,
         858,
         141,
         185,
         11615,
         431,
         101
      ],
      "original_title": "Sound of My Voice",
      "runtime": 85,
      "poster_path": "/q9hNxBOX0upOU7YULJLSTyPQDMg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Skyscraper Films",
         "id": 26197,
         "origin_country": ""
      }],
      "release_date": "2011-01-22",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zal Batmanglij"],
      "runtime": 85,
      "synopsis": "The film begins with us watching a 20-something couple following written instructions, drive into a garage, where they are told to shower, dress in white clothes, then are blind-folded, cuffed and led into a van then driven to an undisclosed location. There they are greeted by Klaus, who tests them via their ability to repeat an extremely complex secret handshake. It is there we are introduced to Maggie,Brit Marling who claims to be a time traveler from the year 2054. We watch as our couple Peter and Lorna, now alone back in their own home, reveal the true motivation is not to join the Cult but to act as documentary filmmakers determined convinced Maggie is just one more cult leader and a fraud. If fact we learn that peters glasses in fact contain a camera. We watch them repeat this nightly process, understanding that they are gathering more information, yet also realizing that, especially Peter is getting drawn deeper in with each passing day. there are several scenes where we watch Peter at work teaching 8 year old children. There is one girl, long blond hair kept constantly covered by a red knit hat, her name is Abigail Pritchett and she clearly is different than the other kids. As we watch her interact with her classmates, there is little doubt that she is connected to the story in ways that will be pivotal to the plot. We are given serious reasons to doubt the claims of Maggie, then the next moment we are compelled to ask if Maggie could be telling the truth. This film gives you two questions for every one answer, but it never feels as if the writers are sloppy. At the conclusion of the film, Peter leads a little girl to Maggie, who she claims is her mother, and then gives definitive proof that she is in fact either from the future or that she has some connection with this girl, who has been acting odd the whole film. Then, gets dragged out of the museum by police. - Lane J. Lubell of Cinemashadow",
      "writers": [
         "Zal Batmanglij",
         "Brit Marling"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1748207/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTExMzcwODc5NDBeQTJeQWpwZ15BbWU3MDQ2MzU2NTc@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Christopher Denham, Nicole Vicius, Brit Marling | See full cast and crew »"],
      "reviews": [
         "I saw this film at SXSW where it was playing following the film's premiere at Sundance. The film is about 2 documentary filmmakers who are determined to expose a cultleader, played by Brit Marling, as a fraud. The more time they spend with the cult, however, the more the filmmaker's relationship to each other is tested -- one continues to dismiss the cult as a hoax while the other considers the possibility, ever so slight, that the central claim of the cult leader may be true. Unlike many low-budget Indie films, the pacing was superb -- there was never a dull moment that made the film feel slow. This is partly due to the film's well-crafted suspense - we, as an audience, are constantly asking ourselves the same question that the protagonists ask: could the cult leader possibly be telling the truth? This film leaves you guessing until the end and when the answer is finally revealed, you are left with a desire for more. The only weakness is a few confusing scenes - (e.g., an FBI investigator debugs her hotel room without explanation. A young girl behaves strangely in class and its never revealed why.) According to interviews, director Zal Batmanglij is working on a trilogy that will continue the story -- very exciting news. Perhaps most satisfying about this film is that it shows that you can make a compelling story come to life on a shoe-string budget. I think this film would play well to mainstream audiences and it deserves a wider release.",
         "Brit Marling, star and co-writer of 'Sound of MY Voice' was also responsible for 'Another Earth', a 2012 Spirit Award nominee for Best First Feature. Both films are similar in that they have an ambiguous ending which has sparked vast debate on the internet message boards. The ending of 'Sound of my Voice' is even more integral to the plot than 'Another Earth', since viewers are led to expect a big 'payoff'. That payoff involves whether the film's antagonist, Maggie, a cult leader, who claims to be from the year 2054, actually is a time traveler from the future. Before dissecting the ending, it's important to realize that the film is also about the power of cult psychology. The film's protagonist, Peter, along with his girlfriend, Lorna, are documentary filmmakers who decide to risk all by infiltrating the group. I had a hard time with the idea that Peter, knowing how dangerous the cult is, still is intent on going ahead with his project. You have to suspend your disbelief over Peter's stubbornness, since the average person (working in a vacuum as Peter and Lorna do) would probably not take such a risk. The film's main conceit during the 'Second Act' of the narrative is that even the most steadfast skeptics such as Peter, can be seduced by a talented manipulator. He and Lorna are subjected to a series of 'loyalty tests' including eating worms and poisoned apples, culminating in Maggie's ability to break Peter down emotionally during one of the sessions (she alludes to one of Peter's upsetting childhood memories). While Peter tells Lorna it was all just an act, later Peter agrees to assist in the abduction of Abigail, the young girl Maggie claims is her mother. Peter argues that he just wants to finish the job he started since so many people never do that. The scenarists of 'Sound of My Voice' argue whatever Peter's ultimate motive is, in the end he's been manipulated into committing an egregious act (the abduction of a child). While hardly any of the mechanics of cult indoctrination can be termed 'suspenseful', Ms. Marling and her co-writer keep dropping hints that there's something a lot bigger afoot. The big 'twist' at the end has Abigail giving Maggie the secret handshake, leading to all kinds of speculation. Interpretations of the ending have been broken down into multiple camps. One camp basically holds that Maggie is indeed Abigail's daughter and a time traveler. Adherents of this point of view point to the fact that when Abigail asks Maggie how she knew the secret handshake, Maggie replies, \"you taught it to me.\" In this scenario, Abigail has been trained to be a terrorist and later Maggie receives the same indoctrination. Maggie's aim is to save her 'mother' as well as herself from those people in the future who have abused them. Carol, the self-declared 'Department of Justice' investigator, is actually a bounty hunter from the future, who is assigned to thwart Maggie's plans, as she will prevent both Abigail and Maggie from turning away from the cult in the present and the future. Camp #1 points to the fact that if these were real Department of Justice investigators, Peter would have also had to have been detained on charges of complicity in the kidnapping. Another camp holds that Carol is a cult follower who pretends to be a Department of Justice Investigator. The cult cons Lorna into believing that Maggie has been arrested but in reality she has been simply 'taken away' by cult followers. With this belief, Lorna is no longer a threat. The 'secret handshake' has been arranged by the man who has been indoctrinating Abigail and Maggie is in on it. Peter, the skeptic, suddenly becomes a 'true believer' in the cult, as he's been conned into the whole time travel scenario. And another camp holds time travel is impossible and it's Klaus who's the true Svengali here. He found the drug-addicted Maggie on the street and brainwashed her into believing that Abigail is her mother. Nonetheless, Abigail may indeed be Maggie's daughter and old lost memories may be breaking into her consciousness. Something inside her is telling her to save Abigail and when Peter finally brings Abigail to her and asks how she knew the secret handshake, Maggie suddenly recalls her daughter taught it to her when she was much smaller (the man who appears to be her 'father' is a cult follower who has been brainwashing little Abigail since her earliest memories, and taught her the secret handshake). Carol is actually affiliated with the DOJ and interrupts the confused Maggie and arrests her, as she is aware that she has a criminal history. Nonetheless, Maggie may not be held criminally liable as later on it may come out that she has been manipulated by Klaus. There seem to be a myriad of explanations to explain the ending of this film. Some people believe that such ambiguity is a mark of a great film--the fact that so many people can come up with so many different explanations as to what this film is about, is held up by some, as a sign of great creativity. On the other hand, others (including myself), feel that this kind of writing is a cop-out. Do you really have a definitive point of view you're trying to put across? Or are you leaving things intentionally ambiguous because you really haven't thought through precisely what you're trying to say? I suppose a film such as this which engenders so much discussion on the internet deserves an extra star. But ultimately, the film never answers fundamental questions about its antagonist which should be answered, leading one to conclude that the film's scenarists do not have a firm grasp on their material.",
         "Sound of My Voice was one of the best-crafted feature films at the 2011 Sundance Film Festival. I was fortunate enough to secure a ticket for the screening at The Library theater, and the place was packed. Sound of My Voice is the story of two amateur documentary filmmakers who decide to infiltrate a secretive cult run by a mysterious woman who calls herself Maggie. They want to expose the cult for reasons that become apparent later in the film. Sound of My Voice is a thriller, so it is hard to describe much without giving away key plot elements, so I will simply say that the acting is superb throughout. The real standout is double-threat Britt Marling who not only stars as Maggie, but also co-wrote the screenplay with Zal Batmanglij (Marling also co-wrote and starred in Another Earth -- which was also a Sundance standout). The cinematography, editing, and score lend just the right edgy feel to this film. Even though Sound of My Voice was shot on a micro-budget, it pays off better than most of the indie films one sees at your local art house. In fact, I could easily see this film crossing over to play at some commercial theaters in large cities. You will be on the edge of your seat, desperately trying to discover the truth, and when the lights come up, Sound of My Voice will both satisfy and leave you begging for more.",
         "Captivating and enigmatic, \"Sound of My Voice\" shows that you can effectively rack an audience's mind with a micro-budget. While many of the strange details and set-ups are left open ended, it's the kind of film that will you have talking with others trying to fill in the blanks long after you've seen it. In some ways, they plant more details than necessary in what seems to be an attempt to confuse the audience and test their attention.Overall, the actors in the film do a great job (especially Marling) and it proves to be a promising directorial debut for Zal Batmanglij. If you want something that also pulls at the mind emotionally, I would recommend \"Another Earth\".",
         "If you are into films that are original and make you think as you leave the theater, this is the film to see while it is still in theaters. Christopher Denham and Nicole Vicius portray a couple attempting to infiltrate and expose a cult led by Brit Marling's Maggie but find themselves in too deep. The film, presented with little back story and minor music cues leaves only the actors and scenes to bring the emotion and interest. All the actors do a good job with the material and if you go with the scenario being presented it's quite engrossing. The end result is a film that forces the viewer to do some of the heavy lifting to determine if Maggie is who she says she is or if it is all a scam.",
         "I just finished watching this movie at home and I must say that it has the qualities of a big production movie. That is, it has high definition film quality and it doesn't look like a low budget production. The acting is pretty solid all around. Even the plot was decent, but not thrilling. I thought I had it all figured out toward the end, but at the last minute, something happens to make you reconsider everything. Spoiler alert... Quit reading if you don't want to read a spoiler! After the last minute handshake that makes you think maybe this time traveler might actually be from the future, you have to come back to reality and realize this is probably a cult scam. Why? There are police records of the woman who has done this exact same thing in the past and the gov't agent knew she would ask for the main character to bring her a child. If this were real life, you would quickly dismiss her as a fraud. For the majority of the film, everything points to this being a full fledged cult right up until the last moment when the secret handshake turns everything upside down. If a movie wants to suspend your disbelief, it needs to do better than that. Maybe this movie should have planted more clues along the way and reveal them at the end. Or walk a thinner line between a cult leader and a time traveler. But just pulling a 360 right at the end with nothing to back it up doesn't work for me. Overall, I think it was a slightly above average effort. The production values were awesome, but the plot lacked because of the the abrupt and unfulfilling ending. I know a believable ending for this kind of movie is extremely hard to accomplish, but this movie didn't really try to give us that.",
         "I loved this film. Must be watched without distraction, to allow yourself to be immersed in the mood and flow of the piece, to feel at times like a person investigating a cult, at times like a person with doubts, at times like a person embracing it, while at times as a person ... in bewilderment ... and wonder. Emotions that draw you in, just as they draw in the cult members. Needless to say this is not a special effects film, despite the \"science-fiction\" question it raises. It is all about the people. All those involved in writing, producing, financing, directing, and acting in this film, deserve an incredible amount of credit.",
         "I saw Sound of My Voice at its SXSW following its premiere at Sundance. It is a weird little film about a two documentary filmmakers investigating Maggie - a cult leader who claims to have traveled back from the future. It was made on a shoestring budget which can be seen in some of its sound and editing. While the film is a decent first effort by some talented amateur filmmakers, it feels oddly unfinished. The acting is okay, but nothing spectacular. The script is a classic presentation of the one of the oldest of cinematic and literary conflicts between faith and reason. Do you believe that Maggie is a time traveler or is she a fraud? The journey is perhaps more interesting than where it ultimately ends up. The trip to that end is worthwhile and really quite creepy and disturbing at times. Maggie is a perplexing enigma and the cult's beliefs and rituals are quite mind-boggling. The cult members seem quite willing to believe anything in the existential quest to give their lives some meaning. They seem to want to be led somewhere and Maggie is very willing to take them. In that sense one can ask what the real difference is between a cult and an established religion. Many scholars would say not that much other than how long they've been around. The final twist is ultimately not all that shocking or truly expected. Still, a good first effort that may allow the filmmakers to move on to bigger and better stuff.",
         "I saw this at the 2012 Palm Springs International Film Festival. An LA journalist and his girlfriend Peter (Christopher Denham) as Peter and Nicole Vicius as Lorna go underground to investigate a cult led by a woman who claims she's from the future. Brit Marling stars as Maggie, the mysterious cult leader with Richard Wharton as Klaus, her dedicated right hand man who brings the members and potential members of the the small group of followers to Maggie's home where she conducts meetings in her basement. Zal Batmanglij directs and co-wrote the script with Marling. Nice music from Rostam Batmanglij with a good-looking production value thanks to cinematographer Rachel Morrison and production designer Scott Enge. This was originally conceived as a 10 part webisode which is why the annoying and unexplainable numbers from one to ten keep popping up every few minutes. Fox Searchlight bought this and turned it into a theatrical release where it debuted as a big hit at the Sundance Film Festival last year. This comes across as more like a TV pilot for some Sci-Fi channel series than a movie. Even if a sequel to it were made as a film, it would spend the entire film just trying to explain and fill in the many unanswered story line subplots and backgrounds. Just too many loose ends here to a semi-interesting story that takes you nowhere. Would probably make a good TV series but this as a film fall flat. I would give this a 6.0 out of 10.",
         "Having seen \"Another Earth\" and \"The East\" in which Brit Marling is both the star and a co-author (plus \"Arbitrage\" where she just has a support part), I wanted to see \"Sound Of My Voice\" which she co-wrote at the same time as \"Another Earth\" and again provides her with a leading role. As with \"The East\", the other co-writer and director is her friend Zal Batmanglij and, as with \"Another Earth\" and \"THe East\". she was also a co-producer. Clearly Marling is a bright and ambitious actress who is not going to wait for good roles to be offered to her, but determined to craft them herself. \"Sound Of My Voice\" was always going to have a limited appeal, since it is so incredibly low budget and markedly slow, but I found it original and mesmerising as it tells the story of Maggie who is either a visitor from the future with some important insights and messages or a complete fraud who is creating a dangerous cult. Out to expose her are Peter (Christopher Denham) and Lorna (Nicole Vicius) who want to make a revelatory documentary but find that Maggie is harder to read and to expose than they imagined. It is a pleasure to find a plot that is different and thought-provoking and Marling is definitely a woman to watch."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["Two documentary filmmakers attempt to penetrate a cult who worships a woman who claims to be from the future."],
      "budget": 0
   },
   "movielensId": 94799,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-01-22",
      "dvdReleaseDate": "2012-10-02",
      "directors": ["Zal Batmanglij"],
      "runtime": 85,
      "movieId": 94799,
      "title": "Sound of My Voice",
      "mpaa": "R",
      "actors": [
         "Brit Marling",
         "Christopher Denham",
         "Nicole Vicius",
         "Davenia McFadden",
         "Kandice Stroh",
         "Richard Wharton",
         "Christy Meyers",
         "Alvin Lam",
         "Constance Wu",
         "Matthew Carey",
         "Jacob Price",
         "David Haley",
         "James Urbaniak",
         "Annie O'Donnell",
         "Laura Leyva",
         "Travis Johns",
         "Piper Mackenzie Harris",
         "Tonita Castro",
         "Jack Griffo",
         "Kyle Hacker",
         "Avery Kristen Pohl"
      ],
      "imdbMovieId": "1748207",
      "originalTitle": "Sound of My Voice",
      "genres": [
         "Science Fiction",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["U8xElfWyexo"],
      "plotSummary": "A journalist and his girlfriend get pulled in while they investigate a cult whose leader claims to be from the future.",
      "tmdbMovieId": 86812,
      "avgRating": 3.41635,
      "releaseYear": "2011",
      "numRatings": 263,
      "posterPath": "/q9hNxBOX0upOU7YULJLSTyPQDMg.jpg"
   }
}