{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1382323",
      "video": false,
      "title": "Phyllis and Harold",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46a9c3a36847f810b2c3",
            "name": "Cindy Kleine",
            "profile_path": null,
            "id": 131884,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.042427,
      "production_countries": [],
      "id": 44997,
      "vote_count": 1,
      "budget": 0,
      "overview": "Phyllis and Harold is a frank journey through a disastrous 59 year old marriage. Drawing on a lifetime of her family's home movies and interviews made over 12 years, filmmaker Cindy Kleine mixes reportage, cinema verite and animation to uncover family secrets and tell a story that could not be shown publicly as long as her father was alive.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         27586,
         244772,
         3981,
         858,
         634,
         17130,
         10818,
         250124,
         513,
         11634,
         112160,
         141,
         437557,
         376867,
         394117,
         297762
      ],
      "original_title": "Phyllis and Harold",
      "runtime": 85,
      "poster_path": "/na90c4GZZf7MFpzZo9Nex2IV9ok.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2010-02-19",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "If you had to do it again...would you?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Cindy Kleine"],
      "runtime": 85,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1382323/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMDUwMjk3Nl5BMl5BanBnXkFtZTgwNTM3NTQyMTE@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "Cindy Kleine undertook a project for 12 years where she interviewed her parents on film and put together the story of their 59 years of marriage with old movies, slides and letters. She originally felt the story was so interesting that she was going to transcribe the interviews and write a screenplay. However, she then realized that the real people saying their own words would be better than any actors she could get to recreate their story. So this filmmaker with the support of her husband Andre Gregory (well known theater and film director best known for \"Dinner with Andre\") put together a most unusual and successful documentary of the story of the marriage and subsequent life of Harold and Phyllis. Her father is shown as the dashing, handsome, confident young dentist who courts his future wife while he is in the army during World War II. He goes on to then develop a successful practice where he can take his wife on vacations all over the world providing all the comforts of life including a devoted nanny for his two children. However, the core of the story is how this marriage is experienced by his wife Phyllis, who is shown to have been a beautiful, articulate and poetic young woman. She shares in interviews with her movie-maker daughter on film her feelings and doubts about her marriage as well as her early secret romantic life, which blossomed again at age 70. Her grown children each find themselves becoming bold participants in a small but significant way in her mother's secret life. The 84 minutes of this film seems to fly by reminding us that everyone's life might be summarized in a well-kept photo album or in a thoughtful documentary if anyone was there to make it. Usually the children, let alone a discerning movie audience do not know parent's innermost secrets. This is the exception and it is an exceptionally creatively edited, well-done documentary. It must have been somewhat therapeutic for Ms. Kleine to have made the film and for sure it will stimulate complicated emotions and discussion in many parents and grown children who view it.",
         "*** This review contains spoilers *** While this was a well made film (great editing, good photography, etc), the subject matter was pretty tedious, and I lost my patience with it. Gee, one more dysfunctional family. What an original idea. The mom and pop are almost stereotypical parents from the 50's. Domineering, patriarchal father. Submissive neurotic mother, and unsure of her life choices as the years roll by. She does get the courage to find a true lover in her 70's (although the neurosis never seems far behind), but it was too late for me. By the time the film got to that point, I had seen too much tripe.",
         "This documentary and the people in it are insane. I think I lost all faith in humanity and in particular the female gender. Basically it is the story of how an wealthy hag kept a secret lover from her decent, hard-working husband. Then when the hag was dumped by her secret lover she mourned him for years. She became disconnected from her children and disconnected from her husband - eventually resenting him. Then 40 years later she hooks up with her ex-lover again and has another secret affair. This time her horrible, shameless and self-promoting daughters arrange the affair. Clearly they take after their mother. Genetics can be a beast..... Anyway, this is all for a childish fantasy of what Walt Disney portrays as love. I really felt horrible after watching this. I cannot imagine the pain the poor old man endured over the years living with someone who was that narcissistic. Anyway the story should have been about how YOU will hate your spouse if you feel guilt every time you look at him or her. So, don't start relationships with other people and hide it. Poor Harold. If there is a hell, Phyllis has a spot saved for her. I only wish she had choked on the sheep bone instead of Harold. I guess life isn't fair though."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Rainbow Releasing",
         "Silver Penny Pictures"
      ],
      "summaries": ["A journey through a disastrous 59 year old marriage. Drawing on a lifetime of her family's home movies and interviews made over 12 years, filmmaker Cindy Kleine mixes reportage, cinema verite and animation to uncover family secrets and tell a story that could not be shown publicly as long as her father was alive."],
      "budget": 250000
   },
   "movielensId": 94891,
   "movielens": {
      "languages": [""],
      "releaseDate": "2010-02-19",
      "dvdReleaseDate": "2010-06-08",
      "directors": ["Cindy Kleine"],
      "runtime": 85,
      "movieId": 94891,
      "title": "Phyllis and Harold",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1382323",
      "originalTitle": "Phyllis and Harold",
      "genres": [
         "Documentary",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Phyllis and Harold is a frank journey through a disastrous 59 year old marriage. Drawing on a lifetime of her family's home movies and interviews made over 12 years, filmmaker Cindy Kleine mixes reportage, cinema verite and animation to uncover family secrets and tell a story that could not be shown publicly as long as her father was alive.",
      "tmdbMovieId": 44997,
      "avgRating": 3.83333,
      "releaseYear": "2010",
      "numRatings": 3,
      "posterPath": "/na90c4GZZf7MFpzZo9Nex2IV9ok.jpg"
   }
}