{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "super power",
            "id": 33637
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "doomsday",
            "id": 34161
         },
         {
            "name": "superhuman strength",
            "id": 179102
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0934706",
      "video": false,
      "title": "Superman: Doomsday",
      "recommendations": [
         22855,
         14011,
         45162,
         17445,
         103269,
         30061,
         76589,
         56590,
         166076,
         15359,
         69735,
         13851,
         43641,
         65291,
         30675,
         14919,
         217993,
         14609,
         16234,
         142061
      ],
      "backdrop_path": "/amXWhCkrsN7p9S6rnLCgD9fNwE6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Superman / Clark Kent / Dark Superman (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597cd",
               "name": "Adam Baldwin",
               "profile_path": "/vhZ8AD36h09mBLuyIXboglRLgIu.jpg",
               "id": 2059,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Lois Lane (voice)",
               "gender": 1,
               "credit_id": "52fe45869251416c750597d1",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Lex Luthor (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597d5",
               "name": "James Marsters",
               "profile_path": "/oJnBB3g2IINnsLSr8B79bJ9ykkx.jpg",
               "id": 47297,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Toyman (voice)",
               "gender": 0,
               "credit_id": "52fe45869251416c750597d9",
               "name": "John DiMaggio",
               "profile_path": "/4gEy7tWkh95mgfsiHmTuFQkeRkx.jpg",
               "id": 31531,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Martha Kent (voice)",
               "gender": 1,
               "credit_id": "52fe45869251416c750597dd",
               "name": "Swoosie Kurtz",
               "profile_path": "/sISOxpV6zn3EfC5uKVsX7s9xLBf.jpg",
               "id": 12967,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Robot (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597e1",
               "name": "Tom Kenny",
               "profile_path": "/uU2VLWHkKZN0UkYVJBf1s1z2l3k.jpg",
               "id": 78798,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Perry White (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597e5",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mercy Graves (voice)",
               "gender": 1,
               "credit_id": "52fe45869251416c750597e9",
               "name": "Cree Summer",
               "profile_path": "/f2ezohBr8bBuLl85YTV2UNOa5j5.jpg",
               "id": 34985,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Jimmy Olsen (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597ed",
               "name": "Adam Wylie",
               "profile_path": "/qSeYVaE3HKf62J4WQY12mEAKjbz.jpg",
               "id": 21402,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Damon Swank (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597f1",
               "name": "Chris Cox",
               "profile_path": "/sdLuGpLB0g5AtEr9VVnAqtIbZPt.jpg",
               "id": 136930,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Newscaster (voice)",
               "gender": 0,
               "credit_id": "52fe45869251416c750597f5",
               "name": "Hettie Lynne Hurtes",
               "profile_path": "/eK8h640jtiZS3Uw9P7M4Lx6JIfm.jpg",
               "id": 103219,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Officer Tucker (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597f9",
               "name": "James Arnold Taylor",
               "profile_path": "/y8SCPH3ackhej26YH5sKps0g7Ch.jpg",
               "id": 19506,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Drill Operator (voice)",
               "gender": 2,
               "credit_id": "52fe45869251416c750597fd",
               "name": "Townsend Coleman",
               "profile_path": "/j7PvxQ7XuOQc1ggSRHWRP6CB8CU.jpg",
               "id": 35035,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Murphy (voice)",
               "gender": 1,
               "credit_id": "52fe45869251416c75059801",
               "name": "Kimberly Brooks",
               "profile_path": "/zKOUdq1MYUeQSiaWN1Yh0eFMXHg.jpg",
               "id": 54427,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45869251416c750597b7",
               "name": "Lauren Montgomery",
               "profile_path": "/3SOXrdBr9bISY7fDeZWmeUJjxbV.jpg",
               "id": 74863,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45869251416c750597bd",
               "name": "Bruce Timm",
               "profile_path": "/2MaucKEFexM0MMcpsHHbDtDVZbk.jpg",
               "id": 34934,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45869251416c750597c3",
               "name": "Bruce Timm",
               "profile_path": "/2MaucKEFexM0MMcpsHHbDtDVZbk.jpg",
               "id": 34934,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe45869251416c750597c9",
               "name": "Duane Capizzi",
               "profile_path": null,
               "id": 74864,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "5547906cc3a36816bf0049b4",
               "name": "John Dillon",
               "profile_path": null,
               "id": 1460488,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554452d5c3a3680cd50037f1",
               "name": "Tristin Cole",
               "profile_path": null,
               "id": 1450356,
               "department": "Art",
               "job": "Background Designer"
            },
            {
               "gender": 2,
               "credit_id": "56a95b3bc3a36872db002170",
               "name": "Jay Oliva",
               "profile_path": "/y7EbnuoKFMvU7uZ4aD50jThyNoF.jpg",
               "id": 105643,
               "department": "Writing",
               "job": "Storyboard"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.502256,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13640,
      "vote_count": 178,
      "budget": 3500000,
      "overview": "When LexCorps accidentally unleash a murderous creature, Doomsday, Superman meets his greatest challenge as a champion. Based on the \"The Death of Superman\" storyline that appeared in DC Comics' publications in the 1990s",
      "similar": [
         1924,
         1452,
         297762,
         8536,
         30061,
         65291,
         9531,
         69735,
         49521,
         209112,
         141052,
         272,
         155,
         382322,
         287947,
         251519,
         14011,
         11411,
         40662,
         379291
      ],
      "original_title": "Superman: Doomsday",
      "runtime": 75,
      "poster_path": "/3of4nShmv1hBmrebOQqGlfZ9ZL0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Comics",
            "id": 429,
            "origin_country": "US"
         },
         {
            "logo_path": "/WkipqT3yVydHqKbS7lAMod9hc8.png",
            "name": "Warner Home Video",
            "id": 2786,
            "origin_country": "US"
         }
      ],
      "release_date": "2007-09-18",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Where were you the day Superman died?",
      "adult": false,
      "homepage": "http://www.warnerbros.com/superman-doomsday",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Lauren Montgomery",
         "Bruce W. Timm"
      ],
      "runtime": 75,
      "synopsis": "In Metropolis, Lois Lane tries to sell editor Perry White on a story exposing Lex Luthor's phony charity scam. Perry will have none of it and tells Lois to let it go, then urges Clark Kent to be careful on his foreign correspondent assignment--and to try to remember to write the occasional story. Clark bids Lois and Jimmy Olsen goodbye. Later, at his Fortress of Solitude, Superman agonizes over the fact that even with all his amazing powers he cannot come up with a cure for cancer, lamenting that he wants to be more than Earth's resident strongman. Lois asks Superman why he insists on bringing her to the Fortress so they can be alone, and then accuses him of hiding his greatest secret from her--his true identity, which she claims she all but knows for certain already. Superman claims that he's doing so to keep her protected, but she insists he's doing it because he's afraid to commit. Elsewhere, outside of Metropolis, scientists working for Luthor uncover an alien spaceship. They accidentally open the ship, releasing a monster who kills them all and begins a destructive and murderous rampage towards the city. At the Fortress, Superman's robot alerts him to the trouble, identifying the monster as a genetically engineered Doomsday weapon designed to destroy anything in its path. Superman flies Lois to Metropolis, then engages the monster in a terrific battle. The battle rages across the city until Superman flies Doomsday up into the stratosphere and brings the monster hurling down again, smashing a crater into the city of Metropolis. Doomsday is defeated, but Superman falls lifeless to the ground and dies in Lois's arms. Lois, Perry, and Jimmy are among the thousands at Superman's funeral. Lois sees an elderly woman whom she recognizes from a photo on Clark's desk as his mother. Even Luthor arrives to apparently pay his respects. Later, when Perry urges Lois to take some time off, she journeys to Smallville and visits Martha Kent, saying that she (Lois) and Martha's son (as Superman) had been intimate for several months, and that Martha was the only other person who could understand how Lois felt in the aftermath of Superman's death. Martha invites Lois in for a cup of coffee. With the loss of its greatest protector, the city of Metropolis is overrun by criminal activity. When the Toyman holds a schoolbus filled with children hostage atop a tall building, Lois attempts a rescue. She manages to free most of the children, but the Toyman throws the bus from the roof with Lois inside it. The bus plummets to the ground, but is caught at the last minute--by Superman, who has miraculously returned from the grave! Superman flies Lois to her apartment, where they say goodbye. Lois is concerned that Superman doesn't seem quite himself, but he passes that off as lingering effects from his near death experience. Superman makes his way to Lexcorp towers, where he finds Luthor in a room lit by red sunlight and brandishing a pair of kryptonite-studded gloves. Luthor beats Superman mercilessly, accusing him of leaving before his time. Luthor compliments the unconscious Superman for doing a very good job convincing the world that the Man of Steel had returned, then goes to a private lab where the body of the real Superman hangs in a suspension tank. Later, at the Fortress of Solitude, Superman awakens on medical bed, attended by his robot. The robot explains that Superman's body had all but shut down following his battle with Doomsday, and that it took the robot some time to locate its master after Luthor stole the body. The robot tells Superman that Luthor had created a clone which was passing itself off as the real deal. Superman instructs the robot to do everything possibe to help him get back to full strength. Luthor discovers that Superman's body is missing from his lab. Meanwhile, in Metropolis, the clone Superman hears that the Toyman had escaped prison and killed a little girl. Enraged, the clone grabs the Toyman and flies him high into the air, throwing him back to the ground. He explains to a shocked public that an example needed to be set, to prevent other criminals from similar actions. The dark clone then receives an assignment from Luthor--investigate Lexcorp competition and find Superman's body. Lois visits Luthor, seemingly grieving, but knocks him out with a sedative and, with Jimmy's help, uncovers Luthor's secret lab, where he has grown hundreds of Superman clones to serve as his personal army. The dark Superman arrives and destroys the lab. Luthor hides in his red sunlight room, but the clone locks him in there, tears the room out of the building, and hurls it to the ground. The real Superman has been receiving direct sunlight exposure and undergoing massive physical therapy to bring him back up to full strength. Although he still has recovery to do, he realizes he has to face his dark clone and flies to Metropolis. His robot gives him a kryptonite gun as a way of evening the odds. The army confronts the dark Superman, insisting that he must answer for his recent actions. Superman destroys their tanks and jets with his heat vision just before the real Superman arrives. The dark Superman claims that he is doing what is best for the people of Metropolis, but the real Superman says that the killing has to stop. Dark Superman easily disarms the real deal of the kryptonite gun, sending it miles away. The two fight in a massive battle, but the real Superman is poorly matched against his full strength doppleganger. Lois and Jimmy drive to the other side of town and retrieve the kryptonite gun. In the final confrontation at the Superman memorial, Superman again gives all he has to defeat his enemy. Just as it looks like this fight will end as tragically as his last one, Lois arrives with the kryptonite gun. After a lucky shot, however, Dark Superman destroys the weapon. In the scuffle, the kryptonite charge gets wedged into Dark Superman's costume, and Superman detonates it with a blast of heat vision. With his dying breath, Dark Superman begs Superman to protect the people of the Earth, and Superman affirms that that's why he is here. Superman convinces Lois that he really has returned this time, and agrees that they should have no more secrets--confirming that he is, in fact, Clark Kent. From his office in Lexcorp, Lex Luthor vows that one day, he will destroy Superman.",
      "writers": [
         "Duane Capizzi",
         "Bruce W. Timm"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0934706/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMTcxNTQ3MF5BMl5BanBnXkFtZTcwMTE4MTM1MQ@@._V1_SY317_CR28,0,214,317_AL_.jpg",
      "actors": ["Stars: Adam Baldwin, Anne Heche, James Marsters | See full cast and crew »"],
      "reviews": [
         "I saw the premiere of Superman Doomsday on July 26, 2007 at the San Diego Comic-Con. It rightfully earns a PG-13 rating for some very intense violence. Although impossible to condense the epic comic book saga into about 80 minutes, the movie captures the essence of the comic book series. The story moves along briskly in the first and third acts, with lots of death and destruction. The second act looks poignantly at a world without Superman. The scene between Lois Lane and Martha Kent brought a tear to my eye. The animation is of high quality. The characters are drawn somewhat differently than in previous incarnations. The way they drew the character cheekbones was a bit distracting at first, but I soon got used to it. Otherwise, the characters and the animation were quite nicely done. Overall, I enjoyed Superman Doomsday a lot and I look forward to more PG-13 interpretations from the DC universe.",
         "Saw this at the San Diego comic con and the 2 hour wait was worth it! Now this is a fresh take on the Death of Superman (obviously only an hour and half long verse how many comic book issues?) but what a movie! This does deserve the PG-13 rating as your going to see Superman and Doomsday in a nasty street fight! (There was also one bad word in the movie too) Then there is Lex Luther. You will hate this bastard (oh yeah, he goes over the top to prove what a scum bag he is). Yes it is animated but unlike the other DC animated movies this one is probably not for the wee ones (2-7). There is a quit a bit of death in this movie, not bloody or gross but this movie would make Robocop say \"that's a lot of bodies.\" And that is the first 20 minutes. But once you start watching this one you will be glued regardless if you watched any of the Superman movies before (animated or live action). Don't get popcorn till the middle of this one as your going to spill it in the opening from saying \"DAMN! Can they do that?\" And then when it is over you can ponder if you should open up a construction business in Metroplis as they will need it.",
         "I'm not a fan of Singer's Superman Returns, and sadly the last Superman animated feature \"Brainiac Attacks\" was so much full of action, that the characters became too pale. But here the action and character scenes are properly balanced. The animated Lex Luther is as always much better than any of the life-action versions. Clancy Brown voice gave Luthor a dangerous tone. I never thought it possible that James Marsters is up to the job to replace him. But he did it well. It's a different Luthor somehow. Much more psycho if you want. Bruce Timm and company did a good movie out of a rather boring Comic series from the 90's. After this I'm looking forward for more Bruce Timm movies. I would also welcome another Batman animated movie as long as it's Kevin Conroys version and not that crappy Batwave series. Ah yes... this movie is far better than the new Marvel animated features. Only the first Avengers was fine and has to be excluded.",
         "as an animated movie,this one isn't too bad.i liked the story and the great action sequences and there are some great fight scenes.but if you're really into the history behind the battle between Superman and Doomsday and the aftermath(in other words,if you've read the comic version of the events)you might be disappointed,as i don't think it is that faithful to the source material.but beyond that,the movie does seem a little rushed.i think they may have tried to jam too much into the short 75 minute running time.still,the movie is entertaining.you shouldn't get bored watching it.DC has done better though and although i liked it,it wasn't as good as i had hoped or expected.all in all,though,i'd Give Superman:Doomsday a 7/10 based on it's entertainment value.",
         "I couldn't even decide on whether to give it a 7 or 8, and the 8 almost won out if it would have meant it would stay higher than SUPERMAN RETURNS: for that is the benchmark for how wrong Warners can get Superman and yet fool so many people into thinking it's \"really Superman.\" As for this film, it's a little better, but still has its problems, so it gets a 7. The relationship between Lois and Superman is such that they appear to be sleeping together, but she doesn't know he's really Clark Kent. This IS decidedly un-Superman-like; however, the film is advertised as being one with more of a \"badder\" Superman and as generally being \"darker.\" It doesn't pee on our shoes and tell us it's raining like SUPERMAN RETURNS. The story is a loose adaptation of not one, but THREE Superman sagas, that were later graphic novels: \"Doomsday\" (a.k.a. THE DEATH OF SUPERMAN), \"Funeral for a Friend,\" (a.k.a. WORLD WITHOUT A SUPERMAN), and \"Reign of the Supermen\" (a.k.a. THE RETURN OF SUPERMAN). Doomsday's origin is very different, as are aspects of Superman's life before the battle. No other super-heroes are mentioned. And perhaps most radical (and disappointing) is the exclusion of the four alternate Supermen of the comics. Instead, Superman dies at the hands of Doomsday, who was unearthed by employees of Lex Luthor. He starts his rampage and Superman dies. Afterwards, a mysterious new Superman emerges. It's not long before we learn that he/it was created by Lex Luthor to take the place of Superman. The clone eventually becomes a tyrannical overlord of Metropolis and the real Superman--at reduced power--has to take him out. Some will object to the language, the relationship of Lois and Supes, and some of the more violent scenes. The character of Toyman is the first victim of the faux Supes, but some might even find it justified in that he'd killed a little girl. Moreover, when we first see the Toyman (designed to look like something out of Tim Burton's sketchbook, which may be significant to note) he has a bus full of kids trapped. Nothing is ever stated, but one must wonder if he's trying to imply that he's a child molester in this version of reality. The character designs are okay, but Superman might look a little too old for some peoples' tastes, and like Kate Bosworth in SUPERMAN RETURNS, Lois might look a tad young. For longtime fans of the SUPERMAN/JUSTICE LEAGUE cartoons of recent years, the new voices might take some getting used to. The biggest problem with the film is that everything seems to happen too fast. We barely feel the loss of Superman before the impostor shows up. And like many superhero vehicles, there are certain things that are, perhaps, somewhat comicbookish. For one thing, Superman is revived at, say, 67%. What does that mean to the typical viewer? That he's 67% as strong as he usually is? If so, what are the upper limits? Is the \"Superman\" he's battling necessarily at 100% himself? And like so many comics, the anti-hero (the faux Superman)'s big crime is that he murdered Toyman and the film regards it as wrong. However, Superman himself appears to be trying to kill his doppleganger, making it seem somewhat hypocritical to say the least. Ultimately, the story about Lex's Superman clone is just not as interesting as \"Reign of the Supermen,\" which kept comic book fans guessing in 1993. Sure, the cat's out of the bag now, and it would be in need of some changes, but it's simply a better story. This mixed with mediocre character designs and ideas that are created simply for shock value, make this outing just pretty good as an experiment. I just hope future direct-to-DVD DC (that's a mouthful) projects are better.",
         "This movie was good or maybe great for what it is, but it felt short changed. The fight between doomsday was WOW! The funeral was GREAT! The resurrection was good, but I was expecting to see Superman return from the afterlife the way it was depicted in the comics. They also should have showed Doomsday demolish JLA. I understand this is a'Superman only' story, but it would have only taken 5 minutes for Doomsday to demolish JLA. That would have amplified Doomsday more and the rest of the 65 minutes could be focus on Superman! Jimmy could have said: \"My God Lois, Doomsday defeats JLA in 5 minutes! How on Earth will Superman defeat him!\" In the comics there was four characters who appear to replace Superman. In the movie there is only one...a clone. Note in the comics the clone is actually the cyborg, but I guess the filmmakers wanted to change that too. All in all, a very fun movie. This movie is loosely inspired by the Death and Resurrection graphic novels. If you can accept that, then you'll enjoy it. I admit...I did.",
         "It looks like Superman gets much better scripts for animated movies than he does for the big screen, lately. After I found myself highly disappointed by the latest big screen installment, I regained comfort and joy by watching this amazing, entertaining gem. If you know the Death Of... Funeral For... The Return of storyline, you know what to expect. Right? Wrong! The guys at Warner Bros were smart enough to change several details, which highly adds an edge-of-the-seat element to this movie. First, it looks great. The soundtrack is great, the locations look great. Having the action taking place mostly at night really makes this movie really atmospheric. Some scenes are very brutal and hard to swallow, even for an animated movie. Once again, they were smart enough not to unnecessarily prolong these. They still leave a mark though. After only a few minutes, you find yourself really caring for some characters while starting to really hate others. So does this movie succeed, overall? Hell, yes. In fact, it's the best Superman movie since Superman II and a great comic book adaptation. Some people are complaining about not having all the fake Supermen running around through Metropolis in this one, \"just like in the comics\". I for one loved the fact that they did NOT include them, I always thought that the \"Reign Of The Supermen\" story was just a commercial attempt to increase sales by prolonging Superman's disappearance and keep the readers interested in the book for as many months as possible. That particular story didn't add anything of essence to the DC Universe, which includes too many weird, filler superhero characters anyway. Besides, applying the exact storyline would have resulted in a boring movie. You would have known what happens and would see Superman on the screen only for the first and last 10 minutes. Are you sure you would have preffered that? Don't rent it, buy it ! It's really worth it.",
         "I read the comics for this story when it came out, much like everyone else at that time because it was the biggest story to ever happen to superman. So naturally, when i saw Superman: Doomsday, i figured it would be an adaptation of the classic comic book story. I was wrong. With this movie, its like they pick and choose which parts of the comic story they like and don't like, then reassemble it with their own writing and take on it... the main problem i have with it is, their take sucks. I think what a lot of people would want to see in an adaptation of this story is the best part, The Reign Of The Supermen, and thats the part they botched up the worst. After superman dies his body is stolen by Luthor and Luthor makes a clone (in the comics this was done by Cadmus, a creepy underground research facility, and the product was Superboy..)His clone starts out protecting metropolis but takes an awful twist as he has been raised and tortured by Luthor (remember Bizzaro, anyone?)so the clone of Superman starts killing criminals, which isn't a very super thing to do to say the least. Meanwhile, Supermans body is stolen again, by a robot helper from the fortress of solitude, and put into a fluid tank (The eradicator does this in the comic books.) Back in Metropolis, Lois and Jimmy Stumble upon Luthors cloning facility, and Luthor isn't pleased with it. The first clone of Superman finds it at the same time as well, and destroys it, saving Lois and Jimmy from Lex (amazing how timing works in these movies...) The clone then tries to kill Luthor. Its not long after this that The real Superman at the fortress of solitude decides its time to return to metropolis and evict the impostor. The result is in another huge battle in the poor city of Metropolis. the victor should be obvious. My final thoughts: Why does Metropolis have to get screwed up twice in one 75 minute movie? in the comics, they made coast city into a huge machine. machine city they called it... drove the green lantern insane... wheres the four supermen? bibbo? heck, i even miss the guardian and that character sucked.... there's just so much content in the comic book story and so little in this movie. its just a real let down if you know the story i guess...",
         "Superman/Doomsday is supposedly based off the phenomenal and epic comic arcs, \"The death of superman\", \"Funeral for a friend\", and \"The Return of superman\". I've gotten a chance to see the full preview of this movie and now i'm going to give you my review of it. This movie is a bit darker than your typical superman movie and/or series; they pull no punches with the violence so expect blood, death, and a bit more deeper tones that may not be for younger kids and I'm saying this cause this movie has a lot of adult tones that may not be for children who are a big fan of shows like, \"Justice Leauge\" or \"Superman: the animated Series\". The fight scenes are fast, furious, really brutal, and just as much vicious which all the means you will probably like; the story line \"Somewhat\" sticks to the comics which is good but its also its greatest flaw which I will explain soon. Adam Baldwin as superman was pretty good but i rather had Tim Daly again as superman he made that character work on the series and some of the movies so it would of seemed fair to bring his voice back again to have some fans of the series familiar with the tones but all in all he did his job and it worked for this movie; but James marsders (Spike from Buffy and angel)as Lex Luther did NOT, he sounded bland, no emotional depth to the character and not much feeling of synergistic grandeur like the voice of the person playing lex in the justice league series honestly you'll watch this film and will be asking that same question, \"where's that other dude's voice-over from Justice league?\" other voice-overs like Anne heche as Lois, Swoozy kurtz as Clark's adopted mother did their job well but you wouldn't really notice all of that as the movie picks up steam but at the same time falls short quickly with the story. For a movie that's at least an 1 hour and 45 minutes they should of pushed it for a normal movie length for 2 hrs cause there's a lot of story that was missing from this movie; For comic fans, most will notice it on the fly like where's the four impostor superman that took his place?, where's the justice league (Booster Gold, etc.) that at least stalled time against doomsday for the inevitable battle?, Wasn't super girl in this as well?, how come they didn't get into detail about Doomsday background to at least understand why he is the way he is (even though its mentioned briefly) along with other plot holes? For those that haven't read this comic or novel you probably wouldn't really care and the movie will fly by with fast paced violence and cool fight scenes. I gave this movie a 6 out of 10 for the fact that even though this movie did it's job to discuss his death and made it a pretty climatic battle which I did enjoy; the artwork was a bit off not your typical superman: TAS artistry some might like it and some like myself would find it and the character design a bit flimsy and off. The story was worked both good and bad...even though it discussed some of the events leading to superman's \"Demise\" and apparent return it didn't really stick to the comics Ergo, it's missing A lot of story to the main premise and a lot of characters that made the comic fun, exciting, and deeply story driven and you will be asking where are they in this. Even though this movie is pretty good, dark, action-driven it missed the mark with a lot of plot holes which i felt they were compressing to make the movie faster but if they kept it in they would of had a good epic animation event that would of made this movie just as much good as if they kept it out! Hopefully, they will make an extended cut or something along the way. which i doubt.",
         "I never read the comic books but I enjoyed the Animateds SEries and the JLA on TV so I bought this DVD and watched it. It was okay for what it was. This is definitely an adult cartoon. With lots of violence but I guess so is the JLA and JLA unlimited, even though some young kids watch it. But this movie was very weak. Number one I didn't like the animation of Superman. I didn't get the reason for all the lines in his face. Lex Luther though voiced okay was too thin and not imposing enough. I have read that some other superheroes try to take Superman's place after he dies. That would have been interesting. I agree with another comment that refers to an episode of the JLA where they did a funeral for superman. It was done a whole lot better there. So this was just average. 5/10"
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["Warner Bros. Animation"],
      "summaries": ["When LexCorps accidentally unleash a murderous creature, Doomsday, Superman meets his greatest challenge as a champion. Based on the \"The Death of Superman\" storyline that appeared in DC Comics' publications in the 1990s."],
      "budget": 3500000
   },
   "movielensId": 95004,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-09-18",
      "dvdReleaseDate": "2007-09-18",
      "directors": [
         "Lauren Montgomery",
         "Bruce Timm"
      ],
      "runtime": 75,
      "movieId": 95004,
      "title": "Superman: Doomsday",
      "mpaa": "PG-13",
      "actors": [
         "Adam Baldwin",
         "Anne Heche",
         "James Marsters",
         "John DiMaggio",
         "Swoosie Kurtz",
         "Tom Kenny",
         "Ray Wise",
         "Cree Summer",
         "Adam Wylie",
         "Chris Cox",
         "Hettie Lynne Hurtes",
         "James Arnold Taylor",
         "Townsend Coleman",
         "Kimberly Brooks"
      ],
      "imdbMovieId": "0934706",
      "originalTitle": "Superman: Doomsday",
      "genres": [
         "Action",
         "Animation",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "wF-xuGkRoC4",
         "etcAXiSCwZM"
      ],
      "plotSummary": "When LexCorps accidentally unleash a murderous creature, Doomsday, Superman meets his greatest challenge as a champion. Based on the \"The Death of Superman\" storyline that appeared in DC Comics' publications in the 1990s",
      "tmdbMovieId": 13640,
      "avgRating": 3.12992,
      "releaseYear": "2007",
      "numRatings": 127,
      "posterPath": "/3of4nShmv1hBmrebOQqGlfZ9ZL0.jpg"
   }
}