{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "true crime",
            "id": 33722
         }
      ],
      "imdb_id": "tt0119579",
      "video": false,
      "title": "Love's Deadly Triangle: The Texas Cadet Murder",
      "recommendations": [239498],
      "backdrop_path": null,
      "revenue": 161001698,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Diane Zamora",
               "gender": 1,
               "credit_id": "52fe4cafc3a368484e1c280d",
               "name": "Holly Marie Combs",
               "profile_path": "/smZy91UWhB8bZib6A28kTQ8w9sT.jpg",
               "id": 26469,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "David Graham",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c2811",
               "name": "David Lipper",
               "profile_path": "/fHrDnu092nFxipXvsruvWwsbLxK.jpg",
               "id": 110018,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Adrianne Jones",
               "gender": 1,
               "credit_id": "52fe4cafc3a368484e1c2815",
               "name": "Cassidy Rae",
               "profile_path": "/gBL4lXCi40z9euCV06q2VXGhsFI.jpg",
               "id": 139871,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Linda Jones",
               "gender": 1,
               "credit_id": "52fe4cafc3a368484e1c2819",
               "name": "Dee Wallace",
               "profile_path": "/zDM6pOTQJfhuOl4HB66Axj01c1F.jpg",
               "id": 62001,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Detective Carl Baker",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c281d",
               "name": "Gary Grubbs",
               "profile_path": "/zbSSBFW8oRl4M1u2vyr1PUnWqCw.jpg",
               "id": 68180,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Detective Tom Green",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c2821",
               "name": "Kurt Fuller",
               "profile_path": "/rZUUgDoYTfYwbh87V7E4VVWUPlh.jpg",
               "id": 29685,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Val",
               "gender": 1,
               "credit_id": "52fe4cafc3a368484e1c2825",
               "name": "Joanna Canton",
               "profile_path": "/gInYKC1HfTat2r2fXYlf2S12U1X.jpg",
               "id": 73403,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bryan McMillan",
               "gender": 0,
               "credit_id": "52fe4cafc3a368484e1c2829",
               "name": "Chad Carlberg",
               "profile_path": null,
               "id": 1183800,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Larry Sweet",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c282d",
               "name": "Jack Landry",
               "profile_path": "/dYpcvvdNwnkb4BXRNtdiZAFsu7V.jpg",
               "id": 1183801,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Donna",
               "gender": 0,
               "credit_id": "52fe4cafc3a368484e1c2831",
               "name": "Karyn Beach",
               "profile_path": null,
               "id": 1183802,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c2835",
               "name": "R. Keith Harris",
               "profile_path": "/3Eegxll6kG7BGYJiQJNPtz8Q8gW.jpg",
               "id": 141191,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Gloria Zamora",
               "gender": 0,
               "credit_id": "52fe4cafc3a368484e1c2839",
               "name": "Derin Altay",
               "profile_path": null,
               "id": 1183803,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Carlos Zamora",
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c283d",
               "name": "Andrew Masset",
               "profile_path": null,
               "id": 1183804,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Perry",
               "gender": 0,
               "credit_id": "52fe4cafc3a368484e1c2841",
               "name": "Wilmer Calderon",
               "profile_path": "/v6ZSzY6mKyC5xRQpxbJHt2HsJhB.jpg",
               "id": 59672,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Susie",
               "gender": 1,
               "credit_id": "52fe4cafc3a368484e1c2845",
               "name": "JoAnna Garcia",
               "profile_path": "/azuqwKgsOsY8qDNw9Tb3d8BZiMd.jpg",
               "id": 99206,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c27fd",
               "name": "Richard A. Colla",
               "profile_path": null,
               "id": 40391,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cafc3a368484e1c2803",
               "name": "Steve Johnson",
               "profile_path": null,
               "id": 1130240,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cafc3a368484e1c2809",
               "name": "Skip Hollandsworth",
               "profile_path": "/eO4eqU2vtFkYOjdJmYRnytvolgL.jpg",
               "id": 995326,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.456487,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 201703,
      "vote_count": 4,
      "budget": 14000000,
      "overview": "Based on a true story, this film recounts the story of Diane Zamora and David Graham, two high school sweethearts who swear to always be together, even as they enter separate military academies. But when David confesses he had an affair with a classmate, Diane has an ultimatum, leading the two into a murderous pact with severe repercussions.",
      "similar": [
         15069,
         984,
         11423,
         357096,
         979,
         96,
         807,
         4771,
         75780,
         281,
         395834,
         281957,
         445954,
         25376,
         21484,
         3134,
         10651,
         12143,
         2749,
         18587
      ],
      "original_title": "Love's Deadly Triangle: The Texas Cadet Murder",
      "runtime": 93,
      "poster_path": "/icYCbrSnY2XZk7oGGyEwYWnGaLu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Steve White Entertainment",
         "id": 15017,
         "origin_country": ""
      }],
      "release_date": "1997-02-20",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard A. Colla"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Skip Hollandsworth",
         "Steve Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119579/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NzYxMzIzMF5BMl5BanBnXkFtZTcwMjY5MTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Holly Marie Combs, David Lipper, Cassidy Rae | See full cast and crew »"],
      "reviews": [
         "This story is loosely based on the real story of Diane Zamora and David Graham. It was recently played on Lifetime Television for women because the real life Diane Zamora wed a fellow inmate in a civil ceremony (stood in by her mother and a friend) a few weeks ago. This story is sick and sad, a young couple so caught up in one another they become fanatically jealous. What is truly sad is that Diane and David, who commit a murder due to David's infidelity, turn on one another in the court. Their strong love wilted to personal defense and bad mouthing. Like most television movies (and admit it, we are all suckers for tv movies) this film plays up the sex, lies, and murder. If you want the true story, buy the book or hit up the various sites on google. If you want an interesting melodrama or to see some early work of the sweet and fun Holly Marie Combs, watch this. It is well shot and acted for a Lifetime Movie and tells such a sad story of two people who could have been so much. ______________________________",
         "This might give a spoiler but Its based on the Diane Zamora (played by Holly Marie Combs of Charmed) and David Grahm case. David cheats on Diane and she finds out and she wants revenge and she convinces David to kidnap and kill the girl that he slept with. Then the police have someone else as a suspect so they over look David and Diane but they go on thier way to the army and navy but Diane brags about killing the girl and the other cadets tell on her and the police start investigating it more and find out that David and Diane were the real killers and needless to say they both pleaded innocent and are in jail right now serving thier sentance it was a stupid crime it was senseless to kill that girl but i remember reading about it in a news paper about 4 years ago when it would have happened. too bad they did that they would have graduated the army and navy this year. They would have been the class of 2,000 they ruined their young life.",
         "I loved this movie! It's one of Holly's best. I like seeing her playing different roles. She plays a jealous girlfriend perfectly. David Lipper does a fantastic job also. It's become one of my favorite movies I've ever seen. I may have only watched it once, but it's stayed with me ever since I watched it. I would love to see it again! I never heard of Cassidy Rae before this movie, and it makes me want to watch more of her stuff. She's one of those actresses that you know is going to have big things happen for her. I would highly recommend this movie to others. It's one of Holly's best work, besides Charmed. I didn't realize how good of an actor David Lipper was until this movie. I'm really glad that I watched it, I will remember it forever.",
         "I caught this movie on the lifetime channel back in July and was kind of freaked out by it. I watched it because i like the work that Holly Marie Combs does. Well, I watched it and at first i was like umm this is going to be weird. Mainly because intercourse for 30 minutes is not all that appealing to me. But then it picked up and i got really interested. Then all of a sudden it became very chilling to watch and it was like i can't believed this really happened. It got really freaky and i was like in total shock for a couple of days, but then i got to thinking about what a really good movie it was. I would totally recommend this movie to all my friends for a creepy night out. 9 out of 10!!",
         "I have watched this a few times on Lifetime when I was bored and there was nothing else on. The acting is okay. It is interesting to see Holly Marie Combs play a murderess and she does a decent job. The movie tries to hard to make David look sympathetic and Diane look evil. Cassidy Rae does a fair job as Adrienne however based on this film and other performances I feel her acting talent is limited. In someways the film, except for the end where you see Adrienne's mother, makes it more about how sorry we should feel for David as opposed to the girl who was brutally murdered. The film makes David out to be a victim who didn't want to kill but was forced to. Which is complete garbage. He was a willing participant who even came up with the story to get Adrienne out of the house. I suppose this is because the film relies heavily on David's confession and not as much on news sources as it should have. The writing suffers from this lack of credible sources. If looking for accurate information about this case, this film is not where you should be looking. Too much information came out in the trial that disproves significant issues. While the film goes along with David's confession that he and Adrienne slept together after a track meet, this is not true. On A & E's American Justice it was told that it came out in the trial that this never happened. In fact someone else gave Adrienne a ride home that day. Since the trial happened after the film was made, the film is not at fault for this error, it would have made more sense to make a film after the trial. David even later admitted that he lied about sleeping with Adrienne. Given this information it leads one to believe that she rejected him and he decided to enact revenge on her. Thus he lied to his girlfriend and they decided to kill her. While this is merely speculation it is food for thought.",
         "I loved this movie. This is probably one of the only things I've seen Holly Marie Combs play a bad girl. She did it wonderfully. The one thing that I don't like about it is that David would actually do something like he does just because Dianne told him too! It is believable though because some people will do anything for love. I recommend this movie to people who like movies with drama and love.",
         "this \"docuDRAMA\" was sorely lacking in drama. you knew the story ahead of time even if you weren't aware of the story from the news. there's no suspense, no thrills, and no drama. it's drier then a 10th grade history lecture. the plot, such as it is, can be summarized in 3 lines, yet they drag it out to 2 hrs (with commercials). it reflects badly on me that i even watched it, but at least i was multi-tasking. save yourself the time, and don't bother.",
         "I just saw the movie and it made no sense to me because so much was missing, the whole thing was so hard to believe. Its only now after reading around, I have come to know that the producers were in a hurry to make the movie for whatever obvious reasons even before the trial started, and the morons based the entire movie around Davids confession<--- what a stupid thing to do... its a painful story and it should have been dealt with more responsibility... all they have done is made David look like a stupid mad in love softy, whereas he might have been the whole mastermind and the poor crazy gal, who knows what mental condition shes got......... Last but not the least, the characters were soo poorly defined, holly marie combs was absolutely wasted, she is one of the best actresses in the industry and did a fine job with whatever twisted script she had. i just wish they cud have done justice to this...",
         "I watch this film every time it's on TV - the male lead David Lipper is a true star with eyes that are riveting - Paul Newman eyes - and what a bod! In the scene without a shirt he displays a set of pecs that will knock you off your feet! Yikes! What a hunk! He is so handsome that I found it difficult to concentrate on the story or the other characters but the Mother of the victim really stands out as well as the two detectives both of whom are first rate. The girl who plays the victim is a real beauty too and a familiar face that I have seen many times although I do not know her name. I think she was on one of the soaps or a series. One of those coming of age series that I never watch but only see tidbits of when I'm channel surfing. I saw the last half of the film again last night - late - and first thing this morning I looked up David Lipper and found he has a Web site but he doesn't have even one shot without a shirt - bummer!!!! Come on Dave, show what you got because dude you got it in spades!",
         "When the movie started, I said, \"Oh boy! Here we go again. One of those drama movies with the same old story!\". However, it turned out to be a very good movie. I liked it, and it is quite an original story : David and Diane are a young couple in love, wanting to spend the rest of their lives together. David, though, makes love with Adrianne and when he confesses everything to Diane, she tells him that she wants Adrianne dead. So, the two of them kill her. It's a story of love and drama, surely, worth watching it. My vote : 90/100."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Steve White Entertainment"],
      "summaries": ["Based on a true story, this film recounts the story of Diane Zamora and David Graham, two high school sweethearts who swear to always be together, even as they enter separate military academies. But when David confesses he had an affair with a classmate, Diane has an ultimatum, leading the two into a murderous pact with severe repercussions."],
      "budget": 0
   },
   "movielensId": 95085,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-02-20",
      "dvdReleaseDate": null,
      "directors": ["Richard A. Colla"],
      "runtime": 93,
      "movieId": 95085,
      "title": "Love's Deadly Triangle: The Texas Cadet Murder",
      "mpaa": "",
      "actors": [
         "Holly Marie Combs",
         "David Lipper",
         "Cassidy Rae",
         "Dee Wallace",
         "Gary Grubbs",
         "Kurt Fuller",
         "Joanna Canton",
         "Chad Carlberg",
         "Jack Landry",
         "Karyn Beach",
         "R. Keith Harris",
         "Derin Altay",
         "Andrew Masset",
         "Wilmer Calderon",
         "JoAnna Garcia"
      ],
      "imdbMovieId": "0119579",
      "originalTitle": "Love's Deadly Triangle: The Texas Cadet Murder",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Based on a true story, this film recounts the story of Diane Zamora and David Graham, two high school sweethearts who swear to always be together, even as they enter separate military academies. But when David confesses he had an affair with a classmate, Diane has an ultimatum, leading the two into a murderous pact with severe repercussions.",
      "tmdbMovieId": 201703,
      "avgRating": 4,
      "releaseYear": "1997",
      "numRatings": 1,
      "posterPath": "/icYCbrSnY2XZk7oGGyEwYWnGaLu.jpg"
   }
}