{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fountain",
            "id": 2098
         },
         {
            "name": "rivalry",
            "id": 9823
         },
         {
            "name": "coin",
            "id": 10294
         },
         {
            "name": "bag of money",
            "id": 10856
         },
         {
            "name": "gold coin",
            "id": 11087
         },
         {
            "name": "little girl",
            "id": 12663
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         },
         {
            "name": "one man band",
            "id": 185248
         },
         {
            "name": "street musician",
            "id": 185250
         },
         {
            "name": "busker",
            "id": 199793
         },
         {
            "name": "short",
            "id": 214549
         },
         {
            "name": "pixar animation",
            "id": 236684
         }
      ],
      "imdb_id": "tt0479113",
      "video": false,
      "title": "One Man Band",
      "recommendations": [
         13925,
         13927,
         13928,
         13062,
         13931,
         13060,
         13929,
         13926,
         13934,
         13930,
         13924,
         13932,
         13042,
         40619,
         24480,
         83564,
         24589,
         13061,
         13413,
         200481
      ],
      "backdrop_path": "/aOTHQzosgV17iY9ygjD91J1JpgD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd2f",
               "name": "Mark Andrews",
               "profile_path": "/7rZMVDkuVzlSDyG9HWRdrPohaO3.jpg",
               "id": 126638,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b69251416c7505fd35",
               "name": "Andrew Jimenez",
               "profile_path": null,
               "id": 59362,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b69251416c7505fd3b",
               "name": "Andrew Jimenez",
               "profile_path": null,
               "id": 59362,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd41",
               "name": "Mark Andrews",
               "profile_path": "/7rZMVDkuVzlSDyG9HWRdrPohaO3.jpg",
               "id": 126638,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b69251416c7505fd47",
               "name": "Osnat Shurer",
               "profile_path": null,
               "id": 1117781,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd4d",
               "name": "Brad Bird",
               "profile_path": "/2XwJyYs6XNLaQuC1O2gbEHT3jxx.jpg",
               "id": 7087,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd53",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd59",
               "name": "Michael Giacchino",
               "profile_path": "/2YW8sSVvRhCwiQmsFCgtFsGkbv8.jpg",
               "id": 15347,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b69251416c7505fd5f",
               "name": "Steve Bloom",
               "profile_path": null,
               "id": 652557,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "572e24f0925141522f00000d",
               "name": "Robin Cooper",
               "profile_path": null,
               "id": 7949,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "572e22eec3a3680fdf0036c5",
               "name": "Ronnie del Carmen",
               "profile_path": null,
               "id": 1236458,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "572e2a9392514151960000d0",
               "name": "Paul Cichocki",
               "profile_path": null,
               "id": 8153,
               "department": "Crew",
               "job": "Post Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "572e2ac99251416c34001932",
               "name": "Nicole Paradis Grindle",
               "profile_path": null,
               "id": 1485788,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "572e2b939251410d300027c6",
               "name": "Marcia Gwendolyn Jones",
               "profile_path": null,
               "id": 7912,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "572f6658c3a3682f5b0009d6",
               "name": "Jason Deamer",
               "profile_path": null,
               "id": 7951,
               "department": "Crew",
               "job": "Production Artist"
            },
            {
               "gender": 0,
               "credit_id": "572f67419251415cc10021f2",
               "name": "Laura Phillips",
               "profile_path": null,
               "id": 7944,
               "department": "Crew",
               "job": "Production Artist"
            },
            {
               "gender": 2,
               "credit_id": "572f6809c3a36878180006b7",
               "name": "Peter Sohn",
               "profile_path": "/ouaPg2hdBBXfq8N7HPatvEq3P81.jpg",
               "id": 21198,
               "department": "Crew",
               "job": "Production Artist"
            },
            {
               "gender": 0,
               "credit_id": "572f69019251413e52000577",
               "name": "Dustin Cawood",
               "profile_path": null,
               "id": 1484178,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "572f6ad3c3a368749200075a",
               "name": "Louis Rivera",
               "profile_path": null,
               "id": 8135,
               "department": "Editing",
               "job": "Color Timer"
            },
            {
               "gender": 0,
               "credit_id": "572f6be99251415cc100227a",
               "name": "Chris Vallance",
               "profile_path": null,
               "id": 8073,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "572f6c6292514118d3001afd",
               "name": "Frank Macchia",
               "profile_path": null,
               "id": 1463824,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "572f6d37c3a368496e0014a9",
               "name": "Adam Cohen",
               "profile_path": null,
               "id": 63517,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 2,
               "credit_id": "572f6d44c3a3685b5c001fca",
               "name": "Steve Jobs",
               "profile_path": "/mOMP3SwD5qWQSR0ldCIByd3guTV.jpg",
               "id": 12897,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 0,
               "credit_id": "572f6d9dc3a3682faa000b9c",
               "name": "Angus MacLane",
               "profile_path": "/7U1mEvzHGNJiC07EOhKIKSl3Qiy.jpg",
               "id": 7929,
               "department": "Crew",
               "job": "Supervising Animator"
            },
            {
               "gender": 2,
               "credit_id": "577016b79251417ba7000447",
               "name": "Kevin Reher",
               "profile_path": null,
               "id": 57673,
               "department": "Crew",
               "job": "Thanks"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.969438,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13933,
      "vote_count": 163,
      "budget": 0,
      "overview": "With one coin to make a wish at the piazza fountain, a peasant girl encounters two competing street performers who'd prefer the coin find its way into their tip jars. The little girl, Tippy, is caught in the middle as a musical duel ensues between the one-man-bands.",
      "similar": [
         20352,
         9023,
         21385,
         326359,
         20722,
         5698,
         13246,
         31135,
         461955,
         145316,
         66819,
         46624,
         27040,
         93521,
         67703,
         194079,
         66872,
         109325,
         53453,
         99968
      ],
      "original_title": "One Man Band",
      "runtime": 4,
      "poster_path": "/e3fDOQgvajJCiag9EQ4QvPRtU6a.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "No Language",
            "iso_639_1": "xx"
         }
      ],
      "production_companies": [{
         "logo_path": "/1TjvGVDMYsj6JBxOAkUHpPEwLf7.png",
         "name": "Pixar",
         "id": 3,
         "origin_country": "US"
      }],
      "release_date": "2005-06-21",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Vibrant and Whimsical!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Mark Andrews",
         "Andrew Jimenez"
      ],
      "runtime": 4,
      "synopsis": null,
      "writers": [
         "Andrew Jimenez",
         "Mark Andrews"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0479113/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTEzNzQ5ODAxOF5BMl5BanBnXkFtZTcwMzI4NjgzMQ@@._V1_SX214_AL_.jpg",
      "actors": [],
      "reviews": [
         "One Man Ban was an absolutely charming piece of work! The colors were vibrant and whimsical and the designs were cute and caricatured. I loved it from the moment it started until the very end! It's surprising it didn't win the Oscar; it was definitely better than the winner. I suppose the judges couldn't justify giving the same crew Oscar after Oscar after Oscar... The story is about a pair of street performers locked in a competition to out-perform the other and win the golden coin of a little girl passing by. Their musical dueling was delightful and I can't even imagine directing a film where the whole script is music! 10/10",
         "Wow, the first thing I noticed was how stunning this looked. Of course, I have been watching a ton of 40s, 50s and 60s cartoons in the last two months so something this new - and with surround sound - is a shock to see and hear, and is extremely impressive. Even in this computer era, this is a stunning short little animated story. Sometimes I couldn't believe what I was seeing and hearing as two one-man bands compete for a coin from a little girl. All they want is a little money for their efforts, but this little girl is a tough sell. The music by these two guys is spectacular. Others have gone into detail so there is no need for me to comment except I will stick up for the two incredible one-man-band players. The little girl was a nasty, little so-and-so. However, as a cartoon it was amazing and almost too much for words. It just makes me wish more of this kind of thing could be done. Why can't there be good, original, entertaining and clean cartoons any more? You have to go back to the 30s through the '70s for anything good, like the Looney Tunes or the Pink Panther This Pixar cartoon shows the incredible animation that could be done for short cartoons today This was an extra feature that came with the \"Cars\" DVD.",
         "Pixar's one man band get cacophonous when two buskers vie to get a gold coin from a little girl. The short story starts with an avuncular busker playing simple music with his trumpet, when he sees that a little girl is about to drop her coin in the fountain, perhaps for a wish. But he manages to lure her with his music and immediately pushes his bowl so that the coin goes into his pocket. Just when the girl reaches to drop the coin into the bowl, another violinist begins to play his instrument. This man is lanky and he plays his instrument mellifluously. The war begins and the girl gets confused as both the buskers get more and more competitive. The ending is unexpected, and I'm glad Pixar didn't go for an emotional ending. The animation is quite vibrant and detailed for a short film and the humor is subtle. My rating: 7/10",
         "Once again there was a short animated film from Pixar before the main Disney computer animated feature in the cinema, Cars. This one sees a busker on a stage, small, playing all his instruments hoping to get some money put in his cap. Along comes a little peasant girl ready to put her shiny gold penny in the near piazza water fountain, when the busker spots her and starts playing to tempt her to give it to him. Across the street however starts playing another busker with his assortment of string instruments, and the girl goes towards him to be tempted to cough up the cash. This need for attention from the little girl and for the penny is becoming a musical feud, and after a humorous rivalry the girl drops her coin into the nearby drain. The little girl is upset and wants her money back, but neither busker has a penny to give her, so she instead takes a violin off the second busker. She starts playing badly and trying to tune it, and she eventually plays well, and she ends up getting a whole sack full of coins. It looks like she might give the two buskers a coin each, but she instead tosses them both into the above high bird bath, and the film ends with them clambering on each other to get them. With some good music, amusing moments, and the same sense of heart has been put into a simple but affective tale for all the family to enjoy. It was nominated the Oscar for Best Short Animated Film. Very good!",
         "One Man Band is simply one of the best shorts ever produced. The minute I saw it I was enchanted and knew I had found my favorite Pixar short to date. Pixar's meticulous attention to detail is conveyed in the brilliance of the story and the craftsmanship of the animation. The short plays like a silent film. No dialogue. Just pantomime. It tells the story of two street musicians trying to compete for the gold coin of a young peasant girl who just wants to cast it in the town square's wish fountain. A simple story told with lots of wit and humor. Plus, there's a twist. It doesn't end the way you think it will. As always, the animation is spot-on and very impressive. The character designs are so cute and appealing. The sound quality is top notch. And the surrounding Renaissance world is a feast of warm colors and visual beauty. It's funny, original, and clever. Proves the simplest ideas are often the best. If I have one complaint about One Man Band is that it isn't longer in length. I was hoping for more! Great addition to the Cars DVD!",
         "Again and again, Pixar films has produced the very best in cutting-edge shorts using computer generated animation. The quality is top-notch and the writing exceptional--so good that for the worst of these short films I'd give them perhaps an 8. The problem, however, is that the films are so good, so consistently great that I think the Academy Awards folks are reticent to give this studio the Oscar for Best Animated Short--otherwise, smaller and less prestigious studios might feel left out and not even bother entering since Pixar would take home most of the awards. I have noticed that their films don't seem to win like they used to and in a few cases (such as KNICK KNACK) they weren't even nominated--even though, to me, they seemed to be producing the best shorts. They are consistently very funny and the most technologically challenging product out there. Now it is very difficult to assess whether or not the wonderful ONE-MAN BAND was yet another case like this because although I have seen this film, the winner (THE MOON AND THE SON) is difficult to find and isn't available anywhere on the internet. I'm not even sure where I can get this HBO produced short. All I can say is that ONE-MAN BAND looks near-perfect, has tremendous set and character design and will make you laugh even though it is dialog-free. A truly exceptional and charming film.",
         "This was a funny short clip from Pixar. I think all musicians will find it really funny and, because they're a musician, they'd understand the comedy and duelling between the men, who try to 'entice' the little girl to give up her last and only coin. I thought the part where the 'brass' guy tore one of the 'strings' guy's violins and handed it to the girl was funny. In the end, the little girl 'screeches' the violin and tunes it, eventually playing a fast, Italian piece, resulting in a stranger throwing a big bag of coins in front of her. She then gets out two coins, making it look like one, quickly gesturing the coins into two, she raises them over her head and throws them into the topmost 'bowl' of the fountain. The last bit of the animation short shows the brass guy and string guy balancing on top of the other trying to get the coins out of the top.",
         "I don't think people really pay attention to Pixar shorts as something other than a bonus to Pixar features (this one coming before Cars), but these things are really great, even standalone. A lot of Pixar shorts involve a theme of personal struggle, usually for recognition or comfort in an empty or uncaring world. They tend to involve smaller characters that are lonely and helpless, but learn something in their struggle. This one is a fun mixture of those themes, involving two competing one-man-bands (or, rather, a one man band and a one man orchestra) who are hunting for the only available coin in an empty plaza... held by a little girl who wants the coin to go far. As the competition heats up they get further and further off track of what they're doing, ultimately fumbling in a predictable direction but one that is still wonderfully poignant. Another magical thing about Pixar shorts is that few of them have any dialog, thus showing character through action and expression. This one is great at that approach, and has a great musical score to back it up. I hope someday Pixar releases a DVD of just their shorts so that people can regard them away from their feature presentations. They really are great on their own. --PolarisDiB",
         "Pixar, at least the preDisney Pixar, uses shorts as experiments. They've used them for new volume computation routines. Remember the birds squooshed together on a telephone line? Remember \"Boundin'\" which investigated the use of quickly changing space? This one is an amusement of course, they all are. But its reason to be what it is, is the opportunity to explore how characters define space. A problem with the type of 3D animation Pixar does is that the characters become harder. Their skin becomes more of an edge that separates them from their context. Human actors have ways around this. Digital puppets don't have this same possibility. But they have others, and one of those is to be compound beings. But how to use this so the characters \"read\" well is unknown. So we have this experiment. As with all Pixar projects, its a triumph. Its more amazing when you know the problem they were solving. Ted's Evaluation -- 3 of 3: Worth watching.",
         "This is a 5-minute animated short film from Pixar that was also nominated for an Oscar, but lost to the entry with the longest runtime that year. The story is pretty simple. We do not have one one man band in this film, no, we have two. They are fighting for a little girl's affection, or I should probably say golden coin. Who's gonna prevail? Find out for yourself. The animation is pretty good (obviously a given with Pixar), quite a decent watch with the costumes etc. as well and the ending is funny too. Other than that that (and the priceless look on the girl's face when her coin is lost), I really only found it mediocre. But it's not bad either, so certainly worth a watch for animation lovers. Oh and for music lovers, for the tunes in here are pretty nice. But the music also had to be good as all the focus is on this aspect with no people talking. By the way, one of the writer/director duo won an Academy Award for \"Brave\" not too long ago and the other is enjoying a pretty prolific career too. You can see glimpses of their talent in this short movie. Recommended."
      ],
      "genres": [
         "Animation",
         "Short",
         "Family",
         "Music"
      ],
      "productionCompanies": ["Pixar Animation Studios"],
      "summaries": [
         "With one coin to make a wish at the piazza fountain, One Man Band tells the humorously captivating tale of a peasant girl who encounters two competing street performers who'd prefer the coin find its way into their tip jars. As the two one-man bands' rivalry crescendos, the two overly eager musicians vie to win the little girl's attention.",
         "Two buskers engage in a petty feud over a child's donation."
      ],
      "budget": 0
   },
   "movielensId": 95377,
   "movielens": {
      "languages": [
         "English",
         "No Language"
      ],
      "releaseDate": "2005-06-21",
      "dvdReleaseDate": null,
      "directors": [
         "Mark Andrews",
         "Andrew Jimenez"
      ],
      "runtime": 4,
      "movieId": 95377,
      "title": "One Man Band",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "0479113",
      "originalTitle": "One Man Band",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["8A7Pe8oGhq8"],
      "plotSummary": "With one coin to make a wish at the piazza fountain, a peasant girl encounters two competing street performers who'd prefer the coin find its way into their tip jars. The little girl, Tippy, is caught in the middle as a musical duel ensues between the one-man-bands.",
      "tmdbMovieId": 13933,
      "avgRating": 3.85499,
      "releaseYear": "2005",
      "numRatings": 431,
      "posterPath": "/e3fDOQgvajJCiag9EQ4QvPRtU6a.jpg"
   }
}