{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "pixar animation",
         "id": 236684
      }],
      "imdb_id": "tt0093832",
      "video": false,
      "title": "Red's Dream",
      "recommendations": [
         13924,
         13927,
         13928,
         13925,
         13062,
         13933,
         13931,
         13934,
         13929,
         13060,
         24589,
         13932,
         13930,
         13061,
         40619,
         72962,
         83564,
         24480,
         13042,
         200481
      ],
      "backdrop_path": "/QTr1uvLEkfyc1lnBycWPTUQZtj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b59251416c7505fc0d",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b59251416c7505fc13",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b59251416c7505fc19",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 4.961631,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13926,
      "vote_count": 93,
      "budget": 0,
      "overview": "Life as the sole sale item in the clearance corner of Eben's Bikes can get lonely. So Red, a unicycle, dreams up a clown owner and his own juggling act that steals the show. But all too soon, the applause turns into the sound of rainfall, as reality rushes back. Red must resign himself to sitting in the corner and await his fate.",
      "similar": [
         13932,
         13042,
         24480,
         13062,
         13929,
         77887,
         433471,
         13930,
         13060,
         13934,
         83564,
         82424,
         24589,
         40619,
         13933,
         13931,
         13413,
         13927,
         13928,
         13924
      ],
      "original_title": "Red's Dream",
      "runtime": 4,
      "poster_path": "/d4uHTIIxuhChFoLkg34CbTMvIyo.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": "/1TjvGVDMYsj6JBxOAkUHpPEwLf7.png",
         "name": "Pixar",
         "id": 3,
         "origin_country": "US"
      }],
      "release_date": "1987-08-17",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Lasseter"],
      "runtime": 4,
      "synopsis": null,
      "writers": ["John Lasseter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093832/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NzQ0MDM3MV5BMl5BanBnXkFtZTgwMTIyMDgwMjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "I make my living as the night engineer at the local PBS TV station. I also happen to be a LONG time animation freak. I've loved and collected the cartoons from Disney, the Fleischer Brothers, Warner Brothers and all the rest for a very long time. I felt that the art of the cartoon was a static field and that it would never drift far from it's pen and ink roots. One night at work... after a program that ran a few minutes short of a full hour, PBS used RED'S DREAM as filler material to round out the hour. A whole new world opened up on the screen... When RED came along, computer animation was still in it's infancy. I think Pixar produced the film as a demonstration piece for what their technology is capable of. At that point in time computer animation was still very expensive, probably as expensive as the traditional, one drawing at a time process of making cartoons by hand. Cartooning done the traditional way has become SO expensive that it's caused some major players to either get out of the field, or make major concessions in film quality. The beloved \"Termite Terrace\", the old Warner Brother's cartooning unit, closed years ago. Likewise, to cut down on the number of drawings required, Fred Flintstone suffers from \"Hanna Barberra Palsey\"; frequently, Fred's feet and mouth are the ONLY things on the screen that move. To combat the high costs of traditional, full motion cartooning, SOME concessions to modern technology have come to the fore. In some of Ralph Bakshi's work (HEY GOOD LOOKIN' and THE HOBBIT for example) he moved offshore to cut labor costs (Ireland), and used Xerox copying. Disney had ALWAYS been the unquestioned master at giving drawn characters the subtle nuances of personality, and occasionally he did it with inanimate objects like Red. My personal Disney favorite is \"Casey Junior\", the little locomotive that pulls the circus train in DUMBO. I saw somewhere that Casey's personality was inspired by the cartoonist watching a puppy. I can believe that easily; while trying to get the train moving, Casey does a maneuver that's VERY familiar to anyone who has spent a lot of time around dogs; Casey does a \"Play Bow\", a canine move used as an invitation to other dogs to come out and play with him. It was little touches like this that convinced me that the cartoonist and animator never had to worry about being automated out of a job by computers. But... then came Red. Red is ASTONISHING. This simple little unicycle achieves the goals that every cartoonist shoots for in his creations. In a very short film he introduces himself, displays a clearly defined personality, communicates to the viewer his wants, needs, and motivations, and he manages to touch that indefinable something deep inside of the viewer that makes you CARE about him. You really IDENTIFY with this simple little character in a four minute film. That's what cartoons are all about, and Red touches every one of the bases. When I saw this little guy, I realized that the traditional pen and ink and drafting board were on their way out, to be replaced by the microprocessor and the graphics tablet The Shreks, Roger Rabbits, and all of the other modern cartoon characters were inevitable, both because of the economics of animation, and the success of little films like RED'S DREAM. We owe this little unicycle, yearning for stardom, a vote of thanks. He himself may be a dead end, but he opened the door to a whole new generation of cartoons.",
         "One of the Pixar shorts from the eighties, this one is directed and written by 'Mr. Pixar' (and director of the upcoming 'Cars' (of which the first teaser sucked heavily, but nevermind)) John Lasseter. It tells the story of the dream of a lonely unicycle, who desperately wants to be in the circus entertaining the people. The constant rain and sad jazzy music help to make this a moody one. Nice short animation picture, but hard to judge on it's own. But knowing how shorts like this and Knick Knack would eventually turn into brilliant pictures like Toy Story and Finding Nemo (haven't watched The Incredibles yet), this sure was a good sign of even better things to come. 6/10.",
         "The folks at Pixar do a wonderful job here. While this isn't their best short, it is definitely a fine one and the hero here is a surprising one: a little red bike, an inanimate Walter Mitty! I got caught up in this short. Pixar really should re-release their collection of their short films. The short work they do is all at least interesting and most of it is magnificent! Well worth hunting up and most highly recommended.",
         "'Red's Dream', at the time of writing, currently ranks as one of Pixar's lesser known efforts, something which I find quite ironic considering the subject matter of this endearing little short - a lonely and dejected unicycle has to deal with being the only item in a bicycle store restricted to the clearance corner. His only real coping mechanism is to sit there dreaming of better things, and the amazing stunts he could pull if only given a chance to prove his worth, in particular upstaging a rather clueless clown in the circus ring. It's more of a situation than a story, really, but it works very well, and you get a good feel of Red's sorrow and predicament as it goes. And I can't help but love it as much as any of the company's classic material - it's downbeat, there isn't a great deal to laugh at, and its overall sombreness will probably come as quite a shock to anyone raised solely on 'Knick Knack', 'For the Birds' and Pixar's other various laugh-out-loud contributions. But 'Red's Dream' manages to hold the viewer's attention through something a little more striking than just its potential comedy value. For all its fantastical personification, it succeeds in capturing a very real and very poignant aspect of human nature - that is, the desire for escapism from a bleak reality. The reality in which our protagonist lives - as reflected in the colourlessness of the bicycle store - is cruel and harsh, and subjects him to constant negligence from those around him (not even the other bicycles seem to respond to him). But Red finds solace in his dream, however temporarily, and I know that everyone can identify with him on that one on at least some level, just as we can all see something of ourselves in both Woody and Buzz of the 'Toy Story' realm. Strange as it may sound, you really end up feeling for this poor little wheel, and when he envisions his colourful circus scene, and being loved by the audience, you really wish that it could come true and that he could stay there. But at the same time, you're left with the uneasy awareness that that's all it is - a dream, and nothing more - and that Red will have to face up to the real world sooner or later. The 3D animation quality is nice enough - that clown does look pretty grotesque and chunky I'll admit, being Pixar's first real attempt at an organic character, and a telling sign of their current lack of expertise in this particular field, but then again, he IS a clown, so I don't think it really matters! Otherwise, the visuals are thumbs up, and Red himself is undeniably cute (it says, a lot don't you think, that you can end up getting attached to an animated unicycle with no organic features whatsoever?) On the whole, the general mood of the short did leave me feeling a little cold, but appropriately so, and it's definitely worthy of being a classic in the same league as 'Luxo Jr'. Above all, Pixar are capable of making me actually care about such everyday inanimate objects as desk lamps, tin toys, miniature snowmen and unicycles - and that has got to be worth something. Grade: A-",
         "Just like Red, waiting abandoned in the corner- This is an undeniable star just waiting to shine. The film is very short and kind of silly, but it's one that takes multiple viewings to get a true appreciation of it. Watch for the expression of total disgust from \"Red\" as the clown goes on oblivious to what's happening to him. The timing is perfect and hilarious. Good job Pixar!",
         "Didn't anyone else notice the reference to the opening moments of Citizen Kane? (Rain, dark exterior, flashing neon reflected inside?) I agree with the other comments on this site, i.e. that this is an amazing piece of computer graphic animation given the technology available at the time. It is short, but within the four minutes manages to sketch a vignette of Red's existence. The clown (and his accompanying unoriginal circus music) are wooden -- especially the face -- the real expressiveness is left to Red himself, which he manages by wheel (body) and saddle (head) movements which clearly refer to Disney animal characters in the viewer's memory. Red also has the expressive jazzy music.",
         "I gotta admit that if you watch this film today and don't understand the context for it, then you will most likely not be particularly impressed. It's such a very simple animated short and one that seems amazingly ordinary--something you could easily make today given the right rendering software and a home computer. However, think back to 1987. People rarely had home computers and those who did had systems with 8086 or 8088 processors--not much more power than a modern calculator (less in some cases). There were often no hard drives--those that did exist were minuscule. Macintosh computers were relatively new and very simple and Windows was still a vague idea, as IBM compatible computers used primitive versions of DOS as the operating systems. And, most importantly, most games were either text only or had very, very rudimentary graphics. In this context, RED'S DREAM is absolutely amazing and breathtaking. The Pixar folks were not yet a big company but just a few individuals doing work on huge computers and they had to design all the software themselves!! And, in spite of all this, the graphics were lovely and the story of a lonely unicycle quite watchable--even though it was really more an experimental film than anything else. Put in this light, my score of 8 seems amazingly low, but I must admit that in an age when we expect so much more, this isn't the most exciting CG animation I've seen. Still, it's a great film.",
         "I saw this short for the first time whilst renting the first volume of Pixar shorts and while it's not the best of the shorts from the 1980s it has detailed graphics and stunning effects for its era. The most realistic part of the exterior street design is the rainfall and I like the slow jazzy music played while Red is shown in the clearance section of Eben's Bikes (named after one of Pixar's technical directors) as well as the circus music played during Red's dream sequence. Like 'Luxo Jr,' the background in the dream sequence is dark and the clown is just as creepy-looking as the baby in Tin-Toy but at least Red and the juggling balls are brightly coloured and I liked how Red tried to assist the clown with his juggling act, which eventually led to the hilarious consequence of the clown not realising he was sitting on Red and falling to the ground. Also I liked how Red had moved to another part of the bike shop whilst he was dreaming and returned to his usual corner. All in all, this is my least favourite of the earlier Pixar shorts but it had great music, specially effects and graphics. 7/10.",
         "Not Pixar at their very best, but a very impressive early effort. The animation on the clown is a little rough especially to how the rest of the animation looked and I personally think the short could have been a little longer. But for such an early Pixar short Red's Dream does look great and holds up really well, the most striking being the noir-ish opening sequence that could have easily won an award on its own. Also loved the bright and atmospheric colours, the meticulous detail given to the rainfall and even by the look of his design you immediately connect with Red. Red's Dream has an intimate music score and sound effects that are subtly used but authentic, the rain falling actually sounds like rain falling. The story is very simple but Red's Dream is an example of simplicity done right, it has a lot of charm as well subtly moving and hauntingly moody. It sustains the short length beautifully and doesn't feel rushed. The characters are also simple but immensely likable too, you'd never think that you'd fall in love with such a simple object like an unicycle but you certainly do with Red. To conclude, not among Pixar's best but a beautifully done short that is proof of not doing an awful lot but still be good. 8/10 Bethany Cox",
         "Red's Dream is the third (short) film by Pixar and the second from mastermind John Lasseter (not counting his two unrelated works around 1980. And after parent and child lamp in Luxo Jr., he breezed life this time into an old unicycle the very own Pixar way. It's a rainy night, the shop is closed and nobody's on the street, when Red starts dreaming about what it would be like to be a big star, first being an assistant to a juggling clown at a circus and then taking over and juggling himself before bowing down to the standing ovations from the crowd. Sadly, it was just a dream for the little one, but the dream of Pixar becoming one of the most influential and prestigious animation company's was becoming more and more reality with these 4 minutes. It an animation effort from over 25 years ago that was well ahead of its time and you just had to enjoy their attention to detail, like the \"50% off\"-sticker referring equally to the number of wheels. Also the way the little unicycle lowers its head after realizing it was just a dream, is a perfect display of how Pixar never fails to convey true emotion, even if it comes from inanimate objects. Pretty good short film and you could already see they'd be up to grand things in the 90s."
      ],
      "genres": [
         "Animation",
         "Short",
         "Family"
      ],
      "productionCompanies": ["Pixar Animation Studios"],
      "summaries": ["With a sale tag hanging from his seat, propped up in the corner of a bicycle store on a rainy night, Red the unicycle dreams about a better place."],
      "budget": 0
   },
   "movielensId": 95628,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1987-08-17",
      "dvdReleaseDate": null,
      "directors": ["John Lasseter"],
      "runtime": 4,
      "movieId": 95628,
      "title": "Red's Dream",
      "mpaa": "G",
      "actors": [""],
      "imdbMovieId": "0093832",
      "originalTitle": "Red's Dream",
      "genres": [
         "Family",
         "Animation"
      ],
      "youtubeTrailerIds": [
         "M80lX3Gl5Dw",
         "zKgK2jagELw"
      ],
      "plotSummary": "Life as the sole sale item in the clearance corner of Eben's Bikes can get lonely. So Red, a unicycle, dreams up a clown owner and his own juggling act that steals the show. But all too soon, the applause turns into the sound of rainfall, as reality rushes back. Red must resign himself to sitting in the corner and await his fate.",
      "tmdbMovieId": 13926,
      "avgRating": 3.15873,
      "releaseYear": "1987",
      "numRatings": 63,
      "posterPath": "/d4uHTIIxuhChFoLkg34CbTMvIyo.jpg"
   }
}