{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0025329",
      "video": false,
      "title": "Jew Süss",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Josef 'Jew Süss' Oppenheimer",
               "gender": 2,
               "credit_id": "52fe4d1bc3a36847f824f061",
               "name": "Conrad Veidt",
               "profile_path": "/AkRjkTKXIUoPlczpPegaiFeg4lu.jpg",
               "id": 3001,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marie Auguste",
               "gender": 1,
               "credit_id": "52fe4d1bc3a36847f824f065",
               "name": "Benita Hume",
               "profile_path": "/1TU1zl2UbZ0HOtZjEjLV7hVENJK.jpg",
               "id": 131726,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Duke Karl Alexander",
               "gender": 2,
               "credit_id": "52fe4d1bc3a36847f824f069",
               "name": "Frank Vosper",
               "profile_path": "/wugGmN7jgfep7ZWJQiA4NOxg9nB.jpg",
               "id": 54036,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rabbi Gabriel",
               "gender": 2,
               "credit_id": "52fe4d1cc3a36847f824f06d",
               "name": "Cedric Hardwicke",
               "profile_path": "/yaOgPrY8PBPkyqXHm7NVl0p2er7.jpg",
               "id": 99461,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d1bc3a36847f824f05d",
               "name": "Lothar Mendes",
               "profile_path": null,
               "id": 138144,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5748c8f1925141374300040f",
               "name": "Lion Feuchtwanger",
               "profile_path": null,
               "id": 55760,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5748c8f892514137370003e9",
               "name": "A.R. Rawlinson",
               "profile_path": null,
               "id": 1094874,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 1,
               "credit_id": "5748c8ffc3a36866740003d9",
               "name": "Dorothy Farnum",
               "profile_path": null,
               "id": 1096777,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "5748c9c492514150ea0001af",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5748c9cb92514137f50003d5",
               "name": "Jack Beaver",
               "profile_path": null,
               "id": 3604,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5748c9d292514137f50003d8",
               "name": "Bretton Byrd",
               "profile_path": null,
               "id": 1051352,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5748c9eb92514150500001a0",
               "name": "Charles Williams",
               "profile_path": null,
               "id": 3605,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5748c9f3c3a36808660001e9",
               "name": "Roy Kellino",
               "profile_path": null,
               "id": 1226783,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "576562f4925141318700012f",
               "name": "John Greenwood",
               "profile_path": null,
               "id": 47675,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.038796,
      "production_countries": [],
      "id": 172214,
      "vote_count": 1,
      "budget": 0,
      "overview": "An awkward historical satire critical of the rising tide of Anti-Semitism in Germany. Based on the novel by Lionel Feuchtwanger, Jew Süss is the story of life in the 18th century Jewish ghetto of Württemberg. Süss (Veidt) works himself out of the ghetto and into a position of power himself with the help of an evil Duke.",
      "similar": [],
      "original_title": "Jew Süss",
      "runtime": 105,
      "poster_path": "/vaJyVhEOLd67SbpIK5jkZiCrI8N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1934-10-13",
      "vote_average": 2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "£",
      "directors": ["Lothar Mendes"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Lion Feuchtwanger",
         "A.R. Rawlinson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025329/",
      "coverLink": null,
      "actors": ["Stars: Conrad Veidt, Benita Hume, Frank Vosper | See full cast and crew »"],
      "reviews": [
         "I watched this movie (a bad copy, with almost inaudible sound) absolutely spellbound, because of Conrad Veidt's performance. It is also fascinating because it was made as a voice against German antisemitism (one of the first bits of dialogue in the film is along the lines of \"But it's 1730! anti-Jewish sentiment is a thing of the past!\" \"No, my friend, they will be against us in 1830, and in 1930, too\"). However, there was a lot of trouble getting it to open in NYC because in America it was perceived as antisemitic. (I got this from John Soister's book on Veidt). It was hard to get a Jewish character on film in the 1930s who was both recognizably \"Jewish\" and not a stereotype. In 1940 the Germans made a film of the same book which made Veidt's elegant Jewish martyr into an elegant Jewish monster. The plot is not new. It's similar to Musset's Lorenzaccio or Victor Hugo's Le Roi S'Amuse (Verdi's Rigoletto), I think: a sexually rapacious prince is served by a man he despises, up to the moment when the prince's lust and cruelty make the \"best friend\" into a mortal enemy. Frank Vosper is interesting as the prince in this movie, a man who at the beginning has a few noble impulses but who quickly degenerates into drunken cruelty and lecherousness. Benita Hume is also pretty cool as his decadent wife, who encourages his liaisons. Veidt's role, Joseph Suess Oppenheimer, is however completely absorbing. His character is also a sensualist. He kisses everybody on the face or mouth--rabbis, his mother, his daughter--except for the woman he falls in love with. He loves luxury and enjoys beautiful clothes and presiding over a ball, and finding a new female tidbit for his prince to deflower. He seems to fantasize about knocking down the walls around the ghetto where he grew up, but his power is in fact a bit shaky; his service to the Jews seems to consist mostly in not denying he is Jewish. When he finally puts himself on the line to save an innocent Jew, it turns out to be a bad move--the prince wants vengeance on him for this concession. As Veidt's character confronts these disappointments, we see the man emerging from the courtier, and it's a wonderful transformation. There is an odd plot twist, in which Oppenheimer learns that his biological father was a Gentile. Supposedly this makes him not Jewish. However, since Jewishness is reckoned by the mother, this makes no sense. Either his mother is a Gentile (not clear from the film) and the Jews would not consider him truly Jewish even if his father was the virtuous Jew Oppenheimer, or else she is a Jewess and our hero is thereby Jewish no matter who fathered him. The idea that he chooses to be a Jew feeds into the final scenes, and is relevant to Veidt's own life (apparently, though he was not Jewish at all, he insisted on stating that he was Jewish to the German authorities). Although the plot is messy and a wee bit incoherent, the performances are beautiful and this is worth a look.",
         "This is actually a very sympathetic adaptation of the original novel by Leon Feuchtwanger (who was himself Jewish), and should not be confused with the Nazi travesty of 1940, which was a crude, anti-semitic propaganda vehicle.",
         "My copy of Jew Suss is exceptionally bad, being an ageing VHS recording with poor image and sound but nevertheless this is a film worth repeated viewing. I wonder which other countries in the 1930s would have had the confidence to film such a controversial story. Jew Suss, on the surface, is a call to oppose the growth of anti-semitism but the hero of the film is no likable chap, he is a ruthless exploiter, a womaniser, a procurer of women-and a father and a son with a tender side to his nature. He despises his master, the Duke and as much as Suss is in the Duke's power, so is the opposite the case. The only person Suss fears is the Rabbi Gabriel who one can call, perhaps,his conscience or at least the one means whereby Suss is kept connected to the reality of the world in which he lives. It is Gabriel who reminds Suss to visit his mother and his child and it is during these visits that we see his tenderness. Apart from anything else, though, the key to the character of Suss is that, good or bad, he is true to himself and his principles and it is this which finally brings about his downfall. He would only have to declare himself a Christian (and in the book this is what his cousin has already done) for all to be forgiven but he will not do it, even though a rather dubious plot device would make this the obvious thing to do. I find without exception that all performances in this film are excellent.",
         "German financier Josef Süss Oppenheimer vowed to attain power at any cost in order to help his brethren in the Jewish ghetto of Württemberg and his friendship with Field Marshall Karl Alexander pays off when the war hero inherits a Duchy. Süss becomes the unscrupulous Duke's Minister of Finance and is able to build schools and hospitals for his people but the beginning of the end comes when the lecherous Duke tries to rape Süss' daughter and she commits suicide. Süss concocts a brilliant plan for revenge but it kills the Duke and the financier's arrested, tried, and sentenced to death for having sex with Gentile women, an old law that hadn't been enforced for hundreds of years. He's offered an out if he converts to Christianity and he'd kept the fact his father was Christian a secret ...but will Süss save himself? Süss is warned early on not to underestimate anti-Semitism which was \"here in 1430 and will be here in 1930\" so it's easy to see Lothar Mendes' elaborate historical biography as \"positive propaganda\", a response to the rise of Hitler and the closing epilogue asks for an end to prejudice, hoping it \"falls like the Walls of Jerico and people can live as one.\" (yeah, tell that to ISIS) Here, Süss is portrayed as a philanthropic opportunist foolish enough to think he could harness evil for the greater good and the opulence of the eighteenth century aristocracy is vividly contrasted with the poverty of the Jewish ghetto by German émigré Mendes. Conrad Veidt's tormented martyr, guilty only of being too smart for his own good in a bad world, recalls the actor's THE MAN WHO LAUGHS and is positively riveting. Cedric Hardwicke's Rabbi Gabriel is the financier's solemn moral conscience and Benita Hume (a Mrs. George Sanders) is also very good as the \"let them eat cake\" Duchess. The U.S. title was POWER and the adult, sexually frank narrative must have been trimmed quite a bit for its release here."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": ["Gaumont British Picture Corporation"],
      "summaries": ["The story of life in the 18th century Jewish ghetto of Wurtemburg. Suess tries to better himself with the help of an evil Duke."],
      "budget": 100000
   },
   "movielensId": 95767,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-10-13",
      "dvdReleaseDate": "2012-04-24",
      "directors": ["Lothar Mendes"],
      "runtime": 105,
      "movieId": 95767,
      "title": "Jew Süss",
      "mpaa": "",
      "actors": [
         "Conrad Veidt",
         "Benita Hume",
         "Frank Vosper",
         "Cedric Hardwicke"
      ],
      "imdbMovieId": "0025329",
      "originalTitle": "Jew Süss",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "An awkward historical satire critical of the rising tide of Anti-Semitism in Germany. Based on the novel by Lionel Feuchtwanger, Jew Süss is the story of life in the 18th century Jewish ghetto of Württemberg. Süss (Veidt) works himself out of the ghetto and into a position of power himself with the help of an evil Duke.",
      "tmdbMovieId": 172214,
      "avgRating": 3.25,
      "releaseYear": "1934",
      "numRatings": 2,
      "posterPath": "/vaJyVhEOLd67SbpIK5jkZiCrI8N.jpg"
   }
}