{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1559025",
      "video": false,
      "title": "Amish Grace",
      "recommendations": [
         265037,
         130858
      ],
      "backdrop_path": "/rFcXXaezs3VKg6HuXxdnupMWdew.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Ida Graber",
               "gender": 1,
               "credit_id": "52fe46d4c3a36847f811474f",
               "name": "Kimberly Williams-Paisley",
               "profile_path": "/nVp4F4VFqVvjh6huOULUQoiAguY.jpg",
               "id": 70696,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Amy Roberts",
               "gender": 1,
               "credit_id": "52fe46d4c3a36847f8114753",
               "name": "Tammy Blanchard",
               "profile_path": "/a0dfK3SlMmANeTUNVEE87Qipr3f.jpg",
               "id": 16859,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Gideon Graber",
               "gender": 2,
               "credit_id": "52fe46d4c3a36847f8114757",
               "name": "Matt Letscher",
               "profile_path": "/4VwdiM9PUBxswxy7g7nGGeIC4o8.jpg",
               "id": 28414,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Jill Green",
               "gender": 1,
               "credit_id": "52fe46d4c3a36847f811475b",
               "name": "Fay Masterson",
               "profile_path": "/rjNb7ZDq00KqhFHwuinSge5Iv8i.jpg",
               "id": 65409,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Rebecca Knepp",
               "gender": 1,
               "credit_id": "559e89f9c3a368080c001887",
               "name": "Darcy Rose Byrnes",
               "profile_path": "/vXDTGWlBWX72fozu08wRSQY6Ok.jpg",
               "id": 206926,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mary Beth Graber",
               "gender": 1,
               "credit_id": "57d0d7929251417fb3002fcf",
               "name": "Madison Davenport",
               "profile_path": "/AjqfjA4cVbLgVg2IZxUwBaGISGZ.jpg",
               "id": 52869,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46d4c3a36847f811474b",
            "name": "Gregg Champion",
            "profile_path": null,
            "id": 27236,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.065414,
      "production_countries": [],
      "id": 45792,
      "vote_count": 16,
      "budget": 0,
      "overview": "When a gunman killed five Amish children and injured five others in a Nickel Mines, Pennsylvania schoolhouse shooting in October of 2006, the world media attention rapidly turned from the tragic events to the extraordinary forgiveness demonstrated by the Amish community.",
      "similar": [],
      "original_title": "Amish Grace",
      "runtime": 88,
      "poster_path": "/cMCmEIawTuqG1jZr69FhfZexGJ1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-03-28",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gregg Champion"],
      "runtime": 88,
      "synopsis": "A grieving Amish mother struggles to forgive the woman whose husband killed her daughter and four other schoolchildren in this movie inspired by the true-life events that unfolded in a Nickel Mines schoolhouse on October 2, 2006. After the shooting, the media descended upon Nickel Mines, and the parents of the murdered schoolchildren remained steadfast in their promise to practice forgiveness -- except for Ida Graber (Kimberly Williams-Paisley). Devastated by the loss of her daughter, Ida found herself unable to forgive the gunman and his wife, Amy Roberts (Tammy Blanchard). With each passing day Ida's sorrow continues to fester, testing her faith in ways that she, and many others in her community, never dreamt of.",
      "writers": [
         "Sylvie White",
         "Teena Booth"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1559025/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3NDM4MjkyNl5BMl5BanBnXkFtZTcwMjI0MzkwMw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Kimberly Williams-Paisley, Tammy Blanchard, Matt Letscher | See full cast and crew »"],
      "reviews": [
         "This was the most heartwarming, most amazing movie I have ever seen. It teaches you that no matter what happens in life, you should always have it in your heart to forgive those who do something so terrible that you think you will never be able to forgive them. Once you watch this movie, you will learn to appreciate life and the people around you more. You will learn that while forgiving someone isn't always the easiest thing to do, it's the right thing to do. The Amish are such beautiful, such kind people who's lives are based on love and forgiveness, and they always find the strength to go on. Once you see this movie, you will be deeply touched.",
         "Amish Grace is an amazing depiction of grace and forgiveness, yet it shows the struggle of real people to offer the forgiveness they have been taught to give. I appreciate the fact that although the writers wanted to show the amazing forgiveness offered by this community to an terrible aggressor, they show an honest look into the lives of those who struggle to act according to the faith they are living. I was also touched by the affective communication and interaction of this separatist community with the \"English\" (those outside their community). I found this movie to be a very respectful depiction of this people who are little understood by outsiders. I'm thankful for this cinematic look into the community and hearts of a people so moved by God to love and forgive in the midst of great loss and tragedy.",
         "STORY - Based on the true story of the murder of five innocent Amish school girls in 2006 in Lancaster County Pennsylvania. The main family in the story is fictional, however. Great acting and screenplay. Emotional without being manipulative. Violent without showing any violence. Inspirational without being preachy. I have always been critical of faith-based films that are basically 'sermons disguised as films'. Faith-based films should be great stories where the message is an integral part of the story. This is one of those. At the heart of the story is a horrific crime. A lone gunman backs his pickup to a one room Amish school, walks in and proceeds to kill five young Amish girls and wound five others. What happens after that is almost as unbelievable. Three Amish men, including the father of one of the victims, visit the home of the killer to offer forgiveness and help to the gunman's widow. But not everyone finds it easy to forgive. Ida Graber (Paisley) isn't buying it. 'I will not betray my daughter by forgiving her killer'. What follows is for the most part the struggle between two women, both mothers & wives, struggling with forgiveness and their husbands from two totally different perspectives. While we may all have a tendency to see the Amish as stoic and and almost mechanical or robotic in their faith, this is not at all what comes thru in the film. While raising (but not answering) some inconsistencies in their practices, we see them as real humans struggling to deal with this horrific crime against their community. One of the most powerful scenes is at the funeral for the gunman. This is a movie that will haunt you and stick with you as you consider (at least I did) how to live out a live of forgiving with even just the most mundane grievances. What could this mean for communities, our nation and our world if forgiveness were truly practiced. I highly recommend this film.",
         "I haven't been this delighted with a movie in a long time. The script was smart, the topic timely and important, the message clear, and the visuals very watchable. It's a rare movie that I can give my own double thumbs up to and recommend to anyone of my acquaintance without added disclaimers about what might offend or annoy them. This is a movie about the value of forgiveness plain and simple (no pun intended). The movie is based on the real life events that took place in Nickel Mine, Pennsylvania in 2006 when a gunman entered an Amish schoolhouse and shot ten school girls. The gunman then killed himself. The Amish community immediately reached out in love to the widow of the gunman. As you can imagine Christian teachings are a core part of the plot but there is nothing preachy about this movie. It's not meant to be an evangelical tool like some movies such as the \"Left Behind\" series . As I said before, this movie is about forgiveness -- the \"mechanics\" of forgiveness if you will. What does forgiveness look like using the Christian model? How is it done? To whom is it extended? The movie addresses these questions and more. One reason why I think this is one of the smartest scripts I've ever seen is the way these questions are presented. Nothing is sugar-coated. The hard questions are asked and the answers are not spoon-fed to us by writers trying to make their own private points but rather left be answered by each individual. Some answers are demonstrated for us by the players in the movie. Not everyone feels like they can forgive the killer and there are a wide variety of reasons given for this. For those who are determined to forgive we are given a glimpse at their inner struggle and the process they go through to reach the place where they can forgive and move on with their lives. It's made abundantly clear that forgiving people is not easy but is as vital to living as breathing. Another reason the script is smart is because it doesn't insult my intelligence or feel it has to show and tell me everything. The murders themselves are alluded to but there isn't a drop of blood to be seen in this movie. Reading up on the actual events the crime scene was described as horrific -- there wasn't a surface inside the one room schoolhouse that was not covered in either blood or broken glass. We don't need to see these things to know how horrible the slaughter was and I appreciate that. The acting is good enough that we understand very clearly what these folks were facing. For those looking for a factual retelling of the tragedy, this isn't it. A disclaimer at the beginning of the movie explains clearly that this is a fictionalized account based on a true story. It goes on to make clear that the main characters in the story, the Graber family, are completely fictional. The event is merely a vehicle to talk about forgiveness and the point is well made. This is not a documentary. So, whether you're \"religious\" or not, the message of forgiveness is completely applicable to anyone's life and the world would be a better place if more people practiced the unconditional forgiveness we're shown in \"Amish Grace\". Great viewing for the entire family!",
         "This movie showed that while forgiveness isn't something that comes naturally, it is something that harms not necessarily the object of hatred but, rather, it harms ourselves, our own lives, & those around us. THIS is the lesson of this movie. It tells you right out that it's a fictionalized version of the real event, so I have no problem w/the bits of \"drama\" added, as another reviewer has indicated. None of that detracted from the important message, & that was the key point. If you have a heart & a soul, you will FEEL this movie ... & be forced to reconsider the next time someone does something petty to you & yours & your automatic reaction is to make them pay--because you will remember this movie, & know that if you can't get over that, you'll never get over the really difficult times.",
         "Film \"Amish Grace\" is a movie containing lessons in true forgiveness. It's intent was not to educate about Amish lifestyle and beliefs, yet those and the Nickel Mines, PA Amish School murders were the backdrops for the story..the framework if you will allow. It is my opinion that it was not the purpose to capitalize upon the tragedy that struck this serene community near my home, nor to point a finger at Mr. Charlie Roberts and his family. Instead, the film's purpose was to address the radicalness of forgiveness in a world which does not often seek to forgive nor teaches forgiveness. The story, and the example of our Amish Christian brethren, is that of illustrating the beauty and strength of the forgiveness that Christ Jesus Himself commanded of his apostles, and also of us. Forgiveness is not easy to carry out, nor to feel in one's heart. Forgiveness is a decision of the will not to seek to carry out vengeance towards another person. Only God, Who is all-knowing and all-loving can truly know what's going on in a person's heart...the one who carries out a fault against another. So, it follows that God forgives, and as we believe and trust in Him, we also are able to imitate His forgiveness, though we cannot, in our human limitations, completely understand a situation. Jesus asks us to take the higher road. Our unforgiveness is an obstacles to the healing and faith of others. To live in His peace is God's will for all mankind. Amish Grace does not seek a major film award. Perhaps it was not perfect in writing, scope, and dialogue, but it is the lesson of forgiveness that is its banner. I hope many, many people see this film and hearten to its lessons. May all people grow in respect of our Amish neighbors and learn also from their simple, quiet, trusting faith in God. We have much to learn from their choice to be separate (holy) unto the Lord. Thanks for reading this.",
         "**SPOILERS** On the morning of October 2, 2006 Charles Roberts, John Churchill, or Charlie the Milkman as he's known in the Bart Township Amish Community walked into the little West Nickel Mines school and gunned down ten Amish girls, between the ages of 6 and 13, five of whom later died! As if this wasn't shocking enough a bigger shock was yet to follow with the Amish Community as well as the victims family members showing up at Charlie's house and expressing forgiveness to his grieving wife Amy, Tammy Blanchard, and her dad Henry Taskey, Gary Graham, for what Charlie did! This set off shock waves all over the country in the Amish ways of not letting a tragedy of even this magnitude have hate take over both their hearts and souls towards the now deceased, who put a bullet in his brain, Carles Roberts! It was only Ida Gaber, Kimberly Williams-Smith, the mother of one of Charlie's victims her 13 year old daughter Mary Beth, Madison Davenport, who couldn't bring herself to forgive Charlie for what he did. It was Ida's steadfast hatred towards not only Charlie but his wife Amy, who was completely devastated by what her husband did, as well. That's until one of the survivors of Charlie's murder spree and Mary Beth's best friend Rebecca Knepp, Darcy Rose Byrnes, told both Ida and her husband Gideon, Matt Letscher, the last world that Mary Beth said just before a crazed and deranged Charlie Roberts blew her away with his shotgun! It was something that a true believing person in God's undeniable love and mercy, even for someone like Charlie, could have uttered and it turned Ida's life around. In a world filled with violence hatred and revenge the Amish have lived the kind of life that most of us could only envy. With strong family ties and deep religious beliefs crime even petty crime is almost unknown in the Amish Community in Pennsylvania's Lancaster County where the murders took place. The very fact that a horror like what happened at the West Nickel Mines School did take place put the Amish living there to the test in proving to the world that they practice what they preach in forgiving those who sin even if the sin involves the murder of their own innocent children! Ida who was about to leave the Amish Community as well as her husband Gideon and take her surviving daughter seven year old Kaite, Karley Scott Collins, along with her was blinded by the hatred and violence that the crazed milkman Charlie Roberts inflicted on her and her family. It was Mary Beth's last words on earth directed at Charlie, who was just about to gun her down, that opened Ida's eyes. It was then that Ida, like her husband Gideon always told her, saw that hatred only survives if it's nurtured by those who have it in their hearts and stays with them their entire lives. And forgiving those whom that hatred is directed upon is the best way to cure it and the suffering and misery that goes along with it!",
         "I don't know if this would be considered to contain a spoiler or not. I knew when I watched the movie that it was a fictionalized, Hollywoodized version of the actual events on that horrible day. I was not be put off by what I expected. What impressed me most about the movie was the unconditional love and unconditional forgiveness on the part of Amish people in the midst of such tragedy. I found the Amish reaction to be a worthy goal and a challenge to my own spirituality and way of handling adversity in my life. The authenticity of Amish life that was portrayed was irrelevant to me. I found the acting to be acceptable and would recommend this movie highly to people who want to understand the nature of love and forgiveness.",
         "This is a great movie. I borrowed it from our local library. I have been reading a lot of books lately on the Amish and am very interested in their lifestyle. This movie seemed to portray their lifestyle pretty accurately. I was particularly impressed with Matt Letscher's performance as an Amish husband and father and a \"plain man\". It was excellent and right on target! I had never seen him before or even knew who he was but I signed onto this website just so I could let him know how good his portrayal was. His grief and pain were so real I couldn't hold back the tears. I know Ms Paisley got top billing and was supposed to be the star of the movie, but her performance was not that great. She was so angry all the time. I think it is easier to show anger than to show the grief and inner turmoil that Mr. Letscher had to portray. I wish somehow this review will be read by him and he will know that his performance was appreciated.",
         "I don't have cable at home beyond the local channels and WGN, but I was lucky to be at a motel when this aired. I had a totally different view of the Amish from the way this movie depicted them. They didn't have electricity or modern conveniences, but they had nice houses. They were not uptight or judgmental, except for shunning members of their group who chose to leave. The children seemed happy; almost no one wanted to experience life on the outside. And these people showed the true meaning of forgiveness like I have never seen it. One of the best performances, and one of the best illustrations of the true meaning of forgiveness, came from an actor playing a gray-bearded farmer who raised corn. Sorry I don't know his name. Of course one of these people had doubts and nearly lost her faith. Who wouldn't? In fact, one woman who lost two children knew she should forgive but seemed to stay mad at the man who committed the terrible deed; she forgave him many times a day. In a sense, that's what forgiveness means, although I'm sure it should mean to forgive once and never have to do it again. But this woman really seemed to understand her faith and was just having great difficulty. One of the most powerful statements was the way these people supported the widow of the shooter; a group of men came to her house not to chastise her but to forgive her husband and to ask what she needed from them. I don't recall any weaknesses in the film. Everyone did a good job of acting. Even the TV reporters who had major roles showed the true meaning of what journalism should be in this situation, as opposed to the vultures who were the majority. I was very surprised at the plain-vanilla TV-PG V-chip rating. But there's nothing here that would make the film inappropriate for older children. True, it is suggested some children die, and we see the grief and hear about what happened, but what happened in that schoolhouse is never shown. It's as mild as it can possibly be considering the circumstances. The description by one survivor who woke up from a coma once again drives home the point about what good Christians these people are. Everyone should see this."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Larry Thompson Organization"],
      "summaries": ["When a gunman killed five Amish children and injured five others in a Nickel Mines, Pennsylvania schoolhouse shooting in October of 2006, the world media attention rapidly turned from the tragic events to the extraordinary forgiveness demonstrated by the Amish community. Through the eyes of a grieving mother, Ida Graber, and other devastated families, this movie explores the Amish's astonishing reaction to the horrific shootings - of forgiveness and compassion."],
      "budget": 0
   },
   "movielensId": 96179,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-03-28",
      "dvdReleaseDate": null,
      "directors": ["Gregg Champion"],
      "runtime": 88,
      "movieId": 96179,
      "title": "Amish Grace",
      "mpaa": "",
      "actors": [
         "Kimberly Williams-Paisley",
         "Tammy Blanchard",
         "Matt Letscher",
         "Fay Masterson",
         "Darcy Rose Byrnes",
         "Madison Davenport"
      ],
      "imdbMovieId": "1559025",
      "originalTitle": "Amish Grace",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When a gunman killed five Amish children and injured five others in a Nickel Mines, Pennsylvania schoolhouse shooting in October of 2006, the world media attention rapidly turned from the tragic events to the extraordinary forgiveness demonstrated by the Amish community.",
      "tmdbMovieId": 45792,
      "avgRating": 3.83333,
      "releaseYear": "2010",
      "numRatings": 6,
      "posterPath": "/cMCmEIawTuqG1jZr69FhfZexGJ1.jpg"
   }
}