{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "reanimated corpse",
            "id": 174413
         },
         {
            "name": "nazi bunker",
            "id": 221257
         }
      ],
      "imdb_id": "tt0780645",
      "video": false,
      "title": "War of the Dead",
      "recommendations": [
         74006,
         147879,
         80583,
         152348,
         108147,
         107227,
         82756,
         153998,
         406582,
         213803,
         100032,
         54606,
         84293,
         222299,
         243901,
         77594,
         79078,
         109841,
         273511,
         48836
      ],
      "backdrop_path": "/kABkkP4aEBVKi8YlZlysK3J56ah.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Martin Stone",
               "gender": 2,
               "credit_id": "52fe495ac3a368484e127391",
               "name": "Andrew Tiernan",
               "profile_path": "/891RIqhOno9VLsYPIfzQsqytQZb.jpg",
               "id": 17290,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Lieutenant Laakso",
               "gender": 2,
               "credit_id": "52fe495ac3a368484e127395",
               "name": "Mikko Leppilampi",
               "profile_path": "/jkeUShOz01YAkmRO0AmB9v9qlfB.jpg",
               "id": 108476,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Captain Niemi",
               "gender": 2,
               "credit_id": "539d1f100e0a261325002b53",
               "name": "Jouko Ahola",
               "profile_path": "/fUvT6AAxzyGPkkeMekav8zd3eFu.jpg",
               "id": 34514,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Kolya",
               "gender": 2,
               "credit_id": "5a0fff6a92514138f60267bd",
               "name": "Samuel Vauramo",
               "profile_path": "/2ZbRpnmWbHlow2APdeXcuxIoLzF.jpg",
               "id": 147734,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe495ac3a368484e127387",
               "name": "Marko Mäkilaakso",
               "profile_path": null,
               "id": 1053404,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe495ac3a368484e12738d",
               "name": "Marko Mäkilaakso",
               "profile_path": null,
               "id": 1053404,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.193775,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "LT",
            "name": "Lithuania"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 77068,
      "vote_count": 20,
      "budget": 0,
      "overview": "Captain Martin Stone is leading a finely-trained, elite platoon of Allied soldiers as they attack an enemy bunker. Underestimating their enemy's strength, they are quickly beaten back into the forest. As they try to regroup, they are suddenly attacked by the same soldiers they had just killed a few minutes earlier. Forced to flee deeper into Russian territory, they discover one of war's most terrifying secrets and realize they have woken up a far more deadlier enemy.",
      "similar": [
         1771,
         228150,
         369885,
         485415,
         424,
         14574,
         637,
         19908,
         5925,
         72190,
         16869,
         339259,
         336843,
         82654,
         766,
         1251,
         10925,
         8408,
         853,
         423
      ],
      "original_title": "War of the Dead",
      "runtime": 86,
      "poster_path": "/u2xcdwUr7FCgyB23OBALnbIzEaR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Momentum Films",
         "id": 1269,
         "origin_country": ""
      }],
      "release_date": "2011-10-22",
      "vote_average": 3.6,
      "belongs_to_collection": null,
      "tagline": "What Killed Them Made Them Stronger",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Marko Mäkilaakso"],
      "runtime": 86,
      "synopsis": "March 1942. Captain Martin Stone (Andrew Tiernan - 300, The Pianist) leads an American unit on a mission to destroy an enemy bunker; joining forces with an elite platoon of Finnish soldiers; Cpt. Niemi (Jouko Ahola - Kingdom of Heaven) and Ltnt. Laasko (Mikko Leppilampi). The troops are torn apart by the same enemy soldiers they had killed a few minutes earlier in an ambush. The living dead? Evil forces? Or SS experiments gone wrong?",
      "writers": [
         "Marko Mäkilaakso",
         "Marko Mäkilaakso"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0780645/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjgxMDgzNjIwM15BMl5BanBnXkFtZTcwODQ3ODU4Ng@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Andrew Tiernan, Jouko Ahola, Samuel Vauramo | See full cast and crew »"],
      "reviews": [
         "the best way to describe this movie is that it's a B movie coated with A movie presentation. the special effects and the acting are the only things really holding it back from its true potential. the acting or dialogue is at times so bad and the accents so inconsistent that you wonder why the director didn't just choose to re-shoot some of the scenes and put a little more pressure on his actors. the special effects are sometimes good, but sometimes bad. this is made clear at the start of the movie when some men are gunned down in a hallway yet there is no sign of any bullet penetration or even sound effects here and there. some men just fall to the ground, we'r shown close ups of some weird nazi character grinning as he walks out of a lit-up doorway like a freaking angel or something. the best thing about this movie is its presentation. the cinematography and camera-work is pretty 'up there'. like one of the quotes on the DVD cover states, it is 'like an episode of band of brothers with zombies'. and yeah, it is; just with much less impressive actors. the story is unoriginal yet interesting enough to warrant your time and it looks like a lot of effort went into this little B movie. the characters all look fantastic (just like any soldier out of saving private ryan or band or brothers) and at times gunfights and explosions are convincing. its just a shame the acting and occasional iffy effects let it down. so in summary: presentation - 8 special makeup effects & sound - 6 acting - 5 script - 6 overall - 6/10",
         "I found \"War of the Dead\" by sheer coincidence. I had never heard about it prior to accidentally stumbling on it. And the cover of the DVD made me pick it up and give it a go, as I do enjoy zombie movies. And zombie Nazis, well it just doesn't get any better! Now, I will say that \"War of the Dead\" is unlike most other zombie movies that I have seen in my life. It has that whole \"Band of Brother\" / \"Saving Private Ryan\" feel to it, with the impressions that you are right there in the action with the soldiers. I liked that about the movie, because it is a cool thing. And taking place during World War II, but with zombies running around, well that is just an interesting concept. Sure it is used in other movies, such as \"Outpost\" and \"Død Snø\" (\"Dead Snow\") for example, but still it worked out quite well in \"War of the Dead\". One thing did puzzle me, and that was why Americans were there helping out the Finnish soldiers. That just didn't strike me as very plausible. But hey, it is just a fictional movie. Moving on, some of the accents throughout the movie were also a bit on the less impressive side. Effect-wise, then I found \"War of the Dead\" to be quite good. The movie had a heap of action with guns and explosions. But for a zombie movie, then the gore and actual mayhem caused by the zombies was a bit tame. Especially because the zombies were agile and running around, a feature in zombie movies that I am not a fan of. (Yeah, I am a Romero-zombie fan to the very core!) And also the zombies seemed to be capable of some brain activity, as they were able to do intricate fighting and blocking in brawling. And when the zombies jumped down from those tall trees, then I was ready to find something else to watch (but I didn't, I gave \"War of the Dead\" a fair chance). What was that all about? So now zombies climb 10-15 meters up into trees to hide and ambush those coming past? That was just too ridiculous. The feeling of the atmosphere in the movie was really one of the better things that was working to pull the movie up. Because it was a great mixture of \"Band of Brothers\" but mixed with the gritty places and narrow corridors that you had in the first two original \"Resident Evil\" games. And that worked out so well, because it really put on a brooding sense of being in the wrong place at the wrong time. I think that the people they had put in the movie in the various roles were actually doing good jobs with their roles. And it was refreshing to see a movie with no familiar faces popping up. The one who put on the most impressive and memorable performance in the movie was Samuel Vauramo (playing Kolya). As for a zombie movie, then don't expect the classical Romero type zombies in the movie, and don't except to see a lot of gore and mayhem, and don't expect to see any real decomposition in the animated corpses either. So if you put these expectations aside, then \"War of the Dead\" is actually a good, wholesome entertaining movie from Finnish director Marko Mäkilaakso.",
         "This movie does everything a B-movie needs to do, to get your attention. It's pretty trashy, it's pretty out there (who cares about historical accuracy anyway, right? ;o) ) and it does have some extreme ideas and still some decent acting (all judged by the limitations of budget of course, don't compare it to a blockbuster). If that sounds intriguing to you, than do not mind the silly name of the movie (though maybe the silly name prepares you somewhat), but do watch the movie and just enjoy it as it is meant to be. Having said that, if you can't fathom the idea of mistakes, ridiculous behaviour, OTT acting or OTT special effects at times, plus some explicit scenes of violence, than you might want to stay clear of this. It is not a great movie by any sense, but it will entertain you, if you let it.",
         "A platoon of British, American and Finnish soldiers come head to head with unstoppable zombie-like soldiers. Aided by a Russian grunt they must fight for survival. Despite some over used slow-motion and unfitting sound effects War of the Dead director Marko Mäkilaakso delivers a wonderfully atmospheric World War II action 'zombie' film. The film has pace, moving from one location to the next through bunkers, trenches, air shafts, forests and there's plenty of gun-play and fights. The effects are modest and well executed and the sets are perfectly dressed, the location shoot gives it an edge. Writers Mäkilaakso and Barr B. Potter include some zombie hallmarks an empty house under siege, a graveyard, shots to the head but the antagonists share more with 28 Day/Weeks Later's infected and Outpost's theme. War of the Dead expands the Nazi super soldiers angel further including some fast moving, stealthy, post experimental and 'infected' soldiers. Reminiscent of The Bunker, Death Watch, Dog Soldiers and the aforementioned to name a few this latest addition includes some great worn looking actors including Antti Reini, the reliable and talented Andrew Tiernan (who also starred in the The Bunker) as Capitan Martin Stone. UK viewers may recognise ITV's Bill - Mark Wingett. Supporting leads Samuel Vauramo as the emotional Kolya and Mikko Leppilampi as Lieutenant Laakso are effective enough. Notable is the only female Magdalena Górska and Jouko Ahola who is perfectly cast as the super soldier Captain Niemi. It lacks that slow foreboding feel synonymous with zombie films in a bid to be original. In addition, the mix of genres doesn't work as well for this WW2 predominately action, chiller as it should due to the thin script. Nevertheless, it's a solid piece of entertainment packed with action and an obligatory nihilistic ending with a twist.",
         "The plot: American and Finnish troops run up against Nazi zombies during World War II. This was not an absolutely terrible movie, but it was still pretty annoyingly bad. The characters were basically interchangeable, and it was even worse during the action sequences, because they were shot so poorly that I couldn't even tell who was fighting whom. Unfortunately, the movie feels like a meth addict did all the camera work and editing. The plot and dialogue are about as bad as you're expecting, but the SFX are far more disappointing. Nobody really expects good plot or dialogue from their direct-to-video, low budget zombie movies -- especially when they're rated this low -- but they do tend to expect a certain minimum level of gore. However, thanks to the horrible camera work and editing, you can't really see much of the SFX or make-up anyway. There just wasn't enough story to stretch this out to feature length, necessitating lots of terrible action scenes. This really should have been edited down to the best few scenes, with a little bit of setup, and uploaded to YouTube. Recommended only to people who like mindless action movies.",
         "This movie started out having a score of 5.9 and went down all the way to 4 sadly. Believe it or not, i did like it. The set up and the atmosphere is great. Acting is OK. And the movie has some good action scenes to keep the audience on. And it's one of ''Nazi zombie'' or a ''War horror'' movies that i really love. But the downfall of this movie is it's story. I think this movie would of been much better if it had bigger work put into the story. Explain more about the experiments, show some flash backs, etc. the one thing i don't like that the movie is VERY fast phase. You can see that movie does not leave out character development, but it's just not enough. Needs more character development and more dialogue and more suspense. the movie is not bad especially if you're a fan of genre. 6/10",
         "I watched the UK premier of this title at Fright fest Scotland. It's your basic mystery story at the start. Bad things are happening behind enemy lines. What is the cause, well with a title like War of the Dead it is easy to say its Zombies. What I liked about this movie was that it told the same old story of dodgy dealings behind enemy lines. It does it pretty good. The effects whilst good are below par. The movie itself looks like its a low to medium budget movie. This is not top of the class but it is good fun for what it is.Its better than zombies of war and Armageddon of the dead.",
         "Bad reviews aside, if you're into zombie movies, then you'll find a nice spin to this one. First of all, it plays out as a real WWII movie - the action, drama and dialog are all what you'd expect from a basic WWII movie. Of course though, there are Nazi zombies to fight. But the nice twist on the zombies is that they are fast-movers, and relatively intelligent in their attacks. As far as low budget, it seems pretty high budget for a zombie movie. In the trivia it even states that this is the \"Most expensive film ever produced in Lithuania.\" Now that may not be saying much but, the trivia also states that \"The film's original title was 'Stone's War', but was changed to 'War of the Dead', after Stan Lee had suggested it.\" So, if Stan Lee gave it the nod, and if the Lithuanian's spent their national budget making it, it's worth a look see.",
         "Yet again another staggeringly bad entry under the zombie banner. The movie has zero character development which leaves the viewer with nothing to care about. The writers should have watched predator or at least the first 15 minutes, it's a master class in how to set up the protagonists. Add to this the thinnest plot imaginable and you really are left with something you purely just stare at for 90 minutes. This means all that is left are the action sequences. I was often left wondering what the hell was going on and who was killing who. Action scenes were messily shot and in between you were given little more motive than let's drive this car over there to the next scene. The director clearly had been brushing up on his band of brothers and private Ryan as the film does mimic their look but only to a degree. The scene from Ryan where the Jewish soldier and German soldier wrestle over the knife was practically lifted wholesale and chucked in, laughable. These were not zombies, Nazi or otherwise. More like mutants. To address the \"if you love zombie movies, you'll love this\" or genre lovers (zombie or horror). I ask you this, why would you like or love this? It's terrible. I love zombies and horror, so much that this film irritated me. You may love zombies too but if you rate this at all you also simply like awful films too. That's fine but this particular film is a disservice to an already struggling genre. Avoid this watch Dead Snow.",
         "Acting is so cool. An artistic zombie army movie. All frames are like painting that you can put on your wall. The lights, the atmosphere are all pretty good. The editing and sound design are perfect. The plot, the story are successfully harmonized. There are a lot of unforgettable scenes in the movie, especially the falling scene. If you want to see zombie or vampire movies just to see the fighting lovers of a teenage girl (just like in true blood or twilight zone) don't watch this movie because this is a real war movie without the narcissist women. If you want to see zombie or vampire movies just to see the family drama just like in walking dead, don't watch this movie because this is a real war movie without cry babies. Artistic horror, perfect acting, excellent editing, with non-stop action. Yeah this is the one of the most wanted war movie style..."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Sci-Fi",
         "Thriller",
         "War"
      ],
      "productionCompanies": [
         "Accelerator Films",
         "Lietuvos Kinostudija",
         "Media One Entertainment"
      ],
      "summaries": [
         "This is a movie set during WWII and involves Captain Stone and a platoon of American and Finnish soldiers on a mission to find a bunker held by the Germans. On the way there they come under fire and at the same time run in to some German soldiers that seem to be \"undead\". How is this possible? Their platoon is almost completely killed off apart from a few of them, including Capt. Stone. They move on and run in to another survivor, a Russian soldier. They all try to survive and end up at the bunker they were meant to take out. But once inside they find out just how the German soldiers became the \"undead\".",
         "A platoon of American and Finnish soldiers is driven deep into a Russian forest where its Captain discovers a terrifying secret."
      ],
      "budget": 1000000
   },
   "movielensId": 96200,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-10-22",
      "dvdReleaseDate": null,
      "directors": ["Marko Mäkilaakso"],
      "runtime": 86,
      "movieId": 96200,
      "title": "War of the Dead",
      "mpaa": null,
      "actors": [
         "Andrew Tiernan",
         "Mikko Leppilampi",
         "Jouko Ahola",
         "Samuel Vauramo"
      ],
      "imdbMovieId": "0780645",
      "originalTitle": "War of the Dead",
      "genres": [
         "Horror",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["obkQFiTXwR8"],
      "plotSummary": "Captain Martin Stone is leading a finely-trained, elite platoon of Allied soldiers as they attack an enemy bunker. Underestimating their enemy's strength, they are quickly beaten back into the forest. As they try to regroup, they are suddenly attacked by the same soldiers they had just killed a few minutes earlier. Forced to flee deeper into Russian territory, they discover one of war's most terrifying secrets and realize they have woken up a far more deadlier enemy.",
      "tmdbMovieId": 77068,
      "avgRating": 1.95455,
      "releaseYear": "2011",
      "numRatings": 11,
      "posterPath": "/u2xcdwUr7FCgyB23OBALnbIzEaR.jpg"
   }
}