{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "japanese noir",
         "id": 180533
      }],
      "imdb_id": "tt1248984",
      "video": false,
      "title": "I Am Waiting",
      "recommendations": [71722],
      "backdrop_path": "/dfLwmLj4PqBVsm2f3vq7gv2xXWZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jôji Shimaki",
               "gender": 2,
               "credit_id": "52fe4844c3a368484e0f062d",
               "name": "Yûjirô Ishihara",
               "profile_path": "/vnZMcUVTxxgqGQmKfP7J2RT96Yu.jpg",
               "id": 140103,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Saeko",
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0631",
               "name": "Mie Kitahara",
               "profile_path": null,
               "id": 933472,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Uchiyama",
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0635",
               "name": "Isamu Kosugi",
               "profile_path": null,
               "id": 1063886,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Takeda",
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0639",
               "name": "Kôjirô Kusanagi",
               "profile_path": "/wVAjgreb6GWGwsi4g3kkzGEhbCY.jpg",
               "id": 233693,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Shibata elder",
               "gender": 2,
               "credit_id": "52fe4844c3a368484e0f063d",
               "name": "Hideaki Nitani",
               "profile_path": null,
               "id": 133707,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Police detective",
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0641",
               "name": "Kenjiro Uemura",
               "profile_path": null,
               "id": 117838,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4844c3a368484e0f0623",
               "name": "Koreyoshi Kurahara",
               "profile_path": "/bD785g5h2JdtFvE3IRQ4u2FtnTy.jpg",
               "id": 82949,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0629",
               "name": "Shintarô Ishihara",
               "profile_path": null,
               "id": 139091,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4844c3a368484e0f0647",
               "name": "Takiko Mizunoe",
               "profile_path": null,
               "id": 82467,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4844c3a368484e0f064d",
               "name": "Masaru Satô",
               "profile_path": "/eXVLW2cSdIqQmwvXqlN0soZwYNz.jpg",
               "id": 18609,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4844c3a368484e0f0659",
               "name": "Akira Suzuki",
               "profile_path": null,
               "id": 70632,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "593b727f9251410593005ef6",
               "name": "Kuratarô Takamura",
               "profile_path": null,
               "id": 1093053,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.211316,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 71719,
      "vote_count": 4,
      "budget": 0,
      "overview": "Jôji is a boxer barred from the ring; Saeko is a singer whose voice is gone. Lost souls, they meet one night by a quay; she may be thinking of suicide. He invites her to his café, and perhaps he will rescue her from the cabaret where she's under contract to a vicious mob leader. When the boss insists on her return, Jôji is bitter. He also despairs over lost dreams. His brother has gone to Brazil to purchase a farm; Jôji planned to join him but now believes his brother abandoned him. When Jôji discovers a clue about his brother, he needs Saeko's help. Like a fighter in the ring, he pursues the truth relentlessly, without regard for his own safety. Will it cost his life?",
      "similar": [
         12493,
         31589,
         86823,
         71723,
         38728,
         71722,
         254123,
         71720
      ],
      "original_title": "俺は待ってるぜ",
      "runtime": 91,
      "poster_path": "/wMdhvSX8KCRHRLQYgS2tBLgI3Nu.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
         "name": "Nikkatsu",
         "id": 955,
         "origin_country": "JP"
      }],
      "release_date": "1957-10-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 91,
      "synopsis": "Joji, a boxer in a world of feather and welter weights intimidates the underworld with his presence. He actually disarms a thug by asking for the gangster's gun. The gun is handed over to Joji who delivers a punch to the gun owner. Fight scenes are enacted with minimal if any music but hyper-real sound effects are used at times. It seems as if the fighters are performing on sand covered wooden floors. Very amateur fight moves compared to today's imports which gives it a nice innocent charm. Poetically shot scenes of reverie by an ocean embankment ( great diagonal shots) or in an empty restaurant lends a European feel to the movie, very French. The singer, Saeko, is revealed to have been an opera singer with an impeccable french accent who lost her talent due to illness. The spoiler revolves around Joji's brother.....Nice twist.",
      "writers": ["Shintarô Ishihara"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1248984/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwMzkxNTA5M15BMl5BanBnXkFtZTcwMzQ0ODk3Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Yûjirô Ishihara, Mie Kitahara, Isamu Kosugi | See full cast and crew »"],
      "reviews": [
         "The earliest film in Eclipse's new Nikkatsu Noir set, this one stars Yujiro Ishihara and Mie Kitahara, the two stars of the previous year's Crazed Fruit (these are only two of about two dozen films they made together). I Am Waiting is a pretty good crime flick about a retired boxer who meets up with a lounge singer who is trying to run away from her gangster employer. The boxer has been waiting a year for his brother to contact him from Brazil, where he hopes to move and help his brother farm. Turns out that his brother never made it there. His mysterious disappearance is linked with the aforementioned gangsters. The story here is really good, and, in general, it's well directed and performed. It does move a tad too slowly, though, and the two halves of the plot, the romance and the mystery of the missing brother, are connected by a pretty big and hard-to-buy coincidence. It's a good film, but it's one that feels like it could have been done a little bit better (the perfect film for a remake!).",
         "Jôji is a washed up boxer. One night he meets Saeko down by the harbor--and she's contemplating killing herself as she's lost her voice--and that's terrible for a professional singer! You don't learn all this up front--it slowly unfolds as the film progresses. However, what neither knows is that her employer and Jôji's plan to move to a farm in Brazil are actually inextricably linked. There is MUCH more to the plot than this, but I'd rather say nothing more about this--as the plot is pretty interesting and offers lots of nice twists and my discussing the plot would ruin the suspense. This is a movie that creeps up on you slowly. At first, it seems like an ordinary sort of film about two losers who somehow find each other. However, keep watching--the plot changes into less of a romance and more a film noir treasure. The dark lighting, criminals who come into their lives and the dark turn of the plot all work together to make a dandy film--well written, well acted and very exciting in its direction.",
         "This is the debut feature film from to-be-New Wave director Koreyoshi Kurahara, also responsible for The Warped Ones, one of the craziest films from the 1960s. I Am Waiting is a different piece of work, so if you liked TWO, don't expect anything similar here. I Am Waiting is a film noir reminiscent of those from America or France, so there's nothing truly exotic about the movie in this regard, in fact, the only thing in the film you wouldn't find in a Western production is a game of mahjong. The film stars Yujiro Ishihara and Mie Kitahara, fresh off their collaboration on Ko Nakahira's Crazed Fruit (1956), amongst many of their other films. The story is a typical noir plot about crime, melancholia and characters haunted by their past mistakes. The plot is based entirely on coincidences, be it the principal three characters all having the same past crime of murdering someone, or the huge coincidence that connects the main two story lines. But it's not really a lazy writing device because the entire plot is based on these coincidental happenings. The film starts off as a romance/character study, but later dissolves into a crime thriller with fisticuffs and investigations. For the most part though, it seems as if the mobster villains weren't in Kurahara's interest as much as the romantic plot was. The dumbest thing about the movie are the villains; they're completely incompetent and it's almost a joke how much of an advantage the hero has over them. They're unable to kill a person by whacking him on the head with a bat and throwing him unconscious in the sea, but the protagonist is perfectly capable of delivering swift killing punches as he effortlessly disposes of multiple baddies by beating them to death. The entire boxing sub-plot actually reminds me of Kubrick's film noir Killer's Kiss, which came out two years before Kurahara's film. The movie's pace is slow but naturally escalates in the final scene, in the true spirit of the classic narratives of many other notable crime films of the period. The opening sequence showing water dripping water on a pond is memorable, as well as some minor stylistical choices, such as utilizing ceiling fans to create rotating shadows onto the set, a trick Kurahara used to better effect years later in The Warped Ones. This movie started off my Nikkatsu Noir experience and while certainly not bad, it isn't anything special either. All in all, I'm definitely interested in seeing more of these films, but this one was just OK.",
         "A bar owner on the waterfront takes action to prevent a young woman from killing herself. This leads to a nice relationship, but both characters are carrying around deep secrets. The young man was a promising boxer but one night a man provoked him into a fight and he killed him, losing any chance of realizing his dream. This has led to depression and hope of changing his life in some way. His brother has supposedly gone to Brazil and is getting things ready for them to farm some land. The odd thing is that there has been no word from the him. The young woman is a lounge singer, and she is hooked up with some bad guys who want her back. Neither of them can seem to get rid of their respective pasts. Soon, the two stories become intertwined. This isn't bad but it is slow moving and meandering. Also, there is some unfinished business at the end."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["Nikkatsu"],
      "summaries": [
         "Jôji is a boxer barred from the ring; Saeko is a singer whose voice is gone. Lost souls, they meet one night by a quay; she may be thinking of suicide. He invites her to his café, and perhaps he will rescue her from the cabaret where she's under contract to a vicious mob leader. When the boss insists on her return, Jôji is bitter. He also despairs over lost dreams. His brother has gone to Brazil to purchase a farm; Jôji planned to join him but now believes his brother abandoned him. When Jôji discovers a clue about his brother, he needs Saeko's help. Like a fighter in the ring, he pursues the truth relentlessly, without regard for his own safety. Will it cost his life?",
         "She believes she may have just killed someone. He is a restaurateur who will soon be leaving Japan to join his brother in Brazil, the brother who is in the process of buying a farm there. He is leaving Japan since there is no longer anything holding him there. These few pieces of information are about all each will tell the other during their first evening together after Saeko and Jôji have a chance meeting one rain soaked late night outside Jôji's port-side restaurant. Both are broken souls, Jôji who reaches out in an effort to help someone who was contemplating suicide. When she learns that he going to Brazil, the only dream he has left, is in an effort to escape his troubles, she reaches out in return. In spending more time together, they will learn more about what troubles the other. Saeko is a classically trained opera singer who lost the ability to sing opera due to damaged vocal cords, she running away from that past which has some difficult emotional connotations beyond the singing. She now is reduced to singing under the stage name Reiko in a sleazy cabaret owned by a lowlife named Shibata, who believes he owns her as well. The man she thinks she may have killed is Shibata's brother, one of his strong arms, who tried to have his way with her. Jôji is a former boxer who killed a man in a bar fight, which resulted in his boxing license being revoked. Regardless, he vowed never to fight again out of emotional guilt. Despite the other man starting the fight, he wants to go to Brazil to run away from that guilt. As Saeko and Jôji get more entwined in helping the other, they will find that their troubles are more connected than they could have ever imagined, especially as Jôji waits to hear from his brother about the farm purchase, his brother who he has not heard from in a year.",
         "A former boxer gets involved with a club hostess trying to escape the clutches of her gangster employer."
      ],
      "budget": 0
   },
   "movielensId": 96227,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1957-10-22",
      "dvdReleaseDate": "2009-08-25",
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 91,
      "movieId": 96227,
      "title": "I Am Waiting",
      "mpaa": null,
      "actors": [
         "Yûjirô Ishihara",
         "Mie Kitahara",
         "Isamu Kosugi",
         "Kôjirô Kusanagi",
         "Hideaki Nitani",
         "Kenjiro Uemura"
      ],
      "imdbMovieId": "1248984",
      "originalTitle": "俺は待ってるぜ",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jôji is a boxer barred from the ring; Saeko is a singer whose voice is gone. Lost souls, they meet one night by a quay; she may be thinking of suicide. He invites her to his café, and perhaps he will rescue her from the cabaret where she's under contract to a vicious mob leader. When the boss insists on her return, Jôji is bitter. He also despairs over lost dreams. His brother has gone to Brazil to purchase a farm; Jôji planned to join him but now believes his brother abandoned him. When Jôji discovers a clue about his brother, he needs Saeko's help. Like a fighter in the ring, he pursues the truth relentlessly, without regard for his own safety. Will it cost his life?",
      "tmdbMovieId": 71719,
      "avgRating": 3.5,
      "releaseYear": "1957",
      "numRatings": 4,
      "posterPath": "/wMdhvSX8KCRHRLQYgS2tBLgI3Nu.jpg"
   }
}