{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0036036",
      "video": false,
      "title": "Immensee",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elisabeth Uhl",
               "gender": 1,
               "credit_id": "5352b9b4c3a3681d8d002bb8",
               "name": "Kristina Söderbaum",
               "profile_path": null,
               "id": 55762,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Reinhart Torsten",
               "gender": 2,
               "credit_id": "5352b9c3c3a3681da0002b8f",
               "name": "Carl Raddatz",
               "profile_path": "/kqmZ01s7Am2P30ABssH07fTY7jE.jpg",
               "id": 36837,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Erich Jürgens",
               "gender": 2,
               "credit_id": "5352b9d4c3a3681d93002c12",
               "name": "Paul Klinger",
               "profile_path": "/6umUiaoYRN2B3LMGoNz9eoqt4sR.jpg",
               "id": 11930,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Vater Torsten",
               "gender": 2,
               "credit_id": "5352b9e3c3a3681d7b002ced",
               "name": "Max Gülstorff",
               "profile_path": "/eQK7VtDhbB3dh41bvxpDGOK2q6s.jpg",
               "id": 47213,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Vater Jürgens",
               "gender": 0,
               "credit_id": "5352b9f0c3a3681da5002bcf",
               "name": "Otto Gebühr",
               "profile_path": null,
               "id": 29180,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Vorsitzender der Prüfungskommission",
               "gender": 0,
               "credit_id": "5352ba02c3a3681d93002c1d",
               "name": "Albert Florath",
               "profile_path": null,
               "id": 46704,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Reinharts Diener",
               "gender": 0,
               "credit_id": "53d101840e0a265e0100c830",
               "name": "Walter Bechmann",
               "profile_path": null,
               "id": 592845,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "59feccab92514146bd0369bb",
               "name": "Carola Toelle",
               "profile_path": null,
               "id": 1386293,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "59feccb692514146e8032b47",
               "name": "Lina Lossen",
               "profile_path": null,
               "id": 1010118,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "59fecccb925141470c035bdb",
               "name": "Germana Paolieri",
               "profile_path": null,
               "id": 1116148,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "59feccdd925141470c035bf5",
               "name": "Käthe Dyckhoff",
               "profile_path": null,
               "id": 1352725,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "59fecce892514146bd036a61",
               "name": "Wilfried Seyferth",
               "profile_path": "/mraT79yu5AU75AsAGLbDOcPwGpN.jpg",
               "id": 38245,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "59feccf5c3a3686835037b32",
               "name": "Malte Jaeger",
               "profile_path": null,
               "id": 51293,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "59fecd06c3a3686844032824",
               "name": "Clemens Hasse",
               "profile_path": "/eVS2qqQjxptCVEQrYQZhSjAHdbl.jpg",
               "id": 13381,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "59fecd17c3a368687e02f733",
               "name": "Ernst Legal",
               "profile_path": null,
               "id": 47218,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "59fecd2ac3a368684403286e",
               "name": "Claire Reigbert",
               "profile_path": null,
               "id": 1422506,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5352b9a3c3a3681d93002c0f",
               "name": "Veit Harlan",
               "profile_path": "/jai4bI2A8SjE3pLgsqj29rJ8bhO.jpg",
               "id": 55761,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59fecc00c3a3686868032b61",
               "name": "Veit Harlan",
               "profile_path": "/jai4bI2A8SjE3pLgsqj29rJ8bhO.jpg",
               "id": 55761,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59fecc08925141471d036fe2",
               "name": "Alfred Braun",
               "profile_path": null,
               "id": 28878,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59fecc3d925141471d037046",
               "name": "Theodor Storm",
               "profile_path": null,
               "id": 1829561,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "59fecc4bc3a36868930382f4",
               "name": "Bruno Mondi",
               "profile_path": null,
               "id": 6244,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59fecc62925141470c035b01",
               "name": "Friedrich Karl von Puttkamer",
               "profile_path": null,
               "id": 1196910,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59fecc7192514147050349d1",
               "name": "Wolfgang Zeller",
               "profile_path": null,
               "id": 11575,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "59fecc8192514147330347cf",
               "name": "Veit Harlan",
               "profile_path": "/jai4bI2A8SjE3pLgsqj29rJ8bhO.jpg",
               "id": 55761,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.816434,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 265579,
      "vote_count": 2,
      "budget": 0,
      "overview": "Elisabeth’s great love is Reinhart, a budding musician.  They spent a happy childhood together on the Immensee.  And although he loves her, too, he leaves Immensee to take up his studies in Hamburg.  For a long time, no one knows what’s become of him; until they meet once again at Immensee.  Happy about this meeting, Elisabeth visits him in Hamburg.  But she finds city life to be strange and confusing; and so, she returns back home disappointed.  Finally, Erich, who has waited for her a long time, confesses to her, that he’s in love with her.  When Eric’s father dies and he inherits the farm, he asks Elisabeth to marry him.  When he eventually dies, Elisabeth stays loyal to him even in death.  Now that the famous director Reinhart is ready to show her his affections, she’s not to be swayed.",
      "similar": [],
      "original_title": "Immensee",
      "runtime": 89,
      "poster_path": "/oABbYLSP8I46YRmqw1Zq7nCtYuW.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Universum Film (UFA)",
         "id": 12372,
         "origin_country": ""
      }],
      "release_date": "1943-12-08",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Veit Harlan"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Theodor Storm",
         "Veit Harlan"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0036036/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODk2Mjk1NTQxMl5BMl5BanBnXkFtZTcwMTU3NzAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kristina Söderbaum, Carl Raddatz, Paul Klinger | See full cast and crew »"],
      "reviews": [
         "A woman's marriage to a wealthy landowner is threatened when her childhood sweetheart, now a famous musician, returns after a long absence. Loosely based on Theodor Storm's novella, this melodrama was set in rural North Germany. Directed by the notorious `Jud Süß'- director Veit Harlan and featuring his wife Kristina Söderbaum in the female lead, this film offers some stunning colour photography.",
         "I have only seen this movie once, years ago, but since then I have been watching out for it to be shown again on television, because I think it's one of Germany's best dramas ever made. The characters are so emotional and the portrayal of their feelings is so refined, this picture is surely ripe for a revival. I even think it's better than Storm's novel itself!",
         "I went to see this at the cinema in Vienna, fully expecting to hate it...after all it was directed by one of cinematic history's all-time villains, Veit Harlan, who directed the notoriously antisemitic drama Jud Suss. And yet...I found myself drawn into the story in spite of myself, and in spite of the fact that Kristina Soderbaum (Harlan's wife) lacks charisma, a charge which can't be laid at the door of her co-star, Carl Raddatz, who is one of those ugly-but-sexy men, and has a distinct screen presence. The reason? The film is so poetic, so haunting, that even though its melodramatic tale is much-ado-about-nothing in some ways, it burrows beneath your defences. It is' at times beautiful to look at, and the score is often overpoweringly evocative. Proof that in artistic terms at least, even villains are not necessarily two-dimensional.",
         "Immensee is based on a novella by Theodore Storm. The propaganda ministry took advantage of the fact to promote self sacrifice. Christine Soderbaum portrays Elizabeth who lives on the estate of Immensee with her mother ,played by Carolla Toelle, she has no desire to ever leave it. With her next door neighbors Eric, played by Paul Klinger, with his sick ,on the wheel chair father,portrayed by Otto Gebuhr, known for his Fredrick the great impersonations, appearing for the first time in a color film.Reinhart , portrayed by Carl Radatz , is a music students who is training to be a symphony conductor and composes his music, is on a holiday and staying with his parents, portrayed by Lina Lossen , who played the prison maiden in to the New shore, and Max Gulstorf as his father.Rein And Liz are in love with each other. They see each other every day, but Rein is wild and likes to go to new places meet different people while Liz wants to stay at Immensee forever. This is the conflict in this film,she wants him to settle down at Immensee and marry her and he want her to go with him around the world. Then there's the neighbor Eric , he too is in love with Liz but but is too shy to let his feelings be known. Otto Gerbuhr character is a stoic who accepts that death is coming to him. I think this was a propaganda message to the German audience to except the death of their love ones fighting for Adolph. Well He promises her that he will come back on his birthday as he goes back to the music conservatory. The next day that he leaves she misses him. Her mother tries to discourage her from him cause he's not a settle down type. She encourages Eric to take more interest in her. His birthday comes and his fellow music students students surprise him at 12 midnight at his dorm with a party. He had written a song about his girl friend Liz and the students surprises him out of his bed with a party and they sing the song with Jesta, played by Kathe Dykhoff, his second girl friend, on the lead with the chorus of students. The party headed by , I hope I'm not wrong about this., music student friend, played by Wilfried Seyferth. Character German actor stalwarts, Clemens Hasse and Maltie Yeger , they're first appearance in a color film, show up as students too. As Rein goes into his bed room to get his robe on , Wilf notices this red book and he open it up it's songs he had written about his girl friend Liz. He and the students start reading it and choose one song and start to sing it. Rein comes out of his room and sees Jesta with his book he chases after her to get it while the music students watch.He does come back to Immensee but when he has to leave and this time for more years, He ask Liz to come with him when she takes him back to the train but she turns him down. So over the years he's studying the music and not visiting Immensee. Liz is worried he hasn't contacted her.He taking his music examinations. One of the professors . played by character actor German stalwart Albert Florath, on his symphony he composed fro his test. He passes and gets a music degree . Liz get's suspicious and goes to see him and the land lady of the dorm shows him his room she opens up his bed room and theirs Jesta sleeping in it. Her suspicion were rights but the Land lady suggest that they had a party that night and he might of let her sleep in his bed room while he slept in another room. She doesn't believe that. So she goes ahead and marries Eric.Later when Rein returns for a break, after Eric and Liz sees that he's back, Invites him to his house , Eric s, and even insist that since he does not have to got back for a while to stay at their place and he can compose. Liz doesn't like this because she fears she still loves him. But their love starts to rekindle and Eric notices this at a community center party and dance where there is a talk about building a Brandy factory in Immensee. Her mother warns Eric about Rein. For Rein and Liz are dancing up a storm together , waltzing, . She goes out side cause she's getting hot. Rein want her to runway with him she say no. Later on Eirc give her permission to have the affair cause he's not jealous . That's when she realizes she loves Eric ,so she send Rein away, Year later Rein is a famous conductor and Liz goes to see him after the show. Eric has died .but both have realized that they were never really were in love with each other and that she sacrifices him for Immensee and he sacrifices her for money and fame . This movie is available in subtitles at German war films dot com. Soon a digital D.V.D. print from Reichs Kino 09/01/11. I got the digitally restored print from Reichs kino. It's still light in contrast but it's digitally sharper although no subtitles.",
         "This film has not aged well. It's a melodrama with capital M, and the director isn't ashamed of using everything in his arsenal not to let us forget that. The acting is pregnant with tears, the dialog is highly noble without ever being more than superfluous, and everything is through-scored with an academic, predictable, serious and dignified symphonic score, which flows over the spectators like syrup over flies. The film might work, if the protagonists were more sympathetic. They are, however, not: Karl Raddatz is incredibly ugly, even though he is supposed to be the handsome hero. Kristina Söderbaum only has one or two emotions to display, and to be quite honest, being a healthy woman who looks as gentle as a pork pie, she really shouldn't have been cast in all these over-suffering roles. But then, her husband knew better. The colour photography is very good, and some of the cast - like pretty Käthe Dyckhoff who enjoyed a brief career during the war - are likable."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Universum Film (UFA)"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 96292,
   "movielens": {
      "languages": [
         "Italiano",
         "Deutsch"
      ],
      "releaseDate": "1943-12-08",
      "dvdReleaseDate": null,
      "directors": ["Veit Harlan"],
      "runtime": 89,
      "movieId": 96292,
      "title": "Immensee",
      "mpaa": null,
      "actors": [
         "Kristina Söderbaum",
         "Carl Raddatz",
         "Paul Klinger",
         "Max Gülstorff",
         "Otto Gebühr",
         "Albert Florath",
         "Walter Bechmann",
         "Carola Toelle",
         "Lina Lossen",
         "Germana Paolieri",
         "Käthe Dyckhoff",
         "Wilfried Seyferth",
         "Malte Jaeger",
         "Clemens Hasse",
         "Ernst Legal",
         "Claire Reigbert"
      ],
      "imdbMovieId": "0036036",
      "originalTitle": "Immensee",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Elisabeth’s great love is Reinhart, a budding musician.  They spent a happy childhood together on the Immensee.  And although he loves her, too, he leaves Immensee to take up his studies in Hamburg.  For a long time, no one knows what’s become of him; until they meet once again at Immensee.  Happy about this meeting, Elisabeth visits him in Hamburg.  But she finds city life to be strange and confusing; and so, she returns back home disappointed.  Finally, Erich, who has waited for her a long time, confesses to her, that he’s in love with her.  When Eric’s father dies and he inherits the farm, he asks Elisabeth to marry him.  When he eventually dies, Elisabeth stays loyal to him even in death.  Now that the famous director Reinhart is ready to show her his affections, she’s not to be swayed.",
      "tmdbMovieId": 265579,
      "avgRating": 3.75,
      "releaseYear": "1943",
      "numRatings": 2,
      "posterPath": "/oABbYLSP8I46YRmqw1Zq7nCtYuW.jpg"
   }
}