{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "dating",
            "id": 13043
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "masturbation",
            "id": 33451
         }
      ],
      "imdb_id": "tt0828393",
      "video": false,
      "title": "Garden Party",
      "recommendations": [
         28026,
         82432,
         38138,
         96314,
         177851,
         53734,
         111894,
         20478,
         62986,
         67955,
         47541,
         71394,
         38051,
         17168,
         386623,
         59293,
         27647,
         202176,
         62142,
         22152
      ],
      "backdrop_path": "/mV3WsxMajtfMbtiTQPtCX06ixo4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sally St. Claire",
               "gender": 1,
               "credit_id": "52fe45d69251416c7506427d",
               "name": "Vinessa Shaw",
               "profile_path": "/jMEm0tSVH3ZSqj5iXrHUhz9oLpu.jpg",
               "id": 5025,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lana",
               "gender": 1,
               "credit_id": "52fe45d69251416c75064287",
               "name": "Tierra Abbott",
               "profile_path": "/9WIL44wmHMpWsSz4G7FZcKZ3nVL.jpg",
               "id": 168213,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Davey Diamond",
               "gender": 2,
               "credit_id": "52fe45d69251416c7506428b",
               "name": "Christopher Allport",
               "profile_path": "/kPnzLpS2G5CLVIQZda81Sz83zW4.jpg",
               "id": 157169,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "April's Mother",
               "gender": 1,
               "credit_id": "52fe45d69251416c7506428f",
               "name": "Lisa Arturo",
               "profile_path": "/osZvDdZKMMoLsiVaq3igLwpNhQ5.jpg",
               "id": 55619,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dirk",
               "gender": 0,
               "credit_id": "52fe45d69251416c75064293",
               "name": "Erik Bragg",
               "profile_path": null,
               "id": 168249,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Nathan",
               "gender": 2,
               "credit_id": "52fe45d69251416c75064297",
               "name": "Alexander Cendese",
               "profile_path": "/wb9ElAiZQguXwuyLwai1OwBvaqS.jpg",
               "id": 168280,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Adriana",
               "gender": 0,
               "credit_id": "52fe45d69251416c7506429b",
               "name": "Alesha Rucci",
               "profile_path": null,
               "id": 95048,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Second Groupie",
               "gender": 0,
               "credit_id": "52fe45d69251416c7506429f",
               "name": "Lindley Domingue",
               "profile_path": null,
               "id": 168308,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Tiff",
               "gender": 1,
               "credit_id": "52fe45d69251416c750642a3",
               "name": "Jennifer Lawrence",
               "profile_path": "/hLzgl1dS8O2IAn1PIwHYhxR0Lkm.jpg",
               "id": 72129,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "April",
               "gender": 1,
               "credit_id": "52fe45d69251416c750642a7",
               "name": "Willa Holland",
               "profile_path": "/wSn01hjcRFnamCrvhbUJyeMIbxo.jpg",
               "id": 1223171,
               "order": 9
            },
            {
               "cast_id": 29,
               "character": "Carlos",
               "gender": 2,
               "credit_id": "57d5f276c3a3684f37002398",
               "name": "Jeffrey R. Newman",
               "profile_path": "/p2to94cdYmP6vGugvmcMUQs1K6Q.jpg",
               "id": 1677897,
               "order": 10
            },
            {
               "cast_id": 30,
               "character": "Joey Zane",
               "gender": 2,
               "credit_id": "58414a199251417d5c005a3b",
               "name": "Ross Patterson",
               "profile_path": "/3Qd6FIEjAoakyFpgm4e0wxrzvzP.jpg",
               "id": 77809,
               "order": 11
            },
            {
               "cast_id": 31,
               "character": "Jasmine",
               "gender": 1,
               "credit_id": "58414a2dc3a36865b3005598",
               "name": "Shelly Varod",
               "profile_path": "/rZldnhPqzpKMXCzrkckR6pAzkZO.jpg",
               "id": 85516,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45d69251416c75064283",
               "name": "Jason Freeland",
               "profile_path": null,
               "id": 168200,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "532f239cc3a3685fdb0048b1",
               "name": "Jason Freeland",
               "profile_path": null,
               "id": 168200,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "532f23c0c3a3685fcb00478b",
               "name": "Robert Benavides Jr. \t",
               "profile_path": null,
               "id": 961615,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "532f23cfc3a3685fe20048d4",
               "name": "Daniel R. Padgett",
               "profile_path": null,
               "id": 1303939,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "532f23e1c3a3685fb30046a1",
               "name": "Deanna Brigidi",
               "profile_path": null,
               "id": 989750,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "532f23f9c3a3685fd3004830",
               "name": "Joseph Middleton",
               "profile_path": null,
               "id": 1593,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "532f2427c3a3685fcb0047a0",
               "name": "Elizabeth Birkenbuel",
               "profile_path": null,
               "id": 1303940,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "532f2437c3a3685fb30046ac",
               "name": "Debra LeClaire",
               "profile_path": null,
               "id": 997232,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "532f2445c3a3685fd300483d",
               "name": "Jennifer Levy",
               "profile_path": null,
               "id": 1181632,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "532f2456c3a3685fbb00474a",
               "name": "Tim Youd",
               "profile_path": null,
               "id": 997116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "532f246ac3a3685fac0046b2",
               "name": "Joseph Middleton",
               "profile_path": null,
               "id": 1593,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "532f2479c3a3685fcb0047a6",
               "name": "Jason R. Houston",
               "profile_path": null,
               "id": 1303941,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "564d1ffbc3a368603700892f",
               "name": "Jason Bistarkey",
               "profile_path": null,
               "id": 997233,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "564d2013c3a3686024009354",
               "name": "John Swihart",
               "profile_path": null,
               "id": 41674,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.55789,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14196,
      "vote_count": 21,
      "budget": 0,
      "overview": "Are you young, sexually confused, just trying to get by? Do you sing, dance or possess some other talent? Welcome to the Garden Party. At the center of the story is 15-year-old April. She is running from one bad situation into another, hoping to find an answer that doesn't involve taking off her clothes.",
      "similar": [
         17899,
         13078,
         23949,
         13416,
         8363,
         22152,
         15037,
         19053,
         9777,
         14922,
         979,
         8456,
         627,
         122081,
         112160,
         24469,
         41282,
         19874,
         133805,
         9025
      ],
      "original_title": "Garden Party",
      "runtime": 88,
      "poster_path": "/eHS8kIaxvFVBWvda0HBxmWbiyVK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lookout Films",
         "id": 21100,
         "origin_country": ""
      }],
      "release_date": "2008-07-11",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Come with a Dream. Leave with a Story.",
      "adult": false,
      "homepage": "http://www.gardenpartymovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jason Freeland"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Jason Freeland"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0828393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNTE2MTU2Nl5BMl5BanBnXkFtZTcwOTU3NjU3MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Erik Smith, Tierra Abbott, Vinessa Shaw | See full cast and crew »"],
      "reviews": [
         "Los Angeles is a city of transplants, every person arriving with a dream that is eventually shown to be an illusion in the harsh light of city's reality. GARDEN PARTY weaves this theme beautifully with an ensemble cast of up-and-comers. The film introduces each character as a classic archetype - the runaway teen, the frustrated artist, the demanding successful boss, the aspiring musician, the dead-end job dreamer - but the film then spends its time delving deep into the personalities behind these stereotypes, revealing them all as individuals as it entangles them in various plots that flirt with destruction but offer redemption. Along the way there is porn, pot, homelessness, backstabbing, tools from the entertainment industry, superficiality, revenge ... and love! As a native Angeleno, what struck me most was how this film captures the mundane, day-to- day existence of Los Angeles with every hint of glamor and Utopian paradise removed from the stark cityscape. What GARDEN PARTY delivers is an accurate and memorable vision of the city of Angels being a landscape of personalities, each with a dream, some with a dark side and most with a sympathetic humanity underneath it all.",
         "I have a habit of liking movies with low production value due to their craptasticness. There is nothing about this movie that is good except for the fact that it tries so hard with its worn out stereotypes and shoestring budget. The movie doesn't portray reality or LA at all. Yet, in all its cheesiness, I found myself smiling. The scenes with Ross Patterson as Joey Zane are really funny. He's trying so hard and it shows. The movie itself goes nowhere and ends where it starts: without any crescendo or plot succession. I guess these people are older and perhaps wiser, but I doubt it. I give this movie a 7 for its bad dialogue, tired portrayals of artists, and quotes like, \"I don't go to school. I'm a musician.\" If you like cheese and have a couple minutes to waste, this may be the movie for you.",
         "I liked Crash. I thought the interweaving story lines was subtle enough to not make me second guess any of the writing. The issues dealing with race and class differences was very compelling and brought me to a different level when I left the movie theater. I do not like Garden Party. Here we have yet another film about people living or moving to LA to try and follow their dreams. The problem with stories like this is the subject matter itself. The film has a smart premise, but I simply did not care for any of the characters. That being said, Garden Party is not a total failure. While the story lines that do join together are forced and many times just don't feel genuine in the least bit. But we do have small scenes of character interactions that are quirky, funny, and charming. The movie portrays LA a little differently than people see it as on the outside. Unfortunately for LA, the more real perception of the city isn't very pretty. And when a movie comes along trying to push that specific point, it better do it with some characters we want to care about. In the end, Garden Party is the story of how we struggle to live our lives, and how not everything is golden and happy on the outside. You might connect with some of the terribly stereotyped characters, but in truth the writing doesn't lend itself to a strong character development, the acting as a whole is sub par, and the story simply not believable. I didn't buy into it, but you might.",
         "The teenager April (Willa Holland) arrives in Los Angeles expecting to find a job and she stays at her lesbian cousin's home. Sammy (Erik Scott Smith) is a talented homeless singer, musician and composer that meets a guy that offers an opportunity to him to become a pop star. Nathan (Alex Cendese) is a young gay that has come to Los Angeles expecting to be a dancer but works as secretary of the real state agent Sally St. Claire (Vinessa Shaw). Todd (Richard Gunn) is an artist that neglects his girlfriend and spends most of his time in porn sites. Their lives are entwined when the pornographer Anthony (Patrick Fischler) meets Nathan and April in a bar and he offers two-thousand dollars to take nude pictures of them. Nathan befriends Sammy on the street. Sally hires April to work in her office with Nathan. And Sally dates Todd and finds that there are pictures of her in Internet. \"Garden Party\" is a film with enjoyable but pointless stories in LA. The characters are likable but the neither the characters and nor the situations are well developed. The one-dimensional characters are shallow and the story goes nowhere. My vote is five. Title (Brazil): Not Available",
         "Well, it's my first comment here on IMDb, but since this movie only had two comments before mine, one of them rating it perfect and the other one below average, I thought mine would make sense. First of, I really liked the semi slow-flowing pace this film had. It kept me entertained the whole way through, and I was excited to see what happened next. Eash characters little story holds dilemmas, and situations we can understand and relate to. While the storyline isn't heading anywhere in particular, it takes you through a short period of time in the character's life. I like this style, and when this is done well, I find I don't long for a big climaxes, or an ending where everything comes together. Sadly there is a lack of depth in the characters. The stereotype characters work very well, but we aren't allowed to look much further below the surface. The perspective is always from the outside as a spectator, which makes the few reactions and emotions seem pretty superficial and hollow. This movie could have been much more! A bit more manuscript development, and it would have been up there. So all in all: This is not a masterpiece, and not a movie I will remember, but a good hour and a half's entertainment well worth watching.",
         "Garden Party tells us the story of several individuals, all of them living in L.A.We have a homeless boy musically gifted,a 15 year old girl raised by questionable parents,a young gay men only now figuring out who he is and what he wants in life and a sexy and successful real estate agent with a not so bright past who has a soft spot for losers. This are the main characters. Also part of the story are a rich pervert and a sleazy photographer. What do most of this characters have in common? A dream or a certain ambition but also lack of money...due to this fact they find themselves hanging out with the wrong crowd or doing things they never thought they would.Eventually their paths cross.I really enjoyed this film, maybe it was my fascination for L.A. or my appetite for Indies... I'm not sure but I thought it was great. Very original script and the acting was great,despite most of the cast being somewhat unknown.Willa Holland who's probably the best known actress in this cast gave a subtle performance but she is one to watch. The soundtrack was also very interesting. I loved the film, it felt incredible refreshing and I would definitely recommend this movie regardless of the low rating it has on this website. 7.5/10",
         "It's not that Garden Party is badly made, just that it seems like this exact same movie has been made 3 or 4 times a year by 3 or 4 different indy filmmakers for the last 15 years. Is there some book out there that teaches people to write this same script as some sort of screen writing exercise? Is there something in the bottled water shipped into Los Angeles that makes people forget they've done this film over and over and over again? Is there some cursed videotape floating amongst the aspiring fringes of the movie industry where if you watch it, you see a girl climb out of a well and the only way to save your life is to write this same script and get it produced? Garden Party is about a bunch of fairly aimless people in LA whose lives are tangentially connected. Yes, one of them is a kid from the streets trying to break into show business. Yes, another is a gay kid from the Midwest. And yes, there's young girl running away from a broken home. No, there's really not much of a plot or a particular reason to give a crap about anything or anyone involved here. There is a moment about 2/3rds of the way through when things almost get a little interesting. Unfortunately, writer-director Jason Freeland is apparently allergic to drama, undermining and deflating the tension before the moment is halfway over. Our cast of characters includes April (Willa Holland), a young girl running away from a leering stepdad who has to turn to nude modeling for fast money; Sammy (Erik Scott Smith), a talented young musician who rises from homeless to budding pop star so fast and relatively painlessly it might make any real struggling singer/songwriter who watches this movie want to kill themselves; Todd (Richard Gunn), a wealthy artist with nothing better to do than masturbate to internet porn; Nathan (Alex Cendese), a blonde slab of beef whose Hollywood dreams have fizzled; Sally (Vinessa Shaw), a real estate agent who slips her clients marijuana as a sales technique; and Anthony (Patrick Fischler), a low-level pornographer who still quaintly uses an actual camera with film in 2008. The actors all do perfectly fine work. Vinessa Shaw gives the standout performance as a very benign version of a film noir temptress. She's sexy and smart but way too nice to people. The almost interesting part of the story is when Sally lures Todd into a scheme to get naked pictures of her removed from the internet, as if such a thing were possible. If this movie weren't so determined to avoid any sort of excitement, that might have been worth watching. As it is, the film sets up some drama and then completely undercuts any sense of danger or even conflict. Then it does it again, just in case you didn't get the point the first time. Garden Party is well directed and looks okay. The dialog isn't memorable but neither will it make you cringe or facepalm. It's really not a bad movie. The problem is that there've been so many low-budget films about \"tangentially connected people in city X\" that it's basically become a sub-genre, like torture porn or zombie movies. If you're going to add something to a sub-genre, you need to do something a little different with it. Garden Party never does. There's no reason to avoid this movie, but also no reason to watch this instead of one of the umpteen other versions of the same thing.",
         "Firstly, If you enjoy generic, safe, and predictable movies, like the ones 'Hollywood' often churn out, then you might not enjoy, or appreciate, this gutsy offering.... As we all know, independent movies are rather 'hit and miss', usually because they push the boundaries, regarding the industry standard rules, when it comes to the directing, production and writing. When an independent movie gets it right, it can be overly refreshing and satisfying. The first risk that 'Garden Party' takes, is that it refuses to give the viewers a recognisable lead character to follow. Instead, the first segment of the movie sets up the premise for several diverse characters, separately, each with their own story and subplot. This is dangerous, for any movie, as trying to follow multiple amounts of plots at once can easily become annoying, and result in an overload, causing the viewer to switch off in frustration. Luckily, in this particular case, it works, and the stories, and characters, quickly begin to intertwine and link with each other. We are introduced to a homeless, pretty boy, up and coming pop/rock singer, who remains placid and confused, as his ultra rise to stardom begins out of nowhere, and he starts to attract attention from promoters, beautiful women, and artists. We then have a young, attractive girl, from a questionable upbringing, who is encouraged by some friends, to get into the soft core porn industry. A young man, who has forgotten who he is, due to being on 24 hour duty to his control freak boss, in real estate, and drug pushing. A ruthless, sexy, and manipulative business women, who does anything to get what she wants, with a soft spot for losers, who she can mould and control. Other characters include an obsessive rich pervert, a seedy photographer, and a pot head who with no ambition. The movie runs along, at a fairly fast pace, and you suddenly begin to care about each character and their individual story. Whether it be in a good, or bad way, you are waiting for closure on each characters subplot, which eventually kind of combines into one big plot. Sex, and taboos, play a big part in the movie, but somehow, and strangely, the movie manages to be quite tasteful, and although sex, drugs, booze and porn are frequently mentioned, it manages to be non offensive, with no real smut element. Its realistic. With a mixture of comedy, drama, and passion, this one should keep you entertained throughout. I like this movie because it has the guts to be a bit different. Exploring scenarios that most movies wouldn't touch, and generally going with the flow. This adds excitement, and an unpredictable element for the viewer. Great acting, interesting soundtrack, good writing, and good directing. I would recommend this film to anybody with an open mind - 8/10",
         "I will also compare this with Crash, but in a positive way. Crash touched a lot of real issues, but had really crappy characters. Garden Party is not so much focused on a cohesive story, but has interesting protagonists. Also, I have to say that I believe the message to be slightly different. While Crash was about people touching other people's lives and actions having consequences, Garden Party is more about the transience of any relationship and the insignificance of its characters. Indeed, I believe the story of this film was not about the people in it as much as it was about how interesting people can make a story interesting when the underlying mechanism doesn't care about or need any of them. Or maybe it was just the mood I was in. This film presents actions like prostitution, posing for sexy pictures, selling drugs and even kidnapping and battery as normal things that people do randomly to reach their goals and live their dreams. Unless, of course, I just found Vinessa Shaw gorgeous and I am rating this high because I be horny.",
         "Even the rating of 5.7 for this film is a little too much. It is very poorly made as there is no premise, no action and no goal. Just a mixture of showing completely irrelevant characters living their lives, without much action. I almost felt that it was a horrible attempt of trying to compare itself to Pulp Fiction, of course was nowhere close to the classic. I wonder why is the movie called ''Garden Party'', yes, there was a garden party, which was only showed for like 30 seconds and was absolutely irrelevant to the film. Because of the song that kid made? Anyways, not enough to name the movie after that. Since it failed to make me care about the characters, i could not find it appealing to me in any way and got bored very quickly. This movie is only 88 minutes and that just shows you, that no matter how short the movie is it can be extremely boring if there is no action and no goal. The script is just weak, hence making the characters not look good even if they were not performing horribly. Anyways, dull conversations, no goal, no action, weak plot - boring."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Lookout Films"],
      "summaries": [
         "Are you young, sexually confused, just trying to get by? Do you sing, dance or possess some other talent? Welcome to the Garden Party. At the center of the story is 15-year-old April. She is running from one bad situation into another, hoping to find an answer that doesn't involve taking off her clothes. As April navigates Los Angeles, she falls in with a group of confused kids struggling to chase their dreams. The black widow at the center of this web is a sexy, pot-dealing realtor named Sally St. Clair. Anyone who gets too close falls victim to her kinky entanglements. For some it goes bad, for other worse.",
         "Teenager April arrives in Los Angeles expecting to find a job and she stays at her lesbian cousin's home. Sammy is a talented homeless singer, musician and composer that meets a guy who offers her an opportunity to him to become a pop star. Nathan is a young gay that has come to Los Angeles expecting to be a dancer but works as secretary of real state agent Sally St. Claire. Todd is an artist that neglects his girlfriend and spends most of his time on porn websites. Their lives are entwined when pornographer Anthony meets Nathan and April in a bar and he offers two-thousand dollars to take nude pictures of them. Nathan befriends Sammy on the street. Sally hires April to work in her office with Nathan. And Sally dates Todd and finds that there are pictures of her online.",
         "April (15) is running from one bad situation into another, hoping to find an answer that doesn't involve nudity, and falls in with a group of confused kids chasing their dreams. The black widow in the web is the sexy, pot-dealing Sally."
      ],
      "budget": 0
   },
   "movielensId": 96370,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-07-11",
      "dvdReleaseDate": null,
      "directors": ["Jason Freeland"],
      "runtime": 88,
      "movieId": 96370,
      "title": "Garden Party",
      "mpaa": "",
      "actors": [
         "Vinessa Shaw",
         "Tierra Abbott",
         "Christopher Allport",
         "Lisa Arturo",
         "Erik Bragg",
         "Alexander Cendese",
         "Alesha Rucci",
         "Lindley Domingue",
         "Jennifer Lawrence",
         "Willa Holland",
         "Jeffrey R. Newman",
         "Ross Patterson",
         "Shelly Varod"
      ],
      "imdbMovieId": "0828393",
      "originalTitle": "Garden Party",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["hg_SlvzQgFM"],
      "plotSummary": "Are you young, sexually confused, just trying to get by? Do you sing, dance or possess some other talent? Welcome to the Garden Party. At the center of the story is 15-year-old April. She is running from one bad situation into another, hoping to find an answer that doesn't involve taking off her clothes.",
      "tmdbMovieId": 14196,
      "avgRating": 2.61538,
      "releaseYear": "2008",
      "numRatings": 13,
      "posterPath": "/eHS8kIaxvFVBWvda0HBxmWbiyVK.jpg"
   }
}