{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "magic",
            "id": 2343
         },
         {
            "name": "archer",
            "id": 4393
         },
         {
            "name": "sorcerer",
            "id": 10821
         },
         {
            "name": "archery",
            "id": 53995
         },
         {
            "name": "brawl",
            "id": 174244
         },
         {
            "name": "astral projection",
            "id": 232993
         },
         {
            "name": "sword and sorcery",
            "id": 234213
         }
      ],
      "imdb_id": "tt0092860",
      "video": false,
      "title": "Deathstalker II",
      "recommendations": [
         31118,
         141600,
         113523,
         15895,
         46500,
         22033,
         203021,
         47360,
         39154,
         163447,
         85169,
         87699,
         39554,
         31634,
         85188,
         109122,
         42517,
         31397,
         107079,
         84901
      ],
      "backdrop_path": "/wCLWHo8hADl5GiyjCUQyWKC5IlS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Deathstalker",
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f753",
               "name": "John Terlesky",
               "profile_path": "/g30YnB2ioSEuJDKzseYdI8vb0sM.jpg",
               "id": 102439,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Reena the Seer / Princess Evie",
               "gender": 1,
               "credit_id": "52fe4582c3a368484e05f757",
               "name": "Monique Gabrielle",
               "profile_path": "/jIlS9UmmvOoX2Pu0MWPHX05LQrB.jpg",
               "id": 44995,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Jarek the Sorcerer",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f75b",
               "name": "John Lazar",
               "profile_path": "/bnzNSA0t92US3F6IP4FygnxvGlZ.jpg",
               "id": 45113,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Sultana",
               "gender": 1,
               "credit_id": "52fe4582c3a368484e05f75f",
               "name": "Toni Naples",
               "profile_path": "/aHTsQtWSDK24tQZxxSoKyJjbhhi.jpg",
               "id": 98149,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Amazon Queen",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f763",
               "name": "Maria Socas",
               "profile_path": null,
               "id": 52125,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Amazon Champion Wrestler",
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f767",
               "name": "Dee Booher",
               "profile_path": "/aa8dX4NQZWPljsIeEmRBq866VzJ.jpg",
               "id": 102607,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "High Priest",
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f76b",
               "name": "Jacques Arndt",
               "profile_path": "/9DC7FfULETr6vS44p1d8OK6w6Xu.jpg",
               "id": 102608,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Dying Soldier",
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f76f",
               "name": "Jim Wynorski",
               "profile_path": "/zfmdU522dCGkmxvsjqN3GPhtq19.jpg",
               "id": 98132,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Pirate",
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f773",
               "name": "Marcos Woinsky",
               "profile_path": null,
               "id": 52131,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f731",
               "name": "Jim Wynorski",
               "profile_path": "/zfmdU522dCGkmxvsjqN3GPhtq19.jpg",
               "id": 98132,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f737",
               "name": "Jim Wynorski",
               "profile_path": "/zfmdU522dCGkmxvsjqN3GPhtq19.jpg",
               "id": 98132,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f73d",
               "name": "Neil Ruttenberg",
               "profile_path": null,
               "id": 102604,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f743",
               "name": "Frank K. Isaac",
               "profile_path": null,
               "id": 52134,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4582c3a368484e05f749",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4582c3a368484e05f74f",
               "name": "R.J. Robertson",
               "profile_path": null,
               "id": 102605,
               "department": "Crew",
               "job": "Additional Dialogue"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 2.415967,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28218,
      "vote_count": 21,
      "budget": 0,
      "overview": "Deathstalker helps Reena the Seer out of a few jams, and she solicits his help for a bigger task. She reveals that she is actually Princess Evie, but the evil sorcerer had her abducted and cloned in order to seize control of the kingdom. Together they travel to the evil sorcerer's stronghold to restore the princess to her rightful position, encountering challenges along the way both from the sorcerer's goons and the fierce Amazon women.",
      "similar": [
         8067,
         32985,
         68735,
         37430,
         15895,
         9946,
         984,
         4771,
         562,
         275,
         68737,
         12445,
         27022,
         122,
         681,
         284052,
         321068,
         398175,
         6978,
         1571
      ],
      "original_title": "Deathstalker II",
      "runtime": 85,
      "poster_path": "/uExpnyNqJTMXKFxNERondlrkPAP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Aries Film International",
         "id": 4890,
         "origin_country": ""
      }],
      "release_date": "1987-11-11",
      "vote_average": 3.8,
      "belongs_to_collection": {
         "backdrop_path": "/bkNG55ZvMJh5m8k9xfYsZnCk6aa.jpg",
         "name": "Deathstalker Collection",
         "id": 48655,
         "poster_path": "/uBGUSn5Zjw9Si2R6Kgp0rrKD18I.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Wynorski"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Jim Wynorski",
         "Neil Ruttenberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092860/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxOTY5NzU2NV5BMl5BanBnXkFtZTcwNzU5MzYyNQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Terlesky, Monique Gabrielle, John Lazar | See full cast and crew »"],
      "reviews": [
         "Deathstalker II is the presumed follow-up to 1982's low-budget Deathstalker. Aside from the title, it's hard to consider this film a sequel. In fact, this film is so much more enjoyable than the first (or the third or fourth, for that matter) that such a statement is probably a good thing! The film begins with Deathstalker (John Terlesky) infiltrating what appears to be a treasure room in a dark castle. He sneaks up to an altar, upon which rests some form of crystal artifact, and in a scene that recalls either Raiders of the Lost Ark or Conan the Barbarian (no, really!), gingerly takes it from its place of honor and pockets it. Without warning, a legion of robe-enshrouded swordsmen rush in, and Deathstalker battles them off in truly heroic fashion.well, somewhat heroic fashion. After dispatching a few of these menacing thugs, Deathstalker breaks through a shuttered window, drops to a stone bridge below, and leaps to the back of his waiting horse before escaping into the night. In his wake, a scantily dressed warrior woman named Sultana (Toni Naples) steps to the window from which he made his daring escape and watches him vanish into the darkness. Without missing a beat, she turns to her remaining guards and vows, \"I'll have my revenge, and Deathstalker, too!\"--at which point the title card \"Deathstalker II\" comes up with a fiery background and a Morricone-esque theme, fully setting the style for this b-grade but surprisingly entertaining sword-and-sorcery \"epic\". In his travels, our hero encounters a lovely young woman who claims to be the wrongfully dethroned Princess Evie (former Penthouse Pet Monique Gabrielle). She implores him to aid her on her journey to reclaim her kingdom and overthrow the villainous wizard Jerak, who has used his skill at the black arts to create Princess Evie's evil duplicate (Mirror-Universe Monique Gabrielle). With the promise of fortune and fame thrown in his lap, Deathstalker accepts the task and the adventure begins in earnest. Along the way, the adventuring duo battle swarthy castle guards, undead zombies, sinister traps, amazon women warriors, an insidious pirate and his team of enforcers, the wicked Sultana, and numerous other hardships before finally reaching the castle and engaging in mortal combat with Jerak and Evil Evie. Who wins? Well, that would be telling, but suffice it to say that this is a quest that is certainly worth the 78-85 minutes(depending on which version you get)spent watching it. Filmed on a budget of apparently tens of dollars, Deathstalker II is rife with high-quality costumes, props and sets. Beautifully adorned styrofoam rock walls can be spotted in the opening scene as well as in the following tavern sequence, which also clearly features a poured concrete floor and fluorescent lighting in addition to numerous wooden barrels marked \"BEER\"!!! The ominous woods are made even more ominous with the generous use of a fog machine and well-concealed klieg lights streaming from between the trunks and branches of the trees. Colored light gels and inspired location shooting provide unique ambience for each new area, and the climactic sword battle (the Duel of the Titans mentioned in the title) is actually very well-choreographed and presented with a dynamic musical accompaniment. However, these technical achievements are only the tip of the cinematic iceberg! The actors chosen are all-too-clearly enjoying their respective roles to an enormous degree. Watch Monique's eyebrows as she gazes into her crystal doorknob and tells \"Stalker\" about the adventure he's about to undergo! Witness the unbridled amount of midget abuse that occurs throughout the film! Prepare for the Gladiator-like battle between Stalker and Gargo the Amazon! And be sure to spot the Fiat parked in the upper-left corner of the Amazon village scene! If you're in the mood for an unpretentious sword-and-sorcery adventure, Deathstalker II is your ticket. It's not Shakespeare, but it is a lot of fun. Rent it tonight (or better yet buy it outright!), and make sure your fridge is fully stocked with brew! P.S. Don't pop this sucker out of your VCR/DVD player until after you watch the outtakes over the end credits! Think of it as your reward for giving this one a chance!",
         "This is easily the best of the Deathstalker movies. John Terlesky isn't the musclebound hulk that Rick Hill was, and certainly not the musclebound hulk in the Boris Vallejo painting they used for the poster, but he doesn't have to be. This is a Deathstalker who knows perfectly well that he's in a campy, B-grade sword-and-sorcery flick, and is determined to have as much fun with it as he can. He takes nothing seriously, and almost everything is done with a wink at the audience. He wonders aloud at one point where the cliche Spikey Trap O'Death is, and when the spikes immediately pop out of the walls he just rolls his eyes, says, \"Son of a bitch!\", and deals with it. John Lazar as the villain Jarek knows it too. He's gleefully, manaically evil, but when he learns his adversary's moniker he can barely suppress the giggle as he repeats, incredulously, \"Deathstalker?!\" Monique Gabrielle takes her parts seriously, and it's just as well. She's the one who's always in need of a rescue, and I suppose that *someone* has to put up a show of genuine peril. She also fills out admirably the part that's absolutely essential in films of this quality: she supplies the main set of on-screen boobs. It wouldn't be a proper B-grade sword-and-sorcery flick without them. Sit back, have a beer or 5, and enjoy Deathstalker II. Laugh; you're supposed to. And stick around through the end credits for the outtakes. Those are funny too.",
         "Yeah, this is a sequel with nothing to do with the first one, and yeah, it's no Conan, but it doesn't try to be. Just remember who the writer/director is (the esteemed Jim Wynorski), take your mind off the hook, and go with it! The premise (soldier of fortune helps a princess in disguise regain the throne)is classic, but it's all told with such a goofy tone that comparison with a more serious film is, well, goofy. If you have the DVD edition with the director's commentary, you'll see where Wynorski was going when he made the film. The script is full of in-jokes from other movies in the genre, jokes from television, and more than enough one liners to fill a dozen old Bob Hope movies. You also get John LaZar (from Beyond the Valley Of The Dolls) as the evil sorcerer, Monique Gabrielle (of a zillion b-movies) as the damsel in distress, and Toni Naples in black leather as Sultana, who swings a mean sword. Add to that a gazillion extras (all masked so they can be used over and over in other scenes), lots of wooden swords painted silver, a fight to the death with Queen Kong (featuring Amazon ring girls holding up the round number painted on cardboard). Yep friends and neighbors, this one leaves no cliché unheard. Do I recommend it? Wholeheartedly. Genre fans won't be disappointed.",
         "One of those very few sequels that exceeds the original by far. Although Deathstalker wasn't too bad in its genre, Deathstalker 2 exceeds it both in `cheapness' and in `ridiculousness'. It wasn't going to be pretty and they knew that while making it. They broke almost every rule in film making, and ended up with a hilarious movie, full of `functional' nudity, hilarious dialogues and `fierce sword fighting'. It's so full of cross references with other movies, (copied set's e.g.) that even for the notorious movie freak it's impossible to find the all. This is truly one of the best films in its genre! I'm still happy I bought this ex rental VHS a few years ago, mainly because of the extremely overdone cover and the addition: `Also with former Penthouse Pet Monique Gabrielle' ha ha. It must have cost the makers more to hire her than the budget for the entire movie..",
         "This movie is awesome because it knows its a b-movie. it has it all: nudity, re-used extras, bad special effects, comedy and even a spoof on professional wrestling. Plus the outtakes at the end of the movie is hilarious. Don't get this movie if you expect great acting and beautiful cinematography, but if you go in knowing what to expect you'll love this movie!",
         "This has to rank alongside Roger Corman's best as one of the great cult favorites. The acting is atrocious and the direction is primitive at best. But there's plenty of action and bare bosoms, which is what such movies are all about. Terlesky seems to be getting by in Hollywood nowadays as a writer, director and actor in mostly B-movies, but D-2 represents the best of his early days. \"Is Deathstalker your first name or your last?\" You gotta love lines like that. A classic of sorts.",
         "This is one of the great fantasy \"B\" flicks. It has some of the funniest one liners, delivered in clasic \"B\" movie style. There's plenty of action and lots of laughs to be had watching this one. Besides the princess is cute and you have to love the villians style. If you're looking for perhaps one of the best low grade fantasy films ever produced than this would definitely be the one to watch. It rocks!",
         "This is one cool flick! Sure, lots of stock-footage -- sure, Deathstalker 1, 3, 4, are all terrible -- but, I promise you, this is a square deal! A funny, knowing, fast-paced comedy that's a hell of a lot better than \"Krull\" or whatever that friggin' Kevin Sorbo flick that was rightfully ignored in '98 -- Terlesky is the perfect anti-hero, and his fight with LaZar (from \"Beneath the Valley of the Dolls\" 'enuff said!) is actually taken seriously and is really well done. Oh, and they make Gabrielle look great (which is easy) and give a funny performance (which perhaps wasn't quite so easy). Genre fans give it a look -- makes a perfect double feature w/ \"Conan The Barbarian!\"",
         "I always loved \"B\" movies that have fun and don't take themselves too seriously. Add a likable male star in John Terlesky and the beautiful former Penthouse Pet in Monique Gabrielle and you have a classic. Even though this is a \"B\" movie, it has good enough special effects to get by. Probably the other most important part to make this a great movie are the two nude scenes by Monique Gabrielle! The movie starts out with the real Princess Evie being replaced by a fake. She recruits the Deathstalker to take her to the castle and reclaim her crown from Jarek the Sorcerer. She predicts their future and offers a reward if he will help her out. They battle bandits and Zombies along the way. Monique has a great line when they go to sleep for the night. She says \"Stalker is that your sword, or are you just glad to see me\". The next day they are caught by a group of women and they put him on trial by combat because he is a womanizer. He has to fight in a boxing ring and they play the Rocky Theme as he enters the ring. He has a very funny fight to the death with a huge woman. He wins and realizes Monique really is the princess. Monique plays the dual role of the princess and the fake princess. She did a great job in each role. As the fake princess she is made up and looks gorgeous. Her costumes are nice and revealing. The real princess spends her time in a brown outfit and she is not made up at all. She still looks gorgeous. Monique leaves the woman's camp when Deathstalker shows interest in the head woman. Stalker leaves when she becomes serious and comes to the rescue of Monique. They finally make it to the castle. Stalker is captured and Monique is attacked by the guards. They rip off her dress to check her heart. Monique boobs look great in this short nude scene. She was definitely hired for her body, even though she does a great job of acting. Later Stalker is saved by the fake princess. She wants to have sex with him and then kill him(this is how she keeps her appearance). She has on a Leia slave girl like outfit on and then she show her two talents in an excellent scene in bed. Nice shots of her boobs! Way to go Monique, it was well worth the wait. The good Monique kills the fake Monique and Stalker takes care of the Sorcerer. The final scene has Monique wearing a sexy white outfit and giving him a reward, herself! What a great reward. What a really fun movie with a really nice nude scene thrown in for Monique fans. 10 out of 10!",
         "An improvment over the first chapter of the saga, the movie stars John Terleski - a Tom Cruise look-alike - as the eponymous hero and the beautiful Monique Gabrielle in a double role. Do you want more? Monique is not nude a lot, alas, but she has a great love scene with Deathstalker near the end of the movie. For the rest, you get a fine B-movie romp, that doesn't take itself seriously at all. The bickering between the leading characters is full of good lines for both the protagonists, and as a sort of heroic fantasy parody this movie is great, probably one of the finest of Wynorski. Very fun even the choice to put bloopers during the end credits, not so usual at the time the movie was shot. A very good movie, worth your time."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Aries Films International",
         "New Horizons Picture"
      ],
      "summaries": [
         "Deathstalker helps Reena the Seer out of a few jams, and she solicits his help for a bigger task. She reveals that she is actually Princess Evie, but the evil sorcerer had her abducted and cloned in order to seize control of the kingdom. Together they travel to the evil sorcerer's stronghold to restore the princess to her rightful position, encountering challenges along the way both from the sorcerer's goons and the fierce Amazon women.",
         "Princess Evie of Jzafir is deposed by the evil sorcerer/swordsman Jerak and his voluptuous, and very dangerous, ally Sultana. Posing as Reena the Seer, Princess Evie enlists the aid of the renowned hero Deathstalker. Together they battle the forces of evil, including a clone of Evie created by Jerak, to win back Evie's kingdom."
      ],
      "budget": 0
   },
   "movielensId": 96631,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-11-11",
      "dvdReleaseDate": "2001-10-23",
      "directors": ["Jim Wynorski"],
      "runtime": 85,
      "movieId": 96631,
      "title": "Deathstalker II",
      "mpaa": "",
      "actors": [
         "John Terlesky",
         "Monique Gabrielle",
         "John Lazar",
         "Toni Naples",
         "Maria Socas",
         "Dee Booher",
         "Jacques Arndt",
         "Jim Wynorski",
         "Marcos Woinsky"
      ],
      "imdbMovieId": "0092860",
      "originalTitle": "Deathstalker II",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["gYyulM9Xzgc"],
      "plotSummary": "Deathstalker helps Reena the Seer out of a few jams, and she solicits his help for a bigger task. She reveals that she is actually Princess Evie, but the evil sorcerer had her abducted and cloned in order to seize control of the kingdom. Together they travel to the evil sorcerer's stronghold to restore the princess to her rightful position, encountering challenges along the way both from the sorcerer's goons and the fierce Amazon women.",
      "tmdbMovieId": 28218,
      "avgRating": 2.77778,
      "releaseYear": "1987",
      "numRatings": 9,
      "posterPath": "/uExpnyNqJTMXKFxNERondlrkPAP.jpg"
   }
}