{
   "tmdb": {
      "original_language": "pt",
      "keywords": [
         {
            "name": "criminal",
            "id": 15009
         },
         {
            "name": "political corruption",
            "id": 181659
         }
      ],
      "imdb_id": "tt1753722",
      "video": false,
      "title": "Two Rabbits",
      "recommendations": [
         33636,
         164941,
         259402,
         163959,
         21253,
         157366,
         86321,
         34071,
         59990,
         8441,
         81923,
         10125,
         40860,
         183766,
         69646,
         69666,
         49374,
         195423,
         69401,
         29262
      ],
      "backdrop_path": "/lvivD3cwaOC2CZVQnkBAQ3TtMhy.jpg",
      "revenue": 1620436,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Edgar",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e73",
               "name": "Fernando Alves Pinto",
               "profile_path": "/hiNuF8PC6vQZXubFm6aVHniqXZa.jpg",
               "id": 142322,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Julia",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e77",
               "name": "Alessandra Negrini",
               "profile_path": "/NuqcXWOCCrrcrimZdXHBuSwbiU.jpg",
               "id": 145609,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Walter",
               "gender": 2,
               "credit_id": "52fe4a10c3a36847f81b6e7b",
               "name": "Caco Ciocler",
               "profile_path": "/h27WDnvLtdVdRQxgIrQR38e7BdN.jpg",
               "id": 142319,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Maicon",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e7f",
               "name": "Marat Descartes",
               "profile_path": "/vsjsehuV8ragp3MxdGz0KJNfArC.jpg",
               "id": 933011,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Professor",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e83",
               "name": "Djair Guilherme",
               "profile_path": "/4w4NvFKlty2oz7TA8TNHyLq3AkM.jpg",
               "id": 1032015,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Jader",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e87",
               "name": "Roberto Marchese",
               "profile_path": "/9BxrX1MdcozAHOOoJxl4kBAdD6f.jpg",
               "id": 1032017,
               "order": 5
            },
            {
               "cast_id": 1009,
               "character": "Sophia",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e8b",
               "name": "Aldine Muller",
               "profile_path": "/tMAFni1BNsLj3Bz7Vmhf59vUdg.jpg",
               "id": 1032018,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Velinha",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e8f",
               "name": "Thaíde",
               "profile_path": "/5SRkoTHvQsZUIFM9VeFEdRNanO2.jpg",
               "id": 1032019,
               "order": 7
            },
            {
               "cast_id": 1011,
               "character": "Bolinha",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e93",
               "name": "Thogun",
               "profile_path": "/lZ7n8XW04BlySQkL3RGz2eEEPFH.jpg",
               "id": 223346,
               "order": 8
            },
            {
               "cast_id": 1012,
               "character": "Henrique",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e97",
               "name": "Neco Villa Lobos",
               "profile_path": "/ebdXx3VT4KP8Pr6TILWO2wxJ7fk.jpg",
               "id": 1032020,
               "order": 9
            },
            {
               "cast_id": 1013,
               "character": "Miojo",
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e9b",
               "name": "Carlos de Niggro",
               "profile_path": "/dtCN8w8yY9M3DrhyX44BfkVwCyX.jpg",
               "id": 1032021,
               "order": 10
            },
            {
               "cast_id": 1015,
               "character": "Robério (Tanajura)",
               "gender": 0,
               "credit_id": "58969d8dc3a36808a5011d9c",
               "name": "Charles Paraventi",
               "profile_path": "/3vo65ipC5cSmctFdZoEbLSh03pH.jpg",
               "id": 1181464,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e69",
               "name": "Afonso Poyart",
               "profile_path": "/7xSUp1CIYMUm8LJijbf5kpoGjIb.jpg",
               "id": 1032011,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6e6f",
               "name": "Izaías Almada",
               "profile_path": null,
               "id": 1032013,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a10c3a36847f81b6ea1",
               "name": "Afonso Poyart",
               "profile_path": "/7xSUp1CIYMUm8LJijbf5kpoGjIb.jpg",
               "id": 1032011,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.040016,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 102784,
      "vote_count": 51,
      "budget": 2000000,
      "overview": "Edgar is a young upper-middle class man, close to completing 30 years old, he lives a full life crisis and is in a position common to the vast majority of Brazilians. On the one hand the power, represented by a corrupt state, abusive and absent in their taxes before their obligations. On the other, crime increasingly organized violence became a constant in the lives of citizens in large cities. Edgar responds to all this as a modern vigilante. With the help of ingredients such as technology, counter-information and manipulation, Edgar concocts a brilliant plan, using the greed of their opponents as the reason for its destruction. As the plot unfolds, we know more about the dark past of each character as Edgar fit the pieces together in an intriguing puzzle that makes up the film's plot.",
      "similar": [
         414,
         629,
         1924,
         1538,
         49049,
         281,
         136795,
         339692,
         339988,
         395990,
         390043,
         338766,
         302946,
         59967,
         1844,
         77866,
         8536,
         6522,
         2112,
         8987
      ],
      "original_title": "2 Coelhos",
      "runtime": 108,
      "poster_path": "/cw5T5dC8gQWmWx5kuUQcSLSrUWR.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Telecine",
         "id": 7764,
         "origin_country": ""
      }],
      "release_date": "2012-01-20",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": "BRL ",
      "directors": ["Afonso Poyart"],
      "runtime": 101,
      "synopsis": "Edgar, a regular middle-class guy, is about to accomplish a politically incorrect dream, by attacking the oppressor from above - a corrupt politician - and the one from below, a violent criminal. Involved in the aftermath of a terrible accident, he crosses the paths of Walter, a college professor, and Julia, a young prosecutor involved with criminals, politicians, and fraud. Edgar develops and executes a complex plan, involving the very criminals and corrupt politicians who are in the pursuit of Julia and her dirty money, aiming to recover, somehow, the lives he has damaged.",
      "writers": ["Afonso Poyart"],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt1753722/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyODgxNjQ3MV5BMl5BanBnXkFtZTcwNzIwNTgwNw@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Fernando Alves Pinto, Alessandra Negrini, Caco Ciocler | See full cast and crew »"],
      "reviews": [
         "It's nice when we go to the the cinema with little or no expectations. Watching the trailer of \"2 Coelhos\", with many effects and explosions a la Hollywood, far from what we typically see in Brazilian films, we see the care in the production and editing of scenes and very little of plot of the movie.The trailer is well done, nothing spectacular or intriguing, but interesting enough to make us want to go to see this movie. I entered the room armed, waiting a sterile attempt to emulate the action films, empty and well packaged, I left the room surprised. In the end, the least caught my attention was the visual effects (there was nothing new) but the script, the editing and great performances. It is not easy to summarize the plot, it is very intricate and full of twists and turns, false clues, comings and goings. Because of the choppy editing and flash backs, sometimes it's difficult to locate in time and space, but in the end, we understand everything all (or almost everything). I think the film needs to be seen more than once. Afonso Poyart, memorize this name, is a talented boy. He wrote the script and came out with a Phantom camera (that records one thousand frames per second) and many ideas in his head.From the style of the film, it is clear that the idols of Poyart are Fernando Meirelles, Christopher Nolan, Guy Ritchie and Tarantino. But he has plenty of talent and personality to create a unique style. I imagine the guy more mature, far from the grip of cinematographic references, and with more financial resources.",
         "In São Paulo, the scheme of the corrupt DA Júlia (Alessandra Negrini) and her mate, the lawyer Henrique (Neco Villas Lobos) with the gangster Maicom (Marat Descartes) is discovered and sent to the Internal Affairs. Maicom is responsible for kidnappings, murderers and heists and his only chance is the support of the corrupt and powerful assemblyman Jader Kerteis (Antônio Roberto Marchese) that demands 2 million-dollars to help him. Meanwhile the \"paulistano\" Edgar (Fernando Alves Pinto), who killed a mother and her son two years ago in a car accident, invites the \"motoboy\" and thief Velinha (Thaíde) to steal the escorted courier that is carrying the pouch with the money to be delivered to Jader. How their lives are entwined? \"2 Coelhos\" is the debut of Afonso Poyart as director, producer, writer, actor and editor with golden key. His work is visibly influenced by Guy Ritchie (Lock, Stock and Two Smoking Barrels); Quentin Tarantino (Pulp Fiction); Christopher Nolan (Memento and Inception); and Fernando Meirelles (Cidade de Deus) in a Hollywoodian style of explosions and special effects with a budget of less than 2 million-dollars. The result is so good that Hollywood is planning to remake this film for a people that have difficulties to read subtitles. The acting and the CGI are top-notch and the non-linear screenplay is well resolved in the end. If you have a chance, read the subtitles and enjoy this worthwhile movie. My vote is eight. Title (Brazil): \"2 Coelhos\" (\"2 Rabbits\")",
         "After devouring this hardcore Brazilian film, what I had to articulate was Holy Sugar!!!! :o This is an ace class crime-thriller flick!!!! Hats off and Big Bravo to its young director, Afonso Poyart. It just blew over over my head to conceive how this super-swift supreme creation came from his debut direction!!!!! His script was so spellbound and plentiful with enormous twists that I could not miss a bit of attention over the movie. Excellent editing with the narration and flashbacks :))) Acting was also great maintaining those twists-turns and some camera shots definitely deserved eulogy. I treat it as a MUST WATCH for all high-tension crime thriller lovers :p___8/10___",
         "This is another movie following the footsteps of \"Cidade De Deus\" and \"Tropa De Elite\", meaning that the main topic is the blatant corruption of our society in Brazil. The main difference this time is that we are no longer in the streets of Rio, but moved on to Brazil's largest city. Much of positive can be said of the movie. The editing and the special effects are superb. The opening sequence, with drawings mixed in the scenes is particularly clever without being over the top. The acting is also very good and uses mostly actors from São Paulo itself, which is not something trivial, if you keep in mind that the huge soap opera industry of Rio is the one usually providing star power for film productions (granted, some of the main characters are played by actors known to the public for soap opera work: Alessandra Negrini and Caco Ciocler to cite the best known faces). Having said this, I cannot turn a blind eye to the plot. It is true that it is very intricate and told in a fast involving pace, but almost every single detail does not survive a closer look. Virtually everyone is cheating on the spouse in a way that helps the big master plan of the main character. Petty thieves suddenly become mega criminals, with heavy artillery hidden in their shacks and do not bend under any kind of pressure. Perhaps the most absurd thing is the improbable alliance between a former professor and the guy who killed his wife and child, without any apparent reason. The director should have tamed his ego and hired a better screenwriter instead of having a go at everything. I hope that is what he does in his next work, given that his directing talent is not at check.",
         "Two Rabbits Its always a pleasure to watch a Brazilian movie whit the guts to do it differently, to show that the seventh art in the country of the football still has a great future ahead. Afonso Poyart surprises us whit a history of robbery corruption and back stabbing counted in a very Brazilian way, whit great strength and by the peaces that the main character Edgar (Fernando Alves Pinto) want us to know. The direction of the film make it quick and easy to watch despite the overflowing of characters and the complex scheme that Edgar plans. The direction of art takes the best in São Paulo to feature the history and the always present contrast of the wealth and the poverty present in the movie. But the velocity and plot twists of the film do not contribute to the understanding of the characters and their goals. Afonso give us an main character that show no remorse after murder a mother and her child and have a life of plenty and yet seek for more money. Julia who in the beginning of the film appears as a fragile woman who its getting to much involvement in the hard life of crime, becomes an femme fatale who plays her husband and ends like the motivation of Edgar plans and his lover who do anything for the love shared by them. Walter its a blur figure hidden behind the bear of Caco Ciocler who Afonso leverages of the common though that he hated Edgar, to make him one of the lasts peaces of the puzzle. After all, you can see that the development of characters that Afonso does, do not make theirs mind clear to the viewer, the director knowing that, he use it to make more plot twists. All this things show how this movie has an great argument that was not entirely passed to the script. Regardless of that mistakes we see a lot of courage in Afonso's movie and it make me thought of the people saying, in the time of the release of \"The secret in their eyes\", that the Brazilian movie makers do not had that courage, but now i know that they have, and they are showing it.",
         "... Too pretentious to be good.... A copy of styles from other movies... I was very excited to see this movie, It Looked like a fresh new film with lots going on, but in the end, i was very disappointed with it. The plot is OK, but it looks like a compilation of a lot of better movies than this one. At least the actors are good. If it only didn't try to look cool, it would be fine. Feels like a lost opportunity to do a good movie... Seriously, I think the director try to put all his background of motion graphics , music videos and publicity in one movie.... In the end , if you want a good movie skip this one...",
         "Those who loved Kaminey, this one is the next level. Those who are fan of Tarantino, this one is must watch. Those who watched City of God, and is looking for good Brazilian movie, this is for you. Those who loves action packed, modern age movie, you'd better not miss this one Those who is looking for world-movies which are under-appreciated but is a potentially great work, you may consider this one. 1. The puzzle like story development, which has been neatly woven and will lead you to more and more clarity towards the ending of the movie. 2. Innovative application of excellent visual effect (reminds me Funky Pawa by Maati Baani, though the movie is earlier work.) 3. Unexpected twist and the graphic explanation for that. I must thank denofgeek dot com for the suggestion - \"25 under-appreciated modern foreign language films\"."
      ],
      "genres": [
         "Action",
         "Thriller"
      ],
      "productionCompanies": [
         "Black Maria Filme Video Digital",
         "Black Maria"
      ],
      "summaries": ["In São Paulo, the scheme of the corrupt DA Júlia and her mate, the lawyer Henrique with the gangster Maicom is discovered and sent to the Internal Affairs. Maicom is responsible for kidnappings, murderers and heists and his only chance is the support of the corrupt and powerful assemblyman Jader Kerteis that demands 2 million-dollars to help him. Meanwhile the \"paulistano\" Edgar, who killed a mother and her son two years ago in a car accident, invites the \"motoboy\" and thief Velinha to steal the escorted courier that is carrying the pouch with the money to be delivered to Jader. How their lives are entwined?"],
      "budget": 3500000
   },
   "movielensId": 96845,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "2012-01-20",
      "dvdReleaseDate": null,
      "directors": ["Afonso Poyart"],
      "runtime": 108,
      "movieId": 96845,
      "title": "Two Rabbits",
      "mpaa": null,
      "actors": [
         "Fernando Alves Pinto",
         "Alessandra Negrini",
         "Caco Ciocler",
         "Marat Descartes",
         "Djair Guilherme",
         "Roberto Marchese",
         "Aldine Muller",
         "Thaíde",
         "Thogun",
         "Neco Villa Lobos",
         "Carlos de Niggro",
         "Charles Paraventi"
      ],
      "imdbMovieId": "1753722",
      "originalTitle": "2 Coelhos",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["-5DDg7usWUo"],
      "plotSummary": "Edgar is a young upper-middle class man, close to completing 30 years old, he lives a full life crisis and is in a position common to the vast majority of Brazilians. On the one hand the power, represented by a corrupt state, abusive and absent in their taxes before their obligations. On the other, crime increasingly organized violence became a constant in the lives of citizens in large cities. Edgar responds to all this as a modern vigilante. With the help of ingredients such as technology, counter-information and manipulation, Edgar concocts a brilliant plan, using the greed of their opponents as the reason for its destruction. As the plot unfolds, we know more about the dark past of each character as Edgar fit the pieces together in an intriguing puzzle that makes up the film's plot.",
      "tmdbMovieId": 102784,
      "avgRating": 3.72727,
      "releaseYear": "2012",
      "numRatings": 44,
      "posterPath": "/cw5T5dC8gQWmWx5kuUQcSLSrUWR.jpg"
   }
}