{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "shark",
            "id": 15097
         }
      ],
      "imdb_id": "tt2043757",
      "video": false,
      "title": "2-Headed Shark Attack",
      "recommendations": [
         83880,
         342927,
         83896,
         216539,
         78509,
         52454,
         100669,
         97589,
         249260,
         63749,
         47436,
         235388,
         39862,
         192813,
         4289,
         34231,
         71628,
         246594,
         44809,
         116463
      ],
      "backdrop_path": "/hQEXkPsJioQaEwIeZGEZ1Oolmrt.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Gimly",
         "id": "5963358ac3a36828a1105602",
         "content": "How is it that more people aren't talking about what is almost certainly the worst affront to the Killer-Shark-Creature-Feature genre? Don't get me wrong, there was absolutely no redeeming _2-Headed Shark Attack_, it was awful, absolutely, but when in the climax of the whole thing, the animators FORGOT IT WAS SUPPOSED TO HAVE TWO HEADS, I went ballistic. I seriously had to rewind, because I thought, even in a movie this atrocious, they couldn't make that mistake, I mean, it's in the title of the movie, it's not possible... But not, they did. They replaced it with a regular shark model...\r\n\r\n_Final rating:½ - So bad it’s offensive. I may never fully recover._",
         "url": "https://www.themoviedb.org/review/5963358ac3a36828a1105602"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Anne Babish",
               "gender": 1,
               "credit_id": "52fe49979251416c910b2559",
               "name": "Carmen Electra",
               "profile_path": "/oFjqvsVleDaMtuJaLnSJdx7LUOg.jpg",
               "id": 28639,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Professor Babish",
               "gender": 2,
               "credit_id": "52fe49979251416c910b255d",
               "name": "Charlie O'Connell",
               "profile_path": "/cv1HzeDLo6ZIdpLOwmwd9DYj8if.jpg",
               "id": 129122,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe49979251416c910b2561",
               "name": "Brooke Hogan",
               "profile_path": "/g3Ylzlb8YFnjvNLcqPN8e6kL6N0.jpg",
               "id": 217272,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Han",
               "gender": 2,
               "credit_id": "52fe49979251416c910b2565",
               "name": "Gerald Webb",
               "profile_path": "/ndeC3GwyeR8lPzzKld8DFP9hxIA.jpg",
               "id": 211900,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe49979251416c910b2569",
               "name": "David Gallegos",
               "profile_path": null,
               "id": 933544,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Dana",
               "gender": 1,
               "credit_id": "52fe49979251416c910b256d",
               "name": "Christina Bach",
               "profile_path": "/c8XTZr6POztuNvOjjTAWlzd3Rvy.jpg",
               "id": 933545,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Kristen",
               "gender": 0,
               "credit_id": "52fe49979251416c910b2571",
               "name": "Ashley Bissing",
               "profile_path": null,
               "id": 933546,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Ryan",
               "gender": 0,
               "credit_id": "52fe49979251416c910b2575",
               "name": "Marckenson Charles",
               "profile_path": null,
               "id": 933547,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Kirk",
               "gender": 0,
               "credit_id": "52fe49979251416c910b2579",
               "name": "Chase Conner",
               "profile_path": null,
               "id": 933548,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Ethan",
               "gender": 0,
               "credit_id": "52fe49979251416c910b257d",
               "name": "Michael Dicarluccio",
               "profile_path": null,
               "id": 933549,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Jamie",
               "gender": 0,
               "credit_id": "5a6e7925c3a368554d0240e4",
               "name": "Lauren Vera",
               "profile_path": null,
               "id": 1631132,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b252b",
               "name": "Christopher Ray",
               "profile_path": "/IVnfqEPMcsFUksVAX78gQMJsb5.jpg",
               "id": 97901,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b2531",
               "name": "Edward DeRuiter",
               "profile_path": "/ztl9qZp6ExKYC4kXUatwl0Q1wQw.jpg",
               "id": 289992,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b2537",
               "name": "H. Perry Horton",
               "profile_path": null,
               "id": 558864,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b253d",
               "name": "Paul Bales",
               "profile_path": null,
               "id": 79390,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b2543",
               "name": "David Michael Latt",
               "profile_path": null,
               "id": 30053,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b2549",
               "name": "David Rimawi",
               "profile_path": null,
               "id": 236844,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49979251416c910b254f",
               "name": "Chris Ridenhour",
               "profile_path": null,
               "id": 128763,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49979251416c910b2555",
               "name": "Spencer Brennan",
               "profile_path": null,
               "id": 933543,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.882018,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 86703,
      "vote_count": 60,
      "budget": 0,
      "overview": "A Semester at Sea ship is attacked and sunk by a mutated two-headed shark, and the survivors seek refuge on a deserted atoll. The coeds, however, are no longer safe when the atoll starts flooding.",
      "similar": [
         7191,
         124905,
         5876,
         135397,
         332567,
         403119,
         339967,
         39256,
         339530,
         46261,
         8914,
         1907,
         293167,
         588,
         408220,
         40761,
         580,
         15766,
         579,
         315011
      ],
      "original_title": "2-Headed Shark Attack",
      "runtime": 90,
      "poster_path": "/5Tv02hJx2IJxP1QHLrKXvp672ur.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ic2bTizdzRLDVzAvN7MXdUg3WQV.png",
         "name": "The Asylum",
         "id": 1311,
         "origin_country": "US"
      }],
      "release_date": "2012-06-26",
      "vote_average": 3.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "2-Headed Shark Attack",
         "id": 494838,
         "poster_path": null
      },
      "tagline": "1 Body, 2 Heads and 6,000 Teeth",
      "adult": false,
      "homepage": "http://www.theasylum.cc/product.php?id=194",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Ray"],
      "runtime": 88,
      "synopsis": "A group of friends wakeboarding are attacked and devoured by a two-headed shark. Meanwhile, a Semester at Sea ship, called the Sea King, led by Professor Franklin Babish and his wife Anne hit a large shark, that becomes lodged in the boats propeller, which damages the ship's hull, causing the boat to take on water. Soon after, the two-headed shark attacks the boat and breaks the radio antenna, preventing ship co-captain Laura from summoning help. The group notice a deserted atoll near-by, so Laura drives the Sea King closer, before Professor Babish takes the students, consisting of Kate, Paul, Laura, Liza, Cole, Lyndsey, Ethan, Jamie, Ryan, Kirsten, Alex, Kristen, Kirk, Haley, Jeff, Alison, and Dana, over to the atoll on a dinghy. Anne remains on the Sea King, along with Laura and the ship's crew, Han and Dikilla. Laura enters the water to repair the ship's hull, but is quickly ripped apart by the two-headed shark. Meanwhile, the group searches the atoll for scrap metal to help repair the boat, where Kate tells Kirsten she is afraid of the water. Kirk, Haley and Alison decide to go skinny dipping, only to be attacked and eaten by the two-headed shark. The rest of the group meet up and find two small speedboats before an apparent earthquake hits, causing Professor Babish to fall and badly cut his leg. Jeff and Mike take Professor Babish back to the Sea King on the dinghy and Anne tends to her husband while Jeff and Mike head back to the atoll, and discover Laura's severed hand in the water before being attacked by the two-headed shark. They attempt to swim back to the Sea King, but both are ultimately killed. Kate and Paul manage to fix the two boats they found, while Cole finds a gasoline tank to fuel them. Cole then jumps in one of the boats with Ryan, Jamie and Alex and drives away, prompting Kate, Paul, and Dana to follow in the other. The two boats race each other, unaware of Professor Babish's and Anne's warnings of the two-headed shark. The two-headed shark attacks Cole's boat, causing Ryan to fall into the water, where he is devoured, notifying the other students of the shark. Paul realizes the shark will continue to chase Cole's boat as it has a bigger engine. Cole also realizes this and jumps off the boat, leaving Jamie and Alex to be eaten. Kate, Paul and Dana save Cole and arrive back at the atoll, followed by Professor Babish, Anne, Han, and Dikilla on the dinghy. The group creates a plan. They hook up a generator to metal poles and place them in the water to distract the shark while Kate and Cole travel to the Sea King and repair the hull. The plan works until the two-headed shark attacks the poles, knocking Han and Dikilla into the water where they are eaten, before the two-headed shark swims to the Sea King. Kate fixes the Sea King, only for Cole to drive away without her, forcing her to swim back to the atoll. The two-headed shark attacks the Sea King, causing it to sink, resulting in Cole being devoured and the boat sending out a distress signal. As the group panic, anothe earthquake hits and the atoll begins to rapidly sink, causing the group to realize that the supposed earthquakes were actually the atoll collapsing in on itself from the underground. Kristen and Dana become separated from the group and are devoured, as are Professor Babish and Anne. A small tsunami hits and the atoll sinks, leaving the survivors with little land. They take shelter in the still standing chapel, but the shark breaks in and devours Lyndsey, Michelle, Liza, and Ethan. Kate, Paul and Kirsten discover the gasoline tank and lure the shark towards it. Kate attempts to stab the two-headed shark, but Kirsten attracts its attention and attempts to blow it up with the tank with her lighter, but she is eaten. Kate and Paul find one of the boats, and turn it on, before taking shelter on part of the remaining atoll. The shark attacks the boat, which explodes, killing the shark. A helicopter then comes to save Kate and Paul, the only survivors of the entire group of 23 people.",
      "writers": [
         "Edward DeRuiter",
         "H. Perry Horton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2043757/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMjU5NzYxN15BMl5BanBnXkFtZTcwNDQ0NzAzOA@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Carmen Electra, Charlie O'Connell, Brooke Hogan | See full cast and crew »"],
      "reviews": [
         "This was one bad movie ! . You can guess what your getting before you start this one up. As a fan of b-budget horror and sci-fi,i HAD to see this movie.Last year brought us Sharktapus,and a few other sci-fi creatures,and this year,it gets BETTER !.A two headed shark !.With loads of bad effects,bad acting,and some good ,ol fashion shoddy monster. The film is chocked full of mistakes,and poor film-making stuff,and stranger things,that you cant stop watching.I loved the way the shark was anywhere from 20 foot ,to 9 foot,depending on the shots needs.Bless the people that worked on this fartblower,and bless US,the viewers that keep watching these movies.",
         "Honestly what are these other clowns on? 6 and 7 stars? This movie is one of if not the worst I have watched. Terrible story line, woeful cgi, my ass could of acted scenes better and so many mistakes. They should start paying people to watch this. If this was my movie and I had just watched the final cut, I would have slit my wrists, gouged my eyes out and then destroyed all evidence that the movie ever existed while I waited to bleed out. I thought this movie may be so bad it would be funny, I was wrong it is just really, really bad. I want the last hour and a half of my life back.",
         "Wow. no words can describe how powerful a film this is. Carmen Electra as a doctor? Pure genius. I was so convinced of her acting, I actually looked up her to see when she got her doctorate. Turns out, she isn't a real doctor, which I find hard to believe, because of how expertly she bandaged that guys leg that one time. I did not expect the black guy, the arrogant jock, and the skinny dippers to die. That came out of nowhere. Now onto the plot. I was taken by surprise when their boat was damaged. I started thinking: what if the two-headed shark showed up? sure enough, it did. I started worrying that they would all die, when suddenly they find an island to get to. I kept thinking the movie would be short, and that they would just stay on the island, but like a gift from god, the experienced screenwriters thought to have the island sink! wow. I was stunned. By now your probably thinking, how can this movie get any greater? Well, the main protagonist chi You may think a two headed shark wouldn't be very streamlined. well, you're wrong. Its plenty fast, and who knew twice the heads would mean twice the teeth? I sure didn't think of that, until one of the cast mentioned it in the movie. i was like \"aw damn, shes right! this thing is twice as scary a jaws!\"But luckily, this also makes it twice the movie! did not regret finding this on netflix. This is going on my shelf right next to Shawshank Redemption and Schindler's List.",
         "Sharks Vs. Silicone The 'Jaws' series tought us that sharks grow to 40 feet, eat helicopters, raise their heads above the water to roar at their prey, hunt in 4 feet of water, and attack cruise ships. The recent megalodon films tought us that sharks grow to 65 feet, fly, eat 747 airplanes, and attack oil rigs, supertankers, and aircraft carriers. Yet still hunt teenagers in 4 feet of water and raise their heads above the water to roar. Now '2 Headed Shark Attack' teaches us, sharks have two heads, grow to 65 feet yet still hunt teenagers in 4 feet of water, can collapse and island by butting against it, are amphibious and come on land to roar at teenagers, and most importantly have a sweet tooth for silicon. The plot: Hardly original crew of token \"marine biology\" college students' cruise ship is struck by engine and radio failure. With Carmen Electra as a college professor it's understandable why so many gorgeous, horny, and brain dead students signed up for the class. And when I say there's a lot of silicone, I mean it. I counted only 4 breasts that could even pass for natural in the entire film. Predictably the class wades ashore a \"atoll\" which according to this film tend to collapse. Atolls apparently also feature concrete docks for motor boats and Robinson Caruso like grass huts. The dialogue consists entirely of, \"What was that? Oh my God! Go go go!\" There's plenty of blood and guts and some decent CGI FX. Disappointingly there's no explanation for why a shark has 2 heads and is 60 feet long. Most giant shark movies at least offer some type of explanation such as a greedy corporation's experiment gone awry. The silicone is nice to look at between killings but no one is memorably gorgeous enough to save this disaster.",
         "A wild 2 headed Sharpedo appeared. It used pixelate. It's not very effective ... Suddenly, after about one minute, a vicious two-headed shark shows its teeth and consumes two innocent babes as if they were his hors d'oeuvre. Ladies and gentlemen, prepare yourself for 90 minutes of the most preposterous nonsense ever recorded on film. In fact there is not even much to say about total failure number twenty thousand of 'The Asylum'. Really stiff dialogues, lousy acting, miserable directing, hopeless CGI, SFX and the typical, but equally desperate storyline. However, this time there are no scientists or special agents involved. The shark is only confronted with a boat of voluptuous and muscular students, who, of course, parade happily with their breasts and biceps, but ultimately only let the vocal cords work. It can be said that the shark is essentially a young, healthy man, with an immaculate interest in the female sex, even though he presents himself at times as a juvenile peeper. But, generally it doesn't take long before he comes trotting with a whopper of an opening line, and starts courting the giggling girls. A lasting relationship, however, is not an option. We know by now that our friends from 'The Asylum' aren't very pragmatic in approach, but of all the plot holes there is only one that I can not fathom. If that shark has two heads, then why didn't Carmen Electra have four breasts? Food for thought.",
         "I'm curious as to who bank rolls movies like this? I get it, its not suppose to be a 'serious' movie; really the name of the movie says it all, however.... you've got to make the storyline at least a bit believable or at least entertaining. This movie fits in the same class as Piranha 3D and Shark Night. However i'd rather watch either of those over again before watching this movie. The acting is terrible, and if this is the platform Brooke Hogan plans on launching her acting career... I suggest she slap on some spandex and hop in the WWE ring instead. And what about poor Carmen Electra? Clearly she's needing some cash or at the least some exposure in front of the camera because her suntan scene (no nudity) was ridiculous...",
         "You know when you first watched Jaws, how long it took you to get back into water? Now after watching this movie, I don't know how long it will take me to be able to watch another one! It's not just the creature didn't exist in History but the acting was bad, actors were not even attractive, scenario, casting, graphics, synopsis, direction,... etc! I really don't know where to start! I want to warn everyone.. if you are going to watch it... \"DO NOT WATCH IT\" Now to answer golfpunk's question about who would give this movie a great review, simply the actors and the director! I wish there was a lower grade than 1 to give you guys but there ain't! short messages: 1- actors; please stop acting 2- Director; you should change career... do anything else! 3- Writers; How? Just how you have had the courage to write something that bad?! 4- Graphics guys; I used to do these graphics 15 years ago on a 486 machine with 3D under DOS!!!!!!!!!!!!!!! This is another millennium if you know what I mean! I feel abused after watching this movie!",
         "When I watch a total crapfest like this, it makes me wonder how the brilliant Battlestar Galactica ever aired, especially on this Lowest Common Denominator channel. Anyone else remember when this was a GOOD channel? When they showed 50's classic, SF Pilot Playhouse, etc? Now it pummels the audience with garbage like this, filled with has beens and never were's, edits out the softcore nudity and sex (for the DVD's and Europe I imagine). Anyone remember when a B movie was worth seeing? This absolute turd sandwich of a movie featured horrible effects, worse acting and a dumb story that had really nothing going for it. I know, I know, I didn't have to watch it. I know that. But it's like being hypnotized. One wants to look away, but we can't. WE CAN'T. I'd say this, avoid at all costs, unless you want to save money on a sleeping pill. It's simply that horrible.",
         "And let me tell you.... I busted a gut on this one. I mean I expected bad, but there really isn't a word that adequately describes the level of bad this movie broached upon. Like Ninth circle of hell bad. Like Killer Clowns from Outer Space was an Oscar Winner bad. Like .... never mind. I need another good laugh, so I have Sand shark next on my DVR to laugh through. Whoever wrote this film should be drawn and quartered and forced to sign an agreement that swears they will never write again. B rated? Thats a compliment undeserved. Who in their right mind paid to produce that film? Is there a way to negotiate your contract to NOT include this in your credits list? I know if it were me, I'd certainly explore that option.",
         "This might be the greatest cinematic achievement of all time. This is one of the most unpredictable, beautiful, and breathtaking movies I have ever seen. First, the plot goes like any other average teen horror movie. You expect since they are on the water, a shark will show up. Well, if you would assume that, then you are only partially right. What you probably didn't expect is that the shark would have two heads, which is what really sets this movie apart from the rest. It is a completely original groundbreaking idea that will be setting the standards for film makers for years to come. Things start to go wrong, to the surprise of me and I'm sure everyone else who watched this film. The characters eventually get onto an island, which led me to believe that they were safe. This let me catch my breath for a slight second, only to have it taken away again by the twist that the island was sinking! After that detail was revealed, I was on the edge of my seat for the rest of the movie. The actors gave some of the best performances I have ever seen, especially Carmen Electra as the doctor. I didn't think she was a doctor, but I guess I was wrong. She pulled it off better than any actress in the history of film could. The idea of a two headed shark in this movie is absolutely genius. It is an idea never before seen in a movie. The idea scared the hell out of me! I couldn't wrap the idea of a two headed shark around my head, so I started putting things together. I thought, \"Okay, two headed shark. This means twice the eyes so it can see twice as well. Twice the brains so twice as smart. Also, twice the smell and senses of a normal one headed shark. And...NO WAY!!! TWICE THE TEETH!\" The idea of how deadly a two headed shark can be convinced me never to swim in a lake or ocean ever again. I would highly recommend this movie if you would like to see something completely original and innovative. This movie was a wild ride from start to finish that had me in absolute awe. This should go down as one of the all time classics that should be considered for numerous awards."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Asylum, The"],
      "summaries": [
         "Terror takes a ghastly form when a gigantic two-headed shark sinks a ship full of students, and the survivors wash up on a tiny atoll. But just when the kids think they're safe, a tsunami sweeps them back into the deep to face the twin jaws anew.",
         "Survivors escape to a deserted atoll after a Semester at Sea ship is sunk by a mutated two-headed shark. But when the atoll starts flooding, no one is safe from the double jaws of the monster as it eats fresh delicious women and men."
      ],
      "budget": 0
   },
   "movielensId": 96923,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-06-26",
      "dvdReleaseDate": "2012-01-01",
      "directors": ["Christopher Ray"],
      "runtime": 90,
      "movieId": 96923,
      "title": "2-Headed Shark Attack",
      "mpaa": "",
      "actors": [
         "Carmen Electra",
         "Charlie O'Connell",
         "Brooke Hogan",
         "Gerald Webb",
         "David Gallegos",
         "Christina Bach",
         "Ashley Bissing",
         "Marckenson Charles",
         "Chase Conner",
         "Michael Dicarluccio",
         "Lauren Vera"
      ],
      "imdbMovieId": "2043757",
      "originalTitle": "2-Headed Shark Attack",
      "genres": [
         "Horror",
         "Action",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["lcH03mWg_sM"],
      "plotSummary": "A Semester at Sea ship is attacked and sunk by a mutated two-headed shark, and the survivors seek refuge on a deserted atoll. The coeds, however, are no longer safe when the atoll starts flooding.",
      "tmdbMovieId": 86703,
      "avgRating": 1.79412,
      "releaseYear": "2012",
      "numRatings": 17,
      "posterPath": "/5Tv02hJx2IJxP1QHLrKXvp672ur.jpg"
   }
}