{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "marquis",
            "id": 198419
         }
      ],
      "imdb_id": "tt0036135",
      "video": false,
      "title": "The Man in Grey",
      "recommendations": [
         78256,
         81678,
         43693,
         29470,
         92429,
         4926,
         51476,
         73027,
         42066,
         27544,
         35895,
         119687,
         36461,
         61501,
         62720,
         89995,
         29477,
         118534,
         38395,
         26169
      ],
      "backdrop_path": "/dRhFGZFNaUYKIpc4b9jrHpSQxNC.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "52de4401760ee30ae600ba57",
         "content": "The Gypsy Portent and the Woman of Deadly Nightshade. \r\n\r\nThe Man in Grey is directed by Leslie Arliss and adapted to screenplay by Margaret Kennedy and Doreen Montgomery from the novel of the same name written by Eleanor Smith. It stars Margaret Lockwood, James Mason, Phyllis Calvert and Stewart Granger. Music is By Cedric Mallabey and cinematography by Arthur Crabtree. \r\n\r\nA forerunner of Gainsborough’s Wicked Women movies, The Man in Grey is a delicious slice of British noir pie.  \r\n\r\nProudly decked out in period attire, story is ripe with dastards, narcissists, connivers, the selfish and the cruel. Headed up by Mason’s Lord Rohan and Lockwood’s Hesther Shaw, these people will stop at nothing to get what they want in life. It doesn’t matter who is around them, friends and family etc, if they can in any way hinder their respective selfish goals then they will be trampled upon and not a further thought will be given. It all simmers to the boiling point where lives will not just be ruined, but also ended. \r\n\r\nThe four principal players are great, their respective careers well on the way to leaving behind considerable bodies of work. Arliss (The Night Has Eyes) keeps the story simple in spite of the many character strands and traits jostling for meaty exposure, and photographer Crabtree (Waterloo Road) accentuates the miserablist ambiance with sharp black and white lensing.  \r\n\r\nThe use of blackface on white actors is awfully out dated, as is some of the dialogue, but don’t hold these things against The Man in Grey. It’s a darn fine bodice botherer, resplendent with characters straight out of noir’s dark alleyways. 8/10",
         "url": "https://www.themoviedb.org/review/52de4401760ee30ae600ba57"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Hesther Shaw",
               "gender": 1,
               "credit_id": "52fe45e7c3a36847f80e12bb",
               "name": "Margaret Lockwood",
               "profile_path": "/91N940cyvdPV4clTmCREX0kKBZk.jpg",
               "id": 14298,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Clarissa Marr",
               "gender": 1,
               "credit_id": "52fe45e7c3a36847f80e12bf",
               "name": "Phyllis Calvert",
               "profile_path": "/kyRYCX1s9mzLc5lkr8imsYVIJcS.jpg",
               "id": 89534,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Lord Rohan",
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e12c3",
               "name": "James Mason",
               "profile_path": "/b0ebmboBdaYvk8fn2CFCQl4TaW9.jpg",
               "id": 2091,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Peter Rokeby",
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e12c7",
               "name": "Stewart Granger",
               "profile_path": "/vRcMlIV1NTpiXQibMdsl5N4J6gl.jpg",
               "id": 41235,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Toby",
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e12cb",
               "name": "Harry Scott",
               "profile_path": null,
               "id": 127461,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Miss Patchett",
               "gender": 1,
               "credit_id": "52fe45e7c3a36847f80e12cf",
               "name": "Martita Hunt",
               "profile_path": "/hZySDLGjzqFEYbv5XYK8D00tnFH.jpg",
               "id": 20127,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Lady Rohan",
               "gender": 1,
               "credit_id": "52fe45e7c3a36847f80e12d3",
               "name": "Helen Haye",
               "profile_path": "/57ZsJTrHg6aFPWZkkxo0kpYFBaw.jpg",
               "id": 3674,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Gipsy",
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e12d7",
               "name": "Beatrice Varley",
               "profile_path": "/pcthDw35tSIoSC1x5aAzmpU6nEG.jpg",
               "id": 122908,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "The Prince Regent",
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e12db",
               "name": "Raymond Lovell",
               "profile_path": "/sG77WrS9DDa2FQTaHpR1EYcD38k.jpg",
               "id": 115376,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mrs. Fitzherbert",
               "gender": 1,
               "credit_id": "52fe45e7c3a36847f80e12df",
               "name": "Nora Swinburne",
               "profile_path": "/cCzOzfmNtMGgxRgnUo2ciQZF1xC.jpg",
               "id": 88895,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e1287",
               "name": "Leslie Arliss",
               "profile_path": null,
               "id": 125398,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e128d",
               "name": "Eleanor Smith",
               "profile_path": null,
               "id": 127456,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e1293",
               "name": "Doreen Montgomery",
               "profile_path": null,
               "id": 127457,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e1299",
               "name": "Margaret Kennedy",
               "profile_path": null,
               "id": 127459,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e129f",
               "name": "Leslie Arliss",
               "profile_path": null,
               "id": 125398,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e12a5",
               "name": "Edward Black",
               "profile_path": null,
               "id": 14294,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e12ab",
               "name": "Cedric Mallabey",
               "profile_path": null,
               "id": 127460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e7c3a36847f80e12b1",
               "name": "Arthur Crabtree",
               "profile_path": "/lwJOyPBCvlRLsfBe8SPRgz9fE2L.jpg",
               "id": 103589,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e7c3a36847f80e12b7",
               "name": "R.E. Dearing",
               "profile_path": null,
               "id": 14295,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.583974,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 41996,
      "vote_count": 8,
      "budget": 0,
      "overview": "Melodrama about two girls whose fortunes run on very different paths.",
      "similar": [
         435126,
         253,
         62206,
         646,
         657,
         658,
         667,
         699,
         708,
         714,
         691,
         37247,
         1538,
         3933,
         4982,
         9798,
         37710,
         50620,
         210577,
         205596
      ],
      "original_title": "The Man in Grey",
      "runtime": 116,
      "poster_path": "/l1m1fmdQsYKMno7sFdPofILoNQU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Rank Organisation",
         "id": 364,
         "origin_country": ""
      }],
      "release_date": "1943-08-06",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Leslie Arliss"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Eleanor Smith",
         "Doreen Montgomery"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036135/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzODU4NTY4NV5BMl5BanBnXkFtZTcwMzE2NzAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Margaret Lockwood, James Mason, Phyllis Calvert | See full cast and crew »"],
      "reviews": [
         "'The Man In Grey' was the first film in the cycle of Gainsborough costume melodramas (which ended in 1948 with 'The Bad Lord Byron') and it's easily one of the very best. At the time, it was the pairing of a superstar (Lockwood), a star (Mason), a rising star (Calvert) and a newcomer (Granger), a combination which catapulted all four to the top of their profession, and made them the four names most associated with the costume. It's a pity that the four never made another movie all together! Margaret Lockwood as Hesther was just pure evil - a cold, calculating woman. One does get the idea that there is a small glimmer of kindness inside her, but she squashes it pretty quickly. Phyllis Calvert was as sweet as honey, as usual the beloved heroine. Her Clarissa is the main character of the tale - married off to Lord Rohan (Mason) because he desires an heir, she soon tires of his indifference and falls for traveling player Rokeby (Granger). Hesther (Lockwood) in turn falls for Rohan and he for her. And of course you know that's set for trouble. A hint of how much trouble? THIS is the film with the infamous horse-whip thrashing scene. What's also interesting is the whole story is told in flashback, when Calvert and Granger, descendents of the Rohan and Rokeby families, meet at an auction of the Rohan estate. Nice to see a bit of modern dress for a change!",
         "The Man in Grey was the first and probably the most successful of the Gainsborough melodramas. The lavish regency tale centres around the aristocratic Clarissa Richmond (Phyllis Calvert) who dutifully enters into an loveless arranged marriage with the cold hearted Lord Rohan (James Mason)- the Man in Grey of the title. Love and intrigue are to enter Clarissa's life when a chance meeting with an old school friend, the scheming Hester (Margaret Lockwood), leads her to the dashing Rokeby (Stewart Granger). The story reaches its dramatic conclusion through twists and turns of plot and excellent performances from who can be called the four cornerstones of the war time British cinema - Stewart Granger, James Mason, Phyllis Calvert and Margaret Lockwood. The Man in Grey is my personal favorite of all the Gainsborough films, it is high drama and escapism. The Man in Grey is definitely worth another look.",
         "Most of us have seen Gainsborough's film of \"The Wicked Lady\" (1945) as it is easily commercially available on DVD/Video and is shown on old movie channels and I suppose is arguably Margaret Lockwood's (ML) most famous role in the public's eyes.\"The Man in Grey\" (1943), another Gainsborough costume drama film, was produced two years earlier and must have had a decisive influence when casting for the aforementioned film.Once again Margaret is at her scheming, calculating, evil best in the role of Hesther.In the \"Miss Goody Two Shoes\" role of Clarissa, Phyllis Calvert oozes genuine charm.James Mason (JM) was developing his character of the upper class sadistic cad as Lord Rohan (he and ML of course had the principal roles in \"The Wicked Lady\"), while Stuart Grainger inhabits his customary charm in the role of Rokeby.Included in the main supporting character roles (who also appeared in the latter film) were Gainsborough stalwarts Martita Hunt as Miss Patchett and a disguised (it didn't fool me) Beatrice Varley playing a gypsy.Finally consistent direction for these two films was given by its director, Leslie Arliss. The action opens at an auction when a later generation of Clarissa and Rokeby (played by the same actors mentioned above) form a similar friendship as their forebears.They are bidding on objects which subsequently feature in the \"go back in time\" drama.Shift back 250 years or so and Lord Rohan needs an aristocratic brood mare to carry on the line of Rohans.Clarissa is put in the starting frame at a time when marriages were more of a property contract between \"noble\" families, and certainly not bound in love.That's where mistresses came in.I will not provide a \"spoiler\" but like in \"The Wicked Lady\" the good lady invites a veritable cobra into her house and soon ML is plotting to take over her role since she and JM have so much in common. If you enjoyed \"The Wicked Lady\" you are bound to relish \"The Man in Grey\".With such a pedigree of actors on hand it cannot fail to please.",
         "The four stars who were the cornerstone of the British Film Industries Gainsborough Pictures, James Mason, Phyllis Calvert, Margaret Lockwood, and Stewart Granger got to star in The Man In Grey. It's a brooding tale of unhappily married wife during the Regency Period, probably after the Napoleonic Wars. There certainly is no mention of the war in the plot. Two people Phyllis Calvert and Stewart Granger meet during an auction sale during wartime Great Britain. An estate is being sold off as the last of the male heirs has died. Calvert is the last surviving woman who can't inherit and Granger is the descendant of a man who was involved with one of the ancestors and has an heirloom or two of his own. The camera focuses on a series of mundane antiques and then it dissolves to the Regency period where the story is told and we see the connection of all these objects to the lives of the four stars. James Mason is in the title role and he's a titled Earl who is haughty and arrogant and revels in being an aristocrat. He has to take a wife to begat an heir, but he wants one who won't get too much in the way of the rakish lifestyle he has no intention of changing. Among Regency aristocrats even he's giving them a bad name, a fact that Raymond Lovell and Nora Swinburne as the Prince Regent and Mrs. Fitzherbert are quick to notice. Who Mason has chosen for a bride is Phyllis Calvert, a pretty and somewhat naive young thing. Naive so much that she takes as a friend a young woman not of her class when they were both in Martita Hunt's finishing school. Calvert's ill chosen friend is Margaret Lockwood who gets thrown out of the school for some indiscreet behavior. Years later when Calvert is married to Mason she finds Lockwood now with an acting troupe. Back then being an actor if you weren't William MacCready or Edwin Forrest you were not considered respectable. And note those two examples were men. Calvert's like Melanie Hamilton who sees only the good in people. But Lockwood is one exponential Scarlett O'Hara. Imagine Scarlett on steroids and you have Lockwood's character. She wants Mason with all that the title and privileges will bring. And his mojo really gets going with her. And Calvert's mojo gets going for the first time in years with likable gypsy Stewart Granger. This was Granger's first real big part in film and it brought him great critical notices and fulfilled promises of future stardom. Good as Granger and Calvert are, they pale beside the evil characters that Mason and Lockwood essay. I would have to say Lockwood is the more evil mainly because she hides it so well until the end. Mason's a lot, but he isn't a hypocrite. One curious piece of casting is young Harry Scott as the young black slave Toby is interesting. It could be the only case of blackface in the British cinema. Since this was the only credit young Mr. Scott had we don't know for sure, but I think this was a white kid in makeup. The Man In Grey is one of the best films the British cinema turned out during World War II. Like the lead characters who wonder about the connection between them, the British movie-going public went to see this film and put themselves in the places of the leads and wondered about their ancestors and their doings during a postwar period of peace. It's got some of the best acting going by four very skilled players and a good cast in support. And it holds up very well today.",
         "James Mason (like Richard Burton, Edward Arnold, and many other splendid actors - and actresses) never received the Oscar for any of his performances. This is one of the unfair side issues regarding the Academy Awards, as a measuring stick to film stardom. Everyone who has seen Mason's performances (and the others I mentioned) may know they are appearing in a \"turkey\", but they are serving their sections of the \"turkey\" with deluxe dressing. When they are appearing in \"filet mignon\" or the like, they really reach the heights. So, despite his lack of Academy recognition, Mason is remembered with great fondness by everyone who enjoys movies. To this day his voice is imitated in cartoons if you want to see a snooty, aristocratic villain. Yet I said \"villain\". How can I call the wounded, deserted IRA gunman Johnny (ODD MAN OUT) or Norman Main (A STAR IS BORN) or Humbert Humbert (LOLITA) a \"villain\". Yes, he did play Mr. Van Dam in NORTH BY NORTHWEST, but even that fellow had his less villainous moments (too few perhaps). The fact is, when Mason came to the U.S. to appear in Hollywood films in the late 1940s, it was as one of Britain's best villains. This was odd. He had been in films since the late 1930s, and had played a shell shock victim in THE HILL HAVE EYES as well as other parts. In FIRE OVER ENGLAND (an early role) he was an English Catholic nobleman who is planning to aid King Philip of Spain (for reasons of politics and religious freedom) but who is drowned fleeing the police of Elizabeth I. None of these performances had gained him his fame, deserved as it was. It was THE MAN IN GRAY that gained him fame. Set in Regency England (c. 1790 - 1837), Mason was what was termed \"a Regency Buck\". This was a fashionable, upper crust Regency aristocrat or wealthy man who enjoyed his privileges - frequently at the expense of everyone else around them. When Leslie Howard played Sir Percy Blakeney in THE SCARLET PIMPERNEL, his character is a foppish version of \"the Regency Buck\", acting the buffoon at the expense of Col Higgensbottom and even the Prince of Wales - regarding cravats - to hide his serious mission). Mason's character is actually a more openly forceful version of this character. The Marquis of Rohan is a great grandee of England (despite having the last name of a noted French Aristocratic house - connected to the \"Affair of the Diamond Necklace\"). He is fully aware of his position, and the subservient position of everyone else involved with it. Phyllis Calvert is Clarissa, the daughter of a local good family, who was a close friend of Margaret Lockwood (Hester). Their relations is similar to that of Amelia Sedley and Becky Sharp in VANITY FAIR, as good girl and bad girl. Rohan chooses to marry Clarissa because she is a proper (and subservient) wife to breed an heir. Clarissa tries to help Hester by getting her a good position in the household (bad mistake). Rohan is soon bored by marriage, and Clarissa mistakes this as a signal that she is on her own. She meets a traveling actor named Rokeby (Stewart Granger) and starts a relationship with him - egged on by Hester. Hester intention is to reveal it at the right time to Rohan, and replace the disgraced Clarissa. And she does. But it actually does two things. He does go after Rokeby to kill him. But after taking care of that problem, Rohan finds Clarissa going into physical decline. And his better character comes out. He tries to help his wife, but nothing he does helps...and she finally dies. The Marquis is heartbroken. SPOILER COMING UP: Hester still blind to the reality of the situation, confronts Rohan, and reveals her own passions. But now Rohan is fully aware of why Hester made her revelations, and what it has led to. Furious at being used, and at his own cost and of the woman he got to love, Rohan grabs a horse whip and whips Hester to death! It is an orchestrated, violent conclusion (and it's violence may be why the film is rarely shown on television). Despite making Rohan a killer at the end, because he is killing the real villain in the plot Rohan gets the audience to cheer him on! He becomes the \"anti-hero\" of the story. It gained Mason his international standing as \"a man you love to hate\". And it opened the doors to future Hollywood stardom.",
         "A film which has a lot to answer for, since it started both a trend for Gothic romantic melodramas in British cinema which proved ideal escapist fare for a country at war, as well as starting off various star careers (notably James Mason and Stewart Granger). The former, in particular, cornered the market for a while in brooding anti-heroes whose sadistic streak women seemed to find perversely attractive; incidentally, his part here was smaller than I had anticipated � since the protagonists were really the two ladies who suffered at his hands i.e. Margaret Lockwood and Phyllis Calvert (both of whom would likewise become fixtures in this type of film). Still, this being the prototype, its makers utilized modern-day book-ends � with the conveniently look-alike descendants of the 'good' couple, Calvert and Granger, having better luck coming together � as a safety-pin (not to mention adopting such anachronistic devices as having Calvert's \"nigger\" servant-boy played by a white child in black-face!). With this in mind, the film is somewhat halting as entertainment when viewed today, but it nevertheless yields pictorial felicities aplenty (courtesy of cinematographer Arthur Crabtree, who would almost immediately graduate to director and dabble in the costume genre for himself), as well as considerable interest throughout. For the record, the latter arrives by way of the occasional powerful scene (Mason and Granger's night-time scuffle in a public garden, Lockwood's come-uppance at the hands of the doting but honor-bound Mason) or humorous incident (a stock-company performance of Shakespeare's \"Othello\" in which Granger and Lockwood discuss attending aristocrat Calvert, a mutual acquaintance, during the all-important murder scene of Desdemona). Among the film's more notable (and commercially successful) follow-ups, then, were FANNY BY GASLIGHT (1944; which re-united Mason, Calvert and Granger) and THE WICKED LADY (1945; again directed by Arliss and featuring both Lockwood and Mason). JAMES MASON: THE STAR THEY LOVED TO HATE (TV) (Mike Healey, 1984) **1/2 This adequate, if hardly comprehensive, look at one of the most revered actors of the 20th century (one I greatly admire myself) probably amounted to his last ever interview � since the versatile British thespian would die before the program had even aired! With a career spanning some 50 years, it necessarily skimps over score of titles (even some very good ones) and, given the title, tends towards discussion of his sinister roles (which is actually how he rose to stardom: see my review of THE MAN IN GREY [1943] elsewhere and on whose R2 DVD this documentary was included, albeit in abridged form) rather than being a broad overview of his entire body of work � though, curiously enough, there is no mention at all of Alfred Hitchcock's NORTH BY NORTHWEST (1959) in which the actor did play villainous and is possibly the best film he was ever associated with! Mason, graceful as ever, is quite candid in his recollections � from the peculiar circumstances surrounding his first marriage (actress/writer Pamela Kellino would leave her cinematographer/director husband Roy for him, yet the three would form a lasting if not very successful film-making alliance!), his famous criticism of the British movie industry in a series of articles (what was seen as career suicide at a time when it had basically peaked did lead to a move to Hollywood, though his beginnings there were inauspicious) and when it came to choosing the three pictures he was least fond of, namely LADY POSSESSED (1952; one of the Kellino collaborations), FOREVER DARLING (1956; in which he appeared as an angel alongside Lucille Ball) and KILL! (1971; Romain Gary's bizarre thriller about drug-smuggling). In direct counterpoint, then, the two roles he had singled out over the years as his favorites � ODD MAN OUT (1947) and LOLITA (1962) � are likewise given their due. All in all, a nice record of one of filmdom's most compelling and intelligent presences in rare self-appraisal mode.",
         "The Man in Grey is directed by Leslie Arliss and adapted to screenplay by Margaret Kennedy and Doreen Montgomery from the novel of the same name written by Eleanor Smith. It stars Margaret Lockwood, James Mason, Phyllis Calvert and Stewart Granger. Music is By Cedric Mallabey and cinematography by Arthur Crabtree. A forerunner of Gainsborough's Wicked Women movies, The Man in Grey is a delicious slice of British noir pie. Proudly decked out in period attire, story is ripe with dastards, narcissists, connivers, the selfish and the cruel. Headed up by Mason's Lord Rohan and Lockwood's Hesther Shaw, these people will stop at nothing to get what they want in life. It doesn't matter who is around them, friends and family etc, if they can in any way hinder their respective selfish goals then they will be trampled upon and not a further thought will be given. It all simmers to the boiling point where lives will not just be ruined, but also ended. The four principal players are great, their respective careers well on the way to leaving behind considerable bodies of work. Arliss (The Night Has Eyes) keeps the story simple in spite of the many character strands and traits jostling for meaty exposure, and photographer Crabtree (Waterloo Road) accentuates the miserablist ambiance with sharp black and white lensing. The use of black-face on white actors is awfully out dated, as is some of the dialogue, but don't hold these things against The Man in Grey. It's a darn fine bodice botherer, resplendent with characters straight out of noir's dark alleyways. 8/10",
         "The Man In Grey is directed by Leslie Arliss,based on the popular novel by Eleanor Smith and stars Margaret Lockwood, James Mason, Stewart Granger, Phyllis Calvert and Martita Hunt. It's also one of the most memorable costume melodramas Gainsborough Studios ever made. Margeret Lockwood again plays a similar woman to Barbara in The Wicked Lady, with the same low regard for other peoples feelings and lives.Beginning during the Second World War at an auction of heirlooms from the notorious Rohan family we then flash back to Regency era England. The beautiful and angry Hester Shaw(Margeret Lockwood) becomes a pupil at a private school for young ladies run by the comical Miss Patchett(Martita Hunt).Hester is an instant outcast to all except one of the pupils,the kindly Clarissa Marr(Phyllis Calvert).The two become best friends but Hetser also resents Clarissa because she thinks her friendship is a form of charity. A gypsy woman visits the school and reads Clarissa's palm,she predicts a marriage to a rich man but is afraid of Hester and refuses to tell her fortune.Hester runs away and becomes a stage actress,years later she meets up with Clarissa again.Clarissa is unhappily married to the wealthy,but cold and indifferent Lord Rohan(James Mason).Hester sets her sights on him and they begin an affair. Hester introduces Clarissa to her friend the dashing and kind hearted rogue Peter Rokeby(Stewart Granger).The two begin a close friendship and tender love affair. James is suitably slimy and harsh as the crazed Lord Rohan and Stewart oozes sex appeal out of every scene he's in.Margaret is at her best in these sorts of roles, playing a tough independent woman going against society. Ideal viewing for a rainy day.",
         "...in the mind of a scheming woman. She doesn't start out as evil as the ruthless murderess in \"The Wicked Lady\", but Margaret Lockwood's Hester is formidable nonetheless. She is a pauper hired on as a junior teacher who creates scandal at a girl's school while befriending highbrow Phyllis Calvet, a student who marries a wealthy Lord (James mason) for convenience yet who remains strangely unfulfilled as a wealthy wife and neglectful mother. When she runs into Lockwood at a performance of \"Othello\" (which Lockwood is appearing in), she invites her to come to her country home as her companion, and Lockwood, getting over a miserable short-lived marriage, sets her sights on becoming Mason's mistress. Calvet falls in love with Lockwood's \"Othello\" co-star (Stewart Granger) while warnings from gypsy Beatice Varley curse the women's friendship, leading into much turmoil and a shocking finale. This costume variation of \"Old Acquaintance\" doesn't apologize for its less than noble characters, giving us a look into the minds of the nobility of a supposed romantic age that here comes off as anything but. Lockwood gets to start off subtle, build up melodramatic emotion as she goes forward, and finally become so evil you may find herself hissing her. Calvet isn't some wimpy Gothic heroine here; She gives out as good as she gets, which unfortunately isn't strong enough to beat her supposed friend or rascal husband, played by Mason in a delightful moody performance. The only weak link in this strong chain is the presence of young Hary Scott, obviously in blackface, playing an Indian youth, based more on the audacity of his casting rather than his performance.",
         "The critics may only give it three out of five stars, but as long as it features in the book 1001 Movies You must See Before You Die, I'm not complaining or missing it. Set in World War II, two strangers meet each other at an estate auction, and through a series of flashbacks you see how they might have known each other before through family history and connection. The flashbacks reveal beautiful Clarissa Marr (Phyllis Calvert) and her friendship with bitter, reduced to poverty Hesther Shaw (Margaret Lockwood). As their fates entwine and paths divide, Clarissa marries into higher class with handsome but cruel Lord Rohan (James Mason), while Heather becomes an actress. But the two women meet again with Clarissa bringing scheming Heather into her house. Clarissa tries to find true love, but Heather is plotting to take everything that belongs to her. Also starring Stewart Granger as Peter Rokeby, Nora Swinburne as Mrs. Fitzherbert, Martita Hunt as Miss Patchett and Raymond Lovell as The Prince Regent. The performances are good, and there are some eye-catching scenes, so I can certainly see reasons it is a must see. Good!"
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Gainsborough Pictures",
         "Rank Organisation, The"
      ],
      "summaries": [
         "At an estate auction in WWII England, two strangers meet and muse about their families' history and possible connections. Flashbacks reveal the story of the sweet, rich, and beautiful Clarissa Richmond and her friendship with bitter, impoverished Hesther Snow. Their fates are intertwined even as their paths diverge. Clarissa marries the handsome but cruel Marquis of Rohan while Hesther becomes an actress. Eventually, the two women meet again and Clarissa brings the scheming Hesther into her household. As Clarissa searches for true love, Hesther plots to take away everything that belongs to her.",
         "After a brutish, hedonistic Marquis marries a pretty young Clarissa to act as a 'brood sow,' he begins an affair with her friend who plots to take her place."
      ],
      "budget": 0
   },
   "movielensId": 97039,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1943-08-06",
      "dvdReleaseDate": "2012-10-09",
      "directors": ["Leslie Arliss"],
      "runtime": 116,
      "movieId": 97039,
      "title": "The Man in Grey",
      "mpaa": null,
      "actors": [
         "Margaret Lockwood",
         "Phyllis Calvert",
         "James Mason",
         "Stewart Granger",
         "Harry Scott",
         "Martita Hunt",
         "Helen Haye",
         "Beatrice Varley",
         "Raymond Lovell",
         "Nora Swinburne"
      ],
      "imdbMovieId": "0036135",
      "originalTitle": "The Man in Grey",
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Melodrama about two girls whose fortunes run on very different paths.",
      "tmdbMovieId": 41996,
      "avgRating": 3,
      "releaseYear": "1943",
      "numRatings": 3,
      "posterPath": "/l1m1fmdQsYKMno7sFdPofILoNQU.jpg"
   }
}