{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0253078",
      "video": false,
      "title": "The Film Parade",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "565654fc925141018f005e35",
            "name": "J. Stuart Blackton",
            "profile_path": "/ofX2PNvE8ZDCeNqhyyrHsAaewX7.jpg",
            "id": 1100017,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.00118,
      "production_countries": [],
      "id": 370044,
      "vote_count": 0,
      "budget": 0,
      "overview": "Pioneer filmmaker J. Stuart Blackton was intrigued by the idea of a film about the history of the movies as early as 1915. He finally released a 52-minute feature called The Film Parade that was shown in New York and favorably reviewed by \"Variety\" in 1933. He continued tinkering with the film for the rest of the decade, and later filmmakers and distributors used Blackton's footage for stock or to produce their own variously titled and truncated versions.  -UCLA Film &amp; Television Archive",
      "similar": [],
      "original_title": "The Film Parade",
      "runtime": null,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1933-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["J. Stuart Blackton"],
      "runtime": 55,
      "synopsis": null,
      "writers": ["Howard Gaye"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0253078/",
      "coverLink": null,
      "actors": ["Stars: Kent Stevenson, Marian Constance Blackton, Violet Virginia Blackton | See full cast and crew »"],
      "reviews": ["This movie plays like an hour long newsreel. The first section of the film, documents the development of motion pictures. Now, according to Blackman, it was the Ancient Egyptians who first came up with the idea of motion pictures. On each pillar in a temple, there was a carved picture of Isis. Each picture differing slightly from the next. So, if one raced by these pillars in a chariot, there would be a zoetrope effect of a moving picture. Blackton later covers the discovery of the camera obscura, Eastman's development of film, etc. Each section is dramatized in pantomime, as a loud news announcer explains what we're seeing. The second section of the film consists of obscure historic footage, i.e. the inauguration of President McKinley, Czar Nicholas I getting into a carriage with his family. Blackton then uses this to segue into showing his own fictional films made during this period. The narration constantly pokes fun of what's on the screen. An actor's name will be mentioned, followed by \"you'll have to ask your father about him.\" \"Is Mary really angry? No! That steam is from an exhaust pipe. Our studio was outside - on the roof of a building.\" \"This is a very expensive set. We even have a piano painted on the wall.\" An actor sits near the wall, and pretends to play the keys painted on the flat upright wall. It's intriguing to hear a first-person account from someone who made films at the dawn of the 20th Century. Blackton was acquainted with Edison and FILM PARADE includes footage of them meeting. (Unfortunately, we're not listening to an old man discussing his past. We are hearing the voice of a loud narrator reading commentary written by Blackton.) The third section of the film includes a sort of silent movie retrospective. Reminds one of the sort of things they show every year at the Oscars. Clips after clip of different movies - with names of the stars on the bottom of the screen, with sentimental music playing. A few of those shown were already deceased by the time this film was made (1933). It ends with these strange animated illustrations of radio towers. Making a weird claim that every sound ever made can be located and tracked, one day, by beams from large radio towers. \"Perhaps we will even be able to hear the voice of Abraham Lincoln.\" It ends with a memoriam to Thomas Alva Edison. Edison died in October 1931. Maybe that was the catalyst for this odd meandering, reminiscent film?"],
      "genres": ["History"],
      "productionCompanies": ["Alliance Films"],
      "summaries": ["A two-reel short from Alliance (produced in England and not the USA as some sources indicate)covering the history of \"moving pictures\" from 1848 to the (then) present, and even going into detail about how stationary frames of pictures are made to move, and how Sound is put onto the track. Footage from many silent films is used, including Mary Pickford (identified as Gladys Nicholson) in 1910's \"Simple Charity\", and Camille's death scene from \"La Dame aux cemelias\" in which Sarah Bernhardt dies standing on her feet (possibly to ensure the other performers didn't upstage her) and takes her own sweet time doing it. Marlene Dietrich sings \"Falling in Love Again\" from the English version of \"The Blue Angel\", which is good as the German-language title of that song is tough to write on a keyboard that has no accent marks. This short's title was changed to \"March of the Movies\" in the USA, which makes more sense than what most of the US film titles were changed to in England."],
      "budget": 0
   },
   "movielensId": 97117,
   "movielens": {
      "languages": [""],
      "releaseDate": "1933-01-01",
      "dvdReleaseDate": null,
      "directors": ["J. Stuart Blackton"],
      "runtime": 0,
      "movieId": 97117,
      "title": "The Film Parade",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0253078",
      "originalTitle": "The Film Parade",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Pioneer filmmaker J. Stuart Blackton was intrigued by the idea of a film about the history of the movies as early as 1915. He finally released a 52-minute feature called The Film Parade that was shown in New York and favorably reviewed by \"Variety\" in 1933. He continued tinkering with the film for the rest of the decade, and later filmmakers and distributors used Blackton's footage for stock or to produce their own variously titled and truncated versions.  -UCLA Film &amp; Television Archive",
      "tmdbMovieId": 370044,
      "avgRating": 3,
      "releaseYear": "1933",
      "numRatings": 1,
      "posterPath": null
   }
}