{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bob marley",
            "id": 178954
         },
         {
            "name": "reggae music",
            "id": 178959
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         }
      ],
      "imdb_id": "tt1183919",
      "video": false,
      "title": "Marley",
      "recommendations": [
         288581,
         136005,
         297736,
         119820,
         100784,
         27052,
         11295,
         781,
         114961,
         37234,
         82914,
         68540,
         29445,
         20595,
         28614,
         114994,
         80269,
         71434,
         272418,
         37339
      ],
      "backdrop_path": "/sqj8CMPak8z90aoNQgC5bP1PWrK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe489e9251416c750adde9",
               "name": "Bob Marley",
               "profile_path": "/t8NDqkkAGJlNafAXiQksJdKZaRA.jpg",
               "id": 1024815,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe489e9251416c750added",
               "name": "Ziggy Marley",
               "profile_path": "/QeUHklq4p6He9vQJfssRwT9scs.jpg",
               "id": 154857,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe489e9251416c750addf1",
               "name": "Rita Marley",
               "profile_path": null,
               "id": 237537,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe489e9251416c750addf5",
               "name": "Cedella Marley",
               "profile_path": null,
               "id": 1082313,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe489e9251416c750addf9",
               "name": "Jimmy Cliff",
               "profile_path": "/xMvPfzHVSLCL5Y9qUijOXErf84v.jpg",
               "id": 52813,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe489e9251416c750ade15",
               "name": "Chris Blackwell",
               "profile_path": null,
               "id": 587856,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe489e9251416c750ade19",
               "name": "Bunny Wailer",
               "profile_path": null,
               "id": 572314,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750adde5",
               "name": "Kevin Macdonald",
               "profile_path": "/k46Er5HaZ8FqbNEpBXf9FlnxxOX.jpg",
               "id": 17350,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750addff",
               "name": "Ziggy Marley",
               "profile_path": "/QeUHklq4p6He9vQJfssRwT9scs.jpg",
               "id": 154857,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489e9251416c750ade05",
               "name": "Chris Blackwell",
               "profile_path": null,
               "id": 587856,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489e9251416c750ade11",
               "name": "Charles Steel",
               "profile_path": "/wcScRXif1Qk8qfRweNeOp4KzE99.jpg",
               "id": 20247,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "544fe796c3a368023c0024c9",
               "name": "Steve Bing",
               "profile_path": null,
               "id": 53394,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 5.78927,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 90125,
      "vote_count": 127,
      "budget": 0,
      "overview": "Bob Marley's universal appeal, impact on music history and role as a social and political prophet is both unique and unparalleled. Directed by Academy Award-winning director Kevin Macdonald (The Last King of Scotland), MARLEY is the definitive life story of the musician, revolutionary, and legend, from his early days to his rise to international superstardom. Made with the support of the Marley family, the film features rare footage, incredible performances and revelatory interviews with the people that knew him best.",
      "similar": [
         149001,
         502389,
         474727,
         36701,
         864,
         7514,
         134158,
         398745,
         34113,
         429319,
         327637,
         84697,
         74681,
         169610,
         66769,
         211488,
         400627,
         213523,
         487667,
         79704
      ],
      "original_title": "Marley",
      "runtime": 144,
      "poster_path": "/hIkihuykLU1kEniuL9MMWMT7Pql.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Shangri-La Entertainment",
         "id": 2265,
         "origin_country": ""
      }],
      "release_date": "2012-04-20",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.magpictures.com/marley/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Macdonald"],
      "runtime": 144,
      "synopsis": "For nearly half a century, Bob Marley the musician, the revolutionary, the legend has influenced various populations at a global level that remains unparalleled. Marleys passing in May 1981 not only left a huge void in what is perhaps modern musics most spiritual and yet accessible genre, reggae, but also, as a testament to the stars power, set the stage for the unprecedented, posthumous growth of his fan base. The enduring nature of Bob Marleys fame is anything but a simple pop music phenomenon. Just one index of it is the success of the Marley compilation album Legend, which is one of only 17 albums to pass the 10-million mark in sales (in 2009), continues to sell at the rate of about 250,000 albums per year, and is the second-longest charting album in the history of Billboard magazines record-keeping. With an ever-growing fanbase (as evidenced by his 33+ million roster of fans on Facebook and Twitter), his fame has elevated his stature to one of a spiritual beacon. More than 30 years later, the undying messages that go beyond his music make Marley a cultural force to be reckoned with. His way of living was in many ways a political act on the world stage, across the worlds continents. Today, wherever politically minded youth seeks ways to find solidarity (as was exemplified over recent months by the popularity of Bob Marleys music and imagery amidst scenes of protest in the Middle East and Africa and at the Occupy Wall Street demonstrations and its many offshoots), they find him to be an ever-potent cultural touchstone. And yet, for all the loyalty shown to the icon, and all the renewing excitement for those still discovering his legacy, many mysteries and unanswered questions have remained. A glut of concert films, biographies, DVDs and unauthorized videos already have attempted to explore his story over the years since his death, but the man himself remains almost as enigmatic as he is beloved. Now, through the unprecedented, combined efforts of the Marley family, Oscar-winning master filmmaker Kevin Macdonald, many of those questions have been given an answer, and many of those mysteries have in great part been solved.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1183919/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NDUzMzQ2OF5BMl5BanBnXkFtZTcwNzY4NTE0Nw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bob Marley, Ziggy Marley, Jimmy Cliff | See full cast and crew »"],
      "reviews": [
         "Marley is a 2012 Documentary film that tells the story of legendary Jamaican reggae artist Bob Marley. The film charts his life from his humble beginnings in a small country village without electricity, through his rise to fame in Jamaica, to his exile in London, subsequent return to his Island of birth and eventual death at the age of just 36. Before going in to the cinema I wouldn't have classed myself as a Bob Marley fan and although I have a couple of his albums and love his best known songs I knew very little about him. The film gives an honest account of his life and of Marley as a man. The story is told using achieve interviews with Marley himself but mostly through interviews with his friends, family and ex colleagues who are still living. Some of the interviewees are great characters and speak with wisdom. Others are hilarious and most have a fantastic Jamaican Patois which is delightful to listen to. The film also gives some background to Rastafarianism, something else that I knew little about. The whole film is backed with over sixty Marley and Bob Marley and the Wailers songs which start with the song he first recorded aged sixteen and ends with One Love. This film has one of the greatest soundtracks of any film I've seen. The highlight for me was Marley's triumphant return to Jamaica for the One Love Peace Concert in 1978. After years living in London following an attempt on his life, Marley returned to Jamaica and performed in front of 32,000 people and bought the leaders of Jamaica's warring Political Parties up on stage where he managed to get them to hold hands above their heads in a sign of peace. It was an amazing thing to witness, even in the cinema and its impact was obvious. The final quarter of the film takes on a deceivingly sadder tone as we reach the final years of Marley's life. After a battle with cancer he died in 1981 in Miami, USA. There were many people crying in the theatre, including my girlfriend after a very sad few moments on screen. The film ends on a positive note though by showing how Marley's music and message is still being used to educate and unite people today. The film shows Marley to be both a great musician and great man but isn't afraid to look at his less impressive traits. His womanising is mentioned on several occasions, as is his poor parenting. His willingness to do anything to make it is also a constant theme. He was willing to change his style as well as drop his friends in order to become better known or appreciated and the film doesn't shy away from letting this be known. A thread I'd like to have seen explored further was his lack of success with black audiences outside of Jamaica. It was hinted at several times but is an interesting area which could have been looked at further. Marley is a fantastic biopic documentary which sheds light on one of the world's best loved musicians. It isn't afraid to show both his good and bad sides and does a good job of illustrating his life from start to finish. It is accompanied by a soundtrack that head my head bobbing and feet tapping throughout and made me want to go out and further explore his back catalogue as well as his message of One Love. www.attheback.blogspot.com",
         "Greetings again from the darkness. Kevin Macdonald is one of those rare directors who has had commercial success with both documentary and mainstream films. His Last King of Scotland featured a powerful performance from Forest Whitaker as Idi Amin, and in Touching the Void, he chronicled a perilous mountain climbing trip in the Andes. Here, he takes on the fascinating life of musician and humanitarian, Bob Marley. This extraordinary film features some wonderful never before seen video and still photography, as well as some very insightful interviews from friends, family, bandmates, and others who were present during that time. We see the poverty stricken area of Jamaica where Marley was born to his mother (a local teenager) and his father, a 60-something white man who evidently worked for the forest department. It's truly fascinating to watch Marley's development as a musician and human being. With little education, he relied on stunning life instincts and rose to be the most important Jamaican figure in a time of intense discourse. His personality was one that brought people together, and his music complimented his beliefs and encouraged a unified country and world. While he survived an assassination attempt, he was unable to beat cancer. His death at the young age of 36, leaves us asking ... what could have been? Watching his Wailers begin by playing for free in small clubs and building to worldwide tours in huge stadiums shows just how much influence he had with his words, music and actions. He was admired globally and revered in Jamaica. So often biographies and documentaries treat their subject as either a saint or villain. Here, we get the descriptions from Marley's own voice, as well as the voices of his wife Rita, his children (including Ziggy), his girlfriends (including Cindy Breakspeare who was Miss World). We learn he had 11 kids with multiple women. We learn he wasn't the warmest father to his kids. We learn he was courageous and insightful, and always willing to listen to both sides of an argument. For most, being an influential musician would be enough. For Bob Marley, it was just the key to the door ... his vision was for a peaceful world where we could all \"get together and feel alright\". You will notice I have yet to mention marijuana. Marley's face has become a symbol for Jamaica's key export, and that's a shame ... more need to know what this man was all about.",
         "Usain Bolt and bobsleighs aside, when someone mentions Jamaica, you think of either Reggae, Rhastas or weed. In other words, you think of Bob Marley. The undisputed paragon of everything we associate with that \"laid-back\" corner of the Caribbean. But Bob was a little more than a nonchalant stoner who sung a few tunes, you know. As far as singer/songwriters go, they don't come much bigger than Bob Marley. His and The Wailers' universal songs of love, peace and hope rank amidst some of the finest and most recognizable ever given up to music. There are even those who would liken Bob to Ghandi. A bit O.T.T, sure, but the comparisons are there (sort of): an immortal advocate of peace and altruism; a liberal; a national treasure. And yet Bob Marley was not without fault and, 'till now, a fair share of unworthy documentaries. Kevin Macdonald's (The Last King of Scotland) bio' doc' about Bob's life and legacy is a stylish and honest mediation on the man behind the myth that charts his physical and spiritual journey through the music world; his quest for success that would transform him from the rejected frontman of a budding ska band to the iconic, liberating arbitrator whose timeless tunes went beyond music and unified colours, creeds and a country in meltdown. Made with the full cooperation of Bob's family and friends and told largely through their accounts, Marley is a potent and essential piece of documentary film-making. Kevin Macdonald's Bob doc' could've made the man out to be some kind of saint. But it doesn't. Macdonald's various interviews with those who knew Bob best in addition to a heap of archival stills and footage paint the pop-icon in a variety of ways; conflicted, poised, selfish, kind, wanton, loyal, driven, stubborn, free. Marley lays bare the heart and soul of the dreadlocked Rhasta in some style. A distinct level of cohesion and humanity is well and truly found in the director's attention to detail regarding Bob's estranged personal life; from his impoverished roots and search for acceptance to his self-serving, self-sacrificing ways and stirring date with cancer. Despite a muddled and stuttered opening, Marley boasts an absolving and deeply moving final third that ties the hefty, 146 minute bio doc' up in style (cheesy ending credits aside). This is a fresh and thoughtful trip through the life of a music legend with scope and soul in spades; an intriguing and chic fusion of art, music and history. Marley is the quintessential portrait of Bob Marley's life. See it.",
         "I am amazed at the amount of information not publicly known about an icon such as Bob Marley. This movie goes into great (and previously unmentioned) detail regarding his life, his family, his music and his untimely death. The interviews with his wife, his girlfriends, his children, band mates, etc. tell much of the story that we never were privy to prior. While it is more than two hours in length, you will soon realize it takes every bit of this and then some to detail the life of someone who unfortunately only lived to the age of 36. There are recoding sessions, interviews with Marley himself and footage of his many tours and concerts. This documentary will convert anyone yet understanding how important Robert Nesta Marley was to world music and world politics. I highly recommend it.",
         "I was expecting to see the same bits of footage, images, interviews etc. that I've seen before but this doc reveals lots more. We learn how his early formative years as a dual heritage child growing up in rural JA gave him a unique philosophical view in which to form his own ideas of who he was and what his destiny was to be. The film also has the luxury of 144 mins to illuminate the genius that Bob was. I got to appreciate how influential and messianic he became within his immediate circle, his community and his nation. His ambition, drive and competitiveness were an integral part of his make-up and became central to his mission to preach love, Rastafari and unity. Any resistance to this would be casually side-stepped. Whilst not a saint his soul crackled with energy and shone bright, perhaps too bright for the physical being that contained it and which sadly gave out at only 36. But the legacy lives on in the music, the voice of a struggling people, and we should listen as well as dance. Peace, love and blessings.",
         "Until I saw \"Marley\" at the Sonoma International Film Festival last weekend, I knew little about the reggae star but liked a lot of his music. Director Kevin MacDonald was nominated for an Oscar for \"The Last King of Scotland,\" the excellent film about Ugandan dictator Idi Amin. MacDonald won an Oscar for the documentary \"One Day in September.\" He has directed a number of fine films, but none any finer than this gem. This is an excellent biography of a musical genius, who died very young. While he lived, he was a force of nature. What is particularly delicious about this film is the sound. There is a lot of music throughout, much of it in the background, but in the foreground are the people who knew and played with Bob Marley. The Jamaican language makes the film very compelling. There are sub-titles which translate English into English. The language adds so much to understanding why Reggae is what it is. This is a fine film, an artistic achievement and a fitting tribute to a great musician. See it, if you have even a passing interest in reggae or Bob Marley.",
         "The first official documentary featuring members of the Marley family, who reflect on the life of Bob Marley. A prophet to some and a lyrical icon who left the earth leaving a significant mark in musical history. \"Marley\" is a beautifully crafted piece of work based on the late Jamaican star. The film is aimed at his biggest fans as well as those with little knowledge of his life, example being myself. Born in 1963,Raised in the slum's of Kingston, Jamaica, Bob Marley lived life an only child with his mother fending for food and water. Bob's life shows an affect for disaster with little knowledge of his father and any appearance being nothingshort of a myth. Just like Bob, friends and numerous characters from the Kingston area are introduced in the film, expressing their upbringing in poverty stricken Jamaica. We learn of the belief in \"Rasta Fari\". A god worshipped by certain Jamaicans. Bob Marley describes him as the equivalent to Jesus. \"White people have Jesus, we have Rhasta Fari\". A belief which entitles them to smoke a ridiculous amount of weed each day. The concept of the documentary tells a tale of comedy, happiness and depression as ones life is told through those who grew up with, and loved him most. His struggle for success is told through friends and numerous members of The Wailers. How reggae was founded through a single chord? how Bob Marley eventually left Jamaica for America to expand his ideas in music. A story of ambition and tragedy, relating to the shooting of Bob Marley and certain members of The Wailers. How Bob Marley was begged to revive Jamaica's government torn gang war, bringing a country together through his music. Vital members of the Marley family are heard for the first time in this cinematic masterpiece. Son of Bob, Ziggy Marley tells of his remembrance, as we see a shocking resemblance to the late singer. Rita Marley, his first and last love tells the story of how she stayed with Bob, despite his sexual antics. A revealing documentary of the Jamaican superstar, seen through the eyes of members of the music industry as well as a brilliant cast of Kingston locals who simply never left the scene since Bob Marley's growing up. \"Marley\" reveals a variety of live performances, showing Bob Marley at his best and a typically beautiful soundtrack, which mingles with every scene. Fans and people today know of the ending that awaited Bob Marley. This documentary is a terrific celebration towards a musical genius, who just like many icons, changed parts of the world, politically and musically. Overall, \"Marley\" is terrifically original, telling a story of a man with a history guaranteed to make you laugh and cry. A film for fans of all ages to enjoy.",
         "I was a little weary of watching Marley (2012) because I felt that everything that has been said about Bob Marley has been said yet Marley is a fantastic documentary. If there is a little gripe, then I would say that the partnership between The Wailers and Lee \"Scratch\" Perry is left conspicuously unexplored. It must be remembered that The Wailers first proper studio album, Soul Rebels (1970) produced by Perry, became a serious bone of contention between the band and Perry. That said, the interviews are enlightening and often amusing. The interview with Cedella Marley, Bob's Daughter, is rather sad as she obviously retains a level of bitterness towards her Father. Highly recommended.",
         "I'm old enough to have dug Bob Marley when he was actually alive and performing. AND I was fortunate enough to produce some jingles in Tuff Gong Studio for Air Jamaica. So I was around the scene, post-Marley, and I played his music endlessly for a decade or two. Then I discovered salsa, and Latin Jazz, and the Afro-Cuban sound, and let my Marley go. Well, now I have my Marley back. This film took me into parts of Trenchtown, Kingston, Jamaica that I have never seen and never want to see. Even after reading Timothy White's marvelous biography of Marley, \"Catch A Fire,\" I couldn't imagine how horrible Trenchtown was until this movie. It gave me a deep appreciation for how far this young man traveled in his tragically brief time on this particular planet. He wasn't nice, he wasn't easy, but he was brilliantly talented and surrounded himself with other talented, fascinating people. Yes, folks are moaning about the movie not having enough music, but ... it has lots of heart and conversation and laughs and empathetic understanding of the Marley story -- and the story of Jamaica, one of the most beautiful and agonizing places I have ever been. I can't recommend this film highly enough. (Gosh, I hope there are no spoilers here. Can you write a spoiler for a documentary of a widely known figure?)",
         "Marley (2012) *** 1/2 (out of 4) Director Kevin Macdonald epic look at music legend Bob Marley follows him from his early days to his rise in music and eventually his death at the age of 36. Through concert, interview and audio footage, we get to hear from Marley throughout his life and of course there's a lot of attention given to the music but there's also a lot aimed at Marley's lifestyle and his hopes for the future. We also get interviews with his son, daughter, mother, wife as well as countless band members and others who knew him personally. At 142-minutes, this thing certainly packs in a lot of information and I think die-hard Marley fans are going to really love this thing. There's no question that nearly every aspect of his life is covered from his early childhood, to his womanizing and of course the final few months of his life. The film really does an exceptional job at giving you a complete look at the man and it doesn't shy away or try to hide his darker side or moments that aren't as good and fun. The documentary really shows him as a complete human, which is something a lot of these films miss. Those who are just mild fans or are just wanting quick look at how Marley was might find this to be a bit too long but I do feel this was made for die-hard fans who want to know everything. I really enjoyed all of the concert footage that they added because one gets a great idea of what Marley was like on stage. Of course, countless songs are on full display here, which is another major plus. Certain aspects of Marley's life gets additional attention here including the Smile Jamaica Concert and him getting shot before hand. Also, the final months of Marley's life also gets additional scenes and it's still shocking to see him dying so young."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": [
         "Shangri-La Entertainment",
         "Tuff Gong Pictures",
         "Cowboy Films"
      ],
      "summaries": [
         "Bob Marley's universal appeal, impact on music history and role as a social and political prophet is both unique and unparalleled. The definitive life story of the musician, revolutionary, and legend, from his early days to his rise to international super-stardom. Made with the support of the Marley family, there is rare footage, incredible performances and revelatory interviews with the people that knew him best.",
         "A documentary on the life, music, and legacy of Bob Marley."
      ],
      "budget": 0
   },
   "movielensId": 97168,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-04-20",
      "dvdReleaseDate": "2012-08-07",
      "directors": ["Kevin Macdonald"],
      "runtime": 144,
      "movieId": 97168,
      "title": "Marley",
      "mpaa": "PG-13",
      "actors": [
         "Bob Marley",
         "Ziggy Marley",
         "Rita Marley",
         "Cedella Marley",
         "Jimmy Cliff",
         "Chris Blackwell",
         "Bunny Wailer"
      ],
      "imdbMovieId": "1183919",
      "originalTitle": "Marley",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["KuIkYtYi4b0"],
      "plotSummary": "Bob Marley's universal appeal, impact on music history and role as a social and political prophet is both unique and unparalleled. Directed by Academy Award-winning director Kevin Macdonald (The Last King of Scotland), MARLEY is the definitive life story of the musician, revolutionary, and legend, from his early days to his rise to international superstardom. Made with the support of the Marley family, the film features rare footage, incredible performances and revelatory interviews with the people that knew him best.",
      "tmdbMovieId": 90125,
      "avgRating": 3.65409,
      "releaseYear": "2012",
      "numRatings": 159,
      "posterPath": "/hIkihuykLU1kEniuL9MMWMT7Pql.jpg"
   }
}