{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0259747",
      "video": false,
      "title": "The Young and the Dead",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 1,
               "credit_id": "59567f5b9251411dbd04b4f5",
               "name": "Shari Springer Berman",
               "profile_path": "/tEtNUrXSYBQG4mHW5p4TZeWin9h.jpg",
               "id": 72205,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59567f679251412ac706d03d",
               "name": "Robert Pulcini",
               "profile_path": "/nUUPNrIwC6vJNGLwyfhq89yr4T4.jpg",
               "id": 72206,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.002444,
      "production_countries": [],
      "id": 292547,
      "vote_count": 0,
      "budget": 0,
      "overview": "Historical Documentary from directors Shari Springer Berman and Robert Pulcini about the Hollywood Memorial Park cemetery.",
      "similar": [],
      "original_title": "The Young and the Dead",
      "runtime": null,
      "poster_path": "/2eILTBBDu8nFdHalHzTxrh9p3oA.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-04-22",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Shari Springer Berman",
         "Robert Pulcini"
      ],
      "runtime": 91,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0259747/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNDk4NzgyOV5BMl5BanBnXkFtZTYwNDQ5Mzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tyler Cassity, Jay Boileau, Peter Bart | See full cast and crew »"],
      "reviews": [
         "All of the elements are here to what could have been a great film about the Hollywood Forever Cemetery and it's resurrection by Mr. Tyler Cassity. The Young and the Dead is still a good film, but it could have been made better. How? By featuring more of the aura of the resting place of so many legendary silent and Golden Age silver screen stars. It achieves this during a segment on Rudolph Valentino. In particular when eerie music sets in, and slow dissolves reveal a intense, Rasputin-like artist (Jonathan Morrill), painting in a crumbling mausoleum, an oversized portrait of the Sheik. A little more of a historical tour for the viewer, and little less of the banter of a portly pubescent Valentino groupie would have helped. Why wasn't Tom Demille, the cemetery's excellent , knowledgeable, and charismatic tour guide used to take the viewer through this movie? Or at least part of it? We once were given an amazing and thoroughly enjoyable tour of Hollywood Forever by Tom Demille, and it was brilliant. I was hoping he'd be featured in it more than just by chance in the background. The movie would have been much more entertaining and informative with him in it. That's not to say that Mr. Tyler Cassity is hard to look at, he certainly isn't. Mr. Tyler Cassity, without whom there would be no Hollywood Forever Cemetery, brings to this documentary, all of the spirit and good energy that he possesses in life, and as much as can be transcended onto film. There are genuinely funny moments with Tyler, such as reviewing potential voice talents for the cemetery's answering machine. As well there are revealing thoughtful and caring moment's from Mr. Cassity and his dedicated staff. One can imagine that many occur in the business of death. This also could have been revealed to the viewer a little more in-depth. After all, isn't the attraction to find out more about, and honor, our lost idols and fallen heros? Anyhow, this is still a good movie, hats off to anyone who can finish a film. Knowing how much better this could have been made, had a little more resources been used, I can't call it a great film, but it's still a good one.",
         "I enjoyed the film. When I was a child I loved watching old movies and listening to grownups retell events of their lives. My favorite past time was watching old movies. I am not much of a silent movie fan, but I did get to see Gene Wilder's rendition of Valentino and there was a movie in the seventies about his life. I didn't know there is still so much fascination about \"The world's greatest Lover\". The film also depicted how being so close to death makes you realize how important it is to live and cherish those you love. I grew up in a small town in Ohio. I used to go to the cemetery with my friends for bike rides. We had an incredible cemetery. There were no fences to keep people out. It had lots of trees and winding roads. In the Dominican Republic the cemeteries look like a town with tiny houses. As I drive by cemeteries today, there is hardly any shade trees, and they are surrounded by a fence. I'd like to be buried under a shady tree with a view of a fountain or something nice. The cemetery in the film seems like a very nice place. One that does not seem forgotten.",
         "In \"Movie Man\" Walker Percy's character argues that nothing is \"certified\" until it appears on film. The point is arguable. But the people who are going to be buried in this cemetery would no doubt agree. They make a videotape before they die, to be played at their services and made available for viewers afterward. Hollywood Cemetery used to be a junkie, overgrown, fallen-down necropolis with a handful of old-time, half-forgotten celebrities like Fatty Arbuckle. It was recently taken over by entrepreneurs who are turning it into a high-end place to spend eternity. It's kind of like Tom Joad surviving the depression and opening a chain of salad bars in Santa Ana. At first I thought this documentary was supposed to be a spoof of better-done films like \"Gates of Heaven\" or any other Errol Morris piece, since the interviewees come on so enthusiastically with Hollywoodian locutions like, \"This is very unique,\" and, \"It's a very, very, very nice place.\" The owner is described as, \"A nice guy; he looks like a movie star.\" A salesman tells a customer, \"We all want to be remembered, but we want to be remembered the way WE want to be remembered.\" \"The very first statue bought by Dr. Eaton was the duck girl, a young little girl.\" \"Eine Kleine Nachtmusik\" plays in the background. (It ought to be a trained seal playing \"Dream a Little Dream of Me\" on the bicycle horns.) Forest Lawn is held up as the model towards which they strive. And these guys are serious. They are very, very, very much aware that they're characters in a film and have an audience to convince, and some of them see it as free advertisement. \"I've heard that there are secret make-out spots around,\" says one touter, \"and it's a very romantic place.\" There was something engaging about Morris's interviewees and about the excerpts we were shown. But there's not much new here, not in the way of technique anyway. What is still surprising, still amazing, is the plumbless depths to which Orange County vulgarity will sink. It isn't enough to have simply heard about it. It needs to be experienced. We are given a tour of Forest Lawn, the holy of holies, by an unctuous business-suited blonde who explains that Dr. Eaton decided to buy it and fix it up years ago because he found it depressing. For instance, none of the statues of Jesus were smiling. So he had smiling Jesus statues constructed. Also Disneyesque bronze fauns, a replica of Michelangelo's David (no frontal nudity, but surely he wears a fig leaf) that crumbles after every earthquake because \"he's weak in the ankles\", a replica of Copenhagen's little mermaid, a stained-glass replica of \"The Last Supper,\" and so forth. All that's missing is \"The Pissing Mannequin\" of Brussels. Dr. Eaton's goal was achieved. Forest Lawn is no longer depressing. It's either one hundred percent hilarious or one hundred percent emetic, depending on your taste for irony. The content of this documentary is so shockingly repugnant in every way -- the insights shallow, the iconography hair-raisingly schlocky -- that it makes for compelling watching. It's more like \"Mondo Cane\" than like \"The Thin Blue Line,\" but that's what makes it worth watching. It is said that people get the governments they deserve. Is the same thing true of their monuments? There we have Karl Marx buried in Old Highgate Cemetery in London, under a bronze bust, surrounded by all of the most rapacious capitalistic pigs of the industrial age. In the afterlife perhaps they refer to him as \"Old Pinwheel Karl.\" Maybe all monuments are ultimately ironic.",
         "\"The Young and the Dead\" is a marginally interesting documentary about the renovation and innovation of the Hollywood Memorial Park cemetery (6000 Santa Monica Blvd), resting place for a handful of Hollywood stars like Rudy Valentino and Fatty Arbuckle. The film documents all aspects of the cemetery biz as well as those goings-on peculiar to this memorial park...some of which are peculiar. Okay stuff for die-hard Tinseltown junkies and those with an interest in the cemetery biz."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": ["Tail Slate Pictures"],
      "summaries": ["The Hollywood Memorial Park cemetery was run down and bankrupt. Tyler Cassity, a young visionary from St. Louis, bought it for a song. Not only did he renovate the cemetery (the burial place of many of Hollywood's most famous actors and filmmakers), he is in the process of remaking the whole funeral industry, by focusing on the memorial aspects, producing documentaries of the lives of even ordinary people. The hip but respectful and caring approach is in vivid contrast to the traditional funeral business, represented here by Forest Lawn."],
      "budget": 0
   },
   "movielensId": 97240,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-04-22",
      "dvdReleaseDate": "2004-06-01",
      "directors": [
         "Shari Springer Berman",
         "Robert Pulcini"
      ],
      "runtime": 0,
      "movieId": 97240,
      "title": "The Young and the Dead",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0259747",
      "originalTitle": "The Young and the Dead",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Historical Documentary from directors Shari Springer Berman and Robert Pulcini about the Hollywood Memorial Park cemetery.",
      "tmdbMovieId": 292547,
      "avgRating": 3.25,
      "releaseYear": "2000",
      "numRatings": 2,
      "posterPath": "/2eILTBBDu8nFdHalHzTxrh9p3oA.jpg"
   }
}