{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "thief",
            "id": 9727
         },
         {
            "name": "casbah",
            "id": 187203
         }
      ],
      "imdb_id": "tt0029855",
      "video": false,
      "title": "Algiers",
      "recommendations": [
         72613,
         33030,
         51571,
         22856,
         83667,
         40639,
         76140,
         38770,
         27635,
         43335,
         21336,
         94529,
         80596,
         48994,
         29237,
         43864,
         96366,
         43779,
         31555,
         43852
      ],
      "backdrop_path": "/krogNyKD9hPNn1PYIQpiDc13cSp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Pepe le Moko",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab8d",
               "name": "Charles Boyer",
               "profile_path": "/5xjnsNi2vr31yyPyum77aPCuCTE.jpg",
               "id": 29519,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Ines",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ab91",
               "name": "Sigrid Gurie",
               "profile_path": "/xHaSosSS3QwgQORpWeFg5NCpo0v.jpg",
               "id": 89087,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Gaby",
               "gender": 1,
               "credit_id": "52fe444ac3a368484e01ab95",
               "name": "Hedy Lamarr",
               "profile_path": "/AeKUdahr4onbPg8RnzKkIteuDOJ.jpg",
               "id": 89088,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Inspector Slimane",
               "gender": 0,
               "credit_id": "52fe444ac3a368484e01ab99",
               "name": "Joseph Calleia",
               "profile_path": "/xyb6l5Epo5NXbKUXD7puhLoYca2.jpg",
               "id": 33747,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Grandpere",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab9d",
               "name": "Alan Hale",
               "profile_path": "/7ZTTJ08iSQYBaDvfgfhmGpqCrtx.jpg",
               "id": 8729,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Regis",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01aba1",
               "name": "Gene Lockhart",
               "profile_path": "/7IL5fx1mfhCiMAvYXSiY1Dj7yky.jpg",
               "id": 30234,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Chef Inspector Louvain",
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01aba5",
               "name": "Walter Kingsford",
               "profile_path": "/hAyno19zK7ZCzESl6RSw1jbOjH3.jpg",
               "id": 33033,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Commissioner Janvier",
               "gender": 0,
               "credit_id": "52fe444ac3a368484e01aba9",
               "name": "Paul Harvey",
               "profile_path": "/xDk9GgK3ykYIiXeM5ybhoJUwlzg.jpg",
               "id": 34320,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Carlos",
               "gender": 2,
               "credit_id": "535110f10e0a265614000fc3",
               "name": "Stanley Fields",
               "profile_path": "/a7gQDvBBg6S2qN8cQTeclTLGX49.jpg",
               "id": 29762,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Pierrot",
               "gender": 2,
               "credit_id": "535110fc0e0a2655fe000fea",
               "name": "Johnny Downs",
               "profile_path": "/shVecyKb99iqayV3dhrQ5FYJnPM.jpg",
               "id": 131442,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Max",
               "gender": 2,
               "credit_id": "535111050e0a265614000fd0",
               "name": "Charles D. Brown",
               "profile_path": "/tmJTiq9xHPa7vVEnE8t7wXMKbdD.jpg",
               "id": 13977,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Giraux",
               "gender": 2,
               "credit_id": "5351110f0e0a26561100107f",
               "name": "Robert Greig",
               "profile_path": "/ze6PfVLC0AaaoKkwtrJtOLuZkWa.jpg",
               "id": 30262,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "L'Arbi",
               "gender": 2,
               "credit_id": "535111190e0a26561d000f71",
               "name": "Leonid Kinskey",
               "profile_path": "/fM1pWZWlFdJZjyEOKSILNjbTYFn.jpg",
               "id": 4120,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Aicha",
               "gender": 1,
               "credit_id": "535111250e0a26560e001000",
               "name": "Joan Woodbury",
               "profile_path": "/iN5cJbzUThqlwbmVsoEkNiZ1Pi4.jpg",
               "id": 89746,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Tania",
               "gender": 0,
               "credit_id": "535111320e0a265603001088",
               "name": "Nina Koshetz",
               "profile_path": null,
               "id": 102915,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab65",
               "name": "John Cromwell",
               "profile_path": "/1osYpgUy3zABKeFRjyBX0K4qcY9.jpg",
               "id": 31497,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab6b",
               "name": "Walter Wanger",
               "profile_path": "/3FDfLCfCygfTw33lUGTj1KeiGMz.jpg",
               "id": 7646,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab71",
               "name": "John Howard Lawson",
               "profile_path": null,
               "id": 89084,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab77",
               "name": "Vincent Scotto",
               "profile_path": null,
               "id": 89085,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe444ac3a368484e01ab7d",
               "name": "Mohamed Ygerbuchen",
               "profile_path": null,
               "id": 89086,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab83",
               "name": "James Wong Howe",
               "profile_path": "/rbAffvKfJYrfLCuuYPzXKSSyU6t.jpg",
               "id": 14569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ac3a368484e01ab89",
               "name": "Otho Lovering",
               "profile_path": null,
               "id": 14961,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.058756,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22657,
      "vote_count": 8,
      "budget": 0,
      "overview": "Pepe Le Moko is a notorious thief, who escaped from France. Since his escape, Moko became a resident and leader of the immense Casbah of Algiers. French officials arrive insisting on Pepe's capture are met with unfazed local detectives, led by Inspector Slimane, who are biding their time. Meanwhile, Pepe meets the beautiful Gaby , which arouses the jealousy of Ines",
      "similar": [
         949,
         27066,
         713,
         1903,
         116,
         28468,
         1844,
         1939,
         1586,
         1213,
         500,
         283227,
         705,
         247,
         1628,
         11524,
         1813,
         891,
         3594,
         4771
      ],
      "original_title": "Algiers",
      "runtime": 96,
      "poster_path": "/rpVytlkawQtsWb9F9KeegTraOew.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Walter Wagner Productions",
            "id": 34103,
            "origin_country": ""
         }
      ],
      "release_date": "1938-06-28",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "You've Got A Date With Danger, A Rendezvous With Romance In The Glamorous, Mysterious Algiers . . Make A Date Now !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Cromwell"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "John Howard Lawson",
         "James M. Cain"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0029855/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzQ5NDkzMF5BMl5BanBnXkFtZTcwNDY1MzcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Boyer, Hedy Lamarr, Sigrid Gurie | See full cast and crew »"],
      "reviews": [
         "\"Algiers\" is director John Cromwell's remake of the French film, \"Pepe Le Moko\" which appeared only a year earlier. The Gallic flick starred Jean Gabin, then and now one of the truly great actors to emerge from that country. So Cromwell took a risk giving the lead role of jewel thief Pepe to young actor Charles Boyer. The risk paid off - and continues to do so as this fascinating prewar movie is readily available on budget-priced DVD. Pepe is wanted in metropolitan France for stealing jewelry but not, apparently, for any crimes of violence. He's hunkered down in Algiers's famous \"casbah,\" the native quarter whose name is evocative of mystery and, of course, sensuality. Pepe seems to be a sort of Great White Crime Boss in the native quarter where locals both protect and respect him. It's never clear how he ascended to that height. Pepe has a beautiful lover, Ines, played by the truly gorgeous Sigrid Gurie. Legend has it that \"Algiers\" was to be the vehicle to propel this Scandanavian actress to wide fame but in reality her film career was rather short. The winner in this case, besides Boyer, was newcomer Hedy Lamar whose role as Gaby is central to Pepe's loss of control over his small world and, eventually, of himself. Gaby arrives in Algiers engaged to a fat, vulgar borderline-loathsome older man who clearly regards her as a trophy bought and paid for. Why she needed this creep isn't clear. What is clear is her falling in love with Pepe who abandons the devoted and clinging Ines for this right-off-the-boat hothouse beauty. A Parisian police official is in Algiers (Algeria, a French colony for those who don't know history) determined to collar Pepe. His forays into the casbah meet with no success and quiet derision from both the locals and some of the French police who understand that the casbah is honeycombed with escape routes and populated with folks eager to thwart the gendarmerie. A very interesting character is Inspector Slimane, Joseph Calleia. Amused by the foolish antics of his superior, Slimane knows the casbah and in his own way is determined to bring Pepe to justice. His mission isn't kept from Pepe and the two have a cordial relationship with the cop telling the crook that eventually he will be the cause of his own downfall. Sarcastic, witty and observant, Slimane is an arresting character (pun intended). It's not clear if he's a native gone over to the police or a Frenchman who has jumped the reservation and found a more comfortable life straddling two cultures. There's something almost Russian in his outlook and words. \"Algiers\" ends with a famous scene that while not at the level of the closing moments of \"Casablanca\" nonetheless rightfully shares pride of place with that all-time great movie. Boyer is powerful in a role in which, through circumstances he could have controlled but didn't, he slides into a mortal abyss. A must-see movie for anyone interested in prewar films that reflect an actually racist view of non-European life at once almost ridiculous but at the same time dramatically engaging. And let's not forget yesterday's lunacies: Cromwell, a director with many films under his belt, was blacklisted through most of the 50s and his career never rebounded from that extra-legal punishment for non-crimes. 8/10",
         "The tragic account of Pepe Le Moko having been filmed in France the year before with Jean Gabin as the star must have really impressed producer Walter Wanger. It's not often that a remake is made only a year later. Jean Gabin who has been compared to Humphrey Bogart certainly would have brought a different style of Pepe Le Moko. But this film did wonders for Charles Boyer in establishing him among the first rank of American film stars. His Pepe is suave, cunning, and deadly. Unfortunately while hanging out in the forbidden section of French Algiers known as the Casbah, Pepe has sort of built his own prison in that section. He cannot leave because the French police will grab him and a whole bunch of countries are getting in line with the French Foreign office to deport to face a slew of crimes. But in the Casbah he's untouchable as the visiting French prefect Paul Harvey finds out. Joseph Calleia as Inspector Slimane knows the only way to capture him is to lure him out of his shelter. And the bait for that walks in with a visiting tourist from Paris played by Hedy Lamarr. Hedy Lamarr was under contract to MGM having been brought over by Louis B. Mayer after her scandalous nude scene in the Austrian film Ecstacy. But MGM couldn't find anything for her to do, so she stayed idle drawing her weekly paycheck while a suitable property was found. Boyer met Lamarr at a party according to The Films of Hedy Lamarr Citadel Press Series book and was taken with her. He told Walter Wanger and Wanger worked out a deal with Mayer that they could have Lamarr if Boyer did an MGM film. The one he did was Conquest with Greta Garbo. Seems to have worked out all around. There's a lot of debate as to how good an actress Lamarr was. And in the right circumstances she could give a decent performance. The right circumstances was definitely Algiers where Boyer knew that the woman who could stir him from his safety net had to be one extraordinarily beautiful woman. No one ever questioned that about Lamarr. Algiers launched her career for American audiences with a blowout performance. Charles Boyer was nominated for Best Actor as Pepe, but lost to Spencer Tracy in Boys Town. And Gene Lockhart as the treacherous Regis got a nod for Best Supporting Actor, but he was beaten out by Walter Brennan in Kentucky. What's even more extraordinary is that Director John Cromwell did a magnificent job in capturing the mood and ambiance of Algiers. A few establishing newsreel shots and great sets and you would think this was done on location. There was a third film version of Pepe Le Moko's story with Casbah starring Tony Martin. It was a musical version that fell short of establishing Martin as a big screen draw, but the songs were some of his best selling records. Still though Boyer does a fabulous job as Pepe, though I would some day like to see Jean Gabin's version for comparison.",
         "Imitation is the best form of flattery. For audiences that haven't seen the far superior, \"Pepe le Moko\", directed by Julien Duvivier, this version, will have to suffice. \"Algiers\" follows its French model in ways that it's just not a remake, it's a copy of the other film. Fortunately for John Cromwell, a fine director, he got a tremendously appealing performance by Charles Boyer, a suave actor who embodied the famous jewel thief of that notorious district of Algiers. This film was also made better thanks to the magic camera work by James Wong Howe, one of the best men in the business, as proved by his long and distinguished career behind the scenes. Henri LaBarthe's novel was adapted for this American version by John Howard Lawson, with James Cain's helping with additional dialog. \"Algiers\" is not without its own merits. Thanks to the talented cast that came together for the making of this film, it has gained the status of a classic. Charles Boyer was perfect as Pepe, a man whose life centers around the mysterious citadel where all kinds of unsavory characters live. Hedy Lamarr, one of the most beautiful faces in the movies, makes a good appearance as Gaby, the woman who steals Pepe's heart. Gaby and Pepe have a common ground as they reminisce of Paris, a city both love. The other triumph of \"Algiers\" was the way the supporting players made this story much better, as it seems impossible to visualize other people cast for the key minor parts. Sigrid Gurie, is a mysterious Ines, the woman in love with Pepe. In her love, she doesn't stop to take into consideration what her actions will do to her lover. Gene Lockhart, a magnificent character actor, is phenomenal in his take of Regis, the schemer of the Casbah. Joseph Calleia, is perfectly sly as Inspector Slimane, a man with the patience of a saint, who must humor Pepe and his gang and who is powerless inside the Casbah. Stanley Fields makes a loyal Carlos, Pepe's trusted companion. Johnny Downs is seen as Pierrot and Leonid Kinskey, another character actor who worked extensively in that period of the American cinema, is excellent as L'arbi. For those who haven't seen the original Duvivier film, try getting the wonderful DVD to see the great Jean Gabin in one of his best roles. The copy shown by TCM recently, seemed somewhat faded. We don't know if it has been remastered yet, but obviously, James Wong Howe's work ought to be seen in all its magnificence.",
         "Algiers is stunning film on many different levels that carries an unusual originality for the time period. The romantic chemistry between Hedy Lamarr(Gaby) Charles Boyer(Pepe)is perhaps one of the movie's most fascinating and unusual aspects. But what really makes things shine is the brilliant black and white cinematography of James Wong Howe. There are also many different one liners and camera shots in this film that have become famous over the years and it's fun just looking for things that you've heard or seen before. I'm not sure how much Warner Brother's cartoons based their stinky skunk (Pepe le Pew) on Charles Boyer's character Pepe le Moko but there has be some correlation. Anyway, Algiers is a grand piece of entertainment well worth the watching.",
         "I've seen this film countless times on tv, usually in the 1 a.m. time slot. Am always fascinated by it somehow. There's such an authentic atmosphere of the locale, very suspicious characters, intrigue and suspense both indoors and on the streets. The suave Charles Boyer (as Pepe, the thief) certainly grips one's attention while he becomes more mired in the plot as it unfolds. Hedy Lamarr lights up the screen with her glowing beauty, one forgets she's supposed to be acting, but is that important? Of course not. I can't imagine the story having her engaged to marry an elderly wide-girthed fellow; my goodness, for her anything's better than that! There's a youngish Leonid Kinskey also appearing as a supporting actor, along with reliable Alan Hale (formerly Robin Hood's buddy, more or less) and Gene Lockhart, whom I've never seen in such a serious role as this one. It's a movie that stands the test of time.",
         "I've heard of this movie, and when I finally had a chance to view it, I was hooked. I actually thought I was in Algiers and the casbah. When I first saw Hedy Lamarr make her entrance, I was hooked again. What a vision of beauty. I could see now when fans talk about legendary beauties of Hollywood, she is most mentioned. Charles Boyer was great as Pepe La Moko, and so was Gene Lochart as the informer. To me, the ending was most tragic, and I will never forget the fading ship sailing away and Hedy's vision, never to see her lover again. No wonder its a classic. They don't make movies like these anymore, the pity of it all.",
         "I saw Algiers just a few days after its French original, Pepe le Moko, which doesn't do Algiers a lot of favors. So, before writing this review, I read the 20+ ones already posted here, mostly from viewers who had not seen Pepe le Moko first, to see how they reacted to Algiers without knowing the French original. Most of them liked it a lot. While I wouldn't go that far - despite a few of the comments, I found this movie not even close to Casablanca - I did find it enjoyable for certain things, if not for others. While I like Charles Boyer in certain movies (Gaslight, primarily), in this film he is radically inferior to his French predecessor, Jean Gabin. Gabin is very believable as a thief and member of the underworld; it is hard to imagine Boyer surviving there 10 minutes. Gabin could be rough and charming; Boyer is \"suave\", but there is no dark underside to it. Hedy Lamarr is indeed beautiful, and sometimes gets to do some acting here. She never overacts (as Boyer and some of the others do), so she is always fun to watch. The best acting, however, is in the character roles, some of which are in no way inferior to the original. Gene Lockart's death screen is well acted and magnificently staged; it is one of the best moments in the movie. Joseph Calleia is very good as the police agent throughout. Still, the best thing in this movie, for me, was the lighting and camera work. Often atmospheric, some of the shots are very strikingly composed. The next time I watch this movie, it would be tempting to do so with the sound off for most of it - though not when Vincent Scotto's music is playing. It is haunting and very evocative; another of the best features of the film. My only complaint about this movie is the end, which some previous reviewers liked. (Here comes the spoiler.) In the original, Jean Gabin commits suicide when he realizes he can't have Gaby; it is a chilling scene very well done. In the American remake Boyer gets shot while running to the ship; it makes him much more of a victim without control of his destiny, and in that sense was a real aggravation after having seen how it \"could have been done.\" Other changes in the movie are interesting examples of cultural differences: in the French original, Gaby is the well-paid mistress of the wealthy overweight Frenchman; there is no question of marriage between them. In the American remake, they are engaged, and while there is no suggestion either loves the other, the relationship would have been seen as less immoral. In the same sense, the low-life is the French Casbah is much more clearly low: prostitution, etc. That is all glossed over in the American remake. So, a movie worth watching, especially for the lighting, the camera work, and some of the direction, as well as the acting of some of the subordinates. Watch this movie first, and then Pepe le Moko, and you will enjoy it more.",
         "It was made just one year after Duvivier's classic ,which even Godard (Godard!)mentioned in his \"Pierrot LE Fou\".Although I hate God'Art about as much as I love Duvivier,I must admit that a film that can transcend the New Wavelet's contempt possesses something magic a la \"Casablanca\" . I was skeptical about the lead:aristocratic Charles Boyer replacing plebeian Gabin?I was wrong :Boyer,who began his career in France after all ,was up to scratch.And I 'd go as far as to write that Hedy Lamarr is much more attractive than Mireille Balin in the original. All that remains is faithful like a dog: except for the scene when an old singer (Frehel) bursting into tears when she hears one of her old recordings,all the important sequences were kept.Cromwell's directing is efficient ,although it never recaptures the intensity (and the director's pessimism) of its model ,is a good film one can recommend to people who cannot get \"Pepe Le Moko\" . Objections: the scene of Pierrot 's letter and the punishment of the informer is much too long and lacks suspense.Biggest gaffe is this ditty (\"C'est La Vie\" ) which Boyer sings and which seems out of a musical :in what is primarily a film noir,it's thoroughly incongruous. Many of the great lines of the French classic can be heard ,notably the famous \"I'm an informer,I'm not a hypocrite\",and the Boyer/Lamarr pairing displays a special chemistry .The black and white makes a good use of shadows and lights. If all the remakes were made with care like this one.....",
         "I have never heard of this film before, but have heard the famous line from it, \"Let me take you to the Casbah.\" When I saw this at a video store I bought it (it was $2.00!!). Pepe Le Moto, I mean come on. This has got to be a really over the top one. With nothing to do, I watched it that night. WOW!! What a film. I will go on to say that it is almost as good as Casablanca! Though it is not about the war, being made in 1938. The acting, sets, lighting, and most important, the script. I didn't experence one dull moment. In the beginning you got to learn about the characters and then it moved like crazy. The acting was superb and I can not believe that it did not win any oscars, though it did receive 4 nominations (including best actor-Boyer and best supporting actor-Lockart). With only one other comment here, I guess no one else has seen this classic either. You simply must watch this when you get the chance!",
         "*********************MILD SPOILERS************************************* I like this movie. Algiers has an exotic and mysterious air about it. There is also a message about yearning for love and how it makes us crazy. This movie portrays glimmers of hope and then there is desperation and sadness and loss. Pepe Le Moko and the beautiful tourist (Hedy Lamarr) struggle with the choices they've made in life and wonder if they could find happiness together. Dare they risk it? You can sense them wrestling with their thoughts and emotions. Shall they simply exist or attempt to find happiness together? What about the other people in their lives they will affect? Charles Boyer is terrific as Pepe Le Moko, a criminal hiding in the Casbah, where he and others live in their own strange world. He isn't portrayed as perfect, and he has a cruel side to his nature. Sigrid Gurie and Hedy Lamarr are stunning in their roles. These beautiful women are captivating, and Hedy Lamarr says more with her eyes than words could ever express. The lead characters aren't alone in revealing fascinating glimpses of human nature. Joesph Calleia shows ever increasing cunning and snakelike patience as he waits for the right time and opportunity to capture Pepe Le Moko. Gene Lockhart is a tour de force as a treacherous scoundrel who wants to turn Pepe Le Moko in for a reward. Johnny Downs is instantly lovable as the protege that Pepe cares for like a kid brother. The fascinating characters in the Casbah are too numerous too mention. And despite all of the tragedy, this movie is somehow bittersweet. Another strong suit of this movie is the music. It's wonderful. I could listen to the score by itself, but why do that when it enhances the movie so beautifully? What a treat to discover this old movie from 1938. My rating is 92/100. Worth buying. Unfortunately, the DVD copy I have has obviously had some of the edges of the film cropped off to make it fit the TV screen. It was well worth buying despite this, just to be able to watch this fantastic movie."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": ["Walter Wanger Productions"],
      "summaries": [
         "Pepe Le Moko, a thief who escaped from France with a fortune in jewels, has for two years lived in, and virtually ruled, the mazelike, impenetrable Casbah, \"native quarter\" of Algiers. A French official insists that he be captured, but sly Inspector Slimane knows he need only bide his time. The suave Pepe increasingly regards his stronghold as also his prison, especially when he meets beautiful Parisian visitor Gaby, who reminds him of the boulevards to which he dare not return...and arouses the mad jealousy of Ines, his Algerian mistress.",
         "Beautiful Gaby meets a romantic jewel thief in the mysterious Casbah."
      ],
      "budget": 0
   },
   "movielensId": 974,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1938-06-28",
      "dvdReleaseDate": "2002-08-27",
      "directors": ["John Cromwell"],
      "runtime": 96,
      "movieId": 974,
      "title": "Algiers",
      "mpaa": "",
      "actors": [
         "Charles Boyer",
         "Sigrid Gurie",
         "Hedy Lamarr",
         "Joseph Calleia",
         "Alan Hale",
         "Gene Lockhart",
         "Walter Kingsford",
         "Paul Harvey",
         "Stanley Fields",
         "Johnny Downs",
         "Charles D. Brown",
         "Robert Greig",
         "Leonid Kinskey",
         "Joan Woodbury",
         "Nina Koshetz"
      ],
      "imdbMovieId": "0029855",
      "originalTitle": "Algiers",
      "genres": [
         "Drama",
         "Action",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["vGFFItr9_8I"],
      "plotSummary": "Pepe Le Moko is a notorious thief, who escaped from France. Since his escape, Moko became a resident and leader of the immense Casbah of Algiers. French officials arrive insisting on Pepe's capture are met with unfazed local detectives, led by Inspector Slimane, who are biding their time. Meanwhile, Pepe meets the beautiful Gaby , which arouses the jealousy of Ines",
      "tmdbMovieId": 22657,
      "avgRating": 3.38095,
      "releaseYear": "1938",
      "numRatings": 147,
      "posterPath": "/rpVytlkawQtsWb9F9KeegTraOew.jpg"
   }
}