{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0060082",
      "video": false,
      "title": "Thirst for Love",
      "recommendations": [
         95508,
         21967
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Etsuko",
               "gender": 0,
               "credit_id": "52fe49879251416c750cae7d",
               "name": "Ruriko Asaoka",
               "profile_path": "/m2heCroVj9lWmiFaD9nZkEJgKUD.jpg",
               "id": 107963,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Father-in-Law",
               "gender": 2,
               "credit_id": "52fe49879251416c750cae81",
               "name": "Nobuo Nakamura",
               "profile_path": null,
               "id": 30772,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Saburo",
               "gender": 0,
               "credit_id": "52fe49879251416c750cae85",
               "name": "Tetsuo Ishidate",
               "profile_path": null,
               "id": 1063884,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Kensuke",
               "gender": 0,
               "credit_id": "52fe49879251416c750cae89",
               "name": "Akira Yamanouchi",
               "profile_path": null,
               "id": 1063885,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49879251416c750cae79",
            "name": "Koreyoshi Kurahara",
            "profile_path": "/bD785g5h2JdtFvE3IRQ4u2FtnTy.jpg",
            "id": 82949,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.23036,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 95503,
      "vote_count": 3,
      "budget": 0,
      "overview": "Koreyoshi Kurahara adapted a novel by Yukio Mishima for Thirst for Love (Ai no kawaki), a tense psychological drama about a young woman who is widowed after marrying into a wealthy family, and becomes sexually involved with her father-in-law, while harboring a destructive obsession with the family gardener. Kurahara’s atmospheric style is a perfect match for Mishima’s brooding sensuality.",
      "similar": [],
      "original_title": "愛の渇き",
      "runtime": 105,
      "poster_path": "/xPiTgg1WpmbukibT139fvMOSyki.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "1967-02-18",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Toshiya Fujita",
         "Koreyoshi Kurahara"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0060082/",
      "coverLink": null,
      "actors": ["Stars: Nobuo Nakamura, Ruriko Asaoka, Akira Yamanouchi | See full cast and crew »"],
      "reviews": ["THIRST FOR LOVE (1967, the release year given on Criterion's DVD case) is based on a 1950 novel by Yukio Mishima and deals with the kind of obsessive relationship that Mishima seemed to specialize in. Here it's about a widow who lives with her late husband's family on a farming estate outside Osaka and winds up sleeping with her aged father-in-law while at the same time nursing an infatuation for a strapping young man who works the small farm acreage. The widow's feelings become an open secret among the family members who live there although Saburo, the naïve young servant, remains oblivious to it all. When Miyo, an awkward country girl employed as a maid, learns she's pregnant by Saburo, the family patriarch insists that Saburo marry her or leave the household. This complicates things for Etsuko, the widow at the center of it all, who wants Saburo to stay but not with the maid, so she takes matters into her own hands, with tragic results. I found this movie in the Criterion Collection's Eclipse set, \"The Warped World of Koreyoshi Kurahara.\" After seeing it the first time, I got hold of the novel and read it and then re-watched the movie. There are some changes in emphasis, a lot of streamlining in the cast of characters, and a few little plot turns added to the movie, but they may simply be a function of updating the novel from its period setting in the immediate postwar era to the film's contemporary 1960s setting. For instance, the screenplay has the characters speak much more boldly than they do in the novel, saying the things they only thought, as when Kensuke, the idler son unable to impregnate his wife Chieko, when pressed by his father to maybe get a job and fend for himself, declares at the dinner table that \"Chieko and I enjoy this dull, aimless lifestyle,\" a line more at home in 1967 than 1950. The two of them also speak way more frankly to Etsuko than they do in the novel about her infatuation with Saburo and her relationship with the family patriarch. In the novel, the characters' prewar histories and backgrounds inform much of their makeup and give the sense of old ways of life irrevocably changed by the tide of history but still nostalgically recalled, although Mishima was careful not to sympathize with either tradition or modernity, but to simply record the antics of one family caught up in the postwar changes. In the movie this is less of an issue, given its modern setting, and the detailed character backgrounds are dispensed with in order to focus on emotions of the moment. The film reflects its updated period in subtle but clever ways, as when Etsuko's niece and nephew, children of another sibling, run off to watch \"Popeye\" cartoons on TV, singing the \"Popeye the Sailor Man\" theme song. There is one sequence detailing a shopping trip to Osaka, but everything else is set in the village where they live and mostly in the house and on the grounds of the estate, giving a sense of insularity to the proceedings. Even when the family attends a frenetic nighttime festival in the village the sequence is executed entirely through closeups of the principals against backdrops of closely-packed extras, with no sense of where the event is actually happening. This is done possibly to avoid the expense of building a set, but also to emphasize Etsuko's intense focus on Saburo, who is dancing half-naked among bonfires with the other young men of the village in an annual ritual. Overall, I thought it was an excellent adaptation. Ruriko Asaoka does a superb job of interpreting the character of Etsuko on screen less through dialogue or narration than through frequent closeups and the way she walks and moves. Just as in the novel, the events are seen largely through her eyes. There's an impressionistic style of shooting and editing obviously influenced by the French New Wave, with frequent cutaways, occasional hand-held shots that follow characters at length, and extreme closeups of random elements in a scene. And it's all so beautifully captured in black-and-white by the cinematographer Yoshio Miyajima, who also photographed films by Masaki Kobayashi, including HARAKIRI, KWAIDAN, and the epic trilogy, THE HUMAN CONDITION. The DVD case labels the film as being in black-and-white and color, although there are only three quick shots bathed in red rather than any actual color footage. The five films in this box set followed a viewing of an earlier Kurahara film, I AM WAITING (1957), found in the Nikkatsu Noir box set, also from Criterion. Having now seen six of his films, I can only conclude that Kurahara remains the most underrated of Japanese directors from the postwar era. I hope we get the opportunity to see more of his films in the U.S. in the coming years. I find it odd that I never encountered any of these films at the Japanese film festivals I used to attend regularly in New York in the 1970s and '80s."],
      "genres": ["Drama"],
      "productionCompanies": ["Nikkatsu"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 97464,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1967-02-18",
      "dvdReleaseDate": "2011-08-23",
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 105,
      "movieId": 97464,
      "title": "Thirst for Love",
      "mpaa": null,
      "actors": [
         "Ruriko Asaoka",
         "Nobuo Nakamura",
         "Tetsuo Ishidate",
         "Akira Yamanouchi"
      ],
      "imdbMovieId": "0060082",
      "originalTitle": "愛の渇き",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Koreyoshi Kurahara adapted a novel by Yukio Mishima for Thirst for Love (Ai no kawaki), a tense psychological drama about a young woman who is widowed after marrying into a wealthy family, and becomes sexually involved with her father-in-law, while harboring a destructive obsession with the family gardener. Kurahara’s atmospheric style is a perfect match for Mishima’s brooding sensuality.",
      "tmdbMovieId": 95503,
      "avgRating": 3.33333,
      "releaseYear": "1967",
      "numRatings": 3,
      "posterPath": "/xPiTgg1WpmbukibT139fvMOSyki.jpg"
   }
}