{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "private investigator",
         "id": 11168
      }],
      "imdb_id": "tt0081417",
      "video": false,
      "title": "The Return of Frank Cannon",
      "recommendations": [],
      "backdrop_path": "/rwVZGoqzwNIMb2pwaxqxMGA3EAa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frank Cannon",
               "gender": 2,
               "credit_id": "52fe4cd5c3a368484e1c8daf",
               "name": "William Conrad",
               "profile_path": "/7tMF2QMwu5nFja1BZcGEDmYze5X.jpg",
               "id": 16412,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sally Bingham",
               "gender": 1,
               "credit_id": "52fe4cd5c3a368484e1c8dbb",
               "name": "Diana Muldaur",
               "profile_path": "/caR3zW1zNQneROSXFlaqlQ71m1Y.jpg",
               "id": 16014,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mike Danvers",
               "gender": 2,
               "credit_id": "58c35eaa92514123ac0033d1",
               "name": "Ed Nelson",
               "profile_path": "/RxxXeybdcHGQ6iZRrsXeqVapr7.jpg",
               "id": 89040,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Alana Richardson",
               "gender": 1,
               "credit_id": "58c35ec1c3a36866540036ed",
               "name": "Joanna Pettet",
               "profile_path": "/neGg2GVtF3fhat7OM2aE3PTMH0E.jpg",
               "id": 51315,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dr. Curtis McDaniel",
               "gender": 2,
               "credit_id": "58c35eedc3a3686682003038",
               "name": "Arthur Hill",
               "profile_path": "/hY0HsScC0LyWkJgkWr0NK5kVMDz.jpg",
               "id": 65505,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "William Barrett",
               "gender": 2,
               "credit_id": "58c35f08c3a368668d0034b2",
               "name": "William Smithers",
               "profile_path": "/mqPJLVmW2GDmLhoX3YqCtLiBct2.jpg",
               "id": 16030,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "58c35f2b92514123ac003445",
               "name": "Corey Allen",
               "profile_path": "/p4S4rJSCXjtiXdpauvQckVqfVj8.jpg",
               "id": 2775,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58c35f4ac3a368668d0034e7",
               "name": "Ronald Austin",
               "profile_path": null,
               "id": 152669,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58c35f58c3a368668d0034fb",
               "name": "James D. Buchanan",
               "profile_path": null,
               "id": 1230781,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.714196,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 202973,
      "vote_count": 2,
      "budget": 0,
      "overview": "Private detective Frank Cannon comes out of retirement to investigate the murder of an ex-girlfriend's husband.",
      "similar": [
         89463,
         92931,
         1813,
         22803,
         50348,
         345915,
         290250,
         171274,
         169917,
         513285,
         8224,
         1645,
         389,
         489,
         2978,
         37257,
         623,
         11092,
         910,
         11975
      ],
      "original_title": "The Return of Frank Cannon",
      "runtime": 96,
      "poster_path": "/eeuZnBpN1qFtaAXGdCXk8SNyJWP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "CBS Entertainment Productions",
         "id": 3902,
         "origin_country": ""
      }],
      "release_date": "1980-11-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Corey Allen"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Ronald Austin",
         "James D. Buchanan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081417/",
      "coverLink": null,
      "actors": ["Stars: William Conrad, Allison Argo, Burr DeBenning | See full cast and crew »"],
      "reviews": [
         "As a kid, I always loved Cannon- its interesting plots and sanitized violence epitomized the many great detective series of the 70's. Also present were countless great character actors- many who had been or would become major stars- whose presence added immeasurably to the shows. Despite strong ratings, Cannon went off the air after five seasons when William Conrad became tired of his one man tour-de-force. \"The Return of Frank Cannon\" is an excellent TV movie which returned Conrad to the small screen four years after Cannon ended its run. In the movie, Cannon is lured out of retirement to help an old girlfriend whose husband has been murdered. This TV movie works well because of its loyalty to the series in both style and overall look; it is simply a longer \"Cannon\" episode with the plot and characters more fully developed. Guests Arthur Hill, Diana Muldaur, William Smithers and a few others make us feel as if it's old home week watching our favorite shows of the recent past. The Return of Frank Cannon brings back good memories and is worth your while.",
         "***SPOILERS*** Stocky balding five foot seven inch and 250 pound bulldog like private eye Frank Cannon, William Conrad, is brought out of retirement to solve a murder case that's been dismissed as a suicide by the local police. It's when Tom Bingham is found shot to death that Cannon is contacted by his wife Sally, Diana Muladur, and her 21 year old daughter Jessica, Allison Argo, to find out the true reasons behind his death. As it turns out Cannon once had a hot and steamy relationship with Sally some 30 years ago when he was some 50 to 75 pounds lighter that ended with Tom, Cannon's best friend, marrying her. Now determined to get to the bottom of how Tom, who was a former CIA man, was killed Cannon uses his skills as a private investigator as well as his connections with the CIA and local law enforcement agencies to solve the baffling case. The closer that Cannon gets to the truth the more danger he gets into. It's in Cannon finding out that Tom had uncovered a plot to get this mysterious Howard Hughes like multi billionaire sneaked into the country after he has his death faked. This guy is really bad news in that he's been involved in a number of governments overthrows in South and Central America when tens of thousands of innocent people were killed! It doesn't take Cannon long to connect the dots to both Tom's murder and who was behind it. That's in him tracking down former CIA Agent Charles Kirkland, Burr DeBenning, who worked for Tom when he ran the CIA's Caribbean covert operations department. All this lead straight back to Tom's horse farm as well as thoroughbred horse breeding industry where those who are planning to sneak this billionaire gun runner back into the country are working out of! ***SPOILERS*** Fine acting by the late William Conrad who besides his usual fisticuff action scenes with the bad guys, when in most cases he end up getting the worst of it, also shows his sweet kind and tender side as well. Especially with his old flame Sally Bingham who in a number of scenes earlier in the film they both talk about old times when the two were lovers. It's then Where the usual tough as nails Cannon opens his heart up to her and spills his guts out in how much in love he was and still is with Sally. Watching the unexpected and very out of character for Frank Cannon scenes grabbed me so much by the heart-strings that I had to reach for the nearest handkerchief.",
         "I never watched \"Cannon\" as a series back in the 1970s. I always thought that the cop/P.I. shows so prevalent then were pretty much all the same, and only the detective(s) were different. In the case of \"Cannon\", we had a grizzled and portly private investigator, as compared to the myriad other detective characters of that era. \"The Return of Frank Cannon\" brings William Conrad back to the \"Cannon\" character four years after the series ended. The plot is awfully familiar: Cannon is brought out of retirement (cliché 1), by an old flame (cliché 2), to investigate a murder disguised as a suicide (cliché 3) the investigation of which the cops bungled (cliché 4). Cannon's investigation leads him to a remote ranch where illegal activities are taking place (cliché 5) by otherwise respectable people (cliché 6). He is tied up to a chair (cliché 7) and plays mind games with his captors (cliché 8) before a spectacular crash kills the main bad guy (cliché 9). I could go on, but it's not really necessary. The Southern California scenery is pretty and this TV-movie has a top cast, including Ed Nelson, Arthur Hill, Diana Muldaur and others. It also has a spectacular (if somewhat far-fetched) airplane-truck crash at the end. Otherwise, it's about the same as any 1970s P.I. show. If you liked \"Cannon\", I suppose you'll like this movie. If you're looking for something a little different, you may want to look elsewhere."
      ],
      "genres": [
         "Action",
         "Thriller",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "CBS Entertainment Production",
         "Quinn Martin Productions (QM)"
      ],
      "summaries": ["Private detective Frank Cannon comes out of retirement to investigate the murder of an ex-girlfriend's husband."],
      "budget": 0
   },
   "movielensId": 97494,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-11-01",
      "dvdReleaseDate": null,
      "directors": ["Corey Allen"],
      "runtime": 96,
      "movieId": 97494,
      "title": "The Return of Frank Cannon",
      "mpaa": "NR",
      "actors": [
         "William Conrad",
         "Diana Muldaur",
         "Ed Nelson",
         "Joanna Pettet",
         "Arthur Hill",
         "William Smithers"
      ],
      "imdbMovieId": "0081417",
      "originalTitle": "The Return of Frank Cannon",
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Private detective Frank Cannon comes out of retirement to investigate the murder of an ex-girlfriend's husband.",
      "tmdbMovieId": 202973,
      "avgRating": 1.5,
      "releaseYear": "1980",
      "numRatings": 3,
      "posterPath": "/eeuZnBpN1qFtaAXGdCXk8SNyJWP.jpg"
   }
}