{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "striptease",
            "id": 4378
         },
         {
            "name": "street walker",
            "id": 177591
         }
      ],
      "imdb_id": "tt0057238",
      "video": false,
      "title": "The Warped Ones",
      "recommendations": [
         179555,
         95503,
         64728,
         117569,
         21967
      ],
      "backdrop_path": "/4gu9GzOxU9jCdmDeyD2wwa2Suj6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Akira",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf51",
               "name": "Tamio Kawaji",
               "profile_path": "/zynbTFyXxF2BJdJshdNzoj0FgL3.jpg",
               "id": 21499,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Fumiko",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf55",
               "name": "Noriko Matsumoto",
               "profile_path": null,
               "id": 1063883,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Yuki",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf59",
               "name": "Yuko Chishiro",
               "profile_path": null,
               "id": 1051832,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Shinji Kumaki",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf5d",
               "name": "Kôjirô Kusanagi",
               "profile_path": "/wVAjgreb6GWGwsi4g3kkzGEhbCY.jpg",
               "id": 233693,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kashiwagi",
               "gender": 2,
               "credit_id": "52fe49879251416c750caf65",
               "name": "Hiroyuki Nagato",
               "profile_path": "/zb27Ofz3sOEmDVT1xxFKO2G5tGP.jpg",
               "id": 135131,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Masaru",
               "gender": 2,
               "credit_id": "52fe49879251416c750caf69",
               "name": "Eiji Gô",
               "profile_path": "/8yko8Ov8ePqbScIq2KxopfNPA5f.jpg",
               "id": 86247,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Yuki's mother",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf6d",
               "name": "Chigusa Takayama",
               "profile_path": null,
               "id": 1119099,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Neighbor",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf71",
               "name": "Reiko Arai",
               "profile_path": null,
               "id": 1093068,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Gill",
               "gender": 0,
               "credit_id": "54873ff392514128e50000de",
               "name": "Chico Roland",
               "profile_path": null,
               "id": 1051831,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Woman in atelier",
               "gender": 0,
               "credit_id": "52fe49879251416c750caf75",
               "name": "Yôko Kosono",
               "profile_path": "/iZIBgDXakkDgkdwgd3ikxoRcPDL.jpg",
               "id": 1092507,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49879251416c750caf4d",
               "name": "Koreyoshi Kurahara",
               "profile_path": "/bD785g5h2JdtFvE3IRQ4u2FtnTy.jpg",
               "id": 82949,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49879251416c750caf7b",
               "name": "Nobuo Yamada",
               "profile_path": null,
               "id": 563704,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49879251416c750caf8d",
               "name": "Akira Suzuki",
               "profile_path": null,
               "id": 70632,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "571725fdc3a3687b8c0002f9",
               "name": "Yoshio Mamiya",
               "profile_path": null,
               "id": 1198194,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57172605c3a3687b8c0002fd",
               "name": "Toshirō Mayuzumi",
               "profile_path": null,
               "id": 25800,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.430249,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 95508,
      "vote_count": 5,
      "budget": 0,
      "overview": "A juvenile delinquent gets out of the pen and immediately embarks on a rampage of untethered anger, most of it directed at the girlfriend of the journalist who helped send him up.",
      "similar": [
         9879,
         10802,
         9517,
         10148,
         7511,
         402,
         3041,
         70709,
         13009,
         9427,
         158576,
         56263,
         295232,
         38376,
         5857,
         13702,
         10809,
         295517,
         340663,
         6480
      ],
      "original_title": "狂熱の季節",
      "runtime": 75,
      "poster_path": "/neWw9vIS5gkCyr5IQpMgGEQnA3Z.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
         "name": "Nikkatsu",
         "id": 955,
         "origin_country": "JP"
      }],
      "release_date": "1960-09-03",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["Nobuo Yamada"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0057238/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4NTY1OTI3NF5BMl5BanBnXkFtZTcwNDM1OTc1MQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Tamio Kawachi, Eiji Gô, Noriko Matsumoto | See full cast and crew »"],
      "reviews": [
         "Tamio Kawaji (the star of Seijun Suzuki's Story of a Prostitute and co-star of Youth of the Beast and Tokyo Drifter) stars as Akira, a jazz-fueled sociopath who sticks up his nose at society while committing all sorts of crimes with his best friend Eiji Go and prostitute Noriko Matsumoto. To get back at the man who put him in jail, Akira kidnaps his girlfriend (Yuko Chishiro), rapes her and gets her pregnant. Much of the largely plot less film is made up of Akira's shambling around Tokyo, followed by hand-held cameras and scored with American jazz music. Akira is one of the nastiest characters I've met in Japanese cinema, which is saying a lot, but the filmmaking is truly exciting and the black and white visuals are outstanding.",
         "Tamio Kawaji gives a an incredible, repugnant, unbelievable performance as a mentally and emotionally disturbed criminal in a film that is STILL ahead of its time 51 years later. He's a hyperkinetic, twitching deviate, a human Road Runner causing trouble wherever he's dashing around, usually shirtless and sweating; eating and drinking in fast motion; stealing; moving like a speed freak; sexually assaulting, attacking. Eio Go is his more standardized criminal buddy who thinks his ticket to life's best is to join a Yakuza gang. The two live with a beautiful young prostitute and wreak havoc everywhere they go, destroying the lives of a middle-class couple engaged to be married. The radical, frantic cinematography is brilliant and the jazz score is integral to the story. I've never seen a film like this before or since. The running time is short which is just as well because it's an exhausting experience. Now just released by Criterion in a beautiful print in Japanese with English sub-titles; Something Weird Video originally released it. Radley Metzger brought the part street-punk, part sexploitation film to the States for a theatrical release as The Weird Lovemakers.",
         "Great looking, but ultimately rambling story of two thugs and a prostitute who get out of prison an continue their wanton ways, while taking revenge on, and repeatedly crossing paths with, the people who put them there. Playing like a Japanese Breathless or Rebel Without a Cause, this is wonderful looking movie. The film was clearly shot on real locations so it has a sense of place that few films I've seen can match. Luscious black and white photography is arresting to see. I'm guessing the cities and country sides never looked this good. The cast is very good and keep you watching even when the plot seems to be going nowhere for a good chunk of the first half. Thats the rub, the plot. This hip and happening tale of young Japan rambles around for a good chunk of it going nowhere. Its not that its bad, its just it took a long time to get where it was going, or at least feel like it was heading somewhere. The point of the film is to contrast the three antiheroes with the pair who sent them away, and who are seen, in the end to be just as awful as those they despise. Once that happens the first time we're only left with a repetition of the point the two or three more times it happens. Sprinkled with profanity, rape, robbery and abortion this would have gotten banned in many communities had it showed up in the US at the time of release in Japan. Even today its more than likely liable to get a rise out of most audience. Its a walk on a dark side that rattles you with its matter of factness. Is it worth seeing? On most levels yes. Its a wonderful antidote for what was being done elsewhere in the world at the same time (its also more real than many similar Hollywood films). The music is great and the hip, often nihilistic attitude almost saves it all. On the other hand odds are that this is probably not going to be a film you watch a second time, there's nothing wrong with it, its just not as meaty as it thinks it is or we hoped it would be. Ultimately its a movie I admire more than I like.",
         "First things first, this movie has the worst tagline I've ever seen. \"They do Every-thing!\" Well, I know that the film was marketed in the US as a sexploitation feature, but come on. This tagline is even lazier than the iconic one for Bebe's Kids; \"It's animation.\" Koreyoshi Kurahara's The Warped Ones, aka Season of Heat, aka Wild Love- Makers, aka The Weird Lovemakers, is one of the quintessential Sun Tribe films. This was a short sub-genre of Japanese dramas based on the lives of the contemporary youth, whose interests included beach life, jazz music and progressive attitude towards sex. Perhaps the most famous of these is Ko Nakahira's Crazed Fruit, but Kurahara's movie is closer to Yoshishige Yoshida's Good-for-Nothing, because of the way jazz music carries the plot. For the movie, Kurahara reused some plot elements from his earlier Sun Tribe film The Time of Youth. The Warped Ones was such a success that Kurahara later made a follow-up, The Black Sun, with the cast of this film returning to reprise their roles. This movie is the proof that the Japanese New Wave splashed harder than any other film movement back in the day. It's the most fast-paced, relentlessly energetic '60s movie I know of, where destructive mayhem and raging hormones of the protagonists are perfectly synched with the soundtrack and many dynamic camera moves. Remember, this was the same year when Hitchcock's Psycho shocked viewers for showing a toilet flush. In contrast, the protagonist of The Warped Ones is even more of a casual rapist than Alex from A Clockwork Orange which was released 11 years later! Another testament to the revolutionary spirit of the Japanese New Wave. However, unlike Alex from ACO, Akira from TWO is more of a jazz fanatic than a Beethoven aficionado; Akira is a wild beast of a character whose carefree, reckless gestures reflect the spontaneity of jazz. His rapid movements are often accompanied by various exaggerated grunts, screams and sound effects (and greeting women with: \"Wanna f*ck?\"). After all, actor Tamio Kawachi was instructed to act like a hungry lion roaring at the sun. The result is one of the wildest performances in '60s cinema. The movie is obviously a social piece set to criticize juvenile delinquency. However, it actually provides some understanding of the background for the characters and basically criticizes the very environment the criminals grow up in. Even though Akira is the supposed antihero, Kurahara also portrays the middle-class couple that set him in as negative characters, and there's an interesting moral dilemma at the very end that reflects this. Kurahara's film is also a portrait of its time, where the attitude towards the foreigners still wasn't the best and parts of the country were in relative chaos. This being a Sun Tribe film, the visuals are very bright and intruding. At the start the camera points directly towards the sun at its apex, to correspond to the scene of Akira raping a girl at the peak of his reckless behavior. Another scene I like is when Akira, the same girl and her boyfriend are eating a meal together, and the silent, uneasy atmosphere is boosted by the spinning ceiling fans casting brief shadows in passing over the characters. Overall, the lighting and the camera-work here is just amazing. Every frame is incredibly well-lit with an incredible feel for texture, location and mood. The Warped Ones is a fantastic film that sadly gets few mentions. It's a fascinating window into 1960s Japan and it has an unforgettable main character. Add some excellent music, volatile camera-work and explosive pacing, and what you get is the best Sun Tribe film I've seen so far.",
         "It would be easy to identify the warped characters in \"The Warped Ones\" as the film's three main characters, Akira, Masaru, and Masaru's prostitute girlfriend Fumiko. But it isn't so clear as the film progresses. Definitely Akira, who seems to act entirely on impulse, and rapes the fiancé of an up and coming journalist, after kidnapping her and taking her to a secluded beach, is unhinged, but the film has an interesting revenge from the offended couple, who are supposed to represent respectability. In any event, pregnancies play a significant role in a film that seems more plot less than it actually turns out to be. Akira's friend Masaru joins an organized criminal gang which contrasts with Akira's entirely independent criminal behavior. Their use of Fumiko as a lure for rich clients illustrates the sexual power at work as Japan's society evolves in the early 1960s. The film is distinguished by amazing camera work and an ongoing Beatnik subculture throughout.",
         "This film should be well-known, but isn't. It is in many ways the typical sixties Japanese pop-film, combining the best of nouvelle vague (hand held camera, cool-jazz score, moody, young characters) and the Japanese exploitation cinema (lots of violence, sex and rape). It is unknown, probably because of it's raw content. The main line - girl falls in love with the small time criminal who raped her - isn't to the taste of the western public, but is actually handled in a subtle matter. I've seen this one on Something weird video.",
         "If someone tells you that the youth of yesterday, were so much better behaved, have them see this film from Japan in 1960. The film has been compared to Breathless by Godard. The one difference though I would say is in its protagonist. In Breathless, Jean Paul Belmondo's character was kind of cool, and I could see perhaps young people wanting to be like him. The protagonist if any think does not have these qualities. He comes across as crazy, almost psychotic, and a real loser. In many ways his character is more real than Belmondo's. I am not sure, but I think the film might be taking place in Tokyo, but the Japanese city we are presented with is nothing like the Paris of Breathless. It is ugly, you can almost feel the heat, and you wonder how it must even smell. Like this directors later film, 'Black Sun' He also seems to be criticizing the use of music in the way it might block people from reality. Their is a scene in a bar, where jazz music our protagonist enjoys listening to, when the lead female protagonist, who had been raped by him, stops the music from playing, and he almost goes crazy It results him driving to the ocean with his black friend, (Chico Rolands from Black Sun), and go swimming. It is also a criticism of modern art, and those who supposedly practice it, or admire it. Though at the same time, I wonder the way the director films this movie, especially the stolen auto sequence at the beginning, if this film might be artsy at times in itself, and not know it. At the same time, hovering over this film, are Westerners, the men who take the women from the Japanese to have for exchange for money. This film I guess is before the big economic boom in Japan, and shows the contempt that Japanese perhaps felt towards the West, especially the US. Their is a line that our protagonist says regarding Jazz, 'the blacks invented it, the whites stole it, and now we have it. We are worse than them. Chico Roland as Gill is perhaps the one foreigner this film respects. Being black, it is ironic as Japan has been accused of being racist towards blacks, which was somewhat demonstrated in Black Sun. I would like to learn more about Chico Rolands, who he is, and how he began working in Japan. It is regrettable that Criterion on their Eclipse series, didn't supply audio commentaries which might shed some light. Even here on IMDb, their is no info where and when he was born or if he died. I do wish his character was somewhat expanded in the film, and we would know who this character is. The ending is interesting. I am for a woman's right to choose, but the films ending is the only one I think of that can come close to making an anti-abortion statement, as our protagonist looks up at the sky ceiling of the hospital, as if looking up to god."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Nikkatsu"],
      "summaries": [
         "A juvenile delinquent gets out of the pen and immediately embarks on a rampage of untethered anger, most of it directed at the girlfriend of the journalist who helped send him up. The Warped Ones sounded a lost generation's cry for help and was one of the films that kicked off Japan's cinematic sixties with a bang.",
         "Driven by the pounding beat of jazz music, Akira and Yuki are partners in carrying out their primarily petty crimes, which focus largely on bilking unsuspecting western male tourists through some sort of theft, with Yuki acting as the bait, the party girl hooker. Beyond the other crimes he commits, Akira also steals cars to sell to chop shops. They are eventually caught in the act of a crime, as the police are tipped off to their activities by a beat reporter, Kashiwagi. As soon as they are both out of prison, Akira and Yuki continue their crime spree with a third, Masaru, who Akira met in prison and who has as a self-absorbed mentality as his two new cohorts. Masuru and Yuki embark on sexual relationship, which leads to them mapping out their future. In addition, the three seize upon an opportunity for revenge when they spot Kashiwagi and his girlfriend, Fumiko, an art student. The encounter the three criminals have with Kashiwagi and Fumiko results not only in Kashiwagi and Fumiko's relationship being fundamentally changed, but also Fumiko's need to get involved most specifically with Akira. But Fumiko finds that once in her life, Akira is hard to get out, unless some drastic measures are taken.",
         "A juvenile delinquent gets out of the pen and causes reckless mayhem, mostly directed at the girlfriend of the journalist who helped send him up."
      ],
      "budget": 0
   },
   "movielensId": 97600,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1960-09-03",
      "dvdReleaseDate": "2011-08-23",
      "directors": ["Koreyoshi Kurahara"],
      "runtime": 75,
      "movieId": 97600,
      "title": "The Warped Ones",
      "mpaa": null,
      "actors": [
         "Tamio Kawaji",
         "Noriko Matsumoto",
         "Yuko Chishiro",
         "Kôjirô Kusanagi",
         "Hiroyuki Nagato",
         "Eiji Gô",
         "Chigusa Takayama",
         "Reiko Arai",
         "Chico Roland",
         "Yôko Kosono"
      ],
      "imdbMovieId": "0057238",
      "originalTitle": "狂熱の季節",
      "genres": [
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": ["ZryIPRbJ1Lo"],
      "plotSummary": "A juvenile delinquent gets out of the pen and immediately embarks on a rampage of untethered anger, most of it directed at the girlfriend of the journalist who helped send him up.",
      "tmdbMovieId": 95508,
      "avgRating": 3.375,
      "releaseYear": "1960",
      "numRatings": 4,
      "posterPath": "/neWw9vIS5gkCyr5IQpMgGEQnA3Z.jpg"
   }
}