{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "cat fight",
            "id": 156854
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0043744",
      "video": false,
      "title": "Lightning Strikes Twice",
      "recommendations": [
         67451,
         250278,
         98060,
         128722,
         114006,
         33802,
         57412,
         156627
      ],
      "backdrop_path": "/uwlEKc31P2nunALdqdms4A8C5U1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Richard Trevelyan",
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8229",
               "name": "Richard Todd",
               "profile_path": "/asmQq1hLKEHiBQdQvvO4jXzfrNg.jpg",
               "id": 20393,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Shelley Carnes",
               "gender": 1,
               "credit_id": "52fe486fc3a368484e0f822d",
               "name": "Ruth Roman",
               "profile_path": "/lwfbybPwYRR3wy0jdnhS5jH5c4V.jpg",
               "id": 12498,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Liza McStringer",
               "gender": 1,
               "credit_id": "52fe486fc3a368484e0f8231",
               "name": "Mercedes McCambridge",
               "profile_path": "/hfpsmWUzDHeblAJ0vKv0ftXg0jB.jpg",
               "id": 18737,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Harvey Fortescue Turner",
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8235",
               "name": "Zachary Scott",
               "profile_path": "/q9Lm9im3Z2gaHZ1hmDmI3TIEN3u.jpg",
               "id": 31551,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "String",
               "gender": 0,
               "credit_id": "52fe486fc3a368484e0f8239",
               "name": "Darryl Hickman",
               "profile_path": "/bRMxUW00nvYWJZf2X0k09i2tjyz.jpg",
               "id": 81481,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "J.D. Nolan",
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f823d",
               "name": "Frank Conroy",
               "profile_path": "/qaRzzjKlMHBOUB5QGp6Tib0Y7Ad.jpg",
               "id": 14658,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Myra Nolan",
               "gender": 1,
               "credit_id": "52fe486fc3a368484e0f8241",
               "name": "Kathryn Givney",
               "profile_path": "/s8X5LodIvEHQMBpQzPVt5q8MCYi.jpg",
               "id": 163340,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Father Paul",
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8245",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8201",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe486fc3a368484e0f8207",
               "name": "Lenore J. Coffee",
               "profile_path": "/4izZTE5jXntDj7BX3HFVpNr1sRu.jpg",
               "id": 84237,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe486fc3a368484e0f820d",
               "name": "Margaret Echard",
               "profile_path": null,
               "id": 566113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8213",
               "name": "Henry Blanke",
               "profile_path": null,
               "id": 14446,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f8219",
               "name": "Max Steiner",
               "profile_path": null,
               "id": 3249,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe486fc3a368484e0f821f",
               "name": "Sidney Hickox",
               "profile_path": null,
               "id": 13972,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe486fc3a368484e0f8225",
               "name": "Thomas Reilly",
               "profile_path": null,
               "id": 68090,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a17adfc3a3683413006b18",
               "name": "William Wallace",
               "profile_path": null,
               "id": 1137341,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.657502,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 72479,
      "vote_count": 5,
      "budget": 0,
      "overview": "Richard Trevelyan (Richard Todd) was convicted of murdering his wife, given an 11th-hour Death Row reprieve and freed under unusual circumstances after retrial. But his past does not matter to Shelley Carnes (Ruth Roman), an actress visiting the Texas ranchland that Richard calls home. She’s fallen in love with him. But after she becomes the second Mrs. Trevelyan, Shelley is beset by doubts and fear. The director and screenwriter of Bette Davis’s Beyond the Forest – King Vidor (The Fountainhead) and Lenore Coffee (The End of the Affair) – reteam in a richly atmospheric mix of mystery, romance and murder sparked by a luminous cast that also includes Mercedes McCambridge and Zachary Scott.",
      "similar": [
         996,
         513285,
         14638,
         247,
         1092,
         426,
         256591,
         599,
         402,
         289,
         1939,
         9348,
         845,
         678,
         223,
         910,
         25736,
         3112,
         963,
         20367
      ],
      "original_title": "Lightning Strikes Twice",
      "runtime": 91,
      "poster_path": "/jkWeieUjmGPrkAdzDGRnEbeJe65.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1951-04-12",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Would you have the nerve to do what she did on her wedding day?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["King Vidor"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Lenore J. Coffee",
         "Margaret Echard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzMjM2NzIzNV5BMl5BanBnXkFtZTcwOTQzMDAyMw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Todd, Ruth Roman, Mercedes McCambridge | See full cast and crew »"],
      "reviews": [
         "Richard Todd sits on death row, waiting execution for his wife's murder. At the eleventh hour, a reprieve and new trial come through; he's acquitted, thanks to one holdout juror (Mercedes McCambridge). Released, he disappears into the west Texas desert. Enter Ruth Roman, a touring actress in search of the desert's restorative climate. An innkeeper and his wife become solicitous of her when she stops in a small town, and lend her a car to get to the dude ranch where she hopes to recuperate. En route (in a scene prescient of Janet Leigh's flight from Phoenix in Psycho), she gets lost in thunderstorms and takes refuge in an abandoned house -- where Todd is holed up. They size one another up and, next morning, she continues on to the dude ranch. Run by McCambridge and her emotionally disturbed young brother (Darryl Hickman), it has closed down, but they agree to put Roman up for a few days. But she seeks out Todd again, despite conflicting stories about his guilt or innocence. Director King Vidor and scriptwriter Lenore Coffee, having goaded Bette Davis to pull out all the stops in Beyond The Forest two years earlier, here take on another overloaded melodrama, with mixed results. We see too little of key events and rely instead on hearsay about other characters, who sometimes haven't yet been sufficiently established (and the one brief flashback is a mistake -- we need either more or none). And of eight major characters, two or even three (including Zachary Scott) prove superfluous. But the movie's biggest stumble lies in the casting of Richard Todd. Remembered if at all as the title character in that echt-1950s biopic of pious patriotism A Man Called Peter, here his stiff British accent and acting falsify the whole Southwestern milieu (Lightning Strikes Twice, like Desert Fury of five years earlier, evokes the new Sunbelt of money and leisure). Happily, the female characters fall on the plus side. Kathryn Givney shows spunk and intelligence as the strangely solicitous Mrs. Nolan. Ruth Roman, on evidence of this movie and Tomorrow Is Another Day, had more range and subtlety than she was let display in her best known role as Farley Granger's mannikin-like fiancee in Strangers on a Train. But the acting honors, inevitably, fall to McCambridge. Looking especially tomboyish, her face registers every thought and feeling that passes through her head; she's hyper-alert in her moods and responses. And so, as was her custom during her disappointingly thin screen career, she delivers the most memorable performance of the film.",
         "\"Lightning Strikes Twice\" is a pretty diverting minor noir with good performances from Ruth Roman (billed as the film's star) and Mercedes McCambridge (over the top, but that's how we like her, no?). Good support from Darryl Hickman, Kathryn Givney and Richard Todd. There are several very noir-looking scenes, but I find the protag's predic only mildly satisfying as a NOIR SITUATION. The film is situated in the desert areas of some western state, so it often pre-echoes giant bug movies from later in the decade (\"Them\" , \"Tarantula\"). Major complaint: Where the heck is Zachary Scott for the first HOUR of this picture? When the Z finally shows up, he plays yet another effete playboy and is quickly dismissed by the plot. This is a waste of the Z-ster's talents. He might have been better as the male lead, in place of the handsome but bland Todd. Max Steiner's score contributes much Sturm und Drang. Worth a look",
         "All the correct elements for a romantic murder mystery suspense. A dark mysterious man who looks tortured by his problems and associations, a lively woman who is willing to try and believe a man who might be a murderer until the temptation of her imagination overcomes her, an unknown factor of the other woman who is extremely jealous and doesn't want anyone else to have the man she has always wanted, a emotionally disturbed brother who is a reactionary to events in life, and finally a secret that you are not sure you believe any more than the heroine. All set to a b/w backdrop that crawls up your skin while you are waiting for the inevitable moment when the man you have half fell in love with yourself shows his true colors. WOW! Perfect for dark, stormy nights curled up in front of the television with a cup of hot cocoa in one hand and a shotgun beside the other. Hee! But seriously, one of the most perfect mysteries I remember.",
         "Definitely worth a look. Immediately following his \"Beyond the Forest\" and \"The Fountainhead\" (also Warners), this Vidor film is somewhat less feverish and over-the-top than those two, and accordingly does not pack the same punch, but still has a nice erotic frisson. It's a whodunit with romance--including a rainstorm when the two leads meet in an isolated house. Ruth Roman is lovingly photographed and underscored by luscious Steiner music in this threatened-bride tale. Mercedes McCambridge does some of the same kind of scenery chewing that Davis did in \"Forest,\" while Zachary Scott reprises his charming scoundrel from many Warner's films.",
         "Another crazed logic-free over-acted melodrama in the same late Forties/early Fifties hothouse mode of Warners' Beyond The Forest, The Damned Don't Cry and This Woman Is Dangerous, this time sans the stellar fuel tank of Bette Davis or Joan Crawford. Judge this rating accordingly-- if you enjoyed aforementioned pictures, you'll get a kick out this; if not, take shelter. . .stormy weather indeed. No need to rehash plot revealed by earlier posters, a Texas-set dramatic chile con carne liberally laced with murder, unrequited love and dark secrets set in one of those those only-in-the-movies remote desert communities where people live miles apart in remote rancheros. . .but still show up in gowns and white dinner jackets at swank poolside barbecues that would put Manhattanites to shame. Although the smoldering-yet-vanilla Richard Todd, underused Ruth Roman and Zachery Scott(in a \"hey-it's-a-paycheck\" role that comes out of nowhere and getsthere fast) are ostensible stars, show is stolen by cactus-chomping Mercedes McCambridge in (apparently unintentional) schizophrenic role as a butch desert denizen (think of her role in Johnny Guitar, only less feminine) who not only has inexplicable crush on charmless Todd after he has allegedly killed his wife. . .but is nevertheless selected to serve on jury during his murder trial to boot! Things go off-cliff (as does at least one vehicle) from there. Whatever film lacks in reality, it more than makes up for in implausibility and psychological chaos that would baffle Freud. But rest assured, everyone gets their just deserts(sic). If you're in right frame of mind, a yucca minute.",
         "Fun overheated histrionics in the desert with two of the more under-appreciated actresses of the 50's. Ruth Roman is a big city actress looking for a bit of rest in the wilderness and finding little. Right from the get go things in this docile community seem a bit off even though the residents appear friendly. Next thing you know she's neck deep in contretemps with suspected murderers and intrigue! It's all pitched to the higher notes of melodrama but kept grounded by the competence of the cast and no nonsense direction. The movie is a routine Warners programmer but given some snap by the quality performances of Ruth Roman, subtle and dignified, and Mercedes McCambridge, controlled for most of the film but she gets her chance to do some florid emoting later in the picture. Professionally done this is enjoyable in an over the top way especially for fans of either actress.",
         "After getting an Oscar nomination for The Hasty Heart, British actor Richard Todd did a few more American films before returning to the United Kingdom. Some like A Man Called Peter were top rate and some like Lightning Strikes Twice fall right apart at the beginning. There is no way that Mercedes McCambridge would ever have gotten on a jury where Todd was the defendant. In this case he was being tried for murder. She was the holdout on the jury that swung the case to acquittal by reasonable doubt. As someone who knew the defendant that is impossible. McCambridge is the reason to see this film, her intense style of acting carries it over a lot of rough patches, but not enough. Ruth Roman on vacation for her health gets involved in the local controversies where Todd's arrest and trials for murdering his tramp of a wife are the number one subject of local gossip. Roman stays at a dude ranch run by Mercedes and her brother Darryl Hickman. And she falls for Todd, but soon the doubts appear. Zachary Scott is on hand as well in a surprisingly small role as a rather sleazy playboy. Scott is always good, we should have seen more of him. Lightning Strikes Twice has not worn well over the years.",
         "This is a bit of a rum do and no mistake. For a start we have the solid mahogany Richard Todd leaving a trail of sawdust in his wake whilst Zachary Scott who can and does act Todd off the screen doesn't even appear until about reel #6 and is woefully under extended. Ruth Roman might have done really well as the femme lead - if she wasn't in the same movie as Mercedes McCambridge - things are tough all over, it would seem. Plot-wise it's as hokey as they come; we open with Todd on Death Row on account of a little matter of murdering his wife then, with no groundwork/back-story to help us he is awarded first a stay of execution and then a re-trial which leaves him a free man. Enter Ruth Roman, actress on vacation/convalescence who falls instantly into fascination with Todd. This leads nicely to the 'doubting' scene, did he REALLY do it, will he do the same to Me, until all is resolved neatly with the real killer not only being unmasked but also paying the ultimate price. This is noir-lite with two excellent performances from Scott and McCambridge, a solid one from Roman and Todd having a laugh.",
         "Terrible movie. McCambridge was all but chewing on the curtains. She over acted just like she did in \"Giant\". Richard Todd looked good as usual but deserved a better script. Why was he up on a dangerous ledge supposedly hiding from the public after he had been found not guilty? Was he planning to camp up there? He had no tent, equipment or food for his horse. He did throw down a hot cigarette butt in the dry sage though. Luckily no fire was written into the script on that. Guess he wasn't a Boy Scout. Ruth Roman was pretty good but must have needed the paycheck badly. She drives off in an approaching thunder storm in a convertible with the top down. Not too bright, huh? Vidor made sure she showed us her boobs though. She goes to find Richard Todd and does a very poor job of acting like she is afraid of heights up on the cliff. All of a sudden she is in love with him. Give me a break! Zac Scott also over acts and is wearing. How come he is riding the same horse that Ruth was on at the dude ranch. Is it the county horse? He takes Ruth for a car ride acting very menacing, so of course we suspect he may be a killer. Not! He takes Ruth to see Todd and drives off. Later Todd takes Ruth home in the same car. Sadly Ruth marries Todd after knowing him for only a few days. I expect they divorced soon after.",
         "A low-budget murder mystery and undemanding time-killer � which is a real shame. Despite the occasional use of actual locations, obvious studio inserts and phony backdrops give the cost-saving game away. With just a little bit more money in the till, these hazards could easily have been avoided. Admittedly, on it's own penny-pinching level, the movie is interesting enough, even if somewhat slowly paced and somewhat short on action. Nevertheless, it's acted agreeably enough to sustain interest, directed with sufficient tautness, and atmospherically photographed. The characters are both realistically written and tautly played by a well-night perfect cast: Richard Todd, in his first American film, plays with customary charm and stolidity � although not always photographed from the most flattering angles, particularly in his reverse shots. Ruth Roman is delightfully sultry even in what � despite the movie's poster art � is decidedly a goody-two-shoes role. Mercedes McCambridge is her usual neurotic character. Zachary Scott makes a late entrance � 60 minutes late to be precise � but proves a diverting red herring at a point in the narrative where interesting was just beginning to flag. Frank Conroy heads up a very able support cast. King Vidor has directed with his usual dramatic tautness and economy. With just a little bit more money up front, this could have been a high-class mystery yarn, even though the identity of the killer is obvious."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "An actress Shelley Carnes (Ruth Roman), is looking forward to an exciting vacation at a dude ranch, but she gets more than she bargained for,including a perhaps murderous new husband. Only by shear luck has Richard Trevelyan (Richard Todd), her new husband, escaped execution for murdering his first wife Loraine. In a second trial, a single juror held out causing him to be released. A local priest, Father Paul (Rhys Williams), and other eyewitnesses paint a deadly picture to the future bride but the actual murder was not witnessed and somehow, unbelievably, love wins out. Because of local expectation, Shelley ends up at a competing dude ranch run by J.D. (Frank Conroy) and Myra Nolan (Kathryn Givney). The picture of Richard over their fireplace suggests a close relationship. They loan Shelley their car and direct her to go to Trevelyan's ranch. In route she meets Trevelyan on horseback, a handsome, but damaged, and mysterious young man. Upon arrival at the ranch she finds out the dude ranch is closed. She learns this from two rather worrisome characters, the local caretakers, Liza McStringer (Mercedes McCambridge) a rather seedy country girl, who runs it with her younger brother nicknamed String (Darryl Hickman). Shelley pretends to be a friend of the late wife and stays the night perhaps in an attempt to gather more information about the mysterious ranch owner,in what is probably not a safe move. The following day she seeks out Richard and finds him moody, sitting at the edge of a great cliff. He saves her from falling. One thing leads to another as a friend of the Nolans, Harvey Turner (Zachary Scott) pretends first to kidnap Shelley for romantic reasons, and then he turns out to be a friend of Richard's, taking her to Richard at his guest house. After a quick marriage, their marriage night turns wicked as the new, but moody, husband claims to have attacked a large spider in their wedding bed, but he has a murderous look in his eye. She runs back to the closed dude ranch there to be confronted by jealous and spiteful Liza who turns out to be the real murderer. Shelley is able to fight off Lisa just as Richard arrives to save her. Has he suspected or known all along? But as Lisa and her brother attempt to escape in a high speed chase with police, things end abruptly in a fatal crash. The rest is mystery, as they say.",
         "Sent to a dude ranch in the west to recover her health, a New York actress falls in love with a ranch owner recently acquitted of the murder of his wife."
      ],
      "budget": 0
   },
   "movielensId": 97667,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-04-12",
      "dvdReleaseDate": "2009-09-02",
      "directors": ["King Vidor"],
      "runtime": 91,
      "movieId": 97667,
      "title": "Lightning Strikes Twice",
      "mpaa": "",
      "actors": [
         "Richard Todd",
         "Ruth Roman",
         "Mercedes McCambridge",
         "Zachary Scott",
         "Darryl Hickman",
         "Frank Conroy",
         "Kathryn Givney",
         "Rhys Williams"
      ],
      "imdbMovieId": "0043744",
      "originalTitle": "Lightning Strikes Twice",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Richard Trevelyan (Richard Todd) was convicted of murdering his wife, given an 11th-hour Death Row reprieve and freed under unusual circumstances after retrial. But his past does not matter to Shelley Carnes (Ruth Roman), an actress visiting the Texas ranchland that Richard calls home. She’s fallen in love with him. But after she becomes the second Mrs. Trevelyan, Shelley is beset by doubts and fear. The director and screenwriter of Bette Davis’s Beyond the Forest – King Vidor (The Fountainhead) and Lenore Coffee (The End of the Affair) – reteam in a richly atmospheric mix of mystery, romance and murder sparked by a luminous cast that also includes Mercedes McCambridge and Zachary Scott.",
      "tmdbMovieId": 72479,
      "avgRating": 2.625,
      "releaseYear": "1951",
      "numRatings": 4,
      "posterPath": "/jkWeieUjmGPrkAdzDGRnEbeJe65.jpg"
   }
}