{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0996957",
      "video": false,
      "title": "Lana Turner... a Daughter's Memoir",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "576ef08ec3a3687459001f74",
         "content": "A greatly enjoyable document for fans of classic cinema like I am, although I only know of Turner through three films I have seen her in (Peyton Place, Imitation of Life and The Postman Always Rings Twice--the blu of which had this as an extra). It's given extra credibility as it has huge input from the only child Turner had, the same daughter who knifed and killed an abusive lover Turner was trying to dump, and who thus caused the huge Hollywood scandal that devastated Turner's career for the rest of her life.",
         "url": "https://www.themoviedb.org/review/576ef08ec3a3687459001f74"
      }],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "53f80906c3a36873550007e3",
            "name": "Carole Langer",
            "profile_path": null,
            "id": 1093247,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.039158,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 288295,
      "vote_count": 1,
      "budget": 0,
      "overview": "A rare behind the scenes look at the tragedies and bitter disappointments that plagued one of MGM's most popular leading ladies",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Lana Turner... a Daughter's Memoir",
      "runtime": 86,
      "poster_path": null,
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2001-01-01",
      "vote_average": 9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Carole Langer"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Luke Sacher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0996957/",
      "coverLink": null,
      "actors": ["Stars: Robert Wagner, Del Armstrong, Lillian Burns | See full cast and crew »"],
      "reviews": [
         "Cheryl Crane talks about her mother, Lana Turner, in this 2001 documentary, \"Lana Turner...A Daughter's Memoir.\" Turner's private life often overshadowed her film work, some of which was excellent. Beautiful as well as sexy, the actress started out at MGM as a teenager. Her career lasted 54 years. Narrated by Robert Wagner, the prime interviewee is Crane, who looks lovely and comes off as very intelligent as she comments on her mother's life, which is punctuated by photos and film clips. She also speaks frankly about the great scandal - her stabbing of Lana's gangster lover, Johnny Stompanato. There are interviews as well with Turner's long-time makeup man, her good friend Evie Johnson, and others. One of the film clips is of Tyrone Power, the great love of Turner's life, playing with Cheryl as Lana sits beside him. \"He was the one she didn't get to keep,\" Cheryl says. Turner is portrayed as a party-loving, man-loving woman who was somewhat of a negligent mother, leaving Cheryl with her nanny for huge periods of time. It was only later in their lives that the two developed a strong relationship. Negligent didn't mean uncaring, however - when she learned that her current husband, Lex Barker, was abusing Cheryl, she threw him out of the house. What emerges is a portrait of a woman who loved stardom, loved being beautiful, and loved being attractive to men. When looked at closely, her life was both traumatic and somewhat empty. Lucky for Turner, she had a daughter who cared about her - which is something some other female stars didn't have.",
         "Lana Turner: A Daughter's Memoir (2001) **** (out of 4) This incredibly open documentary features Lana Turner's daughter, Cheryl Crane, talking about her mother and their various personal issues. The documentary runs less than 90-minutes but it packs enough for two movies but at the same time there's no denying that it's all rather depressing and extremely sad. We start off learning about Turner's early days and how she eventually got her big break in Hollywood. This came in a very small scene in THEY WON'T FORGET, which is a pretty telling title. In the film Turner is scene walking without a bra and in a tight sweeter and this got her the nickname of the \"Sweeter Girl\" and once you see the scene you'll know why men fell in love and the actress was left embarrassed. From here we see her rise to fame and her many problems, which started before she was even an adult. We hear about her three failed marriages by the time she was thirty, the countless lovers, an illegal abortion, the abandoning of her daughter plus various other issues that would come up with countless men. What was so amazing to me about this movie is how open and honest it was about the subject. There's nothing here that's kept a secret and you could say that the movie highlights Turner's faults more than her actual movies. There's no question that we get to hear about her movies but this here isn't the majority of the running time. The two most infamous things are the stories dealing with Lex Barker raping Turner's daughter and the \"Good Friday\" where Turner was being abused by Johnny Stompanato and he would be killed by the daughter. Who will ever know what really happened but hearing the story from the actual person involved was rather sad. Even sadder is how much Turner's behavior probably damaged the daughter and I must say that I've never seen a sadder documentary from the fine folks at Turner Classic Movies. This is a marvelous film but I think many fans of Turner might not want to see it. Robert Wagner narrates and we get interviews from Crane, Irving Fine (publisist), Lillian Burns (MGM drama coach), Robert Stack, Evie Wynn Johnson, Jackie Cooper, Del Armstrong (Make-up artist), Glenn Rose, Juanita Moore and Kirk Douglas.",
         "No, I am not referring to Lana Turner's figure. I am stating that it is impossible for anybody who has any genuine interest and knowledge in the topics of Lana Turner, MGM, Warner Brothers (where Lana's career began), Juanita Moore, legendary director Douglas Sirk, or the Golden Age of film-making in general not to catch on quickly that no such genuine interest or knowledge is apparent on the part of those responsible for Lana Turner... A Daughter's Memoir. I am unfortunately reminded of those tributes to Luise Rainer. All videographers know about this remarkable actress now is that she's REALLY old and won two Oscars back-to-back. They wheel her in, interrupt her when she wants to speak, applaud, then push her out. These entrepreneurs get money and self-promotion without really caring. And it is the same case here. All they know is the same old sweater girl turned hormone-driven good-time gal and gangster's girlfriend who, by the way, posed-acted sometimes. There is absolutely no compelling evidence that the narrator knows even the basic stats of Turner's life and career, or had even viewed Imitation of Life, for example, even once. Yes, Robert Wagner had been a B+ list film actor, then later a TV star. But that does not ensure he knows any more on the topics than the producer, writer or director of this drivel. It is both displeasing and dismaying that so many others, serious film students, film historians, legitimate biographers... those with a sincere interest in Turner, SHOULD have had access to all the interviewees and artifacts of Turner's life, and done a conscientious job. The only reason I give it 4 instead of 1 is that some work was done as far as tracking down some of Lana's former friends and colleagues, which counts for something. But in the end it is like the very amusing episode of Seinfeld in which George, to pad his intellectual resume, claims to have read War and Peace. Of course, he is always on the verge of getting busted, which is hilarious. Lana Turner... A Daughter's Memoir is not so funny. Many documentaries and factoid-type books have been put out on the topic of this very interesting, underrated actress, who just happened to be beautiful. Not one, including this one, does her justice."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Soapbox Productions",
         "Soapbox Productions"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 97874,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-01-01",
      "dvdReleaseDate": "2002-02-05",
      "directors": ["Carole Langer"],
      "runtime": 86,
      "movieId": 97874,
      "title": "Lana Turner... a Daughter's Memoir",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0996957",
      "originalTitle": "Lana Turner... a Daughter's Memoir",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A rare behind the scenes look at the tragedies and bitter disappointments that plagued one of MGM's most popular leading ladies",
      "tmdbMovieId": 288295,
      "avgRating": 3,
      "releaseYear": "2001",
      "numRatings": 1,
      "posterPath": null
   }
}