{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0499487",
      "video": false,
      "title": "Goal! III : Taking On The World",
      "recommendations": [
         9815,
         9763
      ],
      "backdrop_path": "/oc1L7IlvWuWJs5mXaT5HoXbzbsY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Santiago Munez",
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3ef3",
               "name": "Kuno Becker",
               "profile_path": "/a8TnTdQtVvSKIkTrVikM1Uxf4Lx.jpg",
               "id": 58982,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charlie Braithwaite",
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3ef7",
               "name": "Leo Gregory",
               "profile_path": "/77LXk6gzXbEUJ180WDFnoJLOjR2.jpg",
               "id": 76968,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Liam Adams",
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3f13",
               "name": "J. J. Feild",
               "profile_path": "/zxibNg37bvNHqpttpP2q9OSQpms.jpg",
               "id": 30710,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Roz Harmison",
               "gender": 1,
               "credit_id": "58d804ce9251411f9005bc73",
               "name": "Anna Friel",
               "profile_path": "/ccSUerm8OyftugbfsVdrrKKbBrv.jpg",
               "id": 58016,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3efd",
               "name": "Andrew Morahan",
               "profile_path": null,
               "id": 53599,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3f03",
               "name": "Mike Jefferies",
               "profile_path": null,
               "id": 58987,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47bd9251416c750a3f09",
               "name": "Piers Ashworth",
               "profile_path": null,
               "id": 24206,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47bd9251416c750a3f0f",
               "name": "George Tiffin",
               "profile_path": null,
               "id": 209139,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47bd9251416c750a3f19",
               "name": "Mark Thomas",
               "profile_path": "/1QI1g9bPABLyFg6RtxaY0YGf988.jpg",
               "id": 62086,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe47bd9251416c750a3f1f",
               "name": "Giles Bury",
               "profile_path": null,
               "id": 222985,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.503494,
      "production_countries": [],
      "id": 19139,
      "vote_count": 49,
      "budget": 0,
      "overview": "In the third installment of the football drama trilogy Goal!, Kuno Becker returns as Mexican footballer Santiago Muñez, who, along with his best friends and England national team players Charlie Braithwaite (Leo Gregory) and Liam Adams (JJ Feild), are selected for their respective national teams at the 2006 FIFA World Cup Finals in Germany.",
      "similar": [],
      "original_title": "Goal! III : Taking On The World",
      "runtime": 91,
      "poster_path": "/ak5yYUtaZ7yoe2SesHXi7sjBp5V.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2009-01-01",
      "vote_average": 4,
      "belongs_to_collection": {
         "backdrop_path": "/mKTYkGMseCEFXuZ4CjuZ00xXRCd.jpg",
         "name": "Goal! Collection",
         "id": 110177,
         "poster_path": "/jaUSrep1RTzr73QPN3DNkW4LiRn.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Morahan"],
      "runtime": 96,
      "synopsis": "From the producers of GOAL and GOAL 2 comes the latest installment in the fast-paced, action packed trilogy. With the actual World Cup as its dramatic backdrop, this is the story of two players, Liam Adams (J.J Fields) and his best friend and Real Madrid teammate Charlie Braithwaite (Leo Gregory). Their journey playing for home country England takes them to the center of the greatest stage on Earth and is filled with humor, romance, tragedy and redemption. Liam's world is turned upside down by a chance reunion just as he's set to enjoy the pinnacle of his professional career. This is also a 'coming of age' story for young Liam who finally faces up to his responsibilities on and off the field of play. [D-Man2010] Mexican football star Santiago Munez (Kuno Becker) is pitted against his Real Madrid team-mates and England players Charlie Braithwaite (Leo Gregory) and Liam Adams (JJ Feild) in a quest to lift footballs ultimate prize: the FIFA World Cup. Santi is motivated to try and win the trophy for his late father and family back in Los Angeles and Madrid, whilst Charlie and Liam just want to try and end the Three Lions 40 years of pain. For all three charismatic footballers, the path to football glory is one fraught with temptations and torments - and all three have to deal with personal issues off the pitch that affects their roles on it. Triumph and tragedy sit side by side in equal measure on this journey as the players compete on the field of dreams to achieve their ultimate dream to score the winning goal in the World Cup final and lift the cup in victory to the delight of a whole nation of fans. [D-Man2010] The third installment of the football drama trilogy. Kuno Becker reprises his role as Mexican footballer Santiago Munez, who finds himself pitted against his best friends, Real Madrid team-mates and England players Charlie Braithwaite (Leo Gregory) and Liam Adams (JJ Feild) in the hope of winning the sport's ultimate prize at the 2006 FIFA World Cup Finals in Germany. Santi is motivated to try and win the trophy for his late father and family back in Los Angeles and Madrid. Meanwhile, Charlie and Liam just want to try and end the Three Lions 40 years of pain. For all three charismatic footballers, the path to potential success is one fraught with temptations and torments - and all three have to deal with personal issues off the pitch that affects their roles on it. Also following the tournament around Germany in their St. Georges Cross festooned camper van are the Geordie Boys, whom we first met back in Goal!. Providing the often hilarious fans perspective of the matches are Gordon (Mike Elliott), Foghorn (Christopher Fairbank), Walter (Jack McBride) and Phil (Craig Heaney). [D-Man2010]",
      "writers": [
         "Mike Jefferies",
         "Piers Ashworth"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0499487/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4ODM1MDU5OV5BMl5BanBnXkFtZTgwNTI2NDE5MzE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: JJ Feild, Leo Gregory, Kuno Becker | See full cast and crew »"],
      "reviews": [
         "First of all, whenever I read reviews and they are either below a 3 or above an 8... I usually ignore them because I figure \"exaggeration.\" Goal 3 unfortunately deserves less than a 1. The production value is nothing like the first two movies. The storyline has nothing to do with the first two movies. Santiago is BARELY in the movie, he plays the third or fourth main character... and the way he's handled... scrappy. I absolutely loved the first two movies, they were well produced (for what they are) had all the elements to be emotional and entertaining (once again, for what they are) so I was expecting a respectful finish to the trilogy with closure to the issues presented in the first two. Instead, I got a movie that had nothing to do with the first two... and was just overall horrible. If you're expecting a sequel to the first two movies, don't watch this... it will leave you angry. Roz is not in it, Gavin Harris is not in it, etc. Finally, I waited three years for this and was barely able to get through it. I'll be shocked if most people don't agree with me on this (who have seen the first two). Anybody that calls this the \"best movie ever\" clearly works for the production house that made this movie.",
         "There is not a doubt in my mind why this came straight to DVD. It was an absolute awful film. With the central character from the first two movies Santiago Munez (Kuno Becker) being given a guest entry. The story line was laughable. I am almost sure that there was no script, they just went along as they shot it. The two main characters were just plain unlikable. The CGI, or the blue screen to fit the actors in the matches was extremely bad and low budget. There was hardly any football in the movie. It was more like the story about the love life of two footballers. There was no build up or character development. The lines and the acting was awful. Santiago Munez, the wonder kid, suddenly becomes an average mid-table club player. Finally, the ending, oh the ending, it was disgusting and worse. If any of you value your time and most importantly money then please do not watch this movie. And this is not a \"Goal\" movie. They just used the franchise name to sell some DVD's.",
         "I went into this film thinking that it would carry on from the first 2 goal films and be about the story of the brilliant mexian footballer santiago munez reaching the ultimate dream of playing in the world cup. Unfortunately he played very little part in this film. Not even kicking a ball in the world cup. This is hard to understand considering the first two movies were about him. Overall I thought the script for this movie was terrible compared to the first two which I enjoyed. There were so many times in which the story here just did not relate to what was seen in the first two movies and you ended up asking yourself \" hold on what about munez wife or , who is he I have never seen him before etc etc\" and you never really get a full explanation to these questions. There are some parts which are completely absurd, for instance, adams gets a taxi to see an ex girlfriend, he goes to pay the taxi driver and the taxi drivers says no it alright mate its for free. Adams says great I'll sort you out for tickets to see england in the world cup after the knockout stage. This sounds a reasonable thing to do. However you see the taxi driver and his friends 1) get into the VIP areas of the world cup games, 2)invited to Braithwaite funeral, 3) invited to adams wedding. I mean come it was a free taxi ride for god sake and suddenly your best man at the wedding. All in all I found the story boring and had no relation to the first two movies. The writers for this movie should be ashamed that they strayed so far away from the munez story of the first two movies. So my advice is if you think goal 3 will be anything like the first two movies then you will be bitterly disappointed as I was. With a script this bad It is no wonder some of the actors who played big parts in Goal 1 and 2 did not sign up for Goal 3. Verdit ----> miss at all costs",
         "I would really like to know why someone thought this film is worth shooting. The only watchable part of the movie are some real footages from 2006 world cup and that's about it. Acting is horrible, script is horrible, the CGI is ridiculous,... I sincerely hope that this director and writers will not get a chance to film another movie. Don't watch this crap, it has nothing to do with a \"Goal\" franchise except for Santiago Munez (Kuno Becker) who appears to have something more like a guest-star role. I reckon he had to be in there due to some legal stuff. Anyone who enjoyed this movie is either related to someone who's in it or is still a teenager. Probably both. Total waste of time. Go for a walk instead.",
         "don't want to bore you and go into loads of detail but this was a poor excuse for a movie. There are definitely some plants on this page trying to boost the scores and writing false reviews - don't be duped. It was pathetic. I am angry at myself for spending the time to check it out as I liked the first two Goal movies. This one didn't make any sense! Santiago is a bit part player - instead we are treated to a stereotype character overload, the alcoholic, the sleazy agent, the scorned footballers WAG. I would not recommend watching this film.",
         "I'm glad I didn't see this at the cinema or I'd have had to ask for my money back!! What happened to the great story line in the first 2 films?? We watched this to find out what happened to Santi and his wife being pregnant but she wasn't even mentioned, the whole story was brushed under the carpet in one line!! And what was with the weird trashy porno film set??? Its like they took a load of random ideas and stuck them together (not very well either!!) Have you seen how bad it looks when they use the real World Cup footage and stick the actors in front? I will say one thing, it did have us laughing.. but not for the right reasons!!",
         "Sorry but this was a major disappointment in terms of the quality of the first two movies. I'M not a fan of soccer and I have to say that the first two movies were great, maybe in the top 5 sport movies ever made. This one, major flop! It doesn't even tie in with the other ones. For a trilogy to end like this with characters we don't care about, with Munêz not even a major character here is just bad. I mean where's Harris? Where's Fry?, the two new characters here Adams and Braithwaite just pop out of nowhere. And the action is bad.. very bad... Not one scene where you could believe they where really out there playing for real. The first two movies, you actually wondered if they filmed the scenes during the freaking games since they seemed so real! I loved it! I was hoping for the same quality here, didn't get it at all. I'm guessing the money ran out or just a very bad Director in Morahan. Also I guess that Butchart was the real writer here because the story in Goal 3 is lame.. very lame. Jefferies either got rid of this one in a few hours or he's just that bad. There's no soccer issue other than the drinking oh wow.. If you loved the first two, then don't watch this one, you'll be greatly disappointed. They took the soul of the 1 and 2 out. Gave Munêz a backseat and got rid of the rest of the cast. Even his line that lets us know about his relationship was what can be called some of the worst writing ever! Bad choice. We wanted an end to the story arc. They gave us a shitty conclusion to what seemed like a great continuity. Too bad. 1 star..",
         "The movie is just bad. It might have to be that I am an American, but thought it was just a showcase how England football failure in the world cup. The green screen when the actors who would play with the national team was super cheesy. This movie doesn't even follow the first two except a few characters. The first two I would give a seven they were more center on the characters and soccer scenes were more entertaining. The movie should have been center on finishing up the loose ends of Santiago, but it wasn't. There is nothing much to say. If your an England football fan I would still stay clear of this movie. This movie actually made me mad when watching it that it didn't follow the previous Goal! films. The first movie was called Goal! The Dream begins, but the dream hasn't even concluded yet.",
         "Terrible film. Had higher expectations from the first two, even though I didn't fancy the second one as much as the first one. It's never been about cinematic perfection when it comes to the Goal-movies, but this picture was truly horrific in all possible ways. They even try to make a lad look like Sven-Göran Eriksson by putting on glasses... Please... And what about the German soft porn shoot in the beginning of the film? Or the boring mates traveling in their trailer across Europe, meeting up with blond Scandinavian girls showing off their tits? I really can't see whats even slightly okay about this picture. Perhaps the Swedish goals against England in World Cup 2006, and perhaps Leo Gregory is a fine actor (loved him in 'Stoned'), but I wouldn't recommend this film to anyone. Anyone at all. If you love the game of football, do yourself the favor by not getting involved with Goal III.",
         "Well if you are expecting a continuation from the 1st & 2nd film think again, The original exploits of Santiago Muniz have nothing to do with this new film. Goal 3 centres around 2 new players with Muniz just floating around in the background my sons and I can some up in one word what we felt after watching the film GUTTED. You have been warned! The film is still worth a watch it has actors from the like of The Football Factory but to name a few so from that point its OK but we really wanted to see how Muniz's life panned out for him but this simply does not happen."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Milkshake Films",
         "Little Magic Films"
      ],
      "summaries": ["The heroes compete on the greatest stage of all, the FIFA World Cup Finals."],
      "budget": 10000000
   },
   "movielensId": 98052,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": "2009-06-15",
      "directors": ["Andrew Morahan"],
      "runtime": 91,
      "movieId": 98052,
      "title": "Goal! III : Taking On The World",
      "mpaa": "",
      "actors": [
         "Kuno Becker",
         "Leo Gregory",
         "J. J. Feild",
         "Anna Friel"
      ],
      "imdbMovieId": "0499487",
      "originalTitle": "Goal! III : Taking On The World",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["kHthPPB7_zA"],
      "plotSummary": "In the third installment of the football drama trilogy Goal!, Kuno Becker returns as Mexican footballer Santiago Muñez, who, along with his best friends and England national team players Charlie Braithwaite (Leo Gregory) and Liam Adams (JJ Feild), are selected for their respective national teams at the 2006 FIFA World Cup Finals in Germany.",
      "tmdbMovieId": 19139,
      "avgRating": 1.92857,
      "releaseYear": "2009",
      "numRatings": 21,
      "posterPath": "/ak5yYUtaZ7yoe2SesHXi7sjBp5V.jpg"
   }
}