{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "car chase",
         "id": 15483
      }],
      "imdb_id": "tt1285240",
      "video": false,
      "title": "In Their Sleep",
      "recommendations": [
         46467,
         77551,
         28602,
         69791,
         45102,
         69015,
         128276,
         243997,
         24246,
         83190,
         74539,
         79544,
         82479,
         82760,
         297472,
         27231,
         92119,
         356690,
         32009,
         64528
      ],
      "backdrop_path": "/R64VprOBPUCdVBitI1aGGVxsfh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4861c3a36847f8164481",
               "name": "Anne Parillaud",
               "profile_path": "/d1mUo65Q1ZQLpK7idJEG95MMzkX.jpg",
               "id": 57298,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Arthur",
               "gender": 2,
               "credit_id": "52fe4861c3a36847f8164485",
               "name": "Arthur Dupont",
               "profile_path": "/9LgEzVqnJwkzBo8ofOAoqq038qV.jpg",
               "id": 73394,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "L'homme au break",
               "gender": 2,
               "credit_id": "52fe4861c3a36847f8164489",
               "name": "Thierry Frémont",
               "profile_path": "/c9makGlIHhO0f37LrUqEaQNnWhm.jpg",
               "id": 96413,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Le mari de Sarah",
               "gender": 2,
               "credit_id": "52fe4861c3a36847f816448d",
               "name": "Jean-Hugues Anglade",
               "profile_path": "/iy8Tfcb3Zq1INu1kGm069wccRev.jpg",
               "id": 7037,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5440ae89c3a36860e1000c9c",
               "name": "Caroline du Potet",
               "profile_path": null,
               "id": 1374745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5440ae9fc3a368055c001849",
               "name": "Éric du Potet",
               "profile_path": null,
               "id": 1374747,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5440aebb0e0a262976000d01",
               "name": "Éric du Potet",
               "profile_path": null,
               "id": 1374747,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5440aecac3a3686172000cb8",
               "name": "Caroline du Potet",
               "profile_path": null,
               "id": 1374745,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5440aeea0e0a262976000d0a",
               "name": "Éric Neveux",
               "profile_path": null,
               "id": 70687,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5440af110e0a26293e000ca3",
               "name": "Yann Malcor",
               "profile_path": null,
               "id": 63128,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "550403a792514174b0000b05",
               "name": "Pierre Cottereau",
               "profile_path": null,
               "id": 54197,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.361865,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 53354,
      "vote_count": 17,
      "budget": 0,
      "overview": "Sarah's life is in pieces after the brutal death of her 18 year-old son. One night, her car accidentally hits Arthur, a young man the same age as her boy who is running from a burglar. Sarah sympathizes with him and takes him in, only to be tracked down by the burglar whose murderous rage towards Arthur forces her to take action.",
      "similar": [
         8961,
         9737,
         1572,
         11859,
         2501,
         2502,
         9679,
         562,
         306,
         9739,
         3132,
         13184,
         9654,
         96,
         1948,
         2503,
         1701,
         5503,
         4141,
         15092
      ],
      "original_title": "Dans ton sommeil",
      "runtime": 79,
      "poster_path": "/1T0DR42ljPCt4ryXxjWiuH0VZw3.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Delante Films",
         "id": 7694,
         "origin_country": ""
      }],
      "release_date": "2010-03-21",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": [
         "Caroline du Potet",
         "Éric du Potet"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Caroline du Potet",
         "Éric du Potet"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1285240/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjkyNzIxODY4NF5BMl5BanBnXkFtZTcwMTg5NTcxNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anne Parillaud, Arthur Dupont, Thierry Frémont | See full cast and crew »"],
      "reviews": [
         "From www.allthingshorroronline.net For the past decade the French have owned the home invasion horror subgenre. The films High Tension, Inside, (to a lesser extent) Martyrs, and ILS have taken the familiar comfort of home's four walls and transformed them into a cavalcade of terror, mayhem and death. The sibling team of Caroline and Eric du Potet (producers of Inside) add to the impressive list with In Their Sleep. A year removed from her son's tragic accident/suicide Sarah (the original La Femme Nikita, Anne Parillaud) remains a depressed shell of her former self. The quaint fixer-upper countryside villa remains in a state of disrepair as her husband abandoned her to deal with his own grief, leaving the crumbling walls and scattered home repair materials a fitting metaphor for Sarah's own life. She works herself to the point of collapse as a nurse just to have a routine to numb the hours of the day. Exhausted to the point of distraction, she is ordered home by the hospital to rest. In her jittery state she doesn't notice Arthur until the moment he leaps in front of her car in an attempt to hail her down. Arthur fears for his life. A man burglarized his home, and Arthur saw his face. Now he fears the man will kill him in order to not get caught. The car barreling down the road, tailing Sarah and Arthur lends credibility to his story, so Sarah takes him to her home once the stranger gives up the chase. His fears prove correct when the stranger breaks in to Sarah's home in the late hours of night and trashes the place in fury while the pair attempt to hide. The du Potet's eschew the constant over the top violence and gore of Inside (a film which, for all its merits felt like a Roadrunner cartoon by its end) for a much quieter film that is punctuated by moments of breath stealing atrocities. Flashbacks and fantasy sequences litter the film, keeping the viewer guessing while peeling back layers of truth. Similar to the first act of Inside the victims have no idea their home has been breached. This tact provides the psychological terrors of the film. The idea that one can be nestled within their confines, completely oblivious to the torment that lays an arm's length away plays itself out with stark results. Items that are supposed to provide a sense of security serve to imprison victims instead: in one of the most harrowing sequences of the film a small girl leaps at a deadbolt, with escape just out of the reach of her clutching fingers. Parillaud's performance is the glue that holds it all together. She's a beaten woman long before she encounters Arthur. While she's a smart and resourceful woman, anything or anyone she wants to live for has long since been removed from her. She's often one step away from putting the puzzle pieces together, yet backs away knowing the truth would prove pointless in the end. At times she seems to put one foot in front of the other only because it's what's expected of her. By the film's closing moments, breathtaking in both its beauty and mundane nature, it's fair to question whether death would provide a welcome relief and reward of a sort for her. For fans of extreme French horror, In Their Sleep may prove to tame for their liking. It lacks the monotonous violence of Martyrs that pound the viewer into submission or the batshit craziness of Sheitan, Inside or Frontiers. However, the ripped from the headlines aspect of the film, strong performances and stunning landscapes of the French countryside make it compelling viewing, easily one of the year's best efforts, for those that crave a realistic horror film.",
         "That's what the movie is called in Germany. A movie title that also has a \"subtitle\" attached to it, that makes it even clearer where the movie is heading. But even without it, I'd be surprised if anyone does not see quite a couple of things coming. This has also been pointed out by other reviews here, but while it can be taken as a negative aspect, it didn't bother me as much. What really shines through are the performances. Even with as little as they get, they make the most of it. It might only be a couple of people actually on screen, but the movie is interesting (if predictable) enough to keep you occupied with it. I liked the ending, only thing that was really right for the movie, of course.",
         "After coming home from work, a troubled woman meets a stranger frantically trying to escape from a deranged serial killer and soon becomes entangled in a deadly, violent game with the killer now targeting her as well as someone who can't be trusted with what their saying. This isn't all that great of an entry, especially since this one tends to really meander around all over the place with the incredibly illogical manner of featuring back-story segments within the main storyline, making everything so jumbled around and hard to really understand that there's almost no way of ensuring that the film is coherent in any way. As the main plot-point here isn't all that great to start with, and tends to be incredibly predictable anyway, that just leaves an even more-pronounced sour feeling with the film. While the twists and turns do give it somewhat of a watchable-feeling as it goes along, that there's not a lot of other elements to keep it interesting are a major downfall, although several scenes are enjoyable enough and provide enough action and suspense to not make it a total loss, but it is a flawed experience overall. Rated Unrated/R: Graphic Language, Violence and Brief Full Nudity.",
         "A short and dark horror movie. The twist is something 90% of people will see coming but it hardly takes away from the overall impact of the movie. What does stand out though, is the terrifying death scenes because of how potentially real they could actually be. This is a short and sweet home invasion thriller that works pretty well at getting under your skin, even if it is predictable at times. Though this movie certainly does not hold a candle to other high profile French Horrors (Inside, Martyrs, High Tension), if you are looking for a short and sweet, fast paced thriller, this will suit you just fine! Full Review at: http://www.simplefilmreviews.com/2014/07/in-their-sleep-2010.html",
         "Within the first 15mins i knew exactly what was really going on and as the film progresses you will too if you haven't figured it out. While it may be easy to guess the movie was still pretty good. It's by no means worthy of other French horror like High Tension but worth a watch....once. The actress playing Sarah gives an excellent performance and it's the main reason to watch. If there's nothing better on, give this a shot. It's great for those who enjoy foreign horror and a little blood. In closing, the main actress and seeing how everything turns out make the movie tolerable. It is by no means the worst film i've seen ;) oh and ladies if you like french guys then there's a little bum bonus....although it's not at all what you're thinking. Let's just say, don't sleep in the nude because you never know where the night will take you.",
         "i saw this on IFC on demand over my brother's house, and he had made the mistake of watching the preview they have for all of their films. i didn't watch the preview for it so it didn't ruin the film for me, but he said it gave away too much and ruined the mystery element for him, so don't watch the preview. It was a good thriller, not ground-breaking, but it surprised me, and that's what thrillers are supposed to do. AP is starting to age, and she is featured w/out make-up in most scenes, except for the beginning, to reflect her horrible state of mind. She does have a \"wasted\" look about her without make-up, and there's a good reason why they chose her for \"Dead Girl\" about ten years ago. *****Spoiler**** At the end of the film, she is out of it that it's almost an act of mercy when the other main character slits her throat. So if you're looking for a good thriller with plenty of AP in extremis, this one's for you.",
         "Few horror/thriller films can surprise nowadays. I started watching Dans ton sommeil without any foreknowledge and still managed to be always ahead of the story. The plot is simple, the characters we have seen in countless similar genre movies. There is a twist of some sorts around halfway of the story but it's something at least half a dozen films have employed recently, if not more, indie and mainstream thrillers alike. With all these familiar elements I just can't fathom why the filmmakers bother at all. Directing is okay, as is cinematography. Acting is great throughout, Anne Parillaud excels as tormented mother Sarah. Arthur Dupont brings out the best of the role he is given. Again - their efforts serve a pedestrian story. Clearly, there is real talent involved in the making of this film. Like so often, it's the way too predictable script that makes the whole experience less than worthwhile. Even with a blissfully brief running time it's a strain to sit through. Once you figure out what's going on, everything happens just the way you'd expect from a European film of this genre."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Delante Films",
         "BR Films",
         "Banque Populaire Images 9"
      ],
      "summaries": ["Sarah and her husband have moved to a house in the country; their son, Loic, a college student, chaffs at the isolation and a tragedy occurs. A year later, Sarah lives alone in the house; distracted by grief, she's sent home from her hospital job at 2 AM. Police on the road warn her of burglaries in the area, then a young man, much like her son, flags her down: he surprised a burglar at his house, and he's being chased. He is Arthur. Sarah gives him a lift, and soon a car is in pursuit. A long night ensues with flashbacks to crimes and chases; can Sarah protect Arthur as she would her own son?"],
      "budget": 1400000
   },
   "movielensId": 98167,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2010-03-21",
      "dvdReleaseDate": null,
      "directors": [
         "Caroline du Potet",
         "Éric du Potet"
      ],
      "runtime": 79,
      "movieId": 98167,
      "title": "In Their Sleep",
      "mpaa": null,
      "actors": [
         "Anne Parillaud",
         "Arthur Dupont",
         "Thierry Frémont",
         "Jean-Hugues Anglade"
      ],
      "imdbMovieId": "1285240",
      "originalTitle": "Dans ton sommeil",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["v0sv32Mjunw"],
      "plotSummary": "Sarah's life is in pieces after the brutal death of her 18 year-old son. One night, her car accidentally hits Arthur, a young man the same age as her boy who is running from a burglar. Sarah sympathizes with him and takes him in, only to be tracked down by the burglar whose murderous rage towards Arthur forces her to take action.",
      "tmdbMovieId": 53354,
      "avgRating": 2.66667,
      "releaseYear": "2010",
      "numRatings": 3,
      "posterPath": "/1T0DR42ljPCt4ryXxjWiuH0VZw3.jpg"
   }
}