{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "silent film",
         "id": 154802
      }],
      "imdb_id": "tt0016669",
      "video": false,
      "title": "La Bohème",
      "recommendations": [],
      "backdrop_path": "/1IZF7WBkAbhLIXlt2OitEHTqP3q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mimi",
               "gender": 1,
               "credit_id": "52fe4acec3a36847f81e2c49",
               "name": "Lillian Gish",
               "profile_path": "/vMDJptAwODMUpgrYsfgaphAq7CS.jpg",
               "id": 8828,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rodolphe",
               "gender": 2,
               "credit_id": "52fe4acec3a36847f81e2c4d",
               "name": "John Gilbert",
               "profile_path": "/vW45lb0Ms0NlnzFdGkWO79NBYer.jpg",
               "id": 98045,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Musette",
               "gender": 1,
               "credit_id": "536de541c3a368124100cd8f",
               "name": "Renée Adorée",
               "profile_path": "/e0CFCtGwucUaAPkA0GP7CYS9IDh.jpg",
               "id": 29973,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vicomte Paul",
               "gender": 2,
               "credit_id": "53fb8ba30e0a267a7500863a",
               "name": "Roy D'Arcy",
               "profile_path": "/pCk3zupUHQ1ar5Fn6k0Mh4zs4j7.jpg",
               "id": 90067,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Benoit - Janitor",
               "gender": 2,
               "credit_id": "53fb8be70e0a267a6f008639",
               "name": "Edward Everett Horton",
               "profile_path": "/yf4MoiK7wnb2dafruUvnVgtuxSN.jpg",
               "id": 2437,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Benoit - Janitor",
               "gender": 2,
               "credit_id": "53fb8c680e0a267a7b00823a",
               "name": "Karl Dane",
               "profile_path": null,
               "id": 29978,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marcel",
               "gender": 0,
               "credit_id": "53fb8c0d0e0a267a6c0085e8",
               "name": "Gino Corrado",
               "profile_path": "/s9WKkWJFUNgbPhczUP4sD0OA4I4.jpg",
               "id": 9096,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Schaunard",
               "gender": 2,
               "credit_id": "57351542c3a368023f000181",
               "name": "George Hassell",
               "profile_path": null,
               "id": 134869,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Madame Benoit (as Matilde Comont)",
               "gender": 1,
               "credit_id": "5735154ec3a368024700013f",
               "name": "Mathilde Comont",
               "profile_path": null,
               "id": 244801,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Bernard (as Gene Pouyet)",
               "gender": 0,
               "credit_id": "57351555925141672f00013c",
               "name": "Eugene Pouyet",
               "profile_path": null,
               "id": 1550914,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Theatre Manager",
               "gender": 2,
               "credit_id": "5735155e9251416720000159",
               "name": "Frank Currier",
               "profile_path": null,
               "id": 108103,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Alexis",
               "gender": 0,
               "credit_id": "57351565c3a3680262000159",
               "name": "David Mir",
               "profile_path": null,
               "id": 1329663,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Louise",
               "gender": 0,
               "credit_id": "5735156c9251416735000116",
               "name": "Catherine Vidor",
               "profile_path": null,
               "id": 1619146,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Phemie",
               "gender": 0,
               "credit_id": "57351574c3a368023f00018f",
               "name": "Valentina Zimina",
               "profile_path": null,
               "id": 1613688,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Editor (uncredited)",
               "gender": 2,
               "credit_id": "59807092925141491500f6f1",
               "name": "Agostino Borgato",
               "profile_path": null,
               "id": 1016595,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4acec3a36847f81e2c45",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "573514bac3a368024100015a",
               "name": "Fred De Gresac",
               "profile_path": null,
               "id": 1388805,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573514c6c3a368023f000168",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "573514ce925141672900012f",
               "name": "William Axt",
               "profile_path": "/uMpiKUoeCI9iwV0gVbPuXBIwirR.jpg",
               "id": 29967,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "573514d4c3a368023f00016a",
               "name": "David Mendoza",
               "profile_path": null,
               "id": 29969,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "573514db9251416720000146",
               "name": "Hendrik Sartov",
               "profile_path": null,
               "id": 100039,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "573514e19251416735000108",
               "name": "Hugh Wynn",
               "profile_path": null,
               "id": 29971,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "573514e89251416729000135",
               "name": "Erté",
               "profile_path": null,
               "id": 1536274,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "573514ef9251416720000149",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Settings"
            },
            {
               "gender": 2,
               "credit_id": "573514f5c3a368023f000173",
               "name": "A. Arnold Gillespie",
               "profile_path": null,
               "id": 29984,
               "department": "Art",
               "job": "Settings"
            },
            {
               "gender": 0,
               "credit_id": "573514fd925141672c000140",
               "name": "Maurice Baron",
               "profile_path": null,
               "id": 29968,
               "department": "Sound",
               "job": "Orchestrator"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.120541,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 110253,
      "vote_count": 2,
      "budget": 0,
      "overview": "It is 1830 in Paris and the rent is due, but the money is not there. An article here, a painting there and a monkey with a cup gives them enough money for the rent, but not for food. Fortunately, Musette from downstairs has enough food for everyone including Mimi - the poor little waif from next door who Rodolphe has met. But Count Paul also has his lusting eye on Mimi and uses her embroidery to get close to her. Rodolphe and Mimi fall in love and Mimi works endlessly to support Rodolphe who is writing his play with a new found passion. He does not know that he has been discharged from writing for 'Dog and Cat Fanciers'. Mimi wants to get his play produced and Count Paul offers to help, but there is a terrible fight when Rodolphe thinks that Mimi is faithless to him with Count Paul. After the fight, he seeks out a doctor as she is sick, but she has left when Rodolphe returns and will stay away until his play is finished.",
      "similar": [
         19,
         74643,
         2292,
         81003,
         460793,
         227156,
         82023,
         455661,
         458663,
         705,
         828,
         9662,
         62214,
         251516,
         9833,
         14813,
         121986,
         36208,
         28966,
         140420
      ],
      "original_title": "La Bohème",
      "runtime": 95,
      "poster_path": "/bncFerPagVhhtOxntVwAVaudhNA.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1926-03-13",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["King Vidor"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Fred De Gresac",
         "Henri Murger"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0016669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMjAxNjM3M15BMl5BanBnXkFtZTgwNDA1MDQ0MjE@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Lillian Gish, John Gilbert, Renée Adorée | See full cast and crew »"],
      "reviews": [
         "Perfect casting - John Gilbert as the dashing, romantic and wildly jealous Rodolphe and Lillian Gish as the sweet, quiet, enduring Mimi. This tale of struggling artists in the Parisian garrets of 1830 is based on the original tale, not the Puccini opera. It is grandly romantic and superbly directed by King Vidor. Gish's work here is arguably the finest of her career. Her face is astonishing, registering fleeting emotions and always underplaying. The scene where she must give up her possessions at a pawn shop to pay her rent is amazing, her eyes darting farewells at each treasure which is tossed aside by the pawnbroker. One can with Gish see her think as well as feel. The last scenes where she drags herself through Paris, dying, to be with the now successful Rodolphe are unique in cinema - we've never seen anything before or since so convincing of near-death activity. Her death itself is simply a roll of the eyes upward - the absence of life - no histrionics here. A performance worthy of an Oscar. See this one.",
         "I have seen hundreds of silent films by now, but I have never, ever yet seen a film in which pantomime was so wildly and dramatically used consistently throughout the entire story by the actors, particularly by John Gilbert. I hate to say it, but here as Rudolphe, although he was his usual fantastically handsome self, he reminds me most of Gene Kelly's antics in the silent film spoof musical \"Singin' in the Rain.\" The film required more subtlety from Mr. Gilbert here, and then I think it would have been a genuine classic. That said, there are moments where his pantomime is perfectly poignant, more genteel, and realistic. The romp through the woods on a spring day, where Mimi (Gish) confesses to Rudolphe (Gilbert) that she loves him, is sublime and unforgettable. He places his hand gently on his heart in surprise, and then kisses Mimi's golden ringlets first, before he kisses her face. A gesture so nineteenth century! John Gilbert certainly knew his history and researched his roles very well. Lillian Gish is always a joy to watch, and her performance as Mimi is exceptional. Her death scene was very moving. If you are a fan of John Gilbert or Lillian Gish, don't miss La Boheme. TCM has a wonderful video clip from the film on its website. Just use their search engine to find it.",
         "Once upon a time, in fact, 1924, Marcus Loew teamed up with Louis B. Mayer to by the Goldwyn studios in Culver City. The entity became MGM. In 1925, a blockbuster would help MGM to the forefront where it would stay for many years. That blockbuster was THE BIG PARADE, brilliantly directed by King Vidor and elegantly played by John Gilbert and Renee Adoree. It was so successful that it still was in the theatres in 1931, when it almost disappeared. But that's another story and only included here to set the stage for this silent movie opera. Reportedly wooed by Irving Thalberg whose letters addressed her as Mimi, the tragic heroine of La Boheme, Lillian Gish was a big box office draw in the early twenties. In fact, she was already quite the veteran, had script approval, choice of director of leading man and director. She was a star and was associated which most of D.W.Griffith's biggest hits. In fact, she had top billing in that very controversial film THE BIRTH OF A NATION and though shown only rocking the cradle in INTOLERANCE, was present for most of the shooting of that masterpiece. After ORPHANS OF THE STORM, her last movie with Griffith, she was very much sought and can be said, one of MGM's first stars. For her first MGM movie, she was responsible for bringing Victor Seastrom, an outstanding director from Sweden, and Lars Hanson, also from Sweden as her leading man for THE SCARLET LETTER. Willing to remain silent about the identity of the father of her child, Gish was pretty much peerless as the tragic heroine of the silent era. With Gish in the picture, a picture that Thalberg effectively cast Lillian first, Adoree had to settle for third billing and very much a supporting role when she reunited with Vidor and Gilbert for LA BOHEME. In fact, most of this movie seems intent of making Gilbert a major star with many scenes the iconic tragic Gish. What they may have lacked in physical chemistry, they make up with classic silent movie acting that neither could get away it just a few years later. The movie starts out with Gilbert a frustrated writer with three room mates, one being a young Everett Horton. They can't pay the rent and neither can the waif down the hall, played by Gish. She makes hers by selling her belonging while the four men get their after getting a monkey, that they curiously want to get rid of once they made the rent. Adoree lives downstairs and invites her boyfriend who invites his two friends. Meanwhile, Gilbert is able to see Gish their each other's windows and acting very much like Douglas Fairbanks, defies death to talk to her at her window sill. The most charming scene happens when Gish and Gilbert go on a picnic and do a dance together. She runs away, he catches up to her and she declares her undying love. Gish rarely showed such playfulness here. However, what lessens this movie are major plot holes. He forgets to write articles to focus on his play and she has a rich suitor who's unsuccessful bedding her. Instead, she stays up nights to make clothes and gives money to Gilbert who thinks he's getting money from the publisher. When he discovers he's actually been fired for over five weeks, he goes to Lillian's place and actually stops the rape that the wastrel suitor almost gave her. He jumps to the wrong conclusions and as over the top as silent acting gets, especially on her part, they have a violent break up. He becomes a successful playwright while she works in some horrid manufacturing plant and succumbs to tuberculosis, ironically the disease that Adoree would die of just a few years later. Even more ironic, it is Adoree who is with Gish when she dies. As Gish remarked, though she would roll up her eyes and die many times on screen, in fact, she was the last major silent star to die and lived to be ninety-nine years old. There is evidence of Vidor's talent in this one and if the script is bit nonsensical, it's really the opera's fault. Not given much to do here was Karl Dane, whose comic relief spitting routine helped make THE BIG PARADE a success. The director and leads all made better films but I did find this very watchable and should be better known than it is.",
         "For those who love silent films, this film needs no introduction. For those who know nothing about them and would like to begin your Silent Classics 101 class or better yet your Lillian Gish 101 class, begin with this. Lillian Gish was a silent screen star who also was a very successful movie star in talking pictures. But her main contributions to film history are her silent pictures. She was also in The Wind, The Scarlet Letter, Broken Blossoms, Orphans of the Storm, and in director D.W. Griffith's The Birth of a Nation, Intolerance, and Way Down East. All of them are essential to a Lillian Gish 101 class. But begin with La Boheme. It centers around tenants in an apartment building, who are barely scraping by: John Gilbert who is a writer of stories and plays, or at least hopes to be, and Lillian Gish who sews to make money. They can barely make enough to pay for the rent. Gilbert at least has friends with whom he is \"poor but happy\" with. But Lillian is alone and looks as petite as actresses come. Their lives cross when he takes her in and feeds her out of pity and from thereon he falls in love with her. Miss Gish's dark expressive eyes and fine distinctive features only heighten her performance. She is heartbroken, when she has to give her clothes away and gets very little for them. And throughout the film, she does all she can to help the man she loves. And the last 15 minutes is unforgettable as she is at death's door, but makes her way through the village, back to John Gilbert, hanging onto the back of trucks and literally dragging herself across the street. If you haven't had a good cry lately, I recommend this and defy anyone to not break down watching this. If you don't, then something is seriously wrong with you. What's amazing also is that Miss Gish was already petite, but she lost even more weight just for her final scenes to be believable. That is not makeup. The crew watching and even John Gilbert thought she was actually dying. But, Miss Gish was that way; she would do all for the sake of her work, as the true artist she was. This is in my opinion her tour de force, and that's saying a lot, as she was always outstanding in everything she ever did. None of her other films really capture the intensity and sensitivity of her talents as La Boheme does, with the exception of The Wind. Discover Miss Lillian Gish and La Boheme and you may never want to go back to talking pictures.",
         "La Boheme is a notoriously unreleased film that sometimes broadcasts on TCM. Thanks to a great cast featuring Lillian Gish, John Gilbert, and Renee Adoree, it is no wonder why fans clamor to see it. The star power indeed makes the film a good one. The story is one of sadness and heartbreak; two people live struggling to make ends meet in a shabby town in France. He is working as a writer, succumbing to pieces for the newspaper for money while he can flesh out his play. She is a seamstress whose love for him leads her to working herself to death. The love story is tragic and beautiful. I have never understood the appeal of Gilbert, so I was not as interested in his character or, in consequence, the romantic relationship between he and Gish than I could have been. He is not a bad actor; I simply do not gravitate to his type. Gish is wonderful, however, as a pathetic but beautiful woman. One bright spot of this film was the couple's scenes on a picnic running through the wilderness in the sunlight.",
         "It's difficult to imagine what going to the movies was like during the Silent Era. With no soundtracks, and a person in the theater simply accompanying the on-screen action on piano, dramas of the day must have suffered somewhat. But not 'La Boheme'. As this wonderfully engaging tale of struggling actors and writers in France unfolds, it has a quality to its story telling that would have diminished had it been a talkie. Once you see the frail and beautiful (and quite haunting) Lillian Gish in her key scenes, you will never forget her. Grab a few hankies and enjoy this singular silent screen treat!",
         "In 19th century Bohemia, artistic residents in the \"Latin Quarter\" of Paris suffer and starve. Lillian Gish (as Mimi) is a seamstress who can't pay the rent. John Gilbert (as Rodolphe) is an playwright with money problems of his own. Gilbert has been watching Gish, who lives in the neighboring attic apartment; he is taken by her innocent waif-like beauty. On the first of the month, neither Ms. Gish nor Mr. Gilbert are able to pay the rent, when the landlord visits. Gilbert, his roommates, and friends get some cash together; but Gish, a loner, is evicted. As Gish is preparing to leave the building, Gilbert and friends rescue her from street life. Then, Gish and Gilbert fall in love. The film is most notable for its outstanding pairing of stars Gish and Gilbert, under the star direction of King Vidor. Mr. Vidor is strangely subdued by the period, and settings; but, his Paris street scenes are terrific. The meeting of Gish and lecherous Roy D'Arcy (as Vicomte Paul) is striking; and, Gish's tubercular crawl through the streets of Paris is most especially stunning. The lovers of \"La Bohème\" face poverty and misunderstanding; but, mainly, it's Gish's \"Mimi\" making sacrifices for Gilbert's \"Rodolphe\". Gish's performance is indescribable. According to Vidor and co-workers, she may have put her life in danger to make the film's ending most realistic; and, it shows. Gilbert is in fine form, and characterization; according to Gish, he proposed during film-making. Renée Adorée (as Musette) and Karl Dane (as Benoit) standout among the oddly more well-fed Bohemians. King Vidor directing Lillian Gish and John Gilbert in a prestigious M-G-M production is, of course, well worth seeing; but, the sum of their efforts do not produce the portended masterpiece. Gish's performance seems too outer-worldly for the rest of the cast; and, the story is unworthy. Cinematographer Hendrik Sartov contributes to some beautiful imagery; although, his soft focus lens, on Gish close-ups, is distracting during the early scenes. Happily, Gish, and photographer Sartov, returned to balanced perfection, in \"The Scarlet Letter\" (1926). ******** La Boheme (2/24/26) King Vidor ~ Lillian Gish, John Gilbert, Renee Adoree, Roy D'Arcy",
         "No one else but Lillian Gish would have starved herself for three days to make the final scene, and no one else would have done it so effectively. Would a modern actress have allowed herself to be dragged physically across the cobblestone streets?",
         "Saturday, February 12, 8pm The Castro, San Francisco \"Oh, Art she is a fickle jade, If you work for her, you'll ne'er be paid!\" An aspiring playwright and a waif fall in love as they struggle to survive a life of poverty in nineteenth-century Paris. Mimi (Lillian Gish) sacrifices her own welfare for the sake of Rodolfe's (John Gilbert) success and pays the ultimate price. Lillian Gish signed a spectacular two-year, six-picture contract with fledgling MGM studios in May 1925. She chose La Bohème (1926) for her first film and King Vidor for her director. \"Suggested by\" Henri Murger's Scènes de la vie de bohème, the popular story was well suited for the vast resources of MGM and their ambitious young head of production, Irving Thalberg. Photographed by the legendary Henrik Sartov, highlights include the lovely picnic (a Seurat masterpiece brought to life) and glowing scenes from the theater. Despite an obvious lack of chemistry shared by the principles, the film soars on magnificent production values and Gish's heartbreaking performance in the final reel.",
         "Stories like this have a certain kind of timelessness and familiarity to them, because they are based around characters and situations which recur again and again in art and literature. And in the case of La Boheme, it is a central concept which has particular resonance for the passionately creative amongst us. For here we meet the romantic archetype of the artists who will die for their art � writers, painters and musicians, lovers and libertines all, starving in the garrets of 19th century Paris. The story comes from the 1896 Puccini opera, but elements of it crop up as recently as the 2001 movie Moulin Rouge! During this era, there wasn't really anyone better suited to playing the female lead than Lillian Gish, and perhaps there never has been. Tender, mysterious, as light and ethereal as a strip of gauze, she was in every way the tragic heroine. At her best when she played it subtle, her performance in La Boheme is wonderfully subdued. So much lies in the tiniest flicker of her face, such as that little curl of her lip when she gets her first glimpse of John Gilbert. Gilbert is not nearly as fine an actor as his leading lady, but he is again very much the right type for his part � an idealist with intelligent eyes and a warm smile. Other faces to look out for here are the very entertaining French actress Renée Adorée, and a rare glimpse of a silent-era Edward Everett Horton, although sadly before his comic talent was fully realised. The director is King Vidor, himself a man with a burningly artistic approach to his medium, albeit one grounded enough in reality and focused enough in thought to make him a good professional. His shot composition shows a neat use of space, and confident handling of rhythm. But what really makes Vidor stand out is the smooth way he makes shots that little bit special. Take for example the scene in which Vicomte Paul first lays eyes on Gish. We get a travelling point-of-view shot as he watches one young woman walking alongside his carriage. The carriage then stops, the woman carries on walking to reveal Gish heading straight towards the camera. We then cut in to a close-up of her face. The moment jolts itself into our consciousness, and because the movement of the camera and the two women is logical, it draws us further into the film's world, rather than exposing the artifice of the medium. King Vidor was one of the best directors who ever lived, because he successfully bridged the gap between the stylish and the realistic. The resultant picture is a good work of classic romantic tragedy, and ultimately one that relates more to fantasy and mythology than to any real world situation. Poverty and injustice play their parts in La Boheme, but they are presented in almost noble terms, like some depiction of suffering in a religious painting. Compare this to poverty-themed pictures made just a few years later during the depression, which were earthy, honest and very close to home. La Boheme on the other hand is more the agonising, bittersweet fairytale. And there is no shame in this � it is simply a part of the idealism of the 1920s and of silent cinema, a naïve but beautiful way of thinking that was very soon to vanish with the changing times."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "It is 1830 in Paris and the rent is due, but the money is not there. An article here, a painting there and a monkey with a cup gives them enough money for the rent, but not for food. Fortunately, Musette from downstairs has enough food for everyone including Mimi - the poor little waif from next door who Rodolphe has met. But Count Paul also has his lusting eye on Mimi and uses her embroidery to get close to her. Rodolphe and Mimi fall in love and Mimi works endlessly to support Rodolphe who is writing his play with a new found passion. He does not know that he has been discharged from writing for 'Dog and Cat Fanciers'. Mimi wants to get his play produced and Count Paul offers to help, but there is a terrible fight when Rodolphe thinks that Mimi is faithless to him with Count Paul. After the fight, he seeks out a doctor as she is sick, but she has left when Rodolphe returns and will stay away until his play is finished.",
         "Mimi is attracted to Rudolphe by his kindness. He is writing for a magazine while working on his play. Mimi carries his articles to the paper and because they are late, he is fired. Fearing the news may hurt his play-writing skills, she works late at night sewing, without his knowledge, and uses the proceeds to pay him his expected salary. She meets a friend, she thinks, to have him read and get the play produced, but Rudoplhe is jealous and she is deeply hurt. Suffering, also unknown to Rudolphe, from tuberculosis, she leaves him a note of farewell. His play is a great success but he is unhappy without Mimi.",
         "A group of starving artists try to survive in 1830s Paris, including a seamstress and the would-be playwright she loves."
      ],
      "budget": 0
   },
   "movielensId": 98171,
   "movielens": {
      "languages": [""],
      "releaseDate": "1926-03-13",
      "dvdReleaseDate": "2010-01-12",
      "directors": ["King Vidor"],
      "runtime": 95,
      "movieId": 98171,
      "title": "La Bohème",
      "mpaa": "",
      "actors": [
         "Lillian Gish",
         "John Gilbert",
         "Renée Adorée",
         "Roy D'Arcy",
         "Edward Everett Horton",
         "Karl Dane",
         "Gino Corrado",
         "George Hassell",
         "Mathilde Comont",
         "Eugene Pouyet",
         "Frank Currier",
         "David Mir",
         "Catherine Vidor",
         "Valentina Zimina",
         "Agostino Borgato"
      ],
      "imdbMovieId": "0016669",
      "originalTitle": "La Bohème",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "It is 1830 in Paris and the rent is due, but the money is not there. An article here, a painting there and a monkey with a cup gives them enough money for the rent, but not for food. Fortunately, Musette from downstairs has enough food for everyone including Mimi - the poor little waif from next door who Rodolphe has met. But Count Paul also has his lusting eye on Mimi and uses her embroidery to get close to her. Rodolphe and Mimi fall in love and Mimi works endlessly to support Rodolphe who is writing his play with a new found passion. He does not know that he has been discharged from writing for 'Dog and Cat Fanciers'. Mimi wants to get his play produced and Count Paul offers to help, but there is a terrible fight when Rodolphe thinks that Mimi is faithless to him with Count Paul. After the fight, he seeks out a doctor as she is sick, but she has left when Rodolphe returns and will stay away until his play is finished.",
      "tmdbMovieId": 110253,
      "avgRating": 3.66667,
      "releaseYear": "1926",
      "numRatings": 3,
      "posterPath": "/bncFerPagVhhtOxntVwAVaudhNA.jpg"
   }
}