{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt1930371",
      "video": false,
      "title": "Joe + Belle",
      "recommendations": [
         84312,
         91930,
         325592
      ],
      "backdrop_path": "/4jbhuyc72BhmkGRomguDZuxh1UX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Joe",
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7a7",
               "name": "Veronica Kedar",
               "profile_path": "/b8BId9MeU3PyzjjHurATKzh92M2.jpg",
               "id": 1120638,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Belle",
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7ab",
               "name": "Sivan Levy",
               "profile_path": "/rUpGc6b7IBQMe08BxMMoGa5jfB3.jpg",
               "id": 1069224,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Abigail",
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7af",
               "name": "Romi Aboulafia",
               "profile_path": "/1ubuDaglR0My6OWXo1Jt2YNQeSC.jpg",
               "id": 140196,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Shoshi",
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7b3",
               "name": "Irit Gidron",
               "profile_path": null,
               "id": 1076791,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Matan",
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7b7",
               "name": "Yotam Ishay",
               "profile_path": null,
               "id": 1120644,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa779",
               "name": "Veronica Kedar",
               "profile_path": "/b8BId9MeU3PyzjjHurATKzh92M2.jpg",
               "id": 1120638,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa77f",
               "name": "Veronica Kedar",
               "profile_path": "/b8BId9MeU3PyzjjHurATKzh92M2.jpg",
               "id": 1120638,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa785",
               "name": "Stav J. Davis",
               "profile_path": null,
               "id": 1120639,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa78b",
               "name": "Amir Fishman",
               "profile_path": null,
               "id": 1120640,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa791",
               "name": "Veronica Kedar",
               "profile_path": "/b8BId9MeU3PyzjjHurATKzh92M2.jpg",
               "id": 1120638,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa797",
               "name": "Daphna Keenan",
               "profile_path": null,
               "id": 1120641,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa79d",
               "name": "Ron Haimov",
               "profile_path": null,
               "id": 1120642,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b2a9251416c750fa7a3",
               "name": "Daniel Keysary",
               "profile_path": null,
               "id": 1120643,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.090436,
      "production_countries": [],
      "id": 144271,
      "vote_count": 6,
      "budget": 28000,
      "overview": "An accidental murder brings two girls together in a series of wild crimes and romance over the course of an evening.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         29371,
         244772,
         3981,
         112160,
         858,
         634,
         17130,
         43923,
         513,
         11634,
         141,
         437557,
         376867,
         394117,
         297762,
         242224
      ],
      "original_title": "Joe + Belle",
      "runtime": 80,
      "poster_path": "/8QUnX10XLrWmvrNv8KfEi9yglpn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         }
      ],
      "production_companies": [],
      "release_date": "2011-06-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "If love is not madness... It is not love.",
      "adult": false,
      "homepage": "http://www.joeandbelle.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": "ILS ",
      "directors": ["Veronica Kedar"],
      "runtime": 80,
      "synopsis": "Joe (Veronica Kedar) is a young American Jewish woman who was born in New York but lives in Israel. An orphan, she makes a living as a drug dealer and courier. In the opening scene, she travels from Bangkok to Tel Aviv smuggling drugs into the country. Joe delivers the drugs to a local drug dealer named Abigail (Romi Aboulafia) who tells her to meet at the club 'Dark Eighties' later that night to sell drugs. Meanwhile, Belle (Sivan Levy) is a young French Jewish immigrant who is staying at Tel Aviv Psychiatric Hospital for repeated attempts at suicide. After spending an unknown amount of time at the hospital, she is released into the care of her mother (Florence Bloch). However after learning that her parents got rid of her pet 'Fred' Belle runs away. She climbs onto the roof of a building and strips of her clothes to commit suicide. Before jumping she notices an open window and decides to go inside, after getting close to the window she finds it is closed but she smashes it and goes inside anyway. When Joe arrives home to her apartment she hears noises in her bathroom. Armed with a guitar she goes in to find the suicidal Belle lying in her bathtub with a straight razor in her hand about to slash her wrists. Belle is immediately smitten by Joe and talks her allowing her to go to 'Dark Eighties' together, although she still carries the razor around with her. (Note: from this point Joe and Belle communicate with each other in Hebrew, their second language, since Joe cannot speak any French and Belle cannot speak English.) At the club Joe tries to leave Belle behind, but she follows her home again. Once back at Joe's apartment, Joe locks Belle outside, but she knocks on the door continuously until Joe lets her in. When Joe goes out for cigarettes, Belle looks around the kitchen for food but finds a gun hidden inside the microwave oven which she trades for her razor and then goes to sleep on the couch. Joe's ex-boyfriend Matan (Yotam Ishay) arrives at the apartment and mistakes the sleeping Belle for Joe. Belle wakes up when Matan kisses her feet and she pulls out the gun. He tries to talk her into giving him the gun but she just shoots him instead. Joe arrives to find Matan on the ground and she takes the gun from Belle, but when Matan suddenly wakes up she shoots him in shock, killing him. Abigail who is waiting for her boyfriend Matan to return home thinks he may be cheating on her with Joe and leaves a threatening voice mail on his cell phone. In order to move the body, the two women attempt to steal a car. Belle sexually propositions a man with a car who follows her into an alley were she knocks him out and steals his car keys. Discovering that neither one of them can drive, they leave the car and head back to the apartment. They wrap the body in blankets and then Joe calls Abigail and asks to borrow her van. Initially agreeing to help move the body, Abigail becomes distressed when she realizes that it is Matan wrapped in the blankets. After dumping the body in a river, Joe and Belle talk about ex-lovers and Joe finds out Belle is a lesbian. The three girls then go to a nearby nightclub and Abigail leaves to phone corrupt police officer Lt. Tzedek (Ra'anan Hefetz) and tells him Joe and Belle killed Matan. Joe and Belle panic when they see flashing police lights outside, slip out of the club and hide in a local hotel room. After confirming their feelings for each other they begin to make out with each other when police officer Assi (Nitai Gvirtz) knocks on their door. Initially investigating another crime as he is about to leave he gets notified of Matan's murder over the police radio and Belle hits him over the head with the hotel phone and handcuffs him to the bathtub. Joe and Belle get on a bus and phone Abigail again to let her know they are going to Eilat to hide out until this whole thing blows over. Abigail, Tzedek and a female police officer named Shlomtsi (Noa Provisor) head to Eilat to arrest Joe and Belle. After the phone call, Joe becomes suspicious of Abigail and they get off the bus and head to Sderot, a city that is an ongoing target of Qassam rocket attacks from the nearby Gaza Strip. After playfully running around Sderot, a warning siren for Qassam rocket attacks sounds and they hide out in a deserted public restroom. Whilst hiding out, they have sex for the first time... consummating their sexual attraction to each other. Afterwards, they go to a cafe to eat breakfast and they meet Yoni (Shalev Gelber) a local who is trying to buy drugs. Joe decides to quit being a drug dealer and gives all the drugs she has to Yoni for free. Officers Shlomtsi and Tzedek, who are still waiting in Eilat, begin to suspect Abigail. They arrest her for the murder based on the evidence of blood in her van, her sheets were used to wrap the body and the threatening answer machine message. Joe and Belle rent an apartment and go to a local open mic night were Joe sings a song for Belle. The film ends with Joe and Belle who are no longer being chased by police for murder, happily living in Sderot together like a true romantic couple.... despite the constant rocket attacks.",
      "writers": [
         "Stav J. Davis",
         "Veronica Kedar"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt1930371/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1ODYyNjE5NV5BMl5BanBnXkFtZTgwNDU4NTA2MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Sivan Levy, Veronica Kedar, Romi Aboulafia | See full cast and crew »"],
      "reviews": ["A very original romance and comedy from a first time director, Veronica Kefar which had my attention right from the start. In this, two girls, are on the run from the law and an amusing set-up, amidst the falling rockets in present day Israel. The magical Sivan Levy literally drops into the life of Veronica Kedar, a disenchanted, alienated small-time drug dealer in Tel-Aviv and then the race is on. They consistently survive on the run as they learn about each other and belonging. The film begins so dark and becomes brighter and brighter as one identifies with Ms Kedar's character and falls in love with Ms Levy's. There may be comparisons to Thelma and Louise, but I enjoyed this much more. This is Indie, streetwise, funny and quite an intelligent film, weaving together disparate thoughts and emotions. To think this is Ms Kedar's first film. It is amazing."],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": [
         "A dark comedy about two girls that fall in love with their country and each other en route from Tel Aviv to Sderot. Joe is a frustrated drug dealer and Belle is a french psychopath. The two meet and get involved in an absurd murder in the center of Tel Aviv. They now have to dump the body and escape the police. In this long and difficult journey, the coincidental encounter becomes a true love story that can only exist in one place - Sderot, the ongoing target of Qassam rocket attacks in Israel.",
         "Joe is a frustrated female drug dealer and Belle is a french psychopath. The two meet and get involved in an absurd murder in the center of Tel Aviv, Israel. They now have to dump the body and escape the police. In this long and difficult journey, the coincidental encounter becomes a true love story that can only exist in one place - Sderot (the ongoing target of Qassam rocket attacks).",
         "A dark comedy about two girls who fall in love with their country and with each other en route from Tel Aviv to Sderot (the ongoing target of Qassam rocket attacks)."
      ],
      "budget": 110000
   },
   "movielensId": 98191,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "עִבְרִית"
      ],
      "releaseDate": "2011-06-01",
      "dvdReleaseDate": null,
      "directors": ["Veronica Kedar"],
      "runtime": 80,
      "movieId": 98191,
      "title": "Joe + Belle",
      "mpaa": "",
      "actors": [
         "Veronica Kedar",
         "Sivan Levy",
         "Romi Aboulafia",
         "Irit Gidron",
         "Yotam Ishay"
      ],
      "imdbMovieId": "1930371",
      "originalTitle": "Joe + Belle",
      "genres": [
         "Romance",
         "Crime",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An accidental murder brings two girls together in a series of wild crimes and romance over the course of an evening.",
      "tmdbMovieId": 144271,
      "avgRating": 4,
      "releaseYear": "2011",
      "numRatings": 2,
      "posterPath": "/8QUnX10XLrWmvrNv8KfEi9yglpn.jpg"
   }
}