{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "government agent",
            "id": 163049
         },
         {
            "name": "bad girl",
            "id": 180086
         },
         {
            "name": "stolen bonds",
            "id": 210373
         }
      ],
      "imdb_id": "tt0025129",
      "video": false,
      "title": "Fog Over Frisco",
      "recommendations": [
         84905,
         94236,
         40717,
         40799,
         53781
      ],
      "backdrop_path": "/lePfdzoqpdCWU6ge8fWo1zdGNdb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Arlene Bradford",
               "gender": 1,
               "credit_id": "52fe47d1c3a36847f8149e9d",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Tony Sterling",
               "gender": 2,
               "credit_id": "52fe47d1c3a36847f8149ea1",
               "name": "Donald Woods",
               "profile_path": "/A9PoBFa8pDZbVLaxhxgNl8Gi898.jpg",
               "id": 118022,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Valkyr Bradford",
               "gender": 1,
               "credit_id": "52fe47d1c3a36847f8149ea5",
               "name": "Margaret Lindsay",
               "profile_path": "/2lDJFueklrAQBc7gg13NyVAy8HL.jpg",
               "id": 20365,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Spencer Carlton",
               "gender": 2,
               "credit_id": "52fe47d1c3a36847f8149ea9",
               "name": "Lyle Talbot",
               "profile_path": "/gHbCftyesSSHRCEClOQUOVjISV8.jpg",
               "id": 34119,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Izzy",
               "gender": 2,
               "credit_id": "54d2a4a79251413fd30007a1",
               "name": "Hugh Herbert",
               "profile_path": "/fQz73F4uiu09wQwnDOPdJydeqrE.jpg",
               "id": 34347,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bradford",
               "gender": 2,
               "credit_id": "54d2a4b59251413fd00005d7",
               "name": "Arthur Byron",
               "profile_path": "/73brZu9pY1nF1sIxK4LIkMXEcGC.jpg",
               "id": 78829,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Thorne",
               "gender": 2,
               "credit_id": "54d2a4c39251413fc40004e3",
               "name": "Robert Barrat",
               "profile_path": "/hP59p1hbbBizWea0ayGoCXjY8r5.jpg",
               "id": 88672,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Porter",
               "gender": 2,
               "credit_id": "54d2a4d3c3a3686ab6000a09",
               "name": "Henry O'Neill",
               "profile_path": "/65tPuizhifyCJz5TR2bV1ygnmnU.jpg",
               "id": 20368,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Jake Bello",
               "gender": 2,
               "credit_id": "54d2a4e0c3a3686ac40004a7",
               "name": "Irving Pichel",
               "profile_path": "/ayZG4dUhY6XtPmvMKv0ezHqBPkN.jpg",
               "id": 20370,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Mayard (as Douglas Dumbrille)",
               "gender": 0,
               "credit_id": "54d2a4f29251413fd00005de",
               "name": "Douglass Dumbrille",
               "profile_path": "/ggD9NRWlRDofqVhVR6XaTHvLhp4.jpg",
               "id": 34748,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Chief O'Malley",
               "gender": 2,
               "credit_id": "54d2a501c3a3686ac800044a",
               "name": "Alan Hale",
               "profile_path": "/7ZTTJ08iSQYBaDvfgfhmGpqCrtx.jpg",
               "id": 8729,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Joe Bello",
               "gender": 2,
               "credit_id": "54d2a50f9251413fd30007a6",
               "name": "Gordon Westcott",
               "profile_path": "/wtPQielKOhH9XBx6LE5DImqdiOV.jpg",
               "id": 43866,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Detective Sgt. O'Hagen (as Charles Wilson)",
               "gender": 2,
               "credit_id": "54d2a5209251413fc1000535",
               "name": "Charles C. Wilson",
               "profile_path": "/awAONzbcbB4Pw8JSIRYdVfKYG12.jpg",
               "id": 30160,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Archie Van Ness",
               "gender": 2,
               "credit_id": "54d2a533c3a3686ab6000a0c",
               "name": "Harold Minjir",
               "profile_path": null,
               "id": 1005423,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Spike Smith",
               "gender": 2,
               "credit_id": "54d2a54d9251413fd60005c3",
               "name": "William Demarest",
               "profile_path": "/bQcQWPfKr7RLeDifSBdx4zlZGdV.jpg",
               "id": 21510,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Ragsy",
               "gender": 2,
               "credit_id": "5aa028589251415815015c0a",
               "name": "Skippy",
               "profile_path": "/pX5GTIGKvOktaeBW81aFfharmRa.jpg",
               "id": 1965470,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d1c3a36847f8149e99",
               "name": "William Dieterle",
               "profile_path": "/tZGQR1umCzJm3OM22zMJSFn8gCY.jpg",
               "id": 49214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54d2a46f9251413fc40004df",
               "name": "Robert N. Lee",
               "profile_path": null,
               "id": 100583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54d2a4749251413fc1000529",
               "name": "Robert N. Lee",
               "profile_path": null,
               "id": 100583,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "54d2a47d9251413fd00005d5",
               "name": "Eugene Solow",
               "profile_path": null,
               "id": 144592,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "54d2a48b9251413fc100052b",
               "name": "George Dyer",
               "profile_path": null,
               "id": 1024306,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56ad6d09c3a3681c34007080",
               "name": "Henry Blanke",
               "profile_path": null,
               "id": 14446,
               "department": "Production",
               "job": "Supervising Producer"
            },
            {
               "gender": 2,
               "credit_id": "56ad6d11c3a3681c310077f8",
               "name": "Bernhard Kaun",
               "profile_path": null,
               "id": 29810,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ad6d1ac3a3681c54007a98",
               "name": "Tony Gaudio",
               "profile_path": null,
               "id": 8713,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56ad6d23c3a3681c310077fd",
               "name": "Harold McLernon",
               "profile_path": null,
               "id": 123008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56ad6d2bc3a3681c47007cce",
               "name": "Jack Okey",
               "profile_path": null,
               "id": 17763,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56ad6d33c3a3681c47007cd0",
               "name": "Orry-Kelly",
               "profile_path": null,
               "id": 4127,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.096512,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50675,
      "vote_count": 5,
      "budget": 0,
      "overview": "Bette Davis and Margaret Lindsay portray stepsisters from a society family in this atmospheric tale of crime and punishment in the City by the Bay. One sister is amiable, upright, eager to uphold the family name. The other is volatile, risk-taking, a moth hovering too close to the flame of high-living lowlifes who launder stolen bonds. Care to guess which actress plays her?",
      "similar": [
         7299,
         213,
         12611,
         339964,
         10515,
         33172,
         242958,
         239221,
         361215,
         458679,
         225958,
         254321
      ],
      "original_title": "Fog Over Frisco",
      "runtime": 68,
      "poster_path": "/adSx1c314QxIESmuWRgjsHdpq9F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "First National Pictures",
            "id": 3245,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1934-06-02",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Society beauty's wild escapades shock city!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William Dieterle"],
      "runtime": 68,
      "synopsis": null,
      "writers": [
         "Robert N. Lee",
         "George Dyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025129/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTU1NjQ4NTk0M15BMl5BanBnXkFtZTcwMTk2MjE5Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bette Davis, Donald Woods, Margaret Lindsay | See full cast and crew »"],
      "reviews": [
         "Bette Davis gets top billing even though she isn't in two thirds of the movie? Well, considering how boring the leads were, she deserved it. This films crams a lot into 68 minutes. Red herrings, wild car chases, a butler with a secret and of course Bette Davis as the one who sets it all off, it's all in the film. Davis as Arlene Bradford, seems always in command, that her fate is a little shocking but not unexpected and a little bit delicious. With her short blonde hair and the tight shiny dresses, she is quite a welcome sight. A short fun little film.",
         "Considering the reputations and historicity of Bette Davis and Michael Curtiz, why hasn't anyone issued this marvelously little fast-paced film on video? Davis is lightning-sharp as wicked Arlene, and Margaret Lindsay was an interesting early Warners player. I understand that Jack Warner, in the early days of the talkies, used this film to demonstrate what a director could accomplish with a tight budget and filmic expertise.",
         "This is a great Warner's crime drama - not as well known as some of the others but deserves to be. Bette Davis gives a power-house performance as the venal Arlene Bradford, the criminal step-daughter of a powerful banker. To me it proves how determined Miss Davis was to break the mould and to appear in roles she believed in and that would make her stand out. Bette plays Arlene Bradford, who is secretly working for a criminal (Irving Pichel) who is involved in stolen bonds. Spencer Carlton (Lyle Talbot) a decent but weak employee at Bradfords bank is engaged to Arlene. It is he who is usually called on to dispose of the bonds - obviously he will lose his job if caught. But Arlene is playing the sap for a sap and has no intention of marrying him. She is in love with someone else and is soon to receive the same callous treatment she dishes out to everyone else. Arlene disappears just over halfway through the film and the film is then carried by the two lack-lustre leads. Margaret Lindsay as Val, the \"good\" sister (I have never really got her - but she was a serviceable leading lady for Warners in the 30s) and Donald Woods. The film loses a lot of the verve and excitement it had in the first half. The supporting players are far more interesting - Irving Pichell as the owner of the nightclub, the wonderfully suave Douglas Dumbrille as the family lawyer. Robert Barret as Thorne, the butler is the most fascination - there is something about him - but you don't find out until the last five minutes. Bette Davis' role is eerily reminiscent of what happened to Thelma Todd only a year later. She even looks like her in this film.",
         "Mysterious crime, unconventional way of solving it, witty dialog, fast paced events, car chasing, unexpected resolution... are we watching just another detective action film starring Mel Gibson? No, it is 1934 film Fog over Frisco. It is amazing how little has this type of film evolved in last 70 years or so. The only \"improvements\" we see in modern versions of action films are slimy kissing and love-making scenes, two dozen explosions and rolling stock of a smaller country destroyed. Oh, yeah, done to include something for everyone and to extend the film time to standard one and a half hour. Well Fog over Frisco is what a good action film should look like. It is absolutely enough to have a bit more than a hour to tell everything. Of course, Dieterle could easily make a film a bit longer and the plot more understandable, but this amazing pace is what makes this film even more special. You are moving in the spiral of events so fast that it is necessary to see it twice to get everything straight. But this is not all. We see some really exceptional acting here. Bette Davis makes from one seemingly tiny role more than some leading character actors did in the whole acting career. She is absolutely convincing as Arlene, a spoiled and bored rich girl and you can never see Bette in another film to be so beautiful, glamorous, amusing and enchanting. No wonder that most men in film really seem to be in love with her. Margaret Lindsay, who plays a real head role of her step-sister Val, isn't match for Ms. Davis, however she did her part correctly. Other notable performances include Donald Woods playing Tony and Hugh Herbert playing Izzy, who are convincing as a witty reporter - funny photographer pair. This film is one of the most underestimated films in the whole history of Hollywood and is a must-see for 1930s film period.",
         "FOG OVER FRISCO is getting some interesting comparisons to the work of Alfred Hitchcock, most notably his film PSYCHO. While it can be said that there are some similarities with the sisters where one of them winds up on the wrong side of the tracks and the other gets the unwanted role of having to find out what happened to her, this is where similarities end. Hitchcock wanted to shock the audiences with his story and led us to believe that Janet Leigh, already an established star, would survive the story to the last reel. Yes, there was the element of money her character had taken, the same way Davis' character also gets involved in a plot to steal some securities (I think I have it right, I vaguely recall it being \"money in stock form\"), but in 1934 Davis was just one of many contract players wading through the mire of these quickies that Warner's was giving her. When her character meets her own fate in FOG OVER FRISCO, it's not a shock. It's actually closer to being expected: she's too crude during her short screen time and there is an uncomfortable scene at a dinner table that makes her character unlikeable. Concealing the identity of the murderer also seems to be another point of comparison in between this movie and Hitchcock's classic. Again -- I believe this is an assumption: being a taut crime drama with a good (if clumsy) note of suspense, the need to leave the audience hanging is an old a trick as time itself. I doubt Hitchcock would have even learned about this movie since his inspiration was the book itself which was a loose account of the Ed Gein murders. If he did see this film, no one will ever know, but I personally believe Hitchcock did not use FOG OVER FRISCO even as a vague point of reference. Perhaps the fact that the movie looks different from a cinematic point of view -- it seems to be experimenting with how to transition from one scene to the next, something that only film noir, Orson Welles, and Hitchcock would engage in during the 1940s onwards. At least, it gave Margaret Lindsay a chance to carry the movie on her own since she tended to play the supporting role and would be Davis' rival in JEZEBEL.",
         "Wow, I am amazed that this film is so overlooked, especially considering the reputations of its director (Dieterle) and its star, Miss Bette Dave. Fog Over Frisco is probably forgotten because it had the misfortune of being released the same year as Bette's Academy-rocking star-turn as waitress Mildred in Of Human Bondage. Nevertheless, she is true to form in this early role. I enjoyed this film's fast past and lack of fluff. If you liked \"L.A. Confidential\" you will enjoy Fog Over Frisco's complicated plot and ambiguous characters. The plot structure was strangely reminiscent of \"Psycho\" -- except that Psycho was made twenty-six years later! Seems Hitchcock was not the first to shock his audience unexpectedly...",
         "If anyone out there is looking for Shakespeare or Ingmar Bergman, then this is NOT the film for you. FOG OVER FRISCO is not exactly \"high art\" and yet is quite thrilling and fun--just the sort of gangster film that Warner Brothers did best during the 1930s. So, naturally the film is sensationalistic, action-packed and a tad scandalous! Bette Davis (at her radiant best) is a rich girl who thrives on excitement and danger. Despite being very comfortable, she has a yearning for self-destruction and seems on a collision course with disaster, as she frequents dives, runs around with gangsters and steals security bonds for the excitement of it! So, it's hardly surprising that eventually she disappears and the police are called in to sort out the mystery. The first portion of the film which features Davis in the lead is actually NOT the best aspect of the film. I love seeing her on film, but the film really heats up when her step-sister and a hot-shot reporter investigate. Then, the film accelerates into high gear and is non-stop action and suspense. All in all, this is a great film for those who just want to turn off their brains and have fun.",
         "LOVE the butt-snapping game the reporters play at the city desk of the newspaper. That scene was a little risqué for its time, but the Hayes Code hadn't quite kicked in yet. It's a possible kidnapping of a rich, scheming socialite Arlene Bradford (Bette Davis). William Demarest is the reporter \"Spike\" who gets the call to check out the story. It's a Warner shortie, at 68 minutes, and just one of the four films Davis made with director William Dieterle in the 1930s. Margaret Lindsay and Donald Woods co-star. Alan Hale Sr. is Chief O'Malley, of course. No movie could be made in the 1930s or 1940s without Hale. Regular TCM viewers will also recognize Douglass Dumbrille as \"Josh Maynard\"; Dumbrille had made \"A Day a the Races\" and \"The Big Store\" with the Marx Brothers. Gordon Westcott plays Joe Bello, and in real life, Westcott died at 32 in a weird polo accident. The newspaper dudes and photographers are all over this story, so apparently being followed by the news hounds is nothing new... Arlene's dad is played by Arthur Byron, and he died only a couple years after making this. Some GREAT scenery of foggy San Francisco. The story moves pretty quickly, so pay attention! The sound and photography are a little shaky, but it does show on Turner Classic Movies now & then. A Fun, quick paced film, even if Bette Davis doesn't appear in much of the film! /ksf-2",
         "This film is so rapidly paced that some of the action flew by me too fast to fully understand, although some of the confusion was cleared up in the end. Director William Dieterle used fancy wipes rather than fade-outs and overlapping sound to speed the action along. I prefer a more leisurely pace to enable me to digest the material. Still, the ending was exciting with location shooting in San Francisco a big plus, and it's always enjoyable to watch Bette Davis, who had emerged as a big star by this time. Hugh Herbert provides very minimal comic relief as an inept photographer. I was reminded a bit by Hitchcock's film \"Psycho (1960),\" but you'll have to watch this film to see what I mean.",
         "Betty Davis shoots ..... she scores I was amazed she was wickedly delicious as Arlene Bradford.She played it full throttle also, the twist and turns that the plot took were amazing. Great vehicle to demonstrate her range and her capabilities.Ms.Davis at moments seemed sincere but you knew that there was something sinister brewing about her.As the film unfolded i was a little confused, but everything seemed to gel and it took great shape.I had to watch a second time and I enjoyed it even more.Turner Classic Movies introduced me to this fantastic film and I have recommended this film to other classic movie film fans . To no surprise the loved it*** 10* out of 10* ."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": [
         "Arlene Bradford is the quintessential high society bad girl. She's spoiled by Everett Bradford, her indulgently wealthy San Francisco father, who's recently become totally disgusted by her irresponsible antics. She has little regard for the law and the company she keeps. She has her investment broker fiancé Spencer Carlton involved in a stolen bond racket and flirts with local gangster types including the notorious Jake Bellow. The senior Bradford becomes concerned when Arlene begins to involve her half-sister Valkyr in her shady and highly dangerous activities.",
         "The lifestyles of Arlene and Valkyr Bradford, half-sisters from a respected San Francisco family, diverge markedly as Arlene takes up with criminals."
      ],
      "budget": 0
   },
   "movielensId": 98286,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-06-02",
      "dvdReleaseDate": "2010-08-02",
      "directors": ["William Dieterle"],
      "runtime": 68,
      "movieId": 98286,
      "title": "Fog Over Frisco",
      "mpaa": "",
      "actors": [
         "Bette Davis",
         "Donald Woods",
         "Margaret Lindsay",
         "Lyle Talbot",
         "Hugh Herbert",
         "Arthur Byron",
         "Robert Barrat",
         "Henry O'Neill",
         "Irving Pichel",
         "Douglass Dumbrille",
         "Alan Hale",
         "Gordon Westcott",
         "Charles C. Wilson",
         "Harold Minjir",
         "William Demarest"
      ],
      "imdbMovieId": "0025129",
      "originalTitle": "Fog Over Frisco",
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["yPTNAwxZtPE"],
      "plotSummary": "Bette Davis and Margaret Lindsay portray stepsisters from a society family in this atmospheric tale of crime and punishment in the City by the Bay. One sister is amiable, upright, eager to uphold the family name. The other is volatile, risk-taking, a moth hovering too close to the flame of high-living lowlifes who launder stolen bonds. Care to guess which actress plays her?",
      "tmdbMovieId": 50675,
      "avgRating": 2.625,
      "releaseYear": "1934",
      "numRatings": 4,
      "posterPath": "/adSx1c314QxIESmuWRgjsHdpq9F.jpg"
   }
}