{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lockdown",
            "id": 186523
         },
         {
            "name": "toy dog",
            "id": 186526
         },
         {
            "name": "locked in",
            "id": 186527
         },
         {
            "name": "lost relationship",
            "id": 186531
         },
         {
            "name": "cargo airplane",
            "id": 186532
         },
         {
            "name": "military airplane",
            "id": 186535
         }
      ],
      "imdb_id": "tt1986953",
      "video": false,
      "title": "Storage 24",
      "recommendations": [
         135877,
         92393,
         273509,
         209780,
         31196,
         135579,
         48836,
         47891,
         111901,
         84942,
         122369,
         77785,
         185471,
         90231,
         90232,
         78509,
         92398,
         137528,
         75454,
         86075
      ],
      "backdrop_path": "/4PO26DFE4d4FxgLhUnvTrLrjeVN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001b5",
               "name": "Noel Clarke",
               "profile_path": "/2ggZZ3bHvXyvD2fODiAjLLTQ4kx.jpg",
               "id": 76242,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001b9",
               "name": "Colin O'Donoghue",
               "profile_path": "/pJkkoSu1NTaRatXOWdw1qWFEA29.jpg",
               "id": 235767,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Shelley",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f82001bd",
               "name": "Antonia Campbell-Hughes",
               "profile_path": "/fWppmbfAS5CVlndlsX8nlSj35Kw.jpg",
               "id": 17022,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001c1",
               "name": "Ned Dennehy",
               "profile_path": "/nrHkAv1Z70Jei2O0AZavwmP5eUf.jpg",
               "id": 63362,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Nikki",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f82001c5",
               "name": "Laura Haddock",
               "profile_path": "/cc8dV3F1poQ3nZoNfm5rECI2hd9.jpg",
               "id": 209578,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Chris",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001c9",
               "name": "Jamie Thomas King",
               "profile_path": "/kdhMNGHXdWOwpwbUVH1CISPKXZ2.jpg",
               "id": 109861,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Jake",
               "gender": 0,
               "credit_id": "52fe4b5cc3a36847f82001cd",
               "name": "Alex Price",
               "profile_path": "/mQzwZyhQWwtPYx8O4ouB9S0O7Ti.jpg",
               "id": 120933,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001d1",
               "name": "Geoff Bell",
               "profile_path": "/1zWgEcKr25XSfHGuXdCuFLUvEoX.jpg",
               "id": 6969,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f82001d5",
               "name": "Ruth Gemmell",
               "profile_path": "/gk6WRxn0OqkhaLtn35jzcngYc4T.jpg",
               "id": 18031,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001d9",
               "name": "Davie Fairbanks",
               "profile_path": "/kh05frTky5hymOzhUKNxEDxSslh.jpg",
               "id": 1060136,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe4b5cc3a36847f82001dd",
               "name": "Amy Pemberton",
               "profile_path": "/ybHEIchdXSlZ227kdTzFgKe2pEL.jpg",
               "id": 1134097,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f820019f",
               "name": "Johannes Roberts",
               "profile_path": null,
               "id": 100734,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001a5",
               "name": "Noel Clarke",
               "profile_path": "/2ggZZ3bHvXyvD2fODiAjLLTQ4kx.jpg",
               "id": 76242,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001ab",
               "name": "Davie Fairbanks",
               "profile_path": "/kh05frTky5hymOzhUKNxEDxSslh.jpg",
               "id": 1060136,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b5cc3a36847f82001b1",
               "name": "Marc Small",
               "profile_path": null,
               "id": 174716,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53777f0ac3a3685531001b31",
               "name": "Noel Clarke",
               "profile_path": "/2ggZZ3bHvXyvD2fODiAjLLTQ4kx.jpg",
               "id": 76242,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53777f42c3a368552c001a50",
               "name": "Manu Kumaran",
               "profile_path": null,
               "id": 1320624,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53778004c3a3685525001b09",
               "name": "Christian Henson",
               "profile_path": null,
               "id": 41846,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5377806ac3a3685542001a11",
               "name": "Colin Jones",
               "profile_path": null,
               "id": 238120,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5377807ec3a368554a001b4d",
               "name": "Gail Stevens",
               "profile_path": null,
               "id": 2073,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53778094c3a3685531001b53",
               "name": "Andy Blake",
               "profile_path": null,
               "id": 1320625,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "537780a5c3a368553a001a89",
               "name": "Miss Molly",
               "profile_path": null,
               "id": 1320626,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "537780bfc3a3685525001b15",
               "name": "Malin Lindholm",
               "profile_path": null,
               "id": 1134100,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "537780d9c3a3685531001b5a",
               "name": "Stuart MacKay",
               "profile_path": null,
               "id": 1320627,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5379b45cc3a3685531005736",
               "name": "Tim Sidell",
               "profile_path": null,
               "id": 1134084,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.679443,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 114958,
      "vote_count": 60,
      "budget": 0,
      "overview": "Something nasty is lurking inside a secure storage unit. When a group of people get trapped inside, they need to find a way to get out of a building that's designed to keep things in...",
      "similar": [],
      "original_title": "Storage 24",
      "runtime": 87,
      "poster_path": "/qvDwqWPVoTdsS9zebABQWXALqv9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Medient Studios",
            "id": 23529,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Unstoppable Entertainment",
            "id": 6371,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Big Yellow Films",
            "id": 23530,
            "origin_country": ""
         }
      ],
      "release_date": "2012-06-29",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Will their first contact be their last?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Johannes Roberts"],
      "runtime": 87,
      "synopsis": "Storage 24 is a sci-fi horror film directed by Johannes Roberts and written by Noel Clarke and Davie Fairbanks. The story is introduced following a disaster that occurs on board a military plane. The aircraft spirals into Greater London and releases highly classified contents all over the city. The city is in panic and goes into total lockdown. However, four people are trapped inside a warehouse and are unaware of what is happening outside. Charlie (Noel Clarke) and Shelley (Antonia Campbell-Hughes), accompanied by best friends Mark (Colin ODonoghue) and Nikki (Laura Haddock), are dividing their belongings after breaking up. Charlie has just been dumped by Shelley. Friendships are divided and feelings run hot and cold. Of course, its irrelevant in the face of danger. The group is alarmed when the power goes out and they become trapped in numerous warehouse corridors. Worse yet, they are being stalked by something not human and not too friendly. The warehouse was designed as a storage facility and is designed to keep people out and things inside. The odds are stacked against the protagonists, as they struggle to survive amid very claustrophobic conditions. Along the way, David (played by Ned Dennehy) provides comic relief as a hermit bloke archetype and also sacrifices himself for the other characters. He also gets to whisper at the creature, \"You're vicious, arent you. Just like my wife, my Mary!\". The biggest revelation is that the creature is a vicious alien who is blood-thirsty and quite angry. It looks similar to the Predator monster, and is mostly seen in extreme close up shots. There's also an indication that it may be male, since it seems to have a strange reaction to Shelley and her long eyelashes. However, it is later revealed that the alien is most likely female, therefore making the metaphor of an ex-girlfriend ripping one's heart out into a literal act of brutality. The plot thickens when Charlie learns Mark has been having an affair with his girl all along. Relationships are one of the film's key points, as there is a speech late in the film regarding what being a man really means. The film ends with a huge amount of fireworks as the alien takes on a small toy dog who has explosives attached to it. This mirrors the beginning of the film that features a nameless dog walker (Amy Pemberton) stumbling upon the dangerous warehouse. Storage 24 was wide released January 11, 2013.",
      "writers": [
         "Noel Clarke",
         "Noel Clarke"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1986953/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MjY3Njk4N15BMl5BanBnXkFtZTcwNDc3NjU3OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Noel Clarke, Colin O'Donoghue, Antonia Campbell-Hughes | See full cast and crew »"],
      "reviews": [
         "Based upon the trailer I saw I had reasonable expectations of this movie, not the dizzying heights of Aliens or Alien, but perhaps an entertaining little movie/homage. I was wrong. We were treated to a poorly written script with poor Direction and confusing shallow depth of field close ups for the entirety of the running time. An opportunity was squandered by the writers and director to create an intense experience in a claustrophobic setting with a vicious Alien creature that is hell bent on killing every member. Sounds interesting. Sign me up to watch that movie. But sadly we are not treated to this instead we focus on a group of whiney thirty somethings who look bemused and uninterested, perhaps due to the shoddily written dialogue, who casually saunter through the film with the occasional lapse into hysteria when the \"Alien\" attacks. Otherwise they argue about a break up scenario involving Noel Clarkes character and Antonia Cambell- hughes, who incidentally somehow channels the Audiences reaction to the film with her disinterested performance to the material. In truth if I'd have dated Noel Clarkes whiney character too, He'd have been dumped and cheated on as well. Now to get on to the Alien in question... a hybrid creation which resembles a poor version of the cockroach creatures from District 9. In that movie they looked menacing and creepy, in this it just looks silly. Every attack is shown in an extreme close up... by the end I was begging for the director to please give us a medium shot so at least I could get some indication of surroundings/bearings/anything! The worst travesty has to be the final showdown with the Alien involving a usually fairly talented and reliable Irish actor named Ned Dennehy. He usually gives quirky characterizations and in this to a certain degree he does as well with one key difference: it just isn't believable. You may say its not supposed to be, that he's there for comic relief. Fine, perhaps. But then again it isn't particularly funny either, just another blip on an already blemished film. He courageously sacrifices himself so that the three others can escape the Alien creature near the end of the movie. That would be fine if we cared or indeed we were shown that he cared for any of the characters he sacrificing himself for. Only twenty minutes previous he attacks them and now they are life long buddies sacrificing life and limp for... hmmm anyone else think thats poor writing? I expected a bit more from this movie than it delivered. It sorely lacked direction and a properly cohesive script that had proper set pieces and interesting characterizations instead it fails even as a B movie instead slipping into a category of its own somewhere close to C. I'm surprised Universal studios is releasing this to cinemas its home clearly belongs on DVD.",
         "A plane crashes, and something crashes through into a building full of locked storage units. The small number of people trapped inside by the resultant power outage have to survive against the depredations of whatever it was that was inside whatever it was that crashed. One-man British film industry Noel Clarke comes up with the idea, produces and stars in a low budget horror suspense offering which ends up looking as if it cost more than it actually did. It is familiar stuff, of course - monster on the loose in extensive but claustrophobic surroundings, so who is still going to be alive at the end? And, like all such movies, it doesn't bear close examination. It's OK. It's not brilliant - far from it - and it's not especially horrifying. Gory, yes, horrifying - no. But it keeps the interest up and is professionally staged, with a decent monster. Clarke, as always, gives a decent performance, and everyone else does OK. I did not feel cheated of time when it ended.",
         "The DVD case that is. OK, expecting a masterpiece of claustrophobic stalk and slash horror with this one is as daft as some of the dialogue is in the actual film. It is after all a low budget, low grade British clone of many many other films of similar formulaic ilk. But that said, you have to have some standards and a point when you stand up and say it's just not good enough to blame costs and accept poorness because of a willingness to be indie cool. Storage 24 is a bad film, yes there is a good portion of gore for those inclined, the creature design is decent and the inner conflict in the group (boy/girl romantic triangle trouble wouldn't you know) at least keeps character interest from sinking to the depths of us not caring right away. But the screenplay meanders all too often, boorish chatter and emoting only serving to make you prey the creature turns up post haste. Jolts are telegraphed, as are the switching sympathies with the lead protagonists. Acting is poor, except maybe Ned Dennehy, who is playing a bonkers hermit smelly bloke and enjoys himself, and Noel Clarke as the hero in waiting dude scurrying around trying to save the day. Clarke also produces, while Johannes Roberts directs, Clarke (Adulthood/Kidulthood) is much better than this, as is Roberts (F), but the pair are just saying we have watched Super 8 and Alien and feel like turning one out ourselves. That says there is no pretensions here, but it is also lazy film making. The explosive finale comes laced with tongue firmly in cheek, but nothing previously warrants this being tagged as a hip and funny horror/comedy, tried it has, but Severance it isn't. It's the inconsistencies that coupled with the standard formula make Storage 24 a weak film that's difficult to recommend to anyone but the type of horror fan that keeps watching all those Nightmare on Elm Street and Friday 13th sequels...and loving them. 4/10",
         "C'mon now... what are you REALLY expecting here people...? This is clearly a very low budget, Retro Horror film that for what they had to work with and the simple setting, I truly felt that they did a great job with it! The director had a few really nice sequences that hearken back to snippets from 'TEXAS CHAINSAW MASSACRE' & 'THE BIRDS' with nice edits of close-ups of eyes and such, building a lot of tension. The cinematography and especially the monster effects were done really well. Others here are saying things like 'not well executed' or 'bland, poor characters', but I do not feel that that is true at all. Sure, none of these guys are gonna win any awards (well, except the two women, who are likely gonna tie for 1st place for the Most GAWDawful, BUTT Ugliest Mouth Oscar) Seriously though, no big deal, but considering the PAINFULLY bloody Horrible (in the wrong way) acting we usually see in low budget Horror movies like this one with TRULY awful, clichéd characters who we cannot wait to see die, these guys did just fine. The story is really only limited by the simplicity of the narrow setup, but I really feel that the director still got a HELL of a lot out of it. So, if you like simple but effective Monster Horror, you should enjoy this one just fine. Not to give anything away, but I was just holding my breath at the end, knowing bloody well that the British just simply do not believe in good endings, and let's just say that they came up with a 'good' one...",
         "We went to see the film with reasonable expectations and we were let down BADLY! The idea had promise but the delivery was terrible. No one in the film could act - apart from the mad guy who lived in the storage unit. One of the actresses who played Shelly, showed no emotion what so ever even when she was literally face-to-face with the monster. Her face was constantly in the same pose - that of an ape with chronic Bell's Palsy! The storyline was weak and the scenery unchanging and consisted of two corridors throughout the film. It did have a couple of moments that made you jump, but that was it. It did though have an interesting twist in the very- and I do mean very - last 8 seconds of the film. If you really want to see this then rent it on DVD; don't bother seeing it at the cinema, save your cash. Noel Clark - you can do better!",
         "Lots of people get trapped in a building, with an alien beast on the loose. One of them has just broken up with his girlfriend. She's also stuck in there, along with the guy's best friend, who she was having an affair with. TENSION!! There's also an eccentric gentleman in an ugly dressing gown who might as well be followed by a huge neon sign which says COMEDY RELIEF, A gruff engineer trying to fix the strange power cuts which have been going on and off all day (guess what happens to him) and some others who can charitably be described as 'cannon fodder'. Basically, this is a creature feature, the sort they've made for donkeys years... albeit a British one. The chases down narrow tunnels, the sight of disembodied limbs and torsos scattered about, even the fiend itself... are 'borrowed' from a million other movies... most specifically, a certain series starring Sigourney Weaver. This doesn't make it a bad film per se, but it's not one to fire up the imagination in any way (HEY THAT RHYMES!!). It provides a few cheap thrills, but you probably won't recall it a week from now. Or indeed, the next time you go to the bathroom. 5/10",
         "Watch \"Aliens\" if you want an Alien film, or \"Feast\"/\"Slither\" if you like gory mutilation monster horror. I normally like Clarke as an actor but this was a tough film to finish. Even low budget films can be filmed to make them look like they have higher production values. These characters stand around when people die, they stand around and chat, they stand around and die. No urgency. The two males leads squabble as an ET stalks them, even some of the music has homages to James Horners Aliens score. There are also vents for the hero's to crawl through. The alien is a guy on stilts, but most of the time the alien is in extreme close up. It has a mandible mouth like the predator. It was just bad. Even \"Attack of the Block\" was more enjoyable, at least that knew it was silly and played on the dark humour. Pretty boring film, and Clarke should have known better.. Get the story right, get the characters right, add tension and horror. The ending reminded me of the Alien film \"Altered\", which by the way is much better. Avoid film or catch it on the SCI-FI Channel",
         "If you saw Attack the block and thought it had a certain charm (ignoring the subplot about muggers just being victims of society) then you might have gone for this thinking it'd be OK. Sadly, it's not. Wooden acting. Ludicrous plot. Every cliché you can think of. In addition, Nolan Clarke? How DOES he keep getting roles in anything? As for the ending... What? This kind of monster in the locked building/haunted house has been done better by pretty much any version you can name. We are not talking comparisons with Alien. This comes off looking bad compared to the average Goosebumps episode. Killer revealed too soon. Stereotypical characters. The victims may as well be wearing a neon sign round their neck saying they will not make the finale. In short, save 90 minutes of your life for something better. Like listening to nails scraping on a board...",
         "After a plane crash in central London, a group in a storage containment facility find themselves trapped inside with the vicious alien creature released during the crash and must try to fight if off in order to get out alive. This turned out to be a rather decent enough creature feature. One of the more enduring elements to this one is the fact that there's a refreshing simplicity to how it plays out, as the film's basically a one-note plot that really goes on through the notes quite efficiently and effectively to where it becomes routine more than anything about what goes on It consistently turns into confrontation, escape, confrontation, escape which is plenty of fun due to the tight, cramped location to work with the rather convoluted layout of the area and the continuous encounters where the creature chases them through heating ducts, storage units and throughout the building itself that the scenes make for a rather creepy and exciting set of action. The fact that the alien creature here is quite imposing is where it really helps score a little extra as well because the otherworldly appearance, as the spiked mouth, tentacled fingers and humanoid body create a powerful enough figure without seeing too much of it to lessen it's visual appeal as the creature really helps generate a lot of good marks during the film as the repetitive, action-packed nature of the film results in a creepy monster stalking and attacking people trapped in a creepy location, only to escape and run into it later on so there's a sense of familiarity to this as it goes on which can lower this somewhat. As well, the film's blatant disregard for information-revealing is a bit of a problem as it tends to keep so many ideas and plot-points completely unknown to the viewer about the alien creature, what happened to it and the fates of several characters, and about the only plot-point to this that doesn't work is the long build-up here that results in some painful amount of time not going anywhere due to the aggravation of the animosity towards each other. Otherwise, this is a fine effort. Rated R: Graphic Violence and Graphic Language.",
         "Quite well made with some nice creature effects, but I'm afraid it has little else in its favour. Yes, there are a few 'jump out of your skin' moments, but it really doesn't do anything we haven't seen before. For me, they revealed far too much of the creature far too soon; for horror to work well, it needs to be in the shadows. It's what the audience doesn't see that scares them; the imagination is a very powerful thing if manipulated correctly. The performances were all decent enough although nobody really stood out. On the plus side the running time was nice and short and the pace was kept pretty high throughout. Oh, and I have to admit, I love the ending!� Sadly not quite enough for it to get my recommendation though. SteelMonster's verdict: NOT RECOMMENDED My score: 5.6/10 You can find an expanded version of this review on my blog: Thoughts of a SteelMonster."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Medient Studios",
         "Unstoppable Entertainment",
         "Big Yellow Films"
      ],
      "summaries": ["In London, a military plane crashes leaving its highly classified contents strewn across the city. Completely unaware that the city is in lockdown, a group of people become trapped inside a storage facility with a highly unwelcome guest."],
      "budget": 0
   },
   "movielensId": 98290,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-06-29",
      "dvdReleaseDate": null,
      "directors": ["Johannes Roberts"],
      "runtime": 87,
      "movieId": 98290,
      "title": "Storage 24",
      "mpaa": "R",
      "actors": [
         "Noel Clarke",
         "Colin O'Donoghue",
         "Antonia Campbell-Hughes",
         "Ned Dennehy",
         "Laura Haddock",
         "Jamie Thomas King",
         "Alex Price",
         "Geoff Bell",
         "Ruth Gemmell",
         "Davie Fairbanks",
         "Amy Pemberton"
      ],
      "imdbMovieId": "1986953",
      "originalTitle": "Storage 24",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["WlWp3stYAvw"],
      "plotSummary": "Something nasty is lurking inside a secure storage unit. When a group of people get trapped inside, they need to find a way to get out of a building that's designed to keep things in...",
      "tmdbMovieId": 114958,
      "avgRating": 2.56818,
      "releaseYear": "2012",
      "numRatings": 22,
      "posterPath": "/qvDwqWPVoTdsS9zebABQWXALqv9.jpg"
   }
}