{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt1740053",
      "video": false,
      "title": "A Burning Hot Summer",
      "recommendations": [
         76395,
         174376,
         172469,
         52873,
         285848,
         64252
      ],
      "backdrop_path": "/c7jg7rUtZp5SV3LZLfdtCwJFq8M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Angèle",
               "gender": 1,
               "credit_id": "52fe47c09251416c91074965",
               "name": "Monica Bellucci",
               "profile_path": "/nkrIGojQy6FNn9s5cfpiUAmLeNz.jpg",
               "id": 28782,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Frédéric",
               "gender": 2,
               "credit_id": "52fe47c09251416c91074969",
               "name": "Louis Garrel",
               "profile_path": "/lrGbGrTogl6f1by8OnZEsvI63kY.jpg",
               "id": 16269,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Élisabeth",
               "gender": 1,
               "credit_id": "52fe47c09251416c9107496d",
               "name": "Céline Sallette",
               "profile_path": "/gei5LHBer7tNDh55f0VTDO4y5uv.jpg",
               "id": 72255,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe47c09251416c91074971",
               "name": "Jérôme Robart",
               "profile_path": "/c2i9mBLESUgJIeNVwMYD1H6gZMB.jpg",
               "id": 221669,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Roland",
               "gender": 0,
               "credit_id": "52fe47c09251416c91074975",
               "name": "Vladislav Galard",
               "profile_path": null,
               "id": 992622,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Achille",
               "gender": 2,
               "credit_id": "52fe47c09251416c91074979",
               "name": "Vincent Macaigne",
               "profile_path": "/2dewTWT3S01DEiNNF3Aj2Qz6imk.jpg",
               "id": 992623,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "The grandfather",
               "gender": 2,
               "credit_id": "52fe47c09251416c9107497d",
               "name": "Maurice Garrel",
               "profile_path": "/2DOx3uJiR7guXOeEkC2Dhge1ETu.jpg",
               "id": 18814,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47c09251416c91074931",
               "name": "Philippe Garrel",
               "profile_path": "/sPNYmUHACjxWS8sRwkVDrPglKrz.jpg",
               "id": 56207,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47c09251416c91074937",
               "name": "Philippe Garrel",
               "profile_path": "/sPNYmUHACjxWS8sRwkVDrPglKrz.jpg",
               "id": 56207,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c09251416c9107493d",
               "name": "Marc Cholodenko",
               "profile_path": null,
               "id": 589490,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe47c09251416c91074943",
               "name": "Caroline Deruas",
               "profile_path": null,
               "id": 589491,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47c09251416c91074949",
               "name": "John Cale",
               "profile_path": "/jtzO8cnQhseN7Ww0f60D1X4hv0j.jpg",
               "id": 7491,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47c09251416c9107494f",
               "name": "Willy Kurant",
               "profile_path": null,
               "id": 38168,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c09251416c91074955",
               "name": "Justine Pearce",
               "profile_path": null,
               "id": 589492,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c09251416c9107495b",
               "name": "Letizia Carnevale",
               "profile_path": null,
               "id": 589493,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe47c09251416c91074961",
               "name": "Giorgio Gregorini\t",
               "profile_path": null,
               "id": 589494,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.966233,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 80440,
      "vote_count": 16,
      "budget": 0,
      "overview": "Paul reflects on the summer he met Angèle and Frédéric as he watches his friend being laid to rest.",
      "similar": [],
      "original_title": "Un été brûlant",
      "runtime": 95,
      "poster_path": "/1NxqWfa9ZvnMNatHcAmjskhEf6Q.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Faro Film (II)",
            "id": 41208,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rectangle Productions",
            "id": 2700,
            "origin_country": ""
         },
         {
            "logo_path": "/z0vTTWBhZggM09oZWSY3hbXgPKv.png",
            "name": "Wild Bunch",
            "id": 856,
            "origin_country": ""
         }
      ],
      "release_date": "2011-09-28",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philippe Garrel"],
      "runtime": 95,
      "synopsis": "Frédéric met Paul through a mutual friend. Frédéric is a painter. He lives with Angela, an actress who makes movies in Italy. To live while waiting to become an actor, Paul works as an extra. On a film set, Paul meets Elizabeth who is also a background actress. They fall in love. Frédéric invites Paul and Elizabeth to Rome.",
      "writers": [
         "Marc Cholodenko",
         "Caroline Deruas-Garrel"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1740053/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI1Mjk3NDgwNV5BMl5BanBnXkFtZTcwODM0NTg5Nw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Monica Bellucci, Louis Garrel, Céline Sallette | See full cast and crew »"],
      "reviews": [
         "The meaning is in the eye of a perceiver. I liked this movie. The acting was superb, which is expected from french actors. Louis Garrel is a very talented actor. I disagree with the reviewer from Oklahoma in regards to \"actors dress and personal hygiene \" and \"The woman in the film regarded as an outstanding beauty would not be so to most American viewers\". I am not French, but have European upbringing and I find this opinion as arrogant and stuck-up. There is nothing in this movie suggests that the actor\"s hygiene is poor and they dress like slobs. Hollywood movies actors are so fake, so polished , so unrealistic and talentless, that I stopped watching it long time ago. As for the Monica Bellucci's beauty, once again, American standards are fake beauty of over-groomed people, while Monica Bellucci is a classic beauty. I can't name one single modern American actress that is a real, classic beauty. There are few young Hollywood actresses that are natural beauties, but they are not born American (Natalie Portman,Kate Beckinsale,Charlize Theron).",
         "As this story begins, we watch Frederic, a young French painter, accelerating his car and crashing into a tree. We have no clue as to what appears to be a state of mind that drove this man into doing such a terrible act. In flashbacks we are introduced to Paul, a fried of the painter, who serves as the narrator of the story. Paul, a bit player in movies, met Frederic as a mutual friend took him to the painter's place, where a painting catches the eye of the actor. Paul, who by now is living with Elisabeth, an actress he met on location, is invited to go to Rome to see first hand the works of Frederic. Frederic, who is married to Angele, an actress, whose work is finally being recognized, spends his summer in a magnificent house where he works. Angele, is an unhappy woman. She reveals to Elisabeth the state of her relationship with Frederic. She confesses to her friend her husband's fondness for visiting prostitutes. She, herself, has no problems in her involvement with men, something that her husband senses, but never questions Angele. Angele, working on a new film is involved with the director, Rolande, a friend of her husband's. She has come into the conclusion her marriage is a sham and must leave him. Thus, the state of mind of Frederic when we met him. Philippe Garrel, the director of \"Un ete brulant\", must have had his son Louis in his heart to lead this project, as it becomes apparent it was a vehicle for his son. Written by M. Garrel in collaboration with Caroline Deruas-Garrel and Marc Cholodenko. It is based on the life on a friend of the director, a painter, whose life served as the basis for the scenario. Paul, the actor friend, is a revolutionary, but alas, he likes the worry free life his friend Frederic gives him in a beautiful surrounding without any care in the world, or much less, worries about money he obviously does not have. Paul makes statements as far as how a revolution must happen, sooner or later, and his complete abhorrence for the then French president, Nicolas Sarkozy. Best thing in the film is Celine Sallette, Paul's lover and future wife. She watches quietly how her hosts' lives unravel and end badly. Louis Garrel has handsome looks with an unruly mop of black curls. His Frederic is a study in despair, in spite of having fame, he is miserable because of the way Angele drifts apart. Monica Belucci, a gorgeous woman, does not show anything in this film with her flat performance, something that surprised this viewer. Her appearance in the film is a puzzle, the way her role was conceived. Maurice Garrel, the father of the director, shows up briefly as the dead grandfather.",
         "My wife and I saw this film at the 2011 Toronto International Film Festival under the title \"That Summer.\" This film repeatedly employs what I call \"tableau and talk\" as it focuses on a visual--perhaps a wall inside a home or an outdoor vista--and then has an off-camera voice-over talk (or more precisely drone) on about something. The film that we saw pretty much opens with the climactic scene so the audience knows very early on where this is headed. It is a film about two couples though the more famous and prosperous couple (Louis Garrel and Monica Bellucci)get the lion's share of the attention. Despite their successes, this couple is clearly more troubled and less happy. They seem to take turns sabotaging the relationship and their actions make neither especially sympathetic. This severely constrains audience investment in the unfolding tragedy. As one may clearly gather from my rating of the film, I was very disappointed. However, I don't think my reaction was atypical for that audience as this was the only festival film out of 30 we saw in Toronto last year for which no one applauded at the end. Every other film that we watched received at least a smattering of applause even though it may have been characterized as polite or even half-hearted.",
         "Translation of the film in English means (a burning hot summer), but i could not feel any heat from this movie.acts were not good and we can not find any attractive elements in film except lady Monica. unfortunately I think the director hanged one thousand kilos dumbbell to her legs that Monica PLAYED her role hardly and boring..I can say that Monica has many abilities to save the films from going to downhill and being bored.Monica is a kind of scene catcher actress because she has beautiful face and suitable body .even delicacy of her voice and her mimic is very noticeable if we want to be optimistic we should mention simple story of the film as another positive point of film. story turns around two pair of couples .Treachery is the major theme of the film and it is only problem of the main couple. Fredric is someone that likes whores and Monica,her wife, is in love with someone else.but they never talk to each other about relationship problems. And exactly this is one of the scenario holes of the film.I personally do not like the movie because i think this film is shallow.",
         "This is one of the most boring movies I have seen in a very long time. There were only a couple of scenes worth watching and the rest was same old same old. The only redeeming parts were toward the beginning of the film, and they didn't really tie in to the rest of the movie. It was all downhill from there. Uninspiring camera angles, OK acting, and a plot which leaves a lot to be desired. Louis did a great job, however, and I was surprised that Monica's acting is improving slightly. We all know that Monica is a beautiful lady, but focusing on this aspect of her is starting to get old. She actually did a decent job acting, so it would have been nice if the director had focused more on this than on her physical beauty. Was expecting much better work out of Philippe Garrel. Better luck next time.",
         "The actors in this French movie with English titles work hard. They act as if they feel everything intensely. The film may be enjoyed if the viewer is French and familiar with the French language and customs. I was unable to feel what the actors obviously wanted to get across to viewers. I was unable to suspend disbelief. The actors dress and personal hygiene does not correspond to what I see every day in America. This may not be a negative to French audiences. The woman in the film regarded as an outstanding beauty would not be so to most American viewers. This criticism may be unfair if viewers expect most young women to be beauty-contest gorgeous. The French woman's persona and actions may make her beautiful to a French person. French audiences may appreciate the realism in dress and actions. If I was asked to recommend this film I would say that French audiences may find the movie entertaining. However American audiences are likely to have difficulty appreciating the French appearance, emotions and behavior."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Rectangle Productions",
         "Wild Bunch",
         "Faro Film (II)"
      ],
      "summaries": [
         "Frédéric and Angèle are a married couple, he a painter, she an actress of some renown who gave up her career to be with him. She is a woman who most men desire. Struggling actors Paul and Élisabeth, neither who has any money, start to date after they meet as extras on a movie set. Shortly before Paul and Élisabeth met, Frédéric and Paul became friends after being introduced by a mutual acquaintance. By association, all four become friends, especially strengthened when Paul and Élisabeth decide to move into Frédéric and Angèle's spacious apartment in Rome. Following an attempted suicide by Frédéric, Paul reflects on the friendship between the four. Because of physical proximity, they couldn't help but become closer emotionally. So whenever something happened within one of their lives, either directly concerning one or more of the others or not, it couldn't help but affect the other three, the battle lines more often drawn not by couple but by gender.",
         "The once-happy marriage between brooding painter Frederic and his movie-star wife Angele hits the rocks when another couple joins them on a Roman holiday."
      ],
      "budget": 0
   },
   "movielensId": 98449,
   "movielens": {
      "languages": [
         "Italiano",
         "Français",
         "English"
      ],
      "releaseDate": "2011-09-28",
      "dvdReleaseDate": "2012-11-13",
      "directors": ["Philippe Garrel"],
      "runtime": 95,
      "movieId": 98449,
      "title": "A Burning Hot Summer",
      "mpaa": "NR",
      "actors": [
         "Monica Bellucci",
         "Louis Garrel",
         "Céline Sallette",
         "Jérôme Robart",
         "Vladislav Galard",
         "Vincent Macaigne",
         "Maurice Garrel"
      ],
      "imdbMovieId": "1740053",
      "originalTitle": "Un été brûlant",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["_eIlHVw5in0"],
      "plotSummary": "Paul reflects on the summer he met Angèle and Frédéric as he watches his friend being laid to rest.",
      "tmdbMovieId": 80440,
      "avgRating": 2.6875,
      "releaseYear": "2011",
      "numRatings": 8,
      "posterPath": "/1NxqWfa9ZvnMNatHcAmjskhEf6Q.jpg"
   }
}