{
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [],
      "runtime": 114,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0221300/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDkxNzY1Ml5BMl5BanBnXkFtZTcwMDQ4ODEzMQ@@._V1_SY317_CR21,0,214,317_AL_.jpg",
      "actors": ["Stars: Keith David, Sly Stone, Richard Nixon | See full cast and crew »"],
      "reviews": [
         "As a jazz fan for over 20 years now, ever since I first encountered the 6-LP \"Smithsonian Collection of Classic Jazz\" in the library of the college where my father taught, I could go on and on about all the stuff Ken Burns and company left out. However, part of me keeps imagining some kid latching onto this program the way I did with the Smithsonian LP's, then searching out jazz recordings, books on the subject, and recent copies of \"Down Beat\" magazine. Multiply this scenario by an unknown number (hundreds? thousands, perhaps?), not just with literal kids but all kinds of people open to discovery in the same way, and you get some idea of how I feel about the program. Speaking again as a longtime jazz fan, even though I was a bit disappointed that more \"modern\" and avant-garde jazz wasn't included, the portions of \"Jazz\" covering swing were a revelation--I've never had such a direct visceral connection to that music before, though I've enjoyed it from time to time. This illustrates the major merit of \"Jazz\", the way it puts the viewer inside the world in which the music happened. One reason the swing segments are the best in that regard is that not only do we get to see what else was going on in the world at that time, we get to see the audience's interaction with the music--specifically, the dancing. This may be why \"modern\" jazz isn't emphasized as much; the audience's reaction couldn't be captured on camera in the same way. The one theme I would have liked \"Jazz\" to cover in greater depth was its decline in popularity after swing had run its course and most young musicians were either getting into bebop or dixieland (the postwar revival of the latter being one of the program's more mysterious omissions). I think part of the problem lies in the definitional boundaries some of jazz's defenders have drawn around it. It seems to me that jazz was at its healthiest when its practitioners drew upon other musical traditions for ideas; this could mean classical music, showbiz pop, or most often other traditions of black music, notably the blues. Once jazz had been firmly defined as an improvised music emphasizing certain kinds of instruments and instrumental combinations, there developed a tendency among jazz musicians to draw almost exclusively from earlier jazz styles, often the \"purer\" styles of recent vintage. After a certain point, any attempts at a new style were open to criticism over whether they were \"really\" jazz. (It's interesting, in this regard, that most of jazz's innovators have resisted purists' expectations of \"jazz\" musicians; just try to think of any musicians who added to the jazz vocabulary without doing something along the way that upset some group of purists or another.) Some new styles were accepted as the real stuff, others were not, which is a pity since some of them, especially rhythm & blues, might have lead to the reinvigoration of jazz as a popular art. Louis Jordan is singled out in \"Jazz\" as someone who led black audiences awa y from jazz, yet his music developed directly from the swing music of the 30's and early 40's. How differently would jazz history be written if Jordan's kinds of innovations, which kept the music true to the experience of urban blacks without alienating potentially curious whites, were accepted as \"real\" jazz? After all, it's only a short step from Jordan to early rock &' roll. It strikes me that, if jazz is really central to American music, an honest portrayal of jazz would include a full accounting of its influence on other American musical styles. Louis Jordan is one such example; the hard bop influence on the great 60's soul bands (notably Booker T. & the MG's, James Brown's bands, and the guys at Motown) is another; the use of jazz-schooled musicians by such disparate yet seminal bandleaders as Bob Wills and Spike Jones is yet another. Finally, jazz purism has robbed the music of some potentially valuable innovators, the best example being Jimi Hendrix, exactly the kind of instrumental prodigy who would have been a natural for jazz in an earlier time, but who went from r&b bands to rock & roll instead (contrast Ornette Coleman, who went from r&b bands to the jazz avant-garde). And yet the faults of \"Jazz\" don't cancel out its many fine points, though they do throw them into sharper relief. I can't imagine any jazz fan failing to enjoy the music, and only a few who fail to learn something new about it. The fallout from \"Jazz\" as an event--the numerous arguments over the program's merits as history (many of these arguments concerning, at bottom, the definition of jazz) and the recent spur of jazz record (CD, tape, whatever) sales--is icing on the cake. On my own personal rating system, \"Jazz\" ranks just shy of an A+ (a \"perfect\" film) because I can imagine it being done better. Nevertheless, I'm giving it an IMDB rating of \"10\" for its entertainment value, its educational value, its status as a ublic event, and on general principles.",
         "When I learned that Ken Burn's \"Jazz\" was going to be on TV I was very excited; and prepared a bunch of empty tapes to record it. The previews made it seem like the most perfect documentary that I, then a jazz musician in the making, could watch. However, as the series went on, I became supremely disappointed. This series, though most of it was very interesting to me and I learned a lot from it, is seriously flawed in presenting this most American of art forms and leaves me feeling hurt for the great people that the series failed to even mention, while others much less great were somehow squeezed in. The first few episodes of the series are great, they are superbly done and I enjoyed them throughly. However, passed the bebop era, the series goes rapidly downhill. It skips everything that stems away from the most traditional of jazz, mocks fusion - which is really, like it or not, definitely a big part of jazz and is mostly responsible for it's continued survival, skips all important jazzmen of the 70's and 80's - how could they have done a series about jazz without even a single mention of a giant like Chick Corea is beyond me - and ends on a weird and unclear note, where they present a bunch of unknown young jazz musicians, that are (save for Joshua Redman and Christian McBride) should not have been in the documentary ahead of many giants that were not included. I still have no idea who half of those people are, even after searching for something of theirs. Very fishy. Herbie Hancock, who is a pillar of Jazz and probably the most important Jazz-man of the last 30 years, was barely mentioned as a part of Miles Davis' group. Fellow pianist and jazz giant Chick Corea, who created an enormous body of work that influences young players all over the world (there is no pianist in jazz today who was not influenced by Corea, whether they know it or not) was not mentioned at all. Also there was no mention of such important players as Jaco Pastorius, who established the electric bass as a serious instrument and transformed modern jazz forever, Michael Brecker, the biggest influence on saxophonists since Wayne Shorter (me among them), Pat Metheny, the guitar giant who managed to turn creative Jazz into a accessible and popular music but without sacrificing it's intensity or complexity.. And here, in the section about \"the revival\" of Jazz, they show me a bunch of young faces I haven't even heard of, some of whom are frankly just \"purists\" who are trying to play like the old jazz giants without a hint of originality or message to their music. This is not the future of Jazz as far as I am concerned, and I was insulted for those greats that were not even mentioned when those unknown kids came on the screen. Not that I'm in any way trying to belittle the colossal contribution of Louis Armstrong (who, by the way, is the reason I became interested in Jazz in the first place), but some of the screen time they gave him could have been used to at least mention many greats that were omitted. Also, I felt that Ken Burns tried very hard to turn the history of Jazz into a documentary about civil rights of blacks in America, and though it is, of course, very relevant to the issue at hand, it was still dealt way too much screen time until in becomes tiring and you find yourself fast-forwarding through those parts to see what actually happens to the musicians themselves. As far as I am concerned, this is a very lacking production, that starts off great and then completely misleads the viewers that are uneducated in jazz to believe that jazz between the death of John Coltrane and the emergence of Wynton Marsalis did not exist at all. Too bad. In my opinion, the series is - at best - incomplete. It leaves the impression of a documentary about Jazz made by purists for purists, completely disregarding a huge chunk of very important Jazz, and mockingly downplaying it to boot. 5 out of 10, only by virtue of how well it was technically done.",
         "I am neither a musician nor a serious scholar of jazz, just a fan,but even I could see the flaws in Ken Burns' sometimes fascinating, other times infuriating documentary on the history of \"America's music\". Spanning the century, this nineteen hour documentary is most effective at the beginning, when Burns' gift for research is most apparent. You can see the pains he took searching documentation and rare photographs to paint a picture of the roots of the music. However, as the narrative moves on, his over-reliance for third and fourth hand accounts and his own ignorance of the genre becomes apparent. I am not going to go into the laundry list of \"should have\" musicians (Lionel Hampton, Stan Getz, JJ Johnson, Charles Mingus gets only ten minutes!) and others that got short shrift or weren't even mentioned. I'd be here all day. However, I will say that Burns obviously relied too much on critics and writers in putting together his material. Towards the end, especially when they begin to talk of the 50's and 60's, the whole program begins to have the taint of academia all over it. For example, the 50s phenomenon of the wildly popular California-based \"cool jazz\" is dismissed by critic Nat Hentoff as \"bland\" and then never mentioned again. I am sorry to disagree with the distinguished Mr. Hentoff, but as anyone who has heard the recordings of such greats as Gerry Mulligan and Chet Baker can atest, the music they were producing was just as creative and exciting as their East Coast, black contemporaries. To people like Mr. Hentoff, the west coast musicians committed the ultimate sin of being white and somewhat popular. Much of the documentary continues along the same \"us vs. them\" vein. It seems the people who assisted Mr. Burns took advantage of his ignorance and stamped their orthodox biases on what could have been a great work. Whole genres and types (fusion, Cubano, Brazillian) are either dismissed outright or ignored. It reinforces my view that critics are the most useless species on the face of the planet. However, I do have to admit that many parts were fascinating. When Burns does interview eyewitnesses to certain events, it shows the flashes of \"what might have been\". I just wish that he wouldn't have blindly followed the opinions of the the critics and academics and let the audience discover for themselves what to think.",
         "I've never been one to send in any type of critique or review to any type of website, but after viewing the Ken Burns \"jazz\" documentary, I knew this was a call to arms. I've never been so moved before by any film/doc etc.. through the brilliant use of historical footage and expert insight that dances along with the music of the day it's a perfect marriage of sound and vision. I was actually brought to tears of joy several times throughout the series. if anyone is even remotely interested in any type of American history/music of any kind or just a lover of great programming ,this is a must for all. A true American classic! not only did this series reconnect me with such intricate American heritage, but introduced me to a whole new world of exquisite, fascinating music that I immediately fell in love with. For this I am forever grateful to Mr. Burns. the only thing I'm not happy about is the fact that now I've been on a constant quest and spending spree of most of my weekly paycheck on a jazz cd purchasing frenzy!!! Ohh well , it's worth every penny ,keep up the superb work and now its time to venture into the civil war series.",
         "Don't bother with the U.K. version (12 hours) buy the USA version (19.5 hours) it contains more and can usually be found at lower cost. Covers the birth of jazz, swing era, move to bebop, free modal very well, but there is only scant coverage of more modern moves in the field of jazz. Mr Burns has argued that he is more of an historian than a critic and as such he can only really deal with the phases of jazz that are from the past. This line of reasoning is, I think, not un-reasonable. A nice touch on the DVDs is that when a piece of music is playing then pressing the \"info\" button on the DVD or its handset, brings up a screen about the music being played, e.g. title of music, who wrote it, who is playing, when was it recorded, etc.",
         "Ken Burns has done it again. \"Jazz\" is a wonderful overview of the history of Jazz music, America's classical music. Burns not only illustrates the music of Jazz, but also the African American experience. Which is \"our\" American experience. Some noted Jazz critics have complained that Ken Burns over \"simplified\" Jazz as an art form. Or omitted various artists. However, \"Jazz\" is intended to be an overview or introduction, and not a doctorial thesis. So enjoy it. I highly recommend \"Jazz\" and can't wait to get the DVD with its extras.",
         "Until viewing this documentary I thought it utterly fantastic that jazz could be boring. That belief was shattered by Ken Burns' disappointing \"Jazz\". Though it certainly contains immensely valuable archival footage, the mini-series as a whole is no more than traditionalist propaganda. By all means, go to a jazz concert! Read Amiri Baraka's [LeRoi Jones'] \"Blues People\" & \"Black Music\" and Angela Davis' \"Blues Legacies and Black Feminism\" or Miles Davis' or Duke Ellington's memoirs. There are many other, better ways to learn about this uniquely American art form that abstain from this labored attempt to impose a narrow view of the jazz ideal (I mean how many *hours* of screen time should Wynton Marsalis really have?). Those with an appreciation for the music and footage used in \"Jazz\" will either enjoy the rarities or laugh at the pompous presentation (or both). Those unfamiliar with anything related to jazz should know that this series presents a very slanted view of history. The lack of any objectivity led to critics almost universally panning \"Jazz\" on its release.",
         "Ken Burns' Jazz documentary, which is a twenty-hour documentary (too long or not long enough would be the argument, I'd go with not long enough), details the history of Jazz from its origins in Ragtime, up until the 1960's. It is indeed insightful for those who do not know the histories of these people, pretty much all of them terrific or outstanding, and it does try to take you inside their world. As one who has only really gotten into Jazz within the past few years, as just a history lesson it keeps attention most of the way through. The problems one can find in the documentary could be really squared down to two. The first is that Burns, while talented and obviously with a good research team and plethora of pictorial aids, forgets something about Jazz- it's supposed to be fun! There's something about the sense of humor and vitality of jazz that gets lost among the heavy-handed narrations, that make jazz out to be as mighty and colossal as the Greeks or the Romans. Jazz is important to the world of music, but much of what is spoken trumps most of the experiences in the stories (not that a few of them aren't entertaining- most of the stuff involving Armstrong, Bix, Blaisie, and Art Tatum keeps interest that way). The second problem, which is a given considering the length of the documentary, is that there isn't enough room for everyone, and after Miles and Coltrane, it just halts. It would be intriguing if Burns went back and did a 'special edition' treatment, and cover more ground on what he had, and expand into the great jazz that did come out since the 60's (and there has been a few, believe you/me). If you're wanting to get into the atmosphere, the moods and histories (and of course the music, some of it rare here) on Jazz, basically this is the best place to start. But if you're already an aficionado, or if you don't have the utmost attention span to watch all of the footage, it may comes to let-down.",
         "I'm not a member of the \"Let's Hate Ken Burns\" club. I'm a fan. As a fan, I've seen nearly everything that Burns & Buddy Squires have done together since co-founding Florentine Films, along with Roger Sherman & Lawrence Hott, in the late 70's. And I am *especially a fan* since I am offspring of a bonefide jazz musician who made his living in America & Europe in the 40's, 50's, & 60's, until his untimely death in the 70's. This is Burns & Squires masterpiece in the American Trilogy. They got it right. Burns & Squires, moved through the significant contributors & innovators in Jazz from it's New Orleans Dixie Land inception through the major periods including: Swing, Bop, Hard Bop, Cool, Avant Guard, Free, & Post Modernism. There are a lot of folks out there quick to ridicule Burns & Squires' brilliant effort. I am not one of them. And I would venture to guess, that not many of them \"lived the life\".",
         "It's very sad to read how many people were bowled over by this so-called documentary. Sadder yet to see how many were coerced into thinking that this was a legitimate history of jazz. Let us look at some facts: Before beginning this project, Ken Burns had in his own words, \"maybe two\" jazz cds. Because of this, he looked toward Wynton Marsalis for guidance. As a result, the entire documentary was slanted in accordance with Wynton's beliefs--the strongest belief being that white people have nothing to contribute to the genre. This in mind, it is obvious that taking all of one's cues from him is a rather large mistake, as evidenced in Ken's show. For example, the entire West Coast movement was written off. There is no mention of Stan Kenton, Woody Herman, and many of the other great artists and innovators, simply because they were the wrong color...white. In addition, the trombone is not considered to be relevant past the big band era (Sorry J.J. Johnson!! Sorry Kai Winding!). Then of course, there is the statement made that no worthwhile jazz was composed after (approximately) 1965...well...until WYNTON MARSALIS came along!! What a slap in the face!! This is just the tip of the iceberg. Yes, there were some good things in the show. The old footage of the great ones: Armstrong, Ellington, Basie, etc. It's too bad that Burns neglected to interview many of the musicians who are still alive that played in these organizations. Clark Terry, one of the finest trumpet players to ever walk the earth, and who played in BOTH Ellington and Basie's bands, ended up having less than 2 minutes, speaking about things that were relatively trite. The main message that permeated this series was this: Black people created jazz, and whites made only minor contributions. Wynton has stated before that there is nothing that a white person could teach him about jazz. This means in Wytnon's mind that Django, Kenton, Bill Evans, Bix, Brubeck, Chet Baker, Gerry Mulligan, Jack Teagarden, Kai Winding, etc., etc., etc...have nothing to contribute, because they're white. Sad, isn't it? Hopefully, someday Wynton and Burns will see that two wrongs don't make a right. Until then, if you want a true history of jazz, pick up a book called \"Meet me at Jim and Andy's\" by Gene Lees."
      ],
      "genres": [
         "Documentary",
         "History",
         "Music"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Florentine Films",
         "General Motors Mark of Excellence Productions"
      ],
      "summaries": [
         "This series explores the history of the major American musical form. We track its development in African American culture, its rise to prominence with its golden age of popularity spanning from the 1920's to the mid 1940's both in its original form and in Swing through its popular decline and the rise of vital new sub-genres into the present day. Along the way, we learn of the lives and work of major contributors to the form such as Louis Armstrong, Duke Ellington, Billie Holiday, Benny Goodman, Charlie \"Bird\" Parker and many others who helped form Jazz into the vibrant musical form it is. Moreover, we see how the music reflected the political and social issues of the African American community over the course of the form's history.",
         "A survey of the musical form's history and major talents."
      ],
      "budget": 13000000
   },
   "movielensId": 98795,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-01-09",
      "dvdReleaseDate": null,
      "directors": ["Ken Burns"],
      "runtime": 1140,
      "movieId": 98795,
      "title": "Jazz",
      "mpaa": "",
      "actors": ["Keith David"],
      "imdbMovieId": "0221300",
      "originalTitle": "Jazz",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A survey of the musical form's history and major talents.",
      "tmdbMovieId": 142051,
      "avgRating": 3.81429,
      "releaseYear": "2001",
      "numRatings": 35,
      "posterPath": "/7x0p4wV3qBL9CZYahx5m5P1SrMV.jpg"
   }
}