{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1986204",
      "video": false,
      "title": "After Fall, Winter",
      "recommendations": [],
      "backdrop_path": "/bY88AENx5hh46xZBShEd1j81Xjg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Head Nurse",
               "gender": 1,
               "credit_id": "52fe48bb9251416c9109674f",
               "name": "Heather Aitken",
               "profile_path": null,
               "id": 930073,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe48bb9251416c91096753",
               "name": "Lizzie Brocheré",
               "profile_path": "/hfiVh3DJk3IjxQkoAl3YphtHgeq.jpg",
               "id": 84432,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "nurse",
               "gender": 1,
               "credit_id": "52fe48bb9251416c91096757",
               "name": "Rebecca Jameson",
               "profile_path": "/jxP4uvbKrQOto9C7WBI1zQrivPI.jpg",
               "id": 209656,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "thug",
               "gender": 2,
               "credit_id": "52fe48bb9251416c9109675b",
               "name": "Jimmy King",
               "profile_path": null,
               "id": 930074,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe48bb9251416c9109675f",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Caroline",
               "gender": 1,
               "credit_id": "52fe48bb9251416c91096763",
               "name": "Deborah Twiss",
               "profile_path": "/5tBo6oJa5zfpliBj2KbzunWGVBA.jpg",
               "id": 116881,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48bb9251416c91096709",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48bb9251416c9109670f",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c91096715",
               "name": "Ed Flaherty",
               "profile_path": null,
               "id": 930066,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c9109671b",
               "name": "Edward Flaherty",
               "profile_path": null,
               "id": 930067,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c91096721",
               "name": "Zach Miller",
               "profile_path": null,
               "id": 99666,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48bb9251416c91096727",
               "name": "Eric Schaeffer",
               "profile_path": "/wmg75LITVwe4v8pwCipiGgx2vtP.jpg",
               "id": 68185,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c9109672d",
               "name": "Bruce Aitken",
               "profile_path": null,
               "id": 930068,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c91096733",
               "name": "Matthew Puckett",
               "profile_path": null,
               "id": 930069,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c91096739",
               "name": "Zoran Veljkovic",
               "profile_path": null,
               "id": 930070,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe48bb9251416c9109673f",
               "name": "Frank Reynolds",
               "profile_path": null,
               "id": 20538,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c91096745",
               "name": "Karima Guennouni",
               "profile_path": null,
               "id": 930071,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bb9251416c9109674b",
               "name": "H. Spencer Young",
               "profile_path": null,
               "id": 930072,
               "department": "Crew",
               "job": "Post Production Assistant"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.590519,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 83738,
      "vote_count": 8,
      "budget": 0,
      "overview": "WINTER is a dangerous, sexy, poignant and at times darkly funny story about two people who desperately want intimacy but have fashioned lives of reclusivity and emotional fracture which ultimately spells the doom of their great love. WINTER begins with Michael, in his mid forties, suicidal about his writing career, which once flourished and now is on a downturn. He leaves his home in New York and goes to Paris in hopes of igniting his passion for writing and life. He also has a penchant for S and M. Soon after is arrival he meets Sophie, a sexy, smart, soulful, nurse who helps dying people transition to the after world. She and Michael instantly have chemistry albeit combative. Sophie has a secret. Her other job is being a dominatrix. Throughout the film, Sophie is nursing a little girl, Anais, who is dying of leukemia. Written by Anonymous  (IMDB.com).",
      "similar": [],
      "original_title": "After Fall, Winter",
      "runtime": 130,
      "poster_path": "/2XmdFpE1P5mNlnFoRtnALcrMM9t.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-01-27",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Schaeffer"],
      "runtime": 132,
      "synopsis": null,
      "writers": ["Eric Schaeffer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1986204/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjQ1NTYwMzMwN15BMl5BanBnXkFtZTcwNjIxNTUzNw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Eric Schaeffer, Lizzie Brocheré, Marie Luneau | See full cast and crew »"],
      "reviews": [
         "If all of the other reviewers on this site watched the same \"After Fall, Winter\" that I did. All of these stars and all of these gushing reviews feel like deck-stacking on the part of the filmmaker and his friends, and this phenomenon seems to follow Eric Schaeffer wherever he goes. He is like a male Bebe Buell in that regard. This particular group of reviews reeks of this tactic; all of them rave extensively over the movie but reveal no plot points and devote most of their text to praising Mr. Schaeffer. I rented this movie because I'm a BDSM person, and on that level this picture is profoundly insulting. Without revealing any specific plot points, I will only remark that as a long-term dominatrix, I was deeply offended by the implication that one of my fellow older pros would ever, ever refer a client to a fellow practitioner with whom she felt he would not be safe, no matter how much he begged to be referred to such a person. Another thing that leads me to suspect that these reviews are ringers is that none of them specifically praise the only person who seemed to be trying to bring this often-implausible script to sincere life - the lead actress, Lizzie Brochere. The only pleasure I was able to derive from this depressing, insulting film occurred when she was on screen. I feel like she really tried to make a decent movie that would be watchable for people other than Eric Schaeffer's friends but was subverted from that end time and time again by Mr. Schaeffer's colossal overestimation of his own ability to arouse sympathy and interest.",
         "If Fall was a romantic exploration of a love was that was not meant to be, this sequel from filmmaker/actor Schaeffer is a deeper and darker trip down the rabbit hole that may leave you thinking, in the words of The Who, \"love ain't for keeping\". Schaeffer takes his own character forward in time where we see him living in dejected squalor. Hope comes in the form of an invitation from friends to travel to Paris France where he once again finds love with an unlikely mate. From there, Schaeffer finds truth, humor, pain and passion by digging deep into the psychology and sexuality of his characters. It's a stunning, masterful film and one that will be with me and even haunt me for a long time.",
         "\"After Fall, Winter\" asks challenging questions about the connection between our traumatic pasts and present, and the coping mechanisms we invent or latch onto. It is deeply interested in pain, in all aspects, and in particular grief. Once asked, however, the film has absolutely no interest in exploring any further, much less actually offer any answers. More on that later. Eric Shaeffer has many talents. As a writer, he writes incredibly naturalistic dialog. As a director, not surprisingly, he wrangles incredibly naturalistic performances from his actors. As an actor, he's completely at ease leading by example - he engages his fellow actors by being naturalistic, and *almost* sells himself as how he probably imagines himself to be. Trouble is, rather than the whole being greater than, or at the very least adding up to, the sum of its parts, you get the distinct sense that if he could relinquish control over at least ONE of those creative endeavours, he might actually be onto something good. His poor editor. I'm fairly certain he was just two hands and an editing suite. Rather than being allowed to fashion the film in a way that somehow dug deeper into our human condition, or actually imposing a structure that could've made \"After Fall, Winter\" a much more disciplined, enlarging work, he had to be basically a technician piecing together a reel of how fascinating, interesting, talented, funny, raw, real, honest Eric Shaeffer is. This is nothing against Eric Shaeffer, not on a personal level nor on any kind of professional-jealousy level. In fact, he was absolutely right in his speech before the NYC premiere at The Quad - it is incredibly difficult to get an indie film shown in the movie theaters these days, and I applaud him tremendously for ignoring the naysayers and the detractors, of which I'm just one more. But we all have to eventually put up, or shut up. Mr Shaeffer, if you're reading, like I said above, you're a talented guy. But you have to realise that you're actually dooming yourself by not trusting others and letting their creative energies influence what you could become. Right now, you're just trapped in your vision of yourself, and you can't see that it's dragging you down. He says he'll make a part of the \"seasonal\" series once every 15 years. Perhaps \"After Winter, Spring\", in 2027, will be the one where an older and wiser Mr. Shaeffer realises this, and unleashes the true, talented dramatist within.",
         "So honestly I thought this movie was refreshing. It is shocking to watch sometimes because of the violent sexual nature, but well worth it. The characters were well acted and believable. The story was well developed. I was never bored or disappointed. As a psychologist, I felt the character's issues were well written and accurately depicted throughout the film. I hate movies that are too \"Hollywood\" with the same old boring themes. This was a nice change from the typical romantic films. I don't know enough about S&M to judge the validity there, but I felt that this movie was very moving. It dives deep into human vulnerability. If you are looking for something different and interesting then I highly recommend it! It's a movie to watch when you're feeling melancholy.",
         "This is a love story about two broken people (Michael stated that all people are broken)trying to find repair (salvation, redemption, purpose, etc.) through love. However, the damages that Michael and Sophie bring into the relationship makes it difficult for them to develop a relationship. Michael is a masochist and Sophie is a dominatrix by profession who caters to masochistic men. You would thus think they were soul mates. However, Sophie only role plays her sadistic posture in her work and is not truly a dominatrix personally. Michael is a failure with many redeeming qualities and his masochism mollifies his failures and subsequent depression. Both enter the relationship hiding something from each other, and this serves as an invisible barrier to their love. For the first time in her life, Sophie overcomes her anxiety over intimate love and finds herself falling in love, following Michael's lead in his dependent need for her. However, Michael reveals himself as a pathetic failure who deceived her and she leaves him with disastrous consequences. The movie's ending is disappointing since the potential for developing a love relationship could have been actualized with time and proper honest communication. The movie is extremely well done in all aspects except the ending. The ending could have easily been revised in different ways to make a fulfilling story. Manuel Bonnet as Michael and Lizzie Brocheré as Sophie were both superb. For me, Brocheré's performance ranks with that of Giulietta Massina in \"La Strada\" as one of the best female performances.",
         "I was flipping around one night and caught the second half of this film, so admittedly I haven't seen it from the beginning. I was immediately captivated by the dialogue and chemistry between the two leads. Or rather, I was captivated by Lizzie Brocheré's performance, and I got drawn into the burgeoning relationship between these two flawed people. It reminded me a little of \"Before Sunrise,\" one of my favorite romantic films, for its honest, realistic dialogue and the way you get to \"fall in love\" right along with these two. *** May Contain Spoilers *** I was hopeful about the aspects of BDSM, thinking the film might try and treat the subject with realism and sensitivity--unfortunately, instead, those elements just seemed to turn into a plot vehicle at the end. And the end... ugh. If this had been a book I would have chucked it across the room. It just turned so ridiculously melodramatic and silly. I can see what the writer intended--another tragic take on \"Romeo and Juliet,\" but it just didn't fly with me. And the implication that BDSM led them down that path is just insulting, to paraphrase what another reviewer said. Overall, I gave it a 6. The dialogue and performances kept me engaged, and I was pleased to see such range in Lizzie Brocheré, whom I'd seen only in \"American Horror Story\" previously. I hope she goes on to bigger and better things--she deserves it. The writer/director/star, Eric Schaeffer, well, he should maybe get back to writing some more, and come up with his own endings instead of ripping off Shakespeare, and not in a good way.",
         "Loved it. I'm not in the industry so my review is coming from an indie film lover. Although I agree the male character was annoying at times, I found it to fit with the storyline. He was playing a struggling writer from America after all and who says it means he has to appear Harvard educated in leather loafers? I found the gypsy lady's character off -- not sure what it was, just off somehow. Otherwise, I felt everyone fit in perfectly. I adored the leading lady and have now become a fan. I will look for other films she is in. The ending made me sad, but I liked that. It would have come off too Hollywood (and would have been too easy in my opinion) to give it a happy ending. Frankly, I didn't expect for it to end the way it did so as sad as I was, it shocked me and left me thinking. What a beautiful story, well-directed and perfectly acted. Well done! I'll be watching for all your work now.",
         "As an avid movie-goer and Eric Schaeffer fan, I knew it would be difficult to go into \"After Fall, Winter\" without a biased viewpoint. Schaeffer's writing is not only comedic, but still so passionate and provocative at the same time and when I learned he would be reviving the role of Michael Shiver years later, I was really thrilled. But I went into the premiere with an open mind anyway and was truly blown away by the performances and the storyline. While \"Fall\" tells the story of the sexy, scandalous, yet forbidden romance between Michael and Sarah, \"After Fall, Winter\" goes down a much darker road, exposing Michael at his most vulnerable stage in life and his journey in the pursuit of love, success, and happiness. Schaeffer and his French leading lady, Lizzie Brochere, were masterful on the screen together. Their interaction was so honest and direct and their dialog wasn't in any way sugarcoated. Schaeffer always has a way of remaining truthful to his audience, revealing that life can be wrapped up in secrets, love, humor, pain, death - a quality of writing that I really appreciate. Overall, an authentic, moving film that will stay with me long after.",
         "This excellent sequel to Eric Schaeffer's late-90s romantic dramedy \"Fall\" is quite a bit more serious-minded than the earlier film, but has a lot of laughter along with some shattering drama. Schaeffer and his radiant leading lady, the French up-and-comer Lizzie Brochere, have terrific chemistry and the on-location Parisian photography is evocative without falling back on Eiffel-Tower-style clichés. The comic moments are never an intrusion on the drama, nor do the dramatic scenes come out of nowhere. Schaeffer has managed to balance two discrete styles with aplomb. And the BDSM subplot makes the movie unique and memorable.",
         "I didn't know what to expect when I saw this movie, since I'd never seen the original film \"Fall,\" but seeing the new movie made me want to rent the old one. Interestingly, the only thing the two movies really have in common is the leading male character, so you can see them both independently of the other and enjoy each one. The new movie is more ambitious than the first one and--in my opinion--better. It stirred my soul and, while disturbing, is still inspiring. I loved the Paris setting and all the music. It's also beautifully edited; all in all, a highly polished production on what was presumably a limited budget, which makes it impressive on yet another level. As for the acting, Schaeffer and Brochere are wonderful, and the supporting cast follows suit. Although the overall vibe is highly dramatic, there is delicious humor along the way. See this movie!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Five Minutes Before the Miracle",
         "FilmBuff",
         "D3 Pictures"
      ],
      "summaries": ["WINTER is a dangerous, sexy, poignant and at times darkly funny story about two people who desperately want intimacy but have fashioned lives of reclusivity and emotional fracture which ultimately spells the doom of their great love. WINTER begins with Michael, in his mid forties, suicidal about his writing career, which once flourished and now is on a downturn. He leaves his home in New York and goes to Paris in hopes of igniting his passion for writing and life. He also has a penchant for S and M. Soon after is arrival he meets Sophie, a sexy, smart, soulful, nurse who helps dying people transition to the after world. She and Michael instantly have chemistry albeit combative. Sophie has a secret. Her other job is being a dominatrix. Throughout the film, Sophie is nursing a little girl, Anais, who is dying of leukemia."],
      "budget": 0
   },
   "movielensId": 98911,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-01-27",
      "dvdReleaseDate": null,
      "directors": ["Eric Schaeffer"],
      "runtime": 130,
      "movieId": 98911,
      "title": "After Fall, Winter",
      "mpaa": "",
      "actors": [
         "Heather Aitken",
         "Lizzie Brocheré",
         "Rebecca Jameson",
         "Jimmy King",
         "Eric Schaeffer",
         "Deborah Twiss"
      ],
      "imdbMovieId": "1986204",
      "originalTitle": "After Fall, Winter",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Ou5Vo1TCNK0"],
      "plotSummary": "WINTER is a dangerous, sexy, poignant and at times darkly funny story about two people who desperately want intimacy but have fashioned lives of reclusivity and emotional fracture which ultimately spells the doom of their great love. WINTER begins with Michael, in his mid forties, suicidal about his writing career, which once flourished and now is on a downturn. He leaves his home in New York and goes to Paris in hopes of igniting his passion for writing and life. He also has a penchant for S and M. Soon after is arrival he meets Sophie, a sexy, smart, soulful, nurse who helps dying people transition to the after world. She and Michael instantly have chemistry albeit combative. Sophie has a secret. Her other job is being a dominatrix. Throughout the film, Sophie is nursing a little girl, Anais, who is dying of leukemia. Written by Anonymous  (IMDB.com).",
      "tmdbMovieId": 83738,
      "avgRating": 3,
      "releaseYear": "2012",
      "numRatings": 5,
      "posterPath": "/2XmdFpE1P5mNlnFoRtnALcrMM9t.jpg"
   }
}