{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2343713",
      "video": false,
      "title": "Sexy Baby",
      "recommendations": [
         20328,
         47841,
         46228,
         52856,
         32013,
         244776,
         118075,
         62984,
         33135,
         253282,
         140071,
         173911,
         46989,
         51321,
         33582,
         88224,
         14634,
         29162,
         1115,
         286971
      ],
      "backdrop_path": "/8iEpVgBa67UHGXaiMs40g9jAUpn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "",
               "gender": 0,
               "credit_id": "531ca83d92514177ab005ba2",
               "name": "Winnifred Bonjean Alpart",
               "profile_path": null,
               "id": 1299803,
               "order": 1
            },
            {
               "cast_id": 1006,
               "character": "",
               "gender": 0,
               "credit_id": "59c54ec69251415b2402fb80",
               "name": "Jennifer Bonjean",
               "profile_path": null,
               "id": 1893129,
               "order": 2
            },
            {
               "cast_id": 1007,
               "character": "",
               "gender": 0,
               "credit_id": "59c54ecf9251415b5402d773",
               "name": "Ken Alpart",
               "profile_path": null,
               "id": 1893130,
               "order": 3
            },
            {
               "cast_id": 1008,
               "character": "",
               "gender": 0,
               "credit_id": "59c54edbc3a368141e02b43a",
               "name": "Nichole Romagna",
               "profile_path": null,
               "id": 1893131,
               "order": 4
            },
            {
               "cast_id": 1009,
               "character": "",
               "gender": 0,
               "credit_id": "59c54ee9c3a368141e02b449",
               "name": "Nichole Romagna",
               "profile_path": null,
               "id": 1893133,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4a3bc3a36847f81c26b5",
               "name": "Ronna Gradus",
               "profile_path": null,
               "id": 1036815,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a3bc3a36847f81c26bb",
               "name": "Jill Bauer",
               "profile_path": null,
               "id": 1036816,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "59c54e21c3a368145402c625",
               "name": "Ronna Gradus",
               "profile_path": null,
               "id": 1036815,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "59c54e2cc3a368143002fa8d",
               "name": "Jill Bauer",
               "profile_path": null,
               "id": 1036816,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.415743,
      "production_countries": [],
      "id": 104732,
      "vote_count": 8,
      "budget": 0,
      "overview": "Sexy Baby is the first documentary film to put faces to a seismic cultural shift: the cyber age is creating a new sexual landscape. While doing research for the film, we had intimate and candid conversations with kids in middle school classrooms, suburban shopping malls, nightclubs, college dorms, and even conducted an informal roundtable during a high school house party. While chronicling trends among small town and big city kids, we discovered this: Having pubic hair is considered unattractive and “gross.” Most youngsters know someone who has emailed or texted a naked photo of themselves. Many kids have accidentally or intentionally had their first introduction to sex be via hardcore online porn. Facebook has created an arena where kids compete to be “liked” and constantly worry about what image to portray – much of what was once private is now made public. And the list goes on.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Sexy Baby",
      "runtime": 83,
      "poster_path": "/bvSFh9Y9w22uKSYIBl8Wy16zIFg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-04-20",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A Documentary about sexiness & the cyber age",
      "adult": false,
      "homepage": "http://www.sexybabymovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jill Bauer",
         "Ronna Gradus"
      ],
      "runtime": 84,
      "synopsis": "Sexy Baby is the first documentary film to put faces to a seismic cultural shift: the cyber age is creating a new sexual landscape. While doing research for the film, we had intimate and candid conversations with kids in middle school classrooms, suburban shopping malls, nightclubs, college dorms, and even conducted an informal roundtable during a high school house party. While chronicling trends among small town and big city kids, we discovered this: Having pubic hair is considered unattractive and gross. Most youngsters know someone who has emailed or texted a naked photo of themselves. Many kids have accidentally or intentionally had their first introduction to sex be via hardcore online porn. Facebook has created an arena where kids compete to be liked and constantly worry about what image to portray much of what was once private is now made public. And the list goes on",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2343713/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NzYxMjMxOV5BMl5BanBnXkFtZTcwMTA2OTM3Nw@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Winnifred Bonjean Alpart, Nikita Cash | See full cast and crew »"],
      "reviews": [
         "This documentary aims to explore how the Internet age has changed the present culture of sexuality and, especially, how pretty much anyone has unlimited access to pornography. The documentary profiles three disparately different females--a tweenager in NYC, a wannabe model-slash-teacher's aide in North Carolina, and an aging porn star in Florida--to explore how our information age (and with it, the freely sexualized world of Internet porn, social networking, and limited parental supervision) has affected the behavior and decisions of these women. The most affecting subject is Winnifred, the young woman raised by highly educated, very liberal, clearly wealthy parents in Manhattan... Winnie is shown at the outset as a precocious 12-year-old gymnastics star on the verge of her bat mitzvah, later shown getting ready for a Lady Gaga concert at Madison Square Garden, and at the conclusion, with a hickey given by a boy-bandish Lothario during an eighth grade class trip. Winnie is highly articulate and intelligent for her age; her parents obviously educated, open-minded and aware of the cultural climate; and her descent into full-on adolescence is fascinating and well paced, filmmakingwise, with her equally precocious and corruptive peers playing a good supporting role. Sadly, the film could have used Winnie as the sole subject and made a better argument for the point. Another subject is Nakita Kash/Nichole, an adult film star nearing the end of a successful career, earning extra cash making strip-club appearances (and with her husband, acting as an agent for other porn stars) as well as teaching pole-dancing to bored housewives. Nichole seems stable and secure in her chosen lifestyle, and the filmmakers chose to spend too much time eliciting Nichole's justifications for it, as though trying to dispel the common stereotype that all porn stars are sexually damaged drug addicts. Nichole does reveal a desire to have children, and those efforts become her storyline for the remainder of the documentary. The most pointless addition to the trifecta is the silly and vacuous \"musings\" of a wannabe model-cum-Kindergarten teacher's aide who decides to get labioplasty (surgical removal of the labia) after hearing some dudes talk about \"meat curtains.\" This chick is clearly more damaged than the porn star Nichole, in terms of her pathetic self esteem, which I guess is vaguely interesting in and of itself, but that contrast is sadly unexplored. The most interesting scene in her story is seeing her surgeon toss her actual labia onto the surgical cart. The decision to include her story was probably made prior to filming her story, and I can only imagine the filmmakers cringing at her vapidity while she was actually interviewed. I do feel this film would be very productive for parents to watch with their teenage children; despite some weaknesses, the intention is good and timely, and parents who can stomach the fleeting bits of nudity and porn images (which are sort of vital to the message) with the kids in the room, will probably get a good conversation out of the deal. I do wonder how Winnifred is doing these days...",
         "Our society is saturated with sexually charged images; shown in rapid fire edits here from television commercials to billboards and music videos, and the newest addition, the internet. A major factor is Facebook, with teens and preteens especially, posting inappropriate images at an alarming rate. Three stories of women from a twelve year old New York City girl named Winnifred, who is the centerpiece and most interesting subject of the group followed by the film makers, who also include a twenty two year old who decides that she needs labiaplasty, and a former porn actress, who at thirty eight, develops baby fever. The internet is the star here, with Winnifred changing radically, from an innocent young girl of twelve at the beginning, to a Lolita dressing fourteen by the end of the film. She is remarkably insightful, and the most compelling subject of this otherwise ordinary documentary. The surgically repaired young lady is a silly and vapid human being, and her plastic surgeon is a delusional ass****. The adult actress and mommy wannabe seems to be headed for a long and troubling future. I give it a 5/10 for Winnifred.",
         "A documentary can be excessively ideologically heavy driving home the directors point of view to an extent that it is overbearing. Then there's the opposite problem evidenced here - so what is the director proposing? Through the stories of 3 women and girls who, as the documentary points out specifically, have nothing to do with one another both demographically and thematically, the film makes the \"Captain Obvious\" point that there's a lot of talk of sex in modern media. There was much discussion of this in non-modern media as well such as, say The Holy Bible (published ~300AD) or The Kama Sutra (published originally in Sanskrit). So...your idea?...is that we should discuss it less? Not at all? Only in certain contexts? What then? The Puritans and Quakers tried to carve it out of the human experience with decidedly mixed results. If the message is muddled, are the stories interesting? Not so much. The lack of connection between the women/girls doesn't help as they drive towards no central point. The girl experiencing the Jewish right of passage to womanhood clearly is influenced far more by a very wealthy, cosmopolitan upbringing than watching Lady Gaga videos. The story of an exotic dancer trying to make ends meet pales in comparison to a brief interlude where we meet a \"banker\" (as described by the film) who wants to learn the dancer's craft - there's a far more interesting story. Finally, the \"Assistant Teacher\" seeking cosmetic surgery is no more-or-less compelling than perfectly presentable young women seeking surgery on less titillating body parts. In short, a lack of ideas and little compelling story-telling make this a slog not worth taking.",
         "The documentary essentially highlights 3 separate examples of how feminism degrades American society. A porn star wanting to reproduce, a developing hussy, and an insecure hussy (an ASSISTANT kindergarten teacher, if that displays her intellectual prowess)speak for three generations of failed social engineering. American women MUST watch this documentary. It will answer why American women are undesirable and why marriage is a coin toss now. The parents of the younger hussy are the shining examples of what liberalism is doing to American society. The father is an enabler, and the mother (who is an attorney social justice warrior)boasts that she wears fish nets to closing statements and depositions. As if it is everyone else's fault that she cannot get taken seriously. The highlight of this garbage documentary is when the little hussy goes to a lady gaga concert and a slew of 12 year old girls are walking in public wearing prostitute attire. Way to go feminism."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Two to Tangle Productions"],
      "summaries": ["An ex adult film star, a 12 year old girl and a 22 year old who yearns for \"normal\" private parts are chronicled in this thought provoking doc about how porn, social media and pop culture affect women and girls. A FilmBuff Presentation."],
      "budget": 0
   },
   "movielensId": 99417,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-04-20",
      "dvdReleaseDate": null,
      "directors": [
         "Ronna Gradus",
         "Jill Bauer"
      ],
      "runtime": 83,
      "movieId": 99417,
      "title": "Sexy Baby",
      "mpaa": "",
      "actors": [
         "Winnifred Bonjean Alpart",
         "Jennifer Bonjean",
         "Ken Alpart",
         "Nichole Romagna",
         "Nichole Romagna"
      ],
      "imdbMovieId": "2343713",
      "originalTitle": "Sexy Baby",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["JeD_RztXeko"],
      "plotSummary": "Sexy Baby is the first documentary film to put faces to a seismic cultural shift: the cyber age is creating a new sexual landscape. While doing research for the film, we had intimate and candid conversations with kids in middle school classrooms, suburban shopping malls, nightclubs, college dorms, and even conducted an informal roundtable during a high school house party. While chronicling trends among small town and big city kids, we discovered this: Having pubic hair is considered unattractive and “gross.” Most youngsters know someone who has emailed or texted a naked photo of themselves. Many kids have accidentally or intentionally had their first introduction to sex be via hardcore online porn. Facebook has created an arena where kids compete to be “liked” and constantly worry about what image to portray – much of what was once private is now made public. And the list goes on.",
      "tmdbMovieId": 104732,
      "avgRating": 2.64286,
      "releaseYear": "2012",
      "numRatings": 14,
      "posterPath": "/bvSFh9Y9w22uKSYIBl8Wy16zIFg.jpg"
   }
}