{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1811315",
      "video": false,
      "title": "FDR: American Badass!",
      "recommendations": [
         332312,
         270064,
         257353,
         70576,
         44250,
         51831,
         23515,
         72843,
         411805,
         129798,
         159638,
         270851,
         137756,
         28640,
         92391,
         140750,
         40770,
         22573,
         45773,
         69326
      ],
      "backdrop_path": "/lgFhFuObcKVT2LSvwNO3ONJwTkG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "FDR",
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e0025",
               "name": "Barry Bostwick",
               "profile_path": "/z2jlL5g5PMxelSHMXFF03fTSsLl.jpg",
               "id": 13473,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Louis",
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e0029",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Eleanor Roosevelt",
               "gender": 1,
               "credit_id": "52fe4a2b9251416c750e002d",
               "name": "Lin Shaye",
               "profile_path": "/erD3UM1YDkRS46D3XkhTSNXtRyg.jpg",
               "id": 7401,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Douglas MacArthur",
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e0031",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cleavon Buford",
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e0035",
               "name": "Ross Patterson",
               "profile_path": "/3Qd6FIEjAoakyFpgm4e0wxrzvzP.jpg",
               "id": 77809,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marietta Buford",
               "gender": 0,
               "credit_id": "52fe4a2b9251416c750e0039",
               "name": "Keri Lynn Pratt",
               "profile_path": "/qLrUKUM4GEzCuq5VTUFQNaJOB3Z.jpg",
               "id": 77803,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Officer Nguyen",
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e0043",
               "name": "Matthew Moy",
               "profile_path": "/b6I500CFqDZmMgWbfaUwKvQBGL.jpg",
               "id": 1254625,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Abe Lincoln",
               "gender": 2,
               "credit_id": "57b92bc6c3a36860c40031d3",
               "name": "Kevin Sorbo",
               "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg",
               "id": 51965,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Ellington",
               "gender": 2,
               "credit_id": "58413b22c3a36865c9004f66",
               "name": "William Mapother",
               "profile_path": "/dEfuqLZOo5YfPcOJUftPq1q3hFL.jpg",
               "id": 15338,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mussolini",
               "gender": 2,
               "credit_id": "58413b369251417d50005064",
               "name": "Paul Ben-Victor",
               "profile_path": "/80xWsGSGwTektmHd9xcPdqeOmlI.jpg",
               "id": 85142,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Adolf Hitler",
               "gender": 0,
               "credit_id": "58413b569251417d62004fe6",
               "name": "Jesse Merlin",
               "profile_path": null,
               "id": 1444653,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Curtis",
               "gender": 2,
               "credit_id": "58413b649251417d4d004f0c",
               "name": "Ahmed Best",
               "profile_path": "/kBblb0GZjqN3W1VcJ2J5IkC7Qg3.jpg",
               "id": 33197,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Vincent Vecchio",
               "gender": 2,
               "credit_id": "58413b6ec3a36865af005c61",
               "name": "David Quane",
               "profile_path": null,
               "id": 59193,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Nurse",
               "gender": 2,
               "credit_id": "58413b7f9251417d590051ec",
               "name": "Cherise Bangs",
               "profile_path": "/qNIBeiQaAlObNt9tHp9fOwdnx6a.jpg",
               "id": 1610309,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "George",
               "gender": 2,
               "credit_id": "58413ba8c3a36865bb0050f9",
               "name": "Deon Richmond",
               "profile_path": "/edx02xKeswZCSHcpmNZFHnUURmU.jpg",
               "id": 35596,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a2b9251416c750e0021",
               "name": "Garrett Brawith",
               "profile_path": "/vKhNav7Ifa7YazmntOQYcB8ShNP.jpg",
               "id": 149793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a2b9251416c750e003f",
               "name": "Ross Patterson",
               "profile_path": "/3Qd6FIEjAoakyFpgm4e0wxrzvzP.jpg",
               "id": 77809,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.770597,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 99223,
      "vote_count": 18,
      "budget": 0,
      "overview": "Chronicles the adventures of Franklin Delano Roosevelt, as he rides a \"wheelchair of death\" to stop the world from being taking over by polio-carrying werewolves during WWII. A deadly menace that are led by Werewolf Hitler, Mussolini and Emperor Hirohito.",
      "similar": [],
      "original_title": "FDR: American Badass!",
      "runtime": 93,
      "poster_path": "/hZuC8Y30mYxnmfw7CvmvxN7D4C8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-09-24",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Garrett Brawith"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Ross Patterson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1811315/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5ODE3OTU0NV5BMl5BanBnXkFtZTcwMzg1MTEzOA@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Barry Bostwick, Lin Shaye, Bruce McGill | See full cast and crew »"],
      "reviews": [
         "I saw a screening of this in Portland and it is seriously one of the funniest films ever made. It reminded me of Airplane or Naked Gun. Partly because Barry Bostwick turns in a Leslie Nielson-esque performance, and more importantly, you believe him in the role of FDR. Don't get me wrong the dialogue is out of control and everything is played over the top, including the effects and werewolf costumes, but the cast seems to revel in it and act it out as if the words were Shakespeare. The surrounding cast around Bostwick really rose to level that he was playing his character, especially Ray Wise, Bruce McGill, and Ross Patterson. The filmmakers manage to pull off the low budget aspect and use it to bolster the film, so much so, that it seems like it was specifically written for that type of vibe. The film itself is extremely crass and involves blatant racism, but no one is safe from it. I for one LOVED this film and think it has the potential to be an instant cult classic, but I'm sure some people will be offended.",
         "From the outset this film looks cheap and you might consider not bothering to watch it based on that but if you stick with it the great cast suck you into it's unbelievably ridiculous world. Barry Bostwick's performance Carry's the film. There's a lot of modern street talk that he manages to pull off, even though some of it is borderline to silly but at the same time he turns in some great speeches that would be worthy of a far more serious film. There's not much point in explaining the film, it's far to daft to attempt an explanation but it works, that's mostly down to the cast, the production, direction is excellent too, given the low budget nature of the film they made the most of what they had.",
         "Alright so I saw this movie and it was absolutely ridiculous! As in crayz hilarious! FDR was sooooo nuts in this movie it was hilarious, just imagine Abraham Lincoln Vampire Hunter, but Scary Movie style. FDR the Werewolf Hunter! Not to mention that had these great cut scenes with Hitler, Mussolini, and Hirohito as Werewolves! FDR is kickin werewolf ass in a supped up Wheelchair with silver bullet machinegun wheels and rocket launchers! What really made me think of Scary Movie was the very Slapstick and sexualized jokes that were in the whole film. It also didn't mind using jokes about black people in the 1930s and 40s or some marijuana in the white house. FDR even has a stoned dream of flying with Abe Lincoln! It's hilarious! What's also funny is that they make FDR use a lot of hip hop lingo and speak over the radio as if he was a DJ, \"You're listenin to the Delan-O!\" What made the film work was that it knew it was ghetto and tried to be, and that ghettoness was what made it soooo funny! I really enjoyed it and I think if people like the Scary Movie style films that should totally check this out, it was a great spoof knock-off!",
         "My brother told me of a movie once about a Vietnam vet turned poolboy who has to take on a rival Mexican gang of pool-cleaners, and I thought, \"genius\". Quite frankly, it was. From the same team that brought you \"Poolboy: Drowning Out the Fury\", comes an equally outrageous concept of a story. Franklin Delano Roosevelt gets polio from a werewolf attack and becomes determined to stop the Nazi werewolves and end the second world war for good. FDR, played by a hysterical Barry Bostwick, gets polio from a werewolf. First off, the introduction of werewolves automatically tells you this movie will be very profound and dramatic. From a biographically standpoint, the events in the movie are very true to source. The story is a highly accurate telling of his rise to power, presidency, and war politics, but the real impressive aspect of this film is its attention to detail. The characters can seamlessly spout off lines of cocky socky comic genius and exploit themselves endlessly until the movie really just *ends* abruptly, with a climax so unforgettable, you wont be able to remember what happens in it. The humor is crass, politically incorrect, and inversely subversive, so fans of bad movies should definitely hear it hitting the right notes. The narrative flows awkwardly steady, and the payoff is unimaginable, but what helps this movie entirely is the production design. John Waters once said his favorite movie idea \"is to do a movie where everything's fake; the trees, the grass, even the sun\", and that always described how I felt my life would be like if I were in a TV show from the heyday of America. It just seems funny to me, so in comes a movie that looks like it was shot entirely in a studio, and everything from the story to the characters to the dialogue and effects, just seems so consumingly fake, that it's incredible. Nothing in this movie can be taken seriously, and they just flat-out don't care. They had a funny idea and ran with it, exploiting FD Roosevelt for all his worth, and how he's a true American hero, regardless of anything he's ever done in \"real life\". Now this may not be the \"best\" movie in the world, but by all means, it *is*, and to have a movie where FDR freestyles, men whore out their wives, black people play slaves, Nazi werewolves gossip anti- climactically, Japan continually gets made fun of, and Kevin Sorbo manifests as a cannabinoidally-induced Abraham Lincoln adviser... then you really can't go wrong with a movie that took an under-appreciated ex-president and turns him into a new-found American B.A. The man. They myth. The Delano'saurus. Franklin Delano Roosevelt. And his jiggly polio legs that look like, and *are*, a complete joke. After all, isn't that what America is?",
         "Nobody expected this movie to be high art. But it was enjoyable. There was the historical sacrilege and the jokes in bad taste and historical figures saying dirty words. But there was also real cleverness and, most importantly, a real love that shone through the film. Nobody involved was phoning it in. It seems like everyone involved in making this movie was having fun, and you couldn't help but have fun along with them. I had a friend over, we cued it up, and laughed quite a bit. And in a year, I will have forgotten about it. If you are offended by jokes involving racist / sexist stereotypes, you might want to give this one a miss.",
         "At first I thought this would be funny. The premise gave the clear impression that it would be a great spoof. Then I started to watch it. I laughed a bit admittedly as much because seeing FDR drop \"F\" bombs caught me off guard, but didn't find myself in hysterics over it. I was tired, I went to bed. This morning I went back just a bit before I left off. I looked at this movie in a whole new way. I turned my brain off and found myself really getting a kick out of this. I didn't look at it as a cheap low budget movie that was trying too hard, but instead saw it for what I believe it is, a brilliantly acted and written movie that isn't trying too hard, but trying just enough to LOOK like a cheap low budget \"B\" movie. Now and then I forget that if a movie is made to LOOK like a cheap BAD movie, it's accomplishing the goal so well, you believe that's exactly what you're watching and you don't see the tongue planted firmly in the cheek. I missed that last night but saw it plain as day this morning. This movie is FUNNY if you just pay attention without really thinking it through too much. Yeah, I just confused myself, but I stand by all that. Barry Bostwick does a bang up job as does his supporting cast, all of whom are some of the best character actors out there. Anyone who watches this and finds themselves disappointed should do as I did, watch it again with a different outlook and odds are, you'll appreciate this insane masterpiece as many of us have. Now I think I may have to go back and watch this from the beginning again!",
         "the film is bad but that's what makes it so brilliant, its funny, everything about it is wrong, but so right. B movies at its finest OK this is not a very informative review, but i am not just a regular guy who liked this film so much it deserved praise. are some of you going to hate it? - YES, but then this genre probably doesn't appeal to you anyway, so why are you reading the review. and for the rest of us, grab a beer, a few mates and prepare to be taken on a journey A long time ago in a galaxy far, far away... ohh wrong film :) wow they want me to write ten lines before i can submit this. so i am adding extra words i think will described this film. Beer, food, werewolf silver bullets, funny as in wet your pants funny, ohh and to point out the out of some equipment used is even funny, especially when Franklin Delano Roosevelt get his first wheelchair and its old and wooden, and the little kid comes in with his modern aluminium wheelchair with blankets on (see what i did there, i added Franklin Delano Roosevelt's middle name so it would make more words so i could get to 10 lines :)",
         "Easily one of the best comedies I've seen in a while. If Airplane and Abe Lincoln Vampire Hunter had a crack baby it would be this movie. Unlike some of the more recent spoof type movies that have come out (Epic Movie, Vampires Suck) this one is actually clever and has some balls. What makes it even better is it's historical theme. Franklin Roosevelt, the president who led us out of the great depression, gets wasted, sleeps with his assistants and kills Nazi Werewolves all in an impressively tricked out wheelchair. A werewolf Hitler, Mussolini and Hirohito all make hilarious appearances as well. Barry Bostwick is brilliant in his role as FDR and reminded me of the great Leslie Nielsen. Yes this movie is over the top and ridiculous but it will have you laughing the whole time and that's all that really matters. I definitely recommend checking it out if you get the chance. By the way, just a friendly tip, the consumption of alcohol and/or marijuana may enhance your viewing pleasure.",
         "This movie is brilliant. The score is low on IMDb right now, but it will rise over the years. Let's label this a future cult classic. The cast is brilliant. The script is brilliant. It's over the top and into the wtf ever land. Sure it's playing off the alternate time line craze, but it's spoofing the living dookie out of gangsta mentality/American history/and Lincoln Vampire Hunter and it does it at a Naked Gun level of professionalism. I gave it a 9 because it made me laugh and laugh hard. It does it's job and does it beautifully. This is FDR versus the wicked werewolves of Germany, Italy, and Japan. He talks crap, he rolls in a pimped out super wheel chair and smokes super weed with the ghost of Lincoln. What more do you want? If you love the Chappelle Show, Naked Gun, I'm Gonna Get You Sucka or movies like that...Watch this NOW. If you like what Hollywood has to offer for comedy you'll probably miss the joke. Thug Life.",
         "I admit that I didn't watch the film to the end. I just couldn't. They lost me when they watched the election results and Eleanor draped her bra in front of her while his (son?) pooped in a jar. Is this the filmmakers understanding of humor? Up to that episode of the film, there was really not a thing I could have called funny (which was what the film is supposed to be, I think). The story is so unthinkable (FDR bitten by a Werewolf who turns out to have a swastika on his belly and carries Mein Kampf, Hitler's piece of prose, please, give me a brake). The only strong point of the film, if you would like to call it that, is the strong language used by the majority of the actors, but is rather quite misplaced and unnecessary."
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": [
         "A Common Thread",
         "Street Justice Films"
      ],
      "summaries": ["An outrageous, over-the-top spoof, FDR: American Badass is the untold true story of our country's greatest monster-hunting president!"],
      "budget": 0
   },
   "movielensId": 99478,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-09-24",
      "dvdReleaseDate": null,
      "directors": ["Garrett Brawith"],
      "runtime": 93,
      "movieId": 99478,
      "title": "FDR: American Badass!",
      "mpaa": "R",
      "actors": [
         "Barry Bostwick",
         "Bruce McGill",
         "Lin Shaye",
         "Ray Wise",
         "Ross Patterson",
         "Keri Lynn Pratt",
         "Matthew Moy",
         "Kevin Sorbo",
         "William Mapother",
         "Paul Ben-Victor",
         "Jesse Merlin",
         "Ahmed Best",
         "David Quane",
         "Cherise Bangs",
         "Deon Richmond"
      ],
      "imdbMovieId": "1811315",
      "originalTitle": "FDR: American Badass!",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["rs2m2DJybD4"],
      "plotSummary": "Chronicles the adventures of Franklin Delano Roosevelt, as he rides a \"wheelchair of death\" to stop the world from being taking over by polio-carrying werewolves during WWII. A deadly menace that are led by Werewolf Hitler, Mussolini and Emperor Hirohito.",
      "tmdbMovieId": 99223,
      "avgRating": 2.1,
      "releaseYear": "2012",
      "numRatings": 10,
      "posterPath": "/hZuC8Y30mYxnmfw7CvmvxN7D4C8.jpg"
   }
}