{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "samurai",
            "id": 1462
         },
         {
            "name": "japanese culture",
            "id": 10564
         },
         {
            "name": "based on manga",
            "id": 13141
         },
         {
            "name": "meiji period",
            "id": 230462
         }
      ],
      "imdb_id": "tt1979319",
      "video": false,
      "title": "Rurouni Kenshin",
      "recommendations": [
         221731,
         221732,
         25664,
         82469,
         24889,
         19635,
         32654,
         42341,
         195276,
         204553,
         36681,
         32249,
         13311,
         32213,
         25716,
         18060,
         32163,
         254672,
         16404,
         160704
      ],
      "backdrop_path": "/6cf1HWR2KF68zTwYIlcOscStMHn.jpg",
      "revenue": 61700000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Kenshin Himura",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718a5",
               "name": "Takeru Satoh",
               "profile_path": "/8GJ849GQ9eHCLfsRj026JUVaqJC.jpg",
               "id": 230659,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Kaoru Kamiya",
               "gender": 0,
               "credit_id": "52fe4afdc3a368484e1718a9",
               "name": "Emi Takei",
               "profile_path": "/9kHDikAYFt234AYlSZzd4ebU3yZ.jpg",
               "id": 1084910,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Udo Jine",
               "gender": 0,
               "credit_id": "52fe4afdc3a368484e1718ad",
               "name": "Kôji Kikkawa",
               "profile_path": "/2BUEmCj5YeJaGQZniH4LgIT8ycu.jpg",
               "id": 148288,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Megumi Takani",
               "gender": 1,
               "credit_id": "52fe4afdc3a368484e1718b1",
               "name": "Yu Aoi",
               "profile_path": "/sXgvUK8uWJ4xCxA9Oklapm08DPJ.jpg",
               "id": 84028,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sanosuke Sagara",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718b5",
               "name": "Munetaka Aoki",
               "profile_path": "/14IAuejjPtOAyFHhkoPrBvSokQk.jpg",
               "id": 111640,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Gein",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718b9",
               "name": "Go Ayano",
               "profile_path": "/Ap5IuncBMYnABsvkEtsdoM92VTh.jpg",
               "id": 1084911,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Banjin Inui",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718bd",
               "name": "Genki Sudo",
               "profile_path": "/wxxB80ODA3IhlzlgGJo8MSYPcRi.jpg",
               "id": 86145,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Yahiko Myojin",
               "gender": 0,
               "credit_id": "52fe4afdc3a368484e1718c1",
               "name": "Taketo Tanaka",
               "profile_path": "/8dje8nhBZPSEVzk8awZn5y5NYh5.jpg",
               "id": 1084912,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Aritomo Yamagata",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718c5",
               "name": "Eiji Okuda",
               "profile_path": "/phgV64iDNJ4x673CYLHK9aaNFii.jpg",
               "id": 72389,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Hajime Saito",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718c9",
               "name": "Yosuke Eguchi",
               "profile_path": "/5DI9Iyco1MpaRcVjhUMm5FV5TSN.jpg",
               "id": 55784,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Kanryu Takeda",
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718cd",
               "name": "Teruyuki Kagawa",
               "profile_path": "/pCOQFnFHPDCtSuYmMT3Q24Yf0SE.jpg",
               "id": 46691,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e17188f",
               "name": "Keishi Otomo",
               "profile_path": null,
               "id": 1084905,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e171895",
               "name": "Nobuhiro Watsuki",
               "profile_path": "/7lbJmd2HxkgZQYqots715TP0HFa.jpg",
               "id": 1084906,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4afdc3a368484e17189b",
               "name": "Kiyomi Fujii",
               "profile_path": null,
               "id": 930652,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4afdc3a368484e1718a1",
               "name": "Keishi Otomo",
               "profile_path": null,
               "id": 1084905,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "581f689ec3a36855630010e3",
               "name": "Naoki Satô",
               "profile_path": null,
               "id": 1537405,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 8.794792,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 127533,
      "vote_count": 200,
      "budget": 0,
      "overview": "Former legendary assassin Kenshin Himura has now become a wandering samurai. Offering aid & protecting those in need as atonement for his past deeds. During this time Kenshin Himura comes across and aides Kaoru Kamiya (Emi Takei). Her father opened the Kamiya Kasshin-ryu, a kendo school located in Tokyo and Kaoru is now an instructor there. Kaoru then invites Kenshin to stay at her dojo. Their relationship develops further, but Kenshin is still haunted by his violent past ...",
      "similar": [
         221732,
         58857,
         64686,
         351460,
         16859,
         346,
         616,
         390734,
         372058,
         9323,
         221731,
         4935,
         8392,
         129,
         51739,
         313297,
         128,
         378064,
         430447,
         81
      ],
      "original_title": "るろうに剣心",
      "runtime": 134,
      "poster_path": "/rmBUaljPj6SJVArR68fHl41oJU4.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Studio Swan",
            "id": 10765,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "RoC Works Co.",
            "id": 10766,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2012-08-25",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": "/jqmQLcdn3aEyc30nesZn7qixfoP.jpg",
         "name": "Rurouni Kenshin Live-Action Collection",
         "id": 247028,
         "poster_path": "/yBYLuwZ1zbRBEKaZmwiThsEqUbC.jpg"
      },
      "tagline": "The Journey Begins",
      "adult": false,
      "homepage": "http://wwws.warnerbros.co.jp/rurouni-kenshin/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Keishi Ohtomo"],
      "runtime": 134,
      "synopsis": null,
      "writers": [
         "Nobuhiro Watsuki",
         "Kiyomi Fujii"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1979319/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMzQyMDU0OV5BMl5BanBnXkFtZTgwNDg1MjI5MTE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Takeru Satô, Yû Aoi, Emi Takei | See full cast and crew »"],
      "reviews": [
         "First off - many of the reviewers thus far seem to be comparing this movie adaptation to \"Samurai X\" instead of its source material which is the manga. What they must realize is that \"Samurai X\" was an OVA created for western audiences done by people who had no connection with the manga or the original anime and thus was a departure from the original intent and feel of what the creator of the manga had in mind. He even disagreed with how \"Samurai X\" ended regarding the fate of Kaoru and Kenshin, so much so that he insisted on having the proper ending he envisioned for his own characters put into a collector's box edition of the original anime released in Japan. Even though it was gorgeously rendered, it was overly depressing and moody. Whether you want to believe it or not, Kenshin really wasn't that way. The whole point of his redemption was that, in spite of the pain of his past, he was still able to appreciate the simple joys in life and even laugh at things. The Kenshin in \"Samurai X\" was a somber, overly-wrought, super-tortured fellow who was awash with his own suffering. As a fan of RK, seeing him portrayed that way in \"Samurai X\" really broke my heart because a huge chunk of his personality went missing and all that was left was this emo dude. Onto the review: PLOT/STORY: Understandably, this movie had a hard time trying to capture everything in the first volume of the manga in just over two hours. Because the manga was continuous, there was no way for the movie to be cut and dry in terms of villains and side characters. The director had to draw the line somewhere so the movie could have an ending. So, many fan favorite scenes were cut or changed in order to accommodate a more fluid movie. Time constraints didn't allow for a deep fleshing out of all the characters but, since this the first installment of other movies to come (it has been greenlit as a continuing series) I suspect that the audience is going to be exposed to that over time. I was taken aback at just how many things were changed (Sano's intro, Jin'e's concocted connection to Kanryu, Hanya's choice of weapons, the Oniwabanshu but no Aoshi?!) but I felt they did their best to stay true to the spirit of the story by trying to streamline events. There is even a flashback scene of Kenshin's past included in this movie but it gave you a hint (just a hint) of his tortured past and leaves you wondering. ACTORS: The casting was very well done for this movie. Kenshin is supposed to be relatively diminutive and almost feminine in his looks and stature (the creator based him on an actual historical figure who could carry out assassinations in broad daylight, he was that good), which is why people always underestimated him in a fight or commented on his slight figure. He was a Jekyll and Hyde that way. He could go from unassuming, humble Rurouni to out-and-out killer who's eyes would change into a murderous gaze when the \"hitokiri\" side was provoked (straight outta the manga). You could say Kenshin can \"hulk-out\" lol. Sato, with his pretty looks and physicality, really did well in portraying the conflicted character of Kenshin. Emy was cute as a button, perhaps too cute, since Kaoru is supposed to be a bit more plain and a tomboy but it was satisfying to see her bickering with Yahiko. The kid playing Yahiko was spot-on with the brashness and stubborn pride. Sanosuke's portrayal was a little goofy. There is no allusion to what drives Sano into being a fighter for hire but read the manga for clarification and you will see why he and Kenshin create such a strong bond of friendship. In the movie, there was no time to do so, I guess and Sano's a lot tougher than he is portrayed. Megumi's actress did her justice, I think. Again, not too deep in fleshing out her past either but still, you can see her intelligence and intensity underneath her manipulations. Lastly, Saitou's actor was awesome. He captured the cold, brutal carriage of the Wolf of Mibu very well with his stoic face and the constant badgering of Kenshin. I will stop at the main characters or else this will be too long. All in all, the casting was superb. MUSIC AND CINEMATOGRAPHY: The music ranges from fairly modern (techno beats with tribal vocals) to standard orchestral. I don't remember hearing any traditional Japanese instruments being played over scenes but I could be mistaken. Sometimes the music seemed to be out of place or over-used. For example, dramatic fight scenes seemed to bring out that techno song again and again). A part of me wishes they had somehow incorporated Kenshin's theme from the original anime series; just s simple wooden flute part or something as a nod since it's so recognizable. Otherwise it was fine. The look of the movie is fantastic. Whether it's a war-torn forest or just a village scene or a shot of Kaoru's dojo, it looks thick and substantial. I remember seeing shots of the creator of the manga (Nobuhiro Watsuki) on the set of the movie and watching over the set building. It gave me great comfort that he was there to see it through. Overall, this is one of the best, if not THE best, live-action adaptations of a manga I've yet seen. For those of you who are going to see it, if you haven't read the manga yet it certainly isn't required in order to enjoy the movie but it was thoroughly more enjoyable to see these beloved characters come to life on screen. In any case, I am greatly looking forward to the next installment and will relish in trying to figure out what storyline is going to be featured next!!",
         "In 1868, after the end of the Bakumatsu war, the former assassin Kenshin Himura (Takeru Sato) promises to defend those who needs without killing and wanders through Japan with a sword with inverted blade during the transition of the samurai age to the New Age. When Kenshin helps the idealistic Kaoru Kamiya (Emi Takei) from the gangsters of the powerful opium drug lord Kanryuu Takeda (Teruyuki Kagawa) that wants her school for his production of opium, Kaoru invites Kenshin to stay in the school. But the drug chemist Megumi Takani (Yû Aoi) escapes from Kanryuu and seeks shelter in the school. Meanwhile the killer Battosai is murdering police officers and leaving messages attached to their bodies. When the cruel Kanryuu poisons the population to get the school, and Kenshin and the street fighter Sanosuke Sagara (Munetaka Aoki) join forces to attack their common enemy. \"Rurôni Kenshin: Meiji kenkaku roman tan\" is an excellent samurai movie with spectacular choreography of the fights and a good story. I have just learned that it is based on a manga and I really liked a lot. I saw this movie in the airplane and unfortunately my flight arrived and I did not see the conclusion of the story. The worst thing is that I will have to wait since this movie has not been released in my country yet. My vote is nine. Title (Brazil): Not Available Note: Fortunately Internet does exist and today (30 December 2012) I have just finished watching this awesome movie again, this time until the very end.",
         "When I was a teenager, I used to love watching the highly-popular anime series called Samurai X (an international title otherwise known as Rurouni Kenshin in its native Japan) back in the late 1990s. Now, over ten years later, writer-director Keishi Otomo finally brings RUROUNI KENSHIN to life. At first, I was doubtful whether a live-action adaptation from such a popular manga can live up to its high expectation since most like-minded movie like this always ends up as a rip-off. But thankfully, fans of the anime/manga series will be (mostly) satisfied the way this first live-action adaptation of RUROUNI KENSHIN has turned out admirably. The movie opens briefly on a gritty battlefield in 1869 during the battle of Toba-Fushima, where a young samurai named Hitokiri Battosai (Takeru Sato) almost single-handedly defeated a score of enemies. He walks away from the battlefield as the Empire is finally declared victory and thus a new era has born. Ten years later, Battosai becomes a wanderer and now calls himself as Himura Kenshin. He vows himself not to kill people anymore and even carries a reverse-edged sword. He arrives in a countryside of Japan and subsequently meets Kamiya Kaoru (Emi Takei), the owner of a fencing school used to run by her late father. After Kenshin manages to save her from getting killed by a fake Battosai named Jin-e (Koji Kikkawa) and also helps her to stop a group of thugs trying to take over her dojo, he moves in with her. Apart from them, Kaoru also has an orphaned boy named Myojin Yahiko (Taketo Tanaka) who happened to be her only student. Meanwhile, Jin-e is actually a hired ex-samurai who works for a wealthy businessman named Kanryu Takeda (Teruyuki Kagawa). Takeda is also a notorious criminal who runs a huge opium operation. Megumi (Yu Aoi), who is being forced to make opium, manages to escape from his mansion and subsequently seeks shelter at Kaoru's dojo. Things get worse when a number of innocent people around the countryside are suffering from rat poison in the community wells, but luckily Megumi, who used to be a healer, manages to cure them with sufficient medication. She knows that this is the work of Takeda, and prompts her to return to his mansion so she can kills him. However, she fails to do so and ends up being a hostage. To save Megumi, Kenshin and his newfound friend, Sagara Sanosuke (Munetaka Aoki), who was a street brawler, make their way to Takeda's mansion and settle the matter once and for all. Most of the cast are spot-on excellent. Takeru Sato is excellent as the titular character and he certainly looks the part fans have to use to see him in the anime series -- his trademark red-haired and long ponytail, curvaceous lips, wide eyes, his outfit and even the way he runs, jumps and draws his sword. Not only that, fans will also be delighted with Sato's signature delivery, \"oro?\" as well. As the street brawler Sagara Sanosuke, Munetaka Aoki carries that familiar rough-and-tumble attitude effectively, while Teruyuki Kagawa is gleefully over-the-top as the villainous Kanryu Takeda. The rest of the supporting cast are equally captivating -- ranging from Yu Aoi, Koji Kikkawa and even Taketo Tanaka. The only (slight) disappointment is Emi Takei as Kaoru. Her character is supposed to be a tomboy-ish type, but yet she is too pretty to pull off the part convincingly. Most of the time you'll see her more of a damsel-in-distress than a so-called tough vixen she meant to be. RUROUNI KENSHIN is particularly noted for its impeccable technical values here. It is clear that Keishi Otomo has poured his heart to make this live-action adaptation as stunning as possible. The art direction and costume design are perfectly detailed, while Takuro Ishizaka's lush cinematography is right on target. The action sequence is also top-notch. The sword-fights choreography is fast and furious, yet it's well-staged with an adequate help of elegant slow-motion. The particularly final 30 minutes is downright entertaining -- Kenshin vs. Gein (Gou Ayano), the masked ex-samurai; Sanosuke vs. Banjin Inui (Genki Sudo) in a brutal fisticuffs; and of course the final sword-fight between Kenshin and Jin-e in a forest. Added to the excitement is Naoki Sato's energetic score which often gives the already well-choreographed action scenes a much-needed kinetic boost. The movie has its flaw, though. Clocking at over two hours long, the story feels laborious at times, especially in the middle section. At the same time, the movie is a bit overlong as well. But such flaw is forgivable because RUROUNI KENSHIN manages to accomplish a rare feat for being a highly-satisfying, Japanese live-action adaptation I've ever seen so far.",
         "Lets get this out of the way: Im no kenshin fanboy. I've read the manga and have watched the anime. That's it. So when I heard about a live action movie I thought 'Oh my god'. Uwe Boll-like crap induced horror scenarios crossed my mind. But what a pleasant surprise. They haven't cocked it up. In fact, they did a pretty damn good job of making the manga come to life. STORY The story is basically the first 2 arcs of the manga mixed up and slightly changed to fit into a 2 hour movie. It's pretty good. nothing too fancy but it works and doesn't bore. EFFECTS & CHOREOGRAPHY No. Bleeding. CG. Like, none. everything you see is done by real humans. thank god there are still directors who know their stuff. a rope helps here and there but nothing as stupid as Crouching Tiger, Hidden Dragon. there was but 1 instant in the entire movie where a move looked slightly 'unnatural'. You'll know what I mean when ya see it. the fights are simply awesome. real swordfights and at speeds that make your eyes go 0_o. slick moves, smooth as silk with a great pace. and the occasional brawling, courtesy of Sanosuke. the action is top notch. some of the best, if not -the- best sword fight scenes I've ever seen. ACTING The characters are all portrayed as they should be. there is no crappy acting. Kanryu is slightly over-acting but I guess it kinda fits his character anyway. solid acting all over. some dayplayers in the background seem to have been given little instructions of what to do at times though, it seems. they sometimes look rather lost or keep repeating the same motions. but no matter. you wont notice unless you re nitpicking. OVERALL The entire movie has a slightly 'cartoonish' feel over it. the way people talk, the way they move. but it still all seems very natural and appealing. The music is very nice as well. no tunes from the anime, but some nice original scores that fit the bill. all in all this movie is what so many game/anime-turned-movies should have been. It's well made, with good actors, good music and it doesn't bore you for a second. Word has it there will be a sequel. if it can rival the quality of this movie, Ill be back for part 2.",
         "I have heard of \"Samurai X\" but I have not really read the manga or seen any of anime about this character named Himura Kenshin. This live action movie had come with very high recommendations or else I may have just given this a pass. I am glad I made time for this movie. Himura Kenshin is an assassin of the highest skill during that transition between the Imperial/Samurai Age and the New Age adapting Western practices. After a particular assignment plants in him a massive guilt-trip, he decided to \"disappear\" and become a wanderer, using his fighting skills to defend the helpless WITHOUT KILLING. In this story, Kenshin meets and helps a young lady named Kaoru, whose fencing school was vandalized. They then get entangled in the affairs of a notorious ruthless drug dealer Kanryu Tanaka, when his drug chemist Megumi escapes and seeks shelter in Kaoru's school. On top of all this, there is a mad killer on the loose with mad sword skills calling himself the Battosai, a title bestowed on Kenshin in his murderous past which he would rather disown. With all of these stories and more that the movie tries to tell, the running time is about two hours. However you will not feel the time at all as you get enthralled by the fantastic look of the movie and its spectacular fighting scenes. Either with sword, bare hands or firearms, the fights were choreographed with excitement. The cinematography, color palette and visual effects were impeccably executed. I did not know how the anime drawings of each character before I watched, so I could not comment on that. It is sort of odd looking that with lead actor Takeru Sato, a highly skilled sword fighter looks so androgynous. Afterwards we see that he really does look like that in the anime series. So did the cute Emi Takei (as the feisty Kaoru), Munetaka Aoki (as the rash and brash street fighter Sanosuke)or even Yosuke Eguchi, the samurai turned police chief Hajime Saito. As someone who had no prior knowledge about Samurai X, I was completely taken by this very good-looking film, enough that I may even seek out the animated TV series. This is highly recommended for fans of historical fiction and Japanese culture. Catch it only in SM Cinemas, as this is being locally shown exclusively there.",
         "I went to see this film last night with absolutely no knowledge of the manga upon which it was based, which was both a good and a bad thing. Good, because I understand how the average movie goer like myself will feel about this film. Bad, because I feel like as a fan of the original comic, I would have taken a lot more out of this film. I'll start with the positives - this movie is beautifully filmed. There is not a single unattractive shot within it. I really feel like this movie was made for fans, by fans, because it is so lovingly crafted. The sets are gorgeous, the lighting and colour palette lovely, and the choreography of the fight scenes? FUN. It's actively enjoyable to watch Kenshin dance around with his sword. You actually believe that he is this extraordinary swordsmen, agile and swift. Which brings me to Sato Takeru, who plays Kenshin himself. Again, I feel like he was a fan of the series, as he seems to be so invested in the role. I've no idea what the character of Kenshin was like in the manga, but Sato's portrayal is so layered and believable, I can't imagine it strays far. On that note, I felt like all of the actors did quite a good job. I've a friend who assures me the personalities of all the female characters do not line up with the manga, but I was actually completely satisfied with them! I was particularly enamored with Aoi Yu (whom I don't think has ever disappointed me in a role) who did her best with the script given to her in the role of Megumi. But this brings me to what I felt were the weak points of the film. First, was the over inclusion of bit characters. I said this to friends afterwards, I'm sure if I was a fan of the series they would have been charming cameos from beloved fan favourites. As it is though, to me their inclusion seemed pointless, and stole time that could have been better spent on plot development. And honestly, the plot for the film? A bit weak, and never properly fleshed out. A lot of characters who seem important to the story are never given proper motivations, leaving them seeming 2 dimensional - and the story as well, as a result. Particularly at the end, I feel like the storyline fell to pieces in a series of rushed character inclusions/fight scenes. This is the problem with a film made by fans for fans - while you can feel the love that's been poured into it, you can also see that they're trying too hard to put EVERYTHING in to a two hour film. These sort of films really suffer because they don't have someone ruthlessly eliminating the excess, and making the film more accessible to the public at large. I read that they're hoping for an international release for this film, and I'm not terribly convinced that it will succeed. Fans of the original anime overseas will be at best a niche market (at least for the domestic release, there's a good chance the majority of the audience will have at best a passing familiarity with the series) and I feel like the rapid inclusion of bewildering useless characters will leave many in the audience feeling somewhat alienated. I thoroughly enjoyed the film, don't get me wrong, and I intend to seek out the manga as a result. However, I feel like they've pigeonholed themselves somewhat with their audience, if not so much domestically, then definitely abroad. However, if you can manage to be like me and just sit back and let the beautiful cinematography and Sato's truly excellent portrayal of Kenshin wash over you, you'll derive plenty of pleasure from this film.",
         "...you will love this live action version. The actor portraying Kenshin was perfect. So are Saito, Sano and Megumi--so perfect in fact, that I recognized each of them at first sight. And was filled with all sorts of warm/fuzzy feelings as if I was seeing long lost friends again for the first time in years. I am not sure how people new to the Kenshin franchise will respond, because the film's creators leave out a lot of character development that we get in the slower paced manga and anime TV series in order to jump straight into the action. Since this is one of the best manga/anime series to come out in a long time, I suggest reading the manga, seeing the anime and THEN watching the live action film for maximum enjoyment. \"Oro!\"",
         "I have never even seen a manga so approached this movie with no preconceptions or prior knowledge of the characters. A bit like seeing a Batman movie without ever having read a comic, I imagine. The result was a very pleasant surprise. The principle characters were largely convincing, the photography was very attractive and the story line reasonable given the limits of the genre. The fact that it kept me interested for the entire 2+ hours speaks for itself. I found the sub-titles very effective in keeping me involved which is normally not the case. I am not sure if they are integral to the movie or a third party add-on, but were much better than a dubbed English version which would have taken away much of the authenticity of the movie. I am looking forward to the next episode.",
         "Relying on the familiar narrative of a warrior who tries to shed his violent past in pursuit of a peaceful existence, this live-action adaptation of the highly popular manga and anime series (sometimes known as 'Samurai X') based on the well-known Civil War hero Himura Kenshin makes one wonder why there aren't more of such films coming out of Japan. To say it is good is an understatement, because director Keishi Otomo's film really is a rip-roaringly entertaining samurai movie that packs a riveting punch. We'd have to admit that we aren't acquainted with Nobuhiro Watsuki's original shonen manga nor the anime series that followed, so we won't be able to inform fans of the former or the latter if this adaptation stays close to its source material. From what we have gathered though, Otomo � who co-wrote the screenplay with Kiyomi Fujii � has taken from the first two story arcs of the series, namely Kenshin's vendetta with an opium dealer during the early years of the Meiji Restoration as well as his harrowing past during the Civil War that led to the cross-shaped scar on his face. When we are first introduced to Kenshin, it is already the deciding battle of the revolution - the battle of Toba-Fushima in 1868 � and amid stark sobering scenes of bloodshed and death, Kenshin, better known as the fearsome 'Battosai the Killer', slices the last remaining cohorts of the Shogunate. As news spreads of the Emperor's victory, Kenshin is content to ditch his sword for the solitary life of a wanderer � even as his fellow samurai, Jin'e (Koji Kikkawa), warns him that a samurai lives and dies by the blade. Ten years later, Kenshin has pretty much managed to live his choice of seclusion, before running one day into Kaoru (Emi Takei). Kaoru runs the fencing school left to her by her father, a school whose name has however been vilified for being that of 'Battosai' widely believed to be responsible for a string of murders around Tokyo. A psychopathic warrior who manages to escape death from Kenshin's blade in the battle has assumed the name of 'Battosai' and now goes about doing the bidding for the ruthless businessman Kanryu (Teruyuki Kagawa). Rapacious for power, Kanryu amasses his own private army of ex-samurai, most of them he wills into his service by getting them hooked on a special brand of opium he develops with reluctant pharmacist Megumi (Yu Aoi). Kenshin is forced to revisit his deadly ways when Kaoru, whom he develops an affection to, is threatened first by a sudden run-in with Battosai and later on when Megumi seeks refuge from Kanryu's men at the dojo. The only difference? Kenshin now fights with a 'reverse sword', or simply one with the sharp edge reversed. Truth is, you can pretty much guess where the story is headed, but what makes the movie so enjoyable is the exhilarating fight choreography from action director Kenji Tanigaki. Indeed, the best parts are when we see Kenshin wielding his sword against numerous other opponents, even without the benefit of a lethal blade. Tanigaki ensures that the action is never repetitive, and each sequence boasts its own balletic rhythm to keep you engrossed. Unlike some wuxia films, Tanigaki also opts for a realistic style even with the requisite wirework, offering his audience the spectacle of fluid and furious swordplay without the exaggerated embellishments. In between the clashing of swords, Otomo stages confidently the bond that develops between Kenshin and Kaoru. Rather than conforming their relationship to some formulaic romance, both characters are allowed to play out a more complex relationship that is entwined with Kenshin's own demons from the past. And in that regard, it is fortunate that both Sato and Takei are better actors than to resort to the melodramatic trappings of TV romances where both hail from, with both performers also sharing a graceful chemistry with each other. That they are able to deliver such nuanced performances is also to Otomo's credit, who directs the movie with an assured hand. Rather than the slapstick humour we are told is part and parcel of Kenshin's character in the manga, Otomo opts for a more down to earth portrayal, so even the light heartedness is never overplayed. Similarly, Otomo drops the exposition on the various schools and techniques of kenjitsu, and keeps to having some other character name the cool-sounding move that Kenshin executes whenever it is expedient. It is inevitable given its origins that fans of the manga and anime will bring their expectations to bear on this live-action version. Nonetheless, in going for a more true-to-life feel, this adaptation is, in our opinion, all the better for it. It's not one of those Yoji Yamada samurai movies, nor is it anywhere close to Takashi Miike's '13 Assassins', but this is solid blockbuster entertainment with universal themes of pacifism, vengeance and love packed with a distinct Nippon flavour.",
         "When the first news broke out that Rurouni Kenshin will have a live action movie, as a fan of the manga series, i was honestly afraid. I've felt that it would work out as a comic and animation, but as a live action movie; i had my doubts. Thankfully as i saw the trailers and eventually caught the movie, i'll say that it is worth the time spent waiting for it and every cent spent to catch it on the big screen. Anyone reading the manga series would know that this is the earliest \"adventure\" of a wandering Kenshin in the manga/animation and the premise is definitely suitable for a movie. Even non-fans would be able relate to it instantly, so it does a pretty decent job of holding everyone in place for whole ride. But fans of the manga would definitely notice that there's been some changes of the story, but thankfully the change doesn't feel out of place. The other thing that bugged me a bit was how little purpose Saito Hajime had (fyi - he wasn't even supposed to be involved in this part in the manga) and poor Sanosuke's character entered the story without much purpose or explanation which kind of downplay his role and might be hard for non-manga reading viewers to ask, \"So what was his purpose?\". My friend and myself also recalled that Kenshin had a habit of covering up his cross-scar but somehow, he doesn't do that in the movie. Speaking of the scar, i personally felt that the flashback scene of how he ended up with his first scar, became comical as opposed to something serious. You have to watch it to understand why. All in all, this is one movie that is awesome from start to finish but i'll be even more worried if they ever decided to do a sequel ..."
      ],
      "genres": [
         "Action",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "C&I Entertainment",
         "IMJ Entertainment",
         "RoC Works Co."
      ],
      "summaries": [
         "In 1868, after the end of the Bakumatsu war, the former assassin Kenshin Himura promises to defend those in need without killing. Kenshin wanders through Japan with a reverse-edged sword during the transition of the samurai age to the New Age. When Kenshin helps the idealistic Kaoru Kamiya from the gangsters of the powerful opium drug lord Kanryuu Takeda that wants her school for his production of opium, Kaoru invites Kenshin to stay in the school. But the drug chemist Megumi Takani escapes from Kanryuu and seeks shelter in the school. Meanwhile the killer Battosai is murdering police officers and leaving messages attached to their bodies. When Kanryuu poisons the population to get the school, Kenshin and the street fighter Sanosuke Sagara join forces to attack their common enemy.",
         "Former legendary assassin Kenshin Himura ('Takeru Sato') has now become a wandering samurai. Offerring aid and protecting those in need as atonement for his past deeds. During this time Kenshin Himura comes across and aides Kaoru Kamiya (Emi Takei). Her father opened the Kamiya Kasshin-ryu, a kendo school located in Tokyo and Kaoru is now an instructor there. Kaoru then invites Kenshin to stay at her dojo. Their relationship develops further, but Kenshin is still haunted by his violent past.",
         "Kenshin Himura was an assassin for the Imperial side during the war that ended the Shogunate and installed the Meiji government. After killing countless people, he made a vow to never kill again. Ten years later, he finds a home at a failing dojo, only to be caught up in a string of murders related to an opium ring. His commitment to never taking a life is put to the test as the people he's come to care about are threatened by figures from his past."
      ],
      "budget": 0
   },
   "movielensId": 99530,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2012-08-25",
      "dvdReleaseDate": null,
      "directors": ["Keishi Ohtomo"],
      "runtime": 134,
      "movieId": 99530,
      "title": "Rurouni Kenshin",
      "mpaa": "",
      "actors": [
         "Takeru Satoh",
         "Emi Takei",
         "Kôji Kikkawa",
         "Yu Aoi",
         "Munetaka Aoki",
         "Go Ayano",
         "Genki Sudo",
         "Taketo Tanaka",
         "Eiji Okuda",
         "Yosuke Eguchi",
         "Teruyuki Kagawa"
      ],
      "imdbMovieId": "1979319",
      "originalTitle": "るろうに剣心",
      "genres": [
         "Action",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": [
         "lc_JmcRxdx8",
         "bzeHq9blYC8",
         "SZCAIAvQeAM"
      ],
      "plotSummary": "Former legendary assassin Kenshin Himura has now become a wandering samurai. Offering aid &amp; protecting those in need as atonement for his past deeds. During this time Kenshin Himura comes across and aides Kaoru Kamiya (Emi Takei). Her father opened the Kamiya Kasshin-ryu, a kendo school located in Tokyo and Kaoru is now an instructor there. Kaoru then invites Kenshin to stay at her dojo. Their relationship develops further, but Kenshin is still haunted by his violent past ...",
      "tmdbMovieId": 127533,
      "avgRating": 3.62185,
      "releaseYear": "2012",
      "numRatings": 119,
      "posterPath": "/rmBUaljPj6SJVArR68fHl41oJU4.jpg"
   }
}