{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Hertzfeldt"],
      "runtime": 62,
      "synopsis": null,
      "writers": ["Don Hertzfeldt"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2396224/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMDk0NjA5NV5BMl5BanBnXkFtZTgwMDQ2MDUxNTE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Don Hertzfeldt | See full cast and crew »"],
      "reviews": [
         "This film is amazing. It's a beautiful, philosophical film that leaves you feeling paralyzed after viewing. Every time I watch it, I notice more and more of the great things about this film. The superb effects are even more amazing when you think about how there were no computers used in its filming. This movie feels like the longest hour of your life, but you wish the hour never ends. It is about a man named Bill. It starts of following Bill around with narration by Don Hertzfeldt. Hertzfeldt's narration sounds unconventional and unprofessional, but it adds to the effect of the film. You soon learn that BIll is struggling with some sort of disease never mentioned in the film that affects his mind. Most of the film is split into little windows across the screen, something weird, but original and interesting. All this, plus some darkly funny humor, makes this film not only a great one, but an artistic achievement that will make you do some major thinking about life. This film is perfect.",
         "I haven't seen a film as masterful as Don Hertzfeldt's It's Such a Beautiful Day that I had to watch it twice in two days in a long time. Comprised of three short films, of which were released from 2006-2011, for an hour long feature. It details the life, perspective and ancestry of Bill, a nondescript stickman who suffers from deliberating mental illness. Although it has a minimalist animation style, with simplistic pencilled-in stick figures and fractured splotched split screens contrasted with live action footage, Hertzfeldt manages to dig deep into the bleakest caverns of the psyche of the human condition, whilst also pointing out its silver linings. Even though it's obviously painstakingly animated, there's a liberating stream-of- conscience style with Hertzfeldt's omnipresent and omniscient narration. Despite Bill's erratic state of mind, ostensibly from his family history, he's an incredibly relatable character from his fears, dreams and insecurities. The film is so on point that it's hard to shake a disorientating sense of anxiety from watching it due to its existentialism. The film is a remarkably abrasive experience from its density, firing off small vignettes of Bill's life in just a few seconds at a time, paired with an unnerving use of classical music. But with its absurdist take on life, the grounded sense of humour comes from its irreverent and idiosyncratic observations of trivial social faux pas. However, the only aspect that holds the film back is that it gets too nihilistic at times especially during the family flashbacks without purpose, often forgetting the theme of the title. What's most powerful about the film is the way it approaches mortality. Among all the morbid cruelty of life, it manages something deeply poignant and profound in its casualness. It suggests death as a dumb, awkward stupid moment and in its irony it finds comfort. The final passage explores the consequence of immortality taking a common fantasy on a grand scale. The unbridled creativity, insight and ambition of Hertzfeldt is unparalleled. Both hilarious and gut-wrenching in equal measure, it's a thoroughly inspirational film as Hertzfeldt probably made this on one desk maybe in his bedroom. I implore everyone to spare an hour of their life to watch this. I'll definitely be watching It's Such a Beautiful Day many, many more times. 9/10",
         "Never has a movie had a greater impact on me than this one. In fact, I created my IMDb profile solely to rate this movie 10/10, because it is just that good. At the surface it's a somewhat comically told story of a stickman, Bill, and his struggles in life. Don Hertzfeldt (the animator) narrates Bill's life through what seems like a series tiny excerpts plucked out from a bigger picture. It mirrors the animation style, which at times also seems to consist of excerpts; tiny portions roughly cut out from bigger scenes. All this is accompanied by classical music. At the core of this simple exterior though, is an emotional roller-coaster that will make you think about the big questions. It will make you laugh at dark jokes amidst a sea of tears. It will reduce any hard man into a soft mushy pulp. And in the end, Bill the stickman will have a real impact on your life.",
         "Thankfully I stumbled upon this gem of a film after watching his famous \"Rejected Cartoons\" skits. Which are genius in their own right, this has a whole different mood and only centers around one man. The way Hertzfeldt blends classical music, with simple narration and seemingly simple yet complex animation, he manages to tell a great , thought provoking tale of a man looking for something just a little bit more, often thinking to himself, which in turn often gets the viewer thinking, for better or for worse. Everyone can relate to Bill, as I'm sure there is at least one thing that Bill encounters that the viewer has also encountered, which makes it that much more of a personal experience for the viewer. Surely you will leave this film asking yourself a lot of questions, and some maybe for the better.",
         "'It's Such a Beautiful Day' is nothing like any other feature film. If you are new to Don Hertzfeld's work I would highly recommend doing a quick YouTube search of his name. 'Rejected' is a good example of his style. Hertzfeld is hard to classify. His animation style is simple yet remarkably emotive, dancing between the surreal and the heart wrenchingly real. 'It's Such a Beautiful Day' is a very heavy watch, exploring themes of life/death, youth/aging, longing/impermanence and the unstoppable thirst for the beauty of existence so central to our humanity, the unquenchable awe that keeps us going every day. In the film Hertzfeld follows a simple relatable stick figure named Bill. The dry, blunt (in a good way) narration follows Bill from infancy to adulthood to old age, chronicling in chilling detail the slow devastating deterioration of his mind and body. Executed with exquisite writing this rocky emotional journey is full of engaging secondary-plots and character development. While primarily animated on paper with stick figures Hertzfeld manages to create magical exciting transitions, dream-states and other visual effects all while staying within the medium for the most part. As a musician I just have to comment on the music too. Hertzfeld as usual did not disappoint with the soundtrack. His selections were absolutely stunning, perfectly accompanying the thematic content of the film. These were my personal favourite selections: Smetana's The Moldau - This late- Classical era piece was written about the Moldau, a long winding majestic European river which ends its long journey by spilling into the vast sea. I think this selection perfectly matched the film's thematic content. The permanence of the unending rushing currents of the Moldau juxtaposed against its ultimate fate, to be lost forever flowing into the vase ocean perfectly compliments the film's many monologues about the unimaginable immensity of cosmic time and the universal reality of death, our own spilling into the great abyss. Hertzfeld also featured some excerpts from Strauss' Four Last Songs. As it sounds, these pieces are the last four pieces composed by Richard Strauss who never lived to hear them performed. Their German lyrics are riddled with premonitions and contemplations of both life and death. Hertzfeld's choice here could not have been more tasteful in my opinion. Mirroring the lyrics, as Bill wastes away we are confronted with some of the most fundamental questions. What ought we to value most of all, how do we want to be remembered, who/what brought us true happiness, should we live our life for this life's sake or for the hypothetical next, does anyone die truly satisfied? Although the film is stunning enough on its own, for those familiar with these works and their meanings the combination of elegant prose and these gorgeous selections is truly paralyzing. Finally as Hertzfeld draws the work to a finale he chooses Schumann's beautiful, tender, nostalgic Traumerei which means 'Dreaming'. I don't have much to say about this other than thank you Don. Don Hertzfeld's talent creativity and wisdom is showcased brilliantly in this film. I will be showing this to many many people and will be returning many many times as I grow older and older. 'It's Such a Beautiful Day' is very dark and emotionally heavy. It might be too 'artsy' for some (I hate that word) but in reality it is an extremely mature work of art. This film tackles some really fundamentally disturbing questions. On the one hand it brings up our mortality, our short painful ofttimes disappointing existence. But in light of this depressing truth it also celebrates our remarkable abilities to experience beauty, joy, love, laughter, awe, inspiration, wonder, curiosity, discovery, kindness, passion and everything that makes us human, everything that makes life real, everything that makes it a privilege to experience in our short snippet of time here. This film also really spoke to me in terms of my personal struggle into atheism throughout my teenage years. For some it's hard to see a reason to keep existing when leaving a given faith, however when grappling with cosmic insignificance one eventually encounters many important realizations that make life truly wonderful, awe inspiring and worthwhile. I found that this film, particularly in the finale, addresses many of these issues and for that reason it really gave me chills. This film nearly moved me to tears in more different ways than I have ever experienced, constantly torn between a deep existential sorrow and inexplicable organic joy from being alive. I would recommend this to anybody but I do think this can be particularly helpful for those struggling with the issues non-belief and death. Even though I've lived out my teen years and have begun my gradual but steady deterioration into nonexistence, this film shows my why, in the face of that dark abyss, I have every reason in the world to be happy, to be joyful, to laugh and love as much as I can while I still can. 'It's Such a Beautiful Day' encourages its audience to stop and smell the roses; to realize that amid all the suffering so inseparable from the human experience, we're also gifted with indescribable beauties, a capacity for crippling emotion, loyal companionship, and a vast mysterious cosmos we are learning more about every day. We have much to fear, but we have so much more to be thankful for. 'It's Such a Beautiful Day' reminds us that we are all in the process of dying, year by year and, just in case there's no light at the end of the tunnel it implores us to live for today and enjoy every single aspect of our frail existence before its too late.",
         "When I sat down to watch this, I had never heard of Don Hertzfeldt, the genius behind \"It's Such a Beautiful Day.\" Since then, I've watched every single film he has made at least three times. This film changed the way I look at art; film, music and literal art, in the form of paintings. It is truly incredible. Hertzfeldt's animation style in one of the best in the industry, and has now become my favourite. The story that is told in the series of shorts will make you laugh, cry and consider why you are even living. The way that the simple animation style is composited on screen is unique, and also works seeing as it is told from Bill's perspective. The main character, Bill, is a lonely, confused stickman, who suffers from depression and a mental disorder. The things he dreams up or the hallucinations he sees show Hertzfeldt's absurd humour, which will confuse you and also make you laugh. The questions that he asks will stay in your head for a very long time. The fact that this masterpiece was produced entirely one person with no help from computers makes the film stand out even more. I don't know whether I'll ever watch a film the same again.",
         "In a film industry there animated movies are getting more and more advanced, this extreme surprise shows up on Netflix. What a beautiful film this is. Don Hertzfeldt, a director I had never heard of until this day tells the story of a man named Bill, who struggles to put together his shattered psyche. All this is done with very simple, but heartwarming drawings mixed with some live action moments. Like Mary and Max (2009), this animated feature relies heavily on the narrator, who's voice is the only one you hear. We listen to simple stories about life itself, with some very dark humor intended. You'll laugh, you'll cry, but most of all you'll only spend 62 minutes of your life on something that was quite clearly worth it...",
         "Some films don't leave you for days after you watched them. You actually feel like they will always be within you for your whole life, and they kind of do. This has been one of those films for me. I started watching it with no idea what is was about or what to expect and so it took me to a lovely, passionate, exceptional journey. It's one of these few films that actually makes you think after the last scene, which was by the way a remarkable one to end the film with. It speaks to the heart, the mind and the soul in such a simple, beautiful way. I so loved how it's narrated and how the ideas are displayed. It deserves to be recognized and seen not once, but many times.",
         "I don't think I can accurately describe how very very much I loved this movie. I've seen it 4 times now and each time I still feel my soul ache for Bill. I fell in love with Bill and... just felt for him. In real life, I felt for an animated character. It's that good. The way the scenes are laid out really dig deep into the psyche and even if the scenes are too deep for you, you can still appreciate being pulled into someone's mind and experiences in such a way that later you won't be able to help but to reflect on, and often. I especially loved how the writer depicted the psychotic breaks. Genius. What is it like to have experienced true emotional pain? What's the damage left? What about genetics? There's no doubt that environment plays a large role in emotional development but so does being genetically predisposed to an illness or 'malfunction' that basically hinders brain function so that the brain is no longer efficient. Most of us can only imagine experiencing the brain being truly confused or inept. Yet, Bill pushes on as the sweetest, kindest soul who just lives his simple, rote routines and just keeps living...and living....and living. This movie is amazing and you get to experience Bill's PERCEPTIONS of his reality and life in a stark and matter-of-fact way that gets to you. LOVE this LOVE LOVE LOVE this! ...and I LOVE whomever made this movie. You are simply incredible, sir.",
         "In 2011, Don Hertzfeldt released the third of his films about a stick figure named Bill. The title of this is \"It's Such a Beautiful Day\". The following year, the three films were combined and the title to this full-length film was ALSO \"It's Such a Beautiful Day\"! Talk about confusing...but so are all these films! The three films are absurdist to say the least. While there is an underlying theme of Bill and his brain tumor and the disintegration of his personality, so much of the film appears to make no sense-- which is pretty mush like ALL of the cartoonist's films! I like this weird nonsensical style but many won't. As I watched this film at home, my wife practically screamed and told me to turn it off--as it was 'making me crazy'! Yes, it is often cacophonous and confusing and is NOT a film for everyone. My daughter saw this film at a film festival in Philadelphia and many in the audience loved it and many hated it. Definitely NOT everyone's cup of tea, that's for sure. I enjoyed it but still greatly prefer the filmmaker's \"Rejected\" as well as \"Wisdom Teeth\" and \"Billy's Balloon\"."
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Drama",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Bitter Films"],
      "summaries": ["Bill struggles to put together his shattered psyche, in this new feature film version of Don Hertzfeldt's animated short film trilogy."],
      "budget": 0
   },
   "movielensId": 99764,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-08-24",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 62,
      "movieId": 99764,
      "title": "It's Such a Beautiful Day",
      "mpaa": "NR",
      "actors": [""],
      "imdbMovieId": "2396224",
      "originalTitle": "It's Such a Beautiful Day",
      "genres": [
         "Drama",
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Bill struggles to put together his shattered psyche, in this new feature film version of Don Hertzfeldt's animated short film trilogy.",
      "tmdbMovieId": 147538,
      "avgRating": 3.91815,
      "releaseYear": "2012",
      "numRatings": 336,
      "posterPath": "/fBM4SWUylhtbw9Epmqdq64C4u75.jpg"
   }
}