{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "child abuse",
            "id": 516
         },
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "isolation",
            "id": 1533
         },
         {
            "name": "social worker",
            "id": 2438
         },
         {
            "name": "foster parents",
            "id": 2468
         },
         {
            "name": "stealing",
            "id": 10261
         },
         {
            "name": "drug use",
            "id": 11494
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt1268989",
      "video": false,
      "title": "The Unloved",
      "recommendations": [
         41554,
         109614,
         32119,
         64191,
         80180,
         71465,
         60870,
         1163,
         100017,
         32622,
         30092,
         38294,
         47841,
         61824,
         266425,
         48918,
         64522,
         41386,
         130750,
         18164
      ],
      "backdrop_path": "/nbc7U56yQKLohTKSTtSIRAgg4nT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Lucy",
               "gender": 0,
               "credit_id": "5664d513925141280f000447",
               "name": "Molly Windsor",
               "profile_path": "/pcfo2hApj4SnDpaONuia7oV3eON.jpg",
               "id": 1415918,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Lucy's Father",
               "gender": 2,
               "credit_id": "52fe4866c3a36847f81655a7",
               "name": "Robert Carlyle",
               "profile_path": "/dLNeFPfJACiCiUz3oEdAjeKIwvZ.jpg",
               "id": 18023,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lucy's Mother",
               "gender": 1,
               "credit_id": "52fe4866c3a36847f81655b3",
               "name": "Susan Lynch",
               "profile_path": "/bXwZyTYQu4YL7qcQmsw3GHgmOuh.jpg",
               "id": 42571,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe4866c3a36847f81655af",
               "name": "Craig Parkinson",
               "profile_path": "/efTI4NGP1wnQX61rFEdisDS985D.jpg",
               "id": 45050,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "5664d53bc3a368512100045c",
               "name": "Andrea Lowe",
               "profile_path": "/cXjK3bBu2D7MtHLkuZjMKNqoa0x.jpg",
               "id": 208506,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "52fe4866c3a36847f81655ab",
               "name": "Lauren Socha",
               "profile_path": "/tHSEvLa3iPKMISXlpxbkbqAMsZi.jpg",
               "id": 148117,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe4866c3a36847f81655b7",
               "name": "Michael Socha",
               "profile_path": "/oc4UDo2En0iBdnMHWh9ifnkdY8B.jpg",
               "id": 126171,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5664d547925141280a00045f",
               "name": "Johann Myers",
               "profile_path": "/DGi7evbcyXo5P45yfJWO6SCP1l.jpg",
               "id": 148142,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4867c3a36847f81655bd",
               "name": "Samantha Morton",
               "profile_path": "/zRvK2T98rz5smCwRiAaFRq1CoDo.jpg",
               "id": 2206,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4867c3a36847f81655c3",
               "name": "Samantha Morton",
               "profile_path": "/zRvK2T98rz5smCwRiAaFRq1CoDo.jpg",
               "id": 2206,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4867c3a36847f81655c9",
               "name": "Tony Grisoni",
               "profile_path": null,
               "id": 19725,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.730218,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 53445,
      "vote_count": 14,
      "budget": 0,
      "overview": "The Unloved is film that gives a child's eye view of the U.K.'s government-run care system for orphans and children in danger. Lucy is eleven years old. Having been neglected by her estranged mother and father, she is placed in a children's home. Through her eyes, we follow Lucy's struggle to cope with the system. Her saving is her self-belief and her certainty that she is being watched over and protected by the holy spirit. Hers is a heroic quest for love, beauty and transcendence.",
      "similar": [
         169813,
         185,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         43923,
         437557,
         27586,
         713,
         2771,
         9587,
         3134,
         11236,
         13075,
         10950,
         9813
      ],
      "original_title": "The Unloved",
      "runtime": 106,
      "poster_path": "/lNvvC20Wgq9ULUHnUOA1K6R5uPT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "EM Media",
            "id": 1917,
            "origin_country": ""
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         }
      ],
      "release_date": "2009-05-17",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Samantha Morton"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Tony Grisoni",
         "Samantha Morton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1268989/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MjQ5ODQ2MF5BMl5BanBnXkFtZTgwMDM3MjA2MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Molly Windsor, Robert Carlyle, Susan Lynch | See full cast and crew »"],
      "reviews": [
         "Watched this last night knowing it would stir up all the emotions you can imagine when dealing with the abuse of children and to be honest I was hoping it would be rubbish so I would have the excuse of stopping watching. Well it was powerful stuff, understated drama without being overly dramatic. You wanted to reach out and hug the girl, buy her clean clothes, give her so called carers an earful not for not caring but for not paying attention. If the system is in any part like this, and I'm sure it is, then those in the business should get a wake up call from watching this in learning what not to do. Samantha Morton can be proud of this work as a directorial debut and I am sure it was cathartic based on her childhood as she was in care until 16. Molly Windsor is excellent in the role as the child. Robert Carlyle's is quality as usual",
         "This was so well-directed and acted that it seemed at times like a documentary. Avoiding any clichés and easy answers it was moving and compelling. Clearly Samantha Morton is going to be as great a director as she is an actress. The expressionistic filming style and the long static shots reminded me a bit of Lynne Ramsay's work, which is a compliment in itself! I wish it had been shown in cinemas, as it would have won many awards in my opinion. All the actors were great, as i said above so naturalistic that it seemed at times like watching a documentary. Great performances in particular from the little girl Lucy, and the troubled Lauren that she met whilst in the care home. Highly recommended.",
         "'The Unloved' is the result of actress Samantha Morton's first stab at directing, a story about growing up in a children's home, something she has experienced first hand. If she hadn't, you might wonder if it was exaggerated; if it isn't, it tells a grim and harrowing truth. Artistically, it's quite ambitious, eschewing emphasis on expository narrative in favour of giving a more impressionistic flavour of its central character's life - Morton appeared in Lynne Ramsey's film of 'Morvern Callar', and its tempting to assert one can detect the influence on her style. But there are also hints of Morton's inexperience behind the camera , in the way that her striking, set piece images are presented somewhat obviously, for example in the film's closing scene, where the entirety of a (sad) song is played over a wordless scene in advance of (rather than during) the credits: it's moving, but there's more to great film-making than the juxtapositioning of sad songs and pretty pictures. Still, on this evidence, Morton may get there: it will be interesting to see whether she is interested in directing on subjects less close to her own heart.",
         "With this film, Samantha Morton has done better than most actors-turned-directors, as she displays an understanding not just of the ways in which films make meaning and are experienced by their audience, but also of human behaviour and the way life itself unfolds. While similar subject matter has certainly been covered before in British films, from Ken Loach to Lynne Ramsay (from whom Morton seems to have learned cinematic pacing and how to \"show and not tell\"), this film is still able to give a fresh experience, just like how many people share very similar lives on the surface, yet each one is unique. Without giving anything away plot-wise, the scenes which stand out for excellent direction, acting and pacing are the opening one between the main character and her father, another later on between these same characters in a pub, an outdoor rave, and a fight that breaks out between a group of adults who are supposed to be the responsible ones (though the beauty of the way this scene is handled lies in the fact that we can't be sure some of them *aren't* being responsible by doing what they're doing!). The last shot could have been one of the stronger endings I've seen in recent cinema, but the music that plays over it detracts from the power it could have had - instead of allowing viewers to have their own individual reactions to this image (and there's enough power and emotion inherent in the situation that it would be nearly impossible not to experience something during this shot), the music tells us what the emotions are, through both instrumentation and lyrics. This serves to detach the audience somewhat from what we're seeing, instead of sucking us in like most of the film has already succeeded so well in doing. I can only hope Morton directs another film in the (near) future.",
         "Congratulations to first time director Samantha Morton and Channel 4 for showcasing this magically poignant portrait of a maltreated child suffering the indignities of Britain's under-resourced care system. Star: Molly Windsor delivers a masterful evocation. The Unloved avoids the inherent pitfalls of such difficult subject matter. Morton herself went through care, but this is no angry rant against her experiences, but an enlightening reconstruction of events exorcised through a perceptive and beguiling work of artistry. Strong support from co-stars Robert Carlyle and Susan Lynch as Molly's estranged and troubled parents seeking personal redemption for the hurt caused and subsequent loss of their angelic daughter. I can only hope this is not the only helmed piece Samantha Morton brings to this world, as she is indeed a talented voice in a world of increasingly entertainment driven indifference to the bigger issues which surround and impact upon us all. This cinematic picture should have been given a much deserved big-screen distribution. Assured best new British drama since Red Ridding.",
         "Samantha Morton's passion for this story is evident in the purposeful construction of the film. At first you will wonder what in the world is happening, but as the film develops you will start to understand that the lingering cuts are drawing you into Lucy's world. Molly Windsor does an incredible job of portraying the innocent little observer who is thrust into a wildly different world when she is forced to move into a group home. Still sleeping with her teddy bear she has to room with Lauren, a rebellious teen who takes Lucy along with her shoplifting, partying, etc. The film is a bit sad and doesn't really offer any solution and so you are left feeling sorry for Lucy and hoping she will not succumb to the temptations around her and last probably until she ages out of the system. Hopefully what this film can do is bring awareness to problems in the social service system not only in the UK, but everywhere and perhaps kind hearted people will be stirred to help these children.",
         "Samantha Morton has a proved record as a actress starring in blockbusters like Minority Report, independent films like Control and even earned an Oscar nod for In America. But has a tragic past, being put into the British care system at a young age and going into children's homes and foster care. She has used her experience as the source for her writing and directional debut. Just before Christmas Lucy (Molly Windsor) is a 11-year-old primary school who is badly beaten by her father (scumbag for hire Robert Carlyle) and when it is found out by the school Social Services get involve. Lucy is taken to a children's home, with literally only the clothes on her back. Whilst in the home Lucy is overwhelmed, not understanding the adults who speak like she is not in the room, a world where children are violence and abusive too each other and drinking and drug taking are acceptable and Lucy does not understand why she can't live with her mother (Susan Lynch). In the home Lucy is taken under the wing of 16-year-old Lauren (Lauren Socha), a mouthy chav who has been in trouble with the police. Lost in this world Lucy has to adjust quickly. Morton shows great skill as a director and her strength is simplicity. She lets the actors do their job and by avoiding doing too many cuts or over the shoulder shots. The beginning is very hallowing, starting a voice-over by Lucy saying a biblical quote and then a single shot scene seeing the Lucy's father slowly loosing his temper. That had more power because it felt like you were in the room. Morton continues a harsh traditional of British kitchen sink realism. The script itself shows that the social care is something that even the most smartest child would not understand. A young child will have a more simple view of the world and just wants to be in a loving situation. Within the care system it shows that some people really do care, particularly a woman called Vicky (Andrea Lowe), who takes Lucy shopping, but even she is guilty of speaking like Lucy is not around. Other care workers were more bureaucratic or some like Ben (Craig Parkingson) who takes the approach of being the children's friend. The best approach would be someone who is both an authority figure who is also caring. The children's home is shown to be mismanaged, with the staff arguing amongst themselves and a social worker saying she was not able see Lucy because she did not receive her patrol money (because the welfare of the children isn't important). The acting was a high standard, particularly from Windsor, an incredible young actress. She had an tough job and she does it well, playing a meek child who is confused and easily lead. She is a good child and performance felt so natural and real. Some people may complain she is a passive character: but what do you expect, she is an ordinary child forced into a situation. She just has to go with the flow. Robert Carlyle is always good in any role he plays, and he is truly a horrible man in what is a very raw performance. But he also playing a real character, not just a cartoon monster. This was a real film, the language, character and settings were believable. This a tough film and not one for the faint hearted. But I do have a couple of minor problems with the film. The first is that I felt like we need to see a result involving Ben who raped Lauren and was in the middle of an inappropriate relationship with a 16-year-old. The other is I would have liked to have know what happened to Lucy, did she end up staying in the children's home, go into foster care or get to live with her mum or another family member. But overall The Unloved is a very worthy film.",
         "Lucy (Molly Windsor) is eleven years old living with her abusive father (Robert Carlyle). She is put into foster care and faces a chaotic unloving system. Her roommate is 16 year old Lauren (Lauren Socha). Lauren runs away taking the quiet Lucy with her. They get into trouble with the police and brought back to the home. It's an impressive directorial debut from Samantha Morton. The tone is very haunting. The young girl is put to the great use by keeping her mostly silent. It permits the audience to inhabit her character. Lauren Socha is also quite effective as the teen delinquent character. The biggest drawback is the long running time. This movie could be even better distilled into a tighter pace. Morton seems to be indulging a little too much in long ambling scenes.",
         "English actress Samantha Morton's directorial debut which she co-wrote with British screenwriter Tony Grisoni, is a British television film which was screened at the 34th Toronto International Film Festival in 2009. It was shot entirely on location in Nottingham. It tells the story about eleven-year-old Lucy who lives with her father in an apartment in England. After an incident where Lucy's father beats her, she contacts social services who sends her off to a children's home for orphans and troubled teens. At the institution she meets an older girl named Lauren who she has to share room with. At first Lauren acts with hostility towards Lucy, but after a while she begins to care for her and becomes a kind of guardian. This fictional independent drama which takes a sharp-minded look at the care system in the UK is a subtly and acutely directed British production narrated from the point of view of the protagonist, which examines themes such as child neglect, alienation, coming-of-age, interpersonal relations and friendship. Samantha Morton's minimalistic study of character draws an intimate and heartrending portrayal of an adolescent girl who finds herself lost in a care system which treats her much like her parents, whom she yearns for every single minute of every single day, by pushing her away. The fine cinematography by Tom Townend, the efficient use of sound and the naturalistic milieu depictions emphasizes the poignant atmosphere in this finely tuned, character-driven and semi-autobiographical film which is impelled and reinforced by débutant Molly Windsor, Scottish actor Robert Carlyle, Northern Irish actress Susan Lynch and débutant Lauren Socha's authentic acting performances. A compassionate and commendable feature film debut.",
         "The Unloved is perhaps the most moving film of all Time as I almost cried several times over Lucy's predicament. I would recommend this film to anyone I meet on the basis of how great the film is. After watching this film it's not hard to feel sad for the UK children caught up in the British care system. This movie is possibly the greatest work of art I have ever seen. Lucy Manvers is an inspiring character so to speak. Played by Molly Windsor Lucy Manvers gives you a haunting inside look into the British care system that will leave you almost in tears by the end of this wonderful film. I could just watch this over and over again. I would also recommend oranges and sunshine since its also a touching film featuring my favorite actress Molly Windsor. These two movies are excellent works of film featuring an excellent actress. I absolutely Loved this film and will watch it with my family for years to come"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "EM Media",
         "Film4",
         "Revolution Films"
      ],
      "summaries": [
         "Lucy is eleven years old. Having been neglected by her estranged mother and father, she is placed in a children's home. Through her eyes, we follow Lucy's struggle to cope with the system. Her saving is her self-belief and her certainty that she is being watched over and protected by the holy spirit. Hers is a heroic quest for love, beauty and transcendence.",
         "With a barebones narrative and a visual depth of compassion, this is the life of a young child, any child, caught up in the British care system. Seen through the eyes of an eleven-year-old girl, this, a child's journey and first steps into a wider world. Her desire for recognition is both low on dialogue and high on sentimental empathy of how the physical and emotional abandonment of both parent, and an indifferent system and their respective responsibilities, can isolate and do harm.",
         "A film that gives a child's eye view of the U.K.'s government-run care system for orphans and children in danger."
      ],
      "budget": 0
   },
   "movielensId": 99828,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-05-17",
      "dvdReleaseDate": "2011-05-24",
      "directors": ["Samantha Morton"],
      "runtime": 106,
      "movieId": 99828,
      "title": "The Unloved",
      "mpaa": "",
      "actors": [
         "Molly Windsor",
         "Robert Carlyle",
         "Susan Lynch",
         "Craig Parkinson",
         "Andrea Lowe",
         "Lauren Socha",
         "Michael Socha",
         "Johann Myers"
      ],
      "imdbMovieId": "1268989",
      "originalTitle": "The Unloved",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["MtOWMORQTrE"],
      "plotSummary": "The Unloved is film that gives a child's eye view of the U.K.'s government-run care system for orphans and children in danger. Lucy is eleven years old. Having been neglected by her estranged mother and father, she is placed in a children's home. Through her eyes, we follow Lucy's struggle to cope with the system. Her saving is her self-belief and her certainty that she is being watched over and protected by the holy spirit. Hers is a heroic quest for love, beauty and transcendence.",
      "tmdbMovieId": 53445,
      "avgRating": 3.11111,
      "releaseYear": "2009",
      "numRatings": 9,
      "posterPath": "/lNvvC20Wgq9ULUHnUOA1K6R5uPT.jpg"
   }
}